{
  "episode": {
    "id": "J117HNDhH9c",
    "title": "These Games Are Winning Big In 2025!",
    "publishedAt": "2025-07-18T13:15:02.000Z",
    "description": "Grow Garden has quietly become one of the most successful Merge titles of the past year, but how did it break through in a genre many thought was saturated or fading? In this clip from TWIG 399, we analyze what Grow Garden is doing right: from smart onboarding and session design to monetization mechanics that actually work. We also look at how it’s resonating with Gen Z players and what other developers can learn from its success. If you’re in casual or Merge, this is one game you need to study."
  },
  "channel": {
    "id": "UCbJdp9rI3sDhVzKKZkWDZuw",
    "name": "Deconstructor of Fun",
    "slug": "@deconstructoroffun5677",
    "url": "https://www.youtube.com/channel/UCbJdp9rI3sDhVzKKZkWDZuw"
  },
  "transcript": "[Music]\nOkay, let's move on to Merge 2. There was a piece of news in mobile gamer biz again where one of the trail mix GMs, Felicity Gracie Hurst, gets on to talk about a lot of Love and Pies, which is a game that has done really well in the merge 2 space. Has been one piece of news, and it was interesting on why she's doing this PR push or what's up at Trailmix. And then we got a separate piece of news from Tristan Clark, who is a co-founder at Trailmix, reporting on LinkedIn that this is going to be his last week at Trailmix. So there's two things going on here. There's the merge genre news and there's how Trailmix fits into it. Jen, what's going on in merge?\nYeah, so I took a look. I used to love this genre as a human. I have since pivoted to your favorite all-in hole and the royal kingdom and royal matches. Had no time left in my life to continue to play Merge 2. Uh, it's on fire. So, I looked at Sensor Tower US year-to-date data. So, that's what we're going to look at here. It is the number two top revenue subgenre in puzzle. It's number two right after the royal matches of the world. And more importantly, it's the number seven top revenue subgenre overall of all subgenres, right behind squad RPG. One of our favorites. Again, this is just US year to date. Love and Pies is a top seven game in Merge 2. Gossip Harbor's number one, $100 million year to date in the US alone. Super, super impressive.\nCrest, it's not mice nuts anymore, right?\nMhm.\nNot mice nuts. That is next one is just basically showing that the genre during the last 12 months has doubled in terms of in-app purchases, which is quite a growth, and you know, we're talking about declining market and this and that, but look at Merge 2 just growing. And then I put in few of the top games as well as Love and Pie to just see how well this Trailmix title has fared as the genre has doubled. So, Gossip Harbor is essentially the game that is driving the growth on the genre as a whole. And of course, there's plenty of new games that came in. Travel Town, Seaside Escape, Merge Mansion have been kind of holding steady, but Love and Pies has actually, you know, it's tiny compared those four largest one. Love and Pies has actually lost about 30% of its monthly revenue since the beginning of the year. So, it's not fairing too well for Trailmix. And looking at Merge Mansion, which is another Supercell-owned SL-backed company in the same genre, Metacore, right?\nMetacore. Yeah, they've been they've been holding steady. They used to be the number one. I think they took the position from Zingga, and now they're at number four. And so, everybody else is kind of keeping steady. Seaside grew a little bit, but it's really the Gossip Harbor that is absolutely just crushing.\nYeah, they're crushing it. And then Travel Town, uh, which was taken over by a Chinese company,\nTravel Town. Yeah, that's Israeli.\nOh, Israeli. Okay.\nYeah.\nWhat's going on in Puzzle is really interesting is that especially in the last year or so, it's really broken into all of these different subgenres where you can really get into what's working and what's not working within each of these. Love and Pies is basically the original for Merge 2. They're the OGs. That's what everyone copied. And I think they've just had a difficult time keeping up with what everyone else is doing and how they've really added in all the monetization. They've taken a lot of social casino monetization components, meta collections to to really drive the category. So, oh, let's go back to shooters cuz you know it's not a podcast with us if we don't talk about shooters.\nSo, uh, life service shooter game comes to a premature end, and this is Steel Hunters from Wargaming. It's a mech game that we actually covered to quite a detail on this TWIG episode a few episodes ago. We talked about Steel Hunters versus War Robots, and Chris Sides was actually a guest host on the podcast, and he came pretty hard at Steel Hunters, talking of their gunplay and how they used the UE5 templates, if I'm correct, what he was mentioning, and it felt very generic. It looked different, but the play was not that interesting. And he was right. So, it looks like Steel Hunters didn't make it. And Wargaming still continues with tanks and a little bit of ships. I don't remember if they have plates.\nWe need to talk about this next week, but I think the biggest story in all of this is Mecca Break, baby. Like, Mecca is on [ __ ] Steam. It broke over 100,000 CCUs. It is a Japanese free-to-play Mecca game, and you have a deep, deep layer of customization. It goes full, full eastern, and I think this thing Oh my god, I'm so excited to play this. I haven't I'm not deep enough in to provide a review. Let's talk about it next week. My aspirations for the Gundam franchise are held in this this video game.\nOh wow.\nIt looks really cool.\nWow. It's a shooter like action.\nLike but like you're like flying. But wait till we get to the home menus and look at progression is what I say.\nMecca break.\nOh\nyeah. Look at all the character customization. And let me tell you, this is uh different different cultural norms.\nYeah, they look really enhanced.\nReally enhanced. Yeah. Anime uh pushed to the limits.\nYeah.\nAll right. Well, in the hope of being somewhat positive about what's actually working in the game industry right now, I came up with a topic to talk about is like basically the top seven games outside of puzzle that have done well in the west for the last two years, mind you, are the following: Pokemon, TCG Pocket, Dark War Survival, Top Heroes, Kingshot, Archer 2, Capri Borrow Go, and Lassie Survival. And I know we've talked about kind of like the essences of these, but I just want to reiterate because I keep getting people saying kind of the same thing is that everyone seems to be wanting to build games that delight themselves, right? Versus games that actually do well in the marketplace. So, um, I came across some article that was written, I've never met this or heard about this person, Ailen Yaziki. Does anybody know her? It was actually a really, really well-written piece on two particular games, a Century Games, White Out Survival and then Kingshot. And I've been playing Kingshot like a [ __ ] crack addict. Part of the reason I wanted to talk about this, I have spent a ridiculous amount of money on this game for me. And the whole point of all these games is the same thing I've been talking about since [ __ ] we were in Turkey like three years ago, right, when IDFA happened. is that all these games have the same recipe. First of all, they're all made in China, right? Second, they are casual gameplay with deep monetization design, right? Full stop, right? And they are deep. And when I say deep, I mean deep. Like they have so many different elements of engagement on these games, spending syncs and you know, upgrade all these different mechanics and and systems that are geared towards building up your power level for your games. And so she wrote this piece about these two particular games and it's basically saying how the 4X genre is kind of evolving with like you know these hybrid casual mechanics which reduce complexity in terms of the funnel, but then it makes it again a much more deeper game when you get into it, right? By doing that, it's much easier to acquire users and and less expensive in in the hope to get the whales. And the whole concept here is that the fact is that the majority of the of the money is being generated by a very, very, very, very small percentage of the people, and so you need to capture them in some ways with deep monetization design. That is what's critical to this business. Right? So she kind of writes about this on on how the forex genre is evolving. Um, all I really wanted to say is that mass market gameplay helps bring people to the game, but the demonetization is what actually makes money for the game and justifies all the UA spend. And so again, stop focusing on Warcraft Rumble and games that delight. It's just all about figuring out ways of monetizing them. And even these games like Grow Garden is egregious. Absolutely.\nPeople have no idea. People have no idea. It is like the absolute worst in terms of extraction of all possible. Like the most casual game is [ __ ] gross. Absolutely gross. That's what it takes to make games successful nowadays. That's what it takes.\nBut that game is going to be here today, gone tomorrow. But these games are actually sticking around and growing and continue to attract user. So, I just wanted to say this is what's working in the marketplace right now at scaling outside of puzzle, right? Puzzle is kind of a different ballgame, but from a core type gameplay and game mechanics.\nI did a little webinar on the Grow Garden. I looked into that one cuz I worked on Farmville and it's basically Farmville for kids with Phil's love of monetization, rarity, scarcity. I mean the whole thing\nmutations stealing stealing stealing the live ops people don't understand there's a real live ops strategy in Grow Garden, there is\nnot only that there are chained offers remember these are very young developers like implementing the best of monetization practices\nand there is no place where there is not a tentacle that monetization will go in Roblox games\nand it's out of New Zealand, right? There's two teams, like there's the original developer, yeah, there's a 16-year-old kid and then someone else bought, I think, a share, and so they co-develop it, and there's there's some headcount on the project now. It's it's not just a small team anymore.\nYeah. One of the guys from the new company that took it over, he's a basically a Roblox influencer himself. And so once they took it over and I think they have like 49% of the game and he started to talk about it, it blew up. And then every Saturday morning and I think it's 7:00 a.m. Pacific time, you can just watch the CCU spike with the update. So every week they've got brand new live ops, brand new events, brand new things to buy. And the way that they do it is just, you know, like Phil, it's the deepest monetization that you would see in some of the hardcore games just added to this silly farming game. It would make the original Farmville developers from Zingga blush, you know, in terms of the monetization design. I mean, it is unfucking believable, right? It is sickening. Absolutely sickening. But again, it's going to be gone in a few months. I think like we're not even going to be talking about this in a few weeks. So, it's not a sustainable model, but it's certainly\nI think you're still missing the headline, Eric, which is Roblox's ability to grow hits like this. That's the real story here, which I think is interesting because they took someone from nothing to something based on organics basically alone.\nYeah. This is just like Zinga and Canvas on Facebook. This is exactly the same thing. You extract as much money as possible from the consumer and move the [ __ ] on. You know, that's why Zinga was like a destined to fail is because they just extracted as much money from the users and then moved them on to the next game which monetized less. They pulled the means of distribution right from under their [ __ ] noses, you know? And so I don't think Roblox is going to do that. But the next like sickening game is going to come out and they're going to move on to that, you know, like that's the way this business is going to work. I'd paint it in a better way. Like I think at Zinga they called it like the Death Star. Like they're building the Death Star and you just kind of like point it and launch it. Like that was always Farmville is like they cross-promote things and like Aldderon like explosion. I think the real story is that Roblox like it sounds like they finally have their death star which is the platform. Like just point this thing and\nyou know they can scale any game on the platform. I mean that's that's incredible. This is the most played game in the [ __ ] world. Even if the arpoo is really low, which it is, that is not insignificant.\nYou're not giving enough credit to the influencers that draw people in to make this a thing.\nNo. Influencers are at the other end of the funnel. Influencers cannot make something that's not popular popular. Like they are just as much writing the demand wave as anyone else. Like most popular games are the top stream games. CS GO, Dota, League of Legends.\nDude, when Farmville was coming out in Canvas, people were saying the same exact thing, right? This is the most people that have played a game in the history of man.\nAnd that matters, right? Like that mattered for Candy Crush. That matters for Farmville. Like they rode that for a long time. That wasn't insignificant. that mattered for Fortnite.\nOf course, it matters. And Fargo, by the way, is still around. I know it's crazy, but\nthe difference is they maintain these audiences for the successes like Fortnite and Candy Crush.\nYeah.\nThese audiences are going away, right?\nYeah. And I think that's fair. You know, let's look at how this one holds up. Let's also look at other platform titles like Adopt Me. Like there are games with like stable live service.\nYeah. I'm not condemning Roblox. I'm just condemning, you know, the the hit driven like games like this. Like it's amazing, but it's not sustainable, right?\nI don't know. Uh that a lot of the games in the top Roblox charts have been there for a while. Yes, it's going the hype is going to die down because squirrel because you know these kids have an attention span of 6 to 8 weeks and it's summer. They're likely going to stay addicted all summer and then maybe it'll drop down when school goes back in. It's not going to maintain this level, but it might not go out of the top 10 or 20 unless they stop supporting with live ops or if something else comes in to take its place. You know what's interesting here is it's finally the farming genre. I know it's crazy to think that farming and kids is like the next genre, but you know, if I'm a Roblox developer, I'm going to go mine all of the other\n\n\nGames for 60-year-old women, which is the irony here.\nIt's like that was the audience for Farmville was like 60-year-old women in Iowa who love that game for a very different reason.\nThey took all of the like Pokemon trading card mechanics and put it into a farming theme.\nAnd so I think you're going to see a lot of that if I had to guess is go find a different theme and then just, you know, layer in all of Phil's favorite monetization mechanics.\nAll right.\nYeah, I think that's everything.\nAll right.\nMecca break next week and uh yeah, we'll see you next week.\nTill next week.\nPeace.\n[Music]\nWhat are you doing?\n"
}