{
  "episodeId": "LbkO84MsmyM",
  "channelSlug": "@dwarkeshpatel",
  "title": "Sarah Paine EP 1: The War For India (Lecture & Interview)",
  "publishedAt": "2025-01-16T21:28:35.000Z",
  "rawLines": [
    {
      "lang": "en",
      "text": "I need to start with a disclaimer, \nbecause I work for the US Government,  ",
      "offset": 31.84,
      "duration": 3.2
    },
    {
      "lang": "en",
      "text": "and they require you to do a disclaimer. So: \nthe ideas that you're about to hear are my  ",
      "offset": 35.04,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "ideas. They don't necessarily represent those \nof the US Government, the US Navy Department,  ",
      "offset": 40.76,
      "duration": 6.16
    },
    {
      "lang": "en",
      "text": "the US Department of Defense, let alone the Naval \nWar College where I work. Are we all good on this? ",
      "offset": 46.92,
      "duration": 5.04
    },
    {
      "lang": "en",
      "text": "All right, so today I'm going to tell you \na story of three protagonists, Russia,  ",
      "offset": 51.96,
      "duration": 5.64
    },
    {
      "lang": "en",
      "text": "the United States and China, that all wanted \nto work their magic on India and Pakistan,  ",
      "offset": 57.6,
      "duration": 5.48
    },
    {
      "lang": "en",
      "text": "which didn't exactly appreciate it.\nSo two big topics. One is intervening in  ",
      "offset": 63.08,
      "duration": 6.28
    },
    {
      "lang": "en",
      "text": "someone else's problems, a cottage industry for \nthe United States. And also before you do that,  ",
      "offset": 69.36,
      "duration": 6.76
    },
    {
      "lang": "en",
      "text": "you really ought to check out the alignments. \nWho's the primary adversary of whom? How long has  ",
      "offset": 76.12,
      "duration": 6.88
    },
    {
      "lang": "en",
      "text": "it been that way? And also ask these questions \nabout all the neighbors and anyone who might  ",
      "offset": 83,
      "duration": 5.88
    },
    {
      "lang": "en",
      "text": "want to crash the party along with you.\nIt's also a story of a series of limited  ",
      "offset": 88.88,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "wars. What's a limited war? It means it's for \nsomething less than regime change. So however  ",
      "offset": 94.96,
      "duration": 5.28
    },
    {
      "lang": "en",
      "text": "it turns out the governments that started that \nwar are still in place. And two of them resulted  ",
      "offset": 100.24,
      "duration": 6.64
    },
    {
      "lang": "en",
      "text": "in quick victories, the ideal in warfare. \nThe first one was the Sino-Indian War of  ",
      "offset": 106.88,
      "duration": 6.36
    },
    {
      "lang": "en",
      "text": "1962. And the other one was the Bangladesh War \nof Independence in 1971. And these wars change  ",
      "offset": 113.24,
      "duration": 7.96
    },
    {
      "lang": "en",
      "text": "things in many short term expected ways and \nthen in many long term, highly unexpected ways. ",
      "offset": 121.2,
      "duration": 6.84
    },
    {
      "lang": "en",
      "text": "So I'm going to go into all of this with you all. \nSo here's my game plan, and it's literally a game  ",
      "offset": 128.04,
      "duration": 3.16
    },
    {
      "lang": "en",
      "text": "plan. I'm going to start out with the pivotal \ndecisions made by different players. Then,  ",
      "offset": 131.2,
      "duration": 5.36
    },
    {
      "lang": "en",
      "text": "once they're made, certain things are foreclosed \nand certain things are possible. And this is the  ",
      "offset": 136.56,
      "duration": 5.96
    },
    {
      "lang": "en",
      "text": "playing field delimited by these pivotal \ndecisions. And then I'm going to look at  ",
      "offset": 142.52,
      "duration": 4.08
    },
    {
      "lang": "en",
      "text": "the teams. Some allies were prime allies, others \nwere subprime, and they mixed and matched over  ",
      "offset": 146.6,
      "duration": 6
    },
    {
      "lang": "en",
      "text": "time. So I'll do teams, and then I'll do the \ngame, the interaction, and then at the end,  ",
      "offset": 152.6,
      "duration": 4.72
    },
    {
      "lang": "en",
      "text": "I'm going to do the plays, some of the techniques, \nthings that you can do to play this game. ",
      "offset": 157.32,
      "duration": 4.36
    },
    {
      "lang": "en",
      "text": "Pivotal decision number one. When Mao \nwon the Chinese Civil War in 1949,  ",
      "offset": 161.68,
      "duration": 5.2
    },
    {
      "lang": "en",
      "text": "it didn't end. He also spent the next two years \nnot only eliminating Nationalist remnants,  ",
      "offset": 166.88,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "but also conquering Xinjiang and Tibet. Tibet had \nbeen autonomous since 1911, when the last dynasty  ",
      "offset": 172.68,
      "duration": 7.56
    },
    {
      "lang": "en",
      "text": "had collapsed. And Mao decides that he is going \nto reconquer Tibet. Tibet's an interesting place  ",
      "offset": 180.24,
      "duration": 6.84
    },
    {
      "lang": "en",
      "text": "it contains, I think, about 40% of China's mineral \nresources. So there's a lot of money being made in  ",
      "offset": 187.08,
      "duration": 6
    },
    {
      "lang": "en",
      "text": "Tibet for those with the capital to invest in big \nmines. If you look at this map, the Han Chinese,  ",
      "offset": 193.08,
      "duration": 6.48
    },
    {
      "lang": "en",
      "text": "the preponderant group of China, they inhabit, \nthey dominate as far west as the Chongqing Basin  ",
      "offset": 199.56,
      "duration": 6.48
    },
    {
      "lang": "en",
      "text": "and Sichuan. And then you go further west, \nin-towards Tibet. China has put large armies  ",
      "offset": 206.04,
      "duration": 3.08
    },
    {
      "lang": "en",
      "text": "into Tibet exactly twice. Once under the Qianlong \nemperor in the late 18th century, they didn't stay  ",
      "offset": 209.12,
      "duration": 6.2
    },
    {
      "lang": "en",
      "text": "for very long. And then under Mao in 1950. And \nthey have stayed forever and built roads so they  ",
      "offset": 215.32,
      "duration": 6.24
    },
    {
      "lang": "en",
      "text": "could keep on sending more in. Between 1950 and \n1957, China built a series of road systems through  ",
      "offset": 221.56,
      "duration": 7.12
    },
    {
      "lang": "en",
      "text": "Tibet. And the western route there is the only one \nthat provides year round traffic. The problem with  ",
      "offset": 228.68,
      "duration": 7.16
    },
    {
      "lang": "en",
      "text": "the other two is, well, check it out. They go \nthrough 14 or 15 mountain ranges. It means you  ",
      "offset": 235.84,
      "duration": 4.48
    },
    {
      "lang": "en",
      "text": "go vertical up, vertical down – do that 14, 15 \ntimes. And then between monsoon rains and snow  ",
      "offset": 240.32,
      "duration": 5.6
    },
    {
      "lang": "en",
      "text": "and mudslides, they're very difficult to maintain. \nAnd then the eastern one crosses the major river  ",
      "offset": 245.92,
      "duration": 5.96
    },
    {
      "lang": "en",
      "text": "systems of South Asia. So that's difficult. So \nonly the western route is the really good one.  ",
      "offset": 251.88,
      "duration": 5.64
    },
    {
      "lang": "en",
      "text": "And it's really important for the Chinese if you \nwant to conquer Tibet, you truly want that one. ",
      "offset": 257.52,
      "duration": 4.92
    },
    {
      "lang": "en",
      "text": "All right, so if you look at this, that western \nroute provides not only the ability to control  ",
      "offset": 262.44,
      "duration": 4.48
    },
    {
      "lang": "en",
      "text": "Tibet, but it also provides a pincer onto \nXinjiang. If China wants to come in one  ",
      "offset": 266.92,
      "duration": 4.72
    },
    {
      "lang": "en",
      "text": "way and the other way, it's a good way to get \nin. If you look at those two circles there,  ",
      "offset": 271.64,
      "duration": 4.64
    },
    {
      "lang": "en",
      "text": "those are the disputed areas between China and \nIndia. The northern one is the Aksai Chin Plateau,  ",
      "offset": 276.28,
      "duration": 7.88
    },
    {
      "lang": "en",
      "text": "which China has taken from India and India still \nclaims. And in the south is Arunachal Pradesh,  ",
      "offset": 284.16,
      "duration": 6.72
    },
    {
      "lang": "en",
      "text": "which India still owns, but China claims. And \nso these are the areas that they're fighting  ",
      "offset": 290.88,
      "duration": 6.72
    },
    {
      "lang": "en",
      "text": "over. But once China took Tibet…Before, there had \nbeen a big buffer zone between China and India,  ",
      "offset": 297.6,
      "duration": 7.56
    },
    {
      "lang": "en",
      "text": "right? There's all this Tibet, and no one could \nreally get in there. Now China's built roads so  ",
      "offset": 305.16,
      "duration": 4.76
    },
    {
      "lang": "en",
      "text": "it can get into places where India cannot \ndeploy troops until it gets into the road  ",
      "offset": 309.92,
      "duration": 3.96
    },
    {
      "lang": "en",
      "text": "races with the Chinese. And so it reduces the \nbuffer zone between China and India to these  ",
      "offset": 313.88,
      "duration": 6.84
    },
    {
      "lang": "en",
      "text": "small Himalayan kingdoms of Nepal, Bhutan and \nSikkim. So it changes things. So that's pivotal  ",
      "offset": 320.72,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "decision number one, deciding to conquer Tibet.\nPivotal decision number two is the United States,  ",
      "offset": 326.52,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "in order to deal with the Soviet Unions under \nEisenhower, did what the wits back in the day  ",
      "offset": 332.24,
      "duration": 5.04
    },
    {
      "lang": "en",
      "text": "called pactomania. What is that? It's forming all \nsorts of bilateral relations and also regional  ",
      "offset": 337.28,
      "duration": 5.6
    },
    {
      "lang": "en",
      "text": "groupings in order to counter the Soviets \ninstitutionally and wall them in that way. And  ",
      "offset": 342.88,
      "duration": 5.56
    },
    {
      "lang": "en",
      "text": "part of this was what was called the Northern \ntier strategy, as seen in the Baghdad Pact,  ",
      "offset": 348.44,
      "duration": 6.68
    },
    {
      "lang": "en",
      "text": "where you get Turkey, Iraq, Iran and Pakistan \nto form this thing, and it's to wall off the  ",
      "offset": 355.12,
      "duration": 5.12
    },
    {
      "lang": "en",
      "text": "Soviet Union from the oil fields of the Middle \nEast. East. And the other thing, you should look  ",
      "offset": 360.24,
      "duration": 4.72
    },
    {
      "lang": "en",
      "text": "at this map before it goes away. Look where \nPakistan's located, where you think it is,  ",
      "offset": 364.96,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "and then go to the east, and that's East Pakistan. \nIn the 1971 war, there's going to be a civil war,  ",
      "offset": 369.52,
      "duration": 6.64
    },
    {
      "lang": "en",
      "text": "and Pakistan's going to lose East Pakistan, which \nis Bangladesh today. So just keep that in mind. ",
      "offset": 376.16,
      "duration": 5.28
    },
    {
      "lang": "en",
      "text": "So as part of the sweetener for Pakistan to join \nthe Baghdad Pact, the United States allied with  ",
      "offset": 381.44,
      "duration": 6.04
    },
    {
      "lang": "en",
      "text": "Pakistan and gave them a big military aid treaty. \nAnd here's Nehru, the Prime Minister of India,  ",
      "offset": 387.48,
      "duration": 7.48
    },
    {
      "lang": "en",
      "text": "and he is horrified. A military pact between \nPakistan and the United States changes the  ",
      "offset": 394.96,
      "duration": 5.24
    },
    {
      "lang": "en",
      "text": "whole balance of power in this part of the world, \naffects us most especially. The United States must  ",
      "offset": 400.2,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "realize that the reaction of India is going \nto be, you're arming the Pakistanis. Whom do  ",
      "offset": 404.76,
      "duration": 5.04
    },
    {
      "lang": "en",
      "text": "you think they're going to shoot? It'll be us. \nAnd the Indians were just appalled that we did  ",
      "offset": 409.8,
      "duration": 5.12
    },
    {
      "lang": "en",
      "text": "this. And afterwards, Eisenhower admitted it was \n“perhaps the worst kind of plan and decision we  ",
      "offset": 414.92,
      "duration": 7.12
    },
    {
      "lang": "en",
      "text": "could ever have made.” It was a terrible era, \nbut now we're stuck with it. Because what the  ",
      "offset": 422.04,
      "duration": 4.2
    },
    {
      "lang": "en",
      "text": "United States is slowly discovering is that if \nyou arm either India or Pakistan in this period,  ",
      "offset": 426.24,
      "duration": 5.92
    },
    {
      "lang": "en",
      "text": "it's going to aim it at the other one. And so \nthat pact poisoned US Relations with India for the  ",
      "offset": 432.16,
      "duration": 6.6
    },
    {
      "lang": "en",
      "text": "duration of the Cold War and set up things in ways \nthe United States ultimately wasn't happy with. ",
      "offset": 438.76,
      "duration": 5.28
    },
    {
      "lang": "en",
      "text": "Okay, those are two pivotal decisions. Now for \na pivotal situation, it's really the devolving  ",
      "offset": 444.04,
      "duration": 5.52
    },
    {
      "lang": "en",
      "text": "situation between Russia and China. Until Mao got \natomic weapons in 1964, he really had to shut up.  ",
      "offset": 449.56,
      "duration": 8.08
    },
    {
      "lang": "en",
      "text": "And because he needed Russian technological aid, \nhe's been totally cut off from the West. After  ",
      "offset": 457.64,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "the Korean War, he's being isolated. So he truly \nneeds Soviet aid. And he also, if he wants nuclear  ",
      "offset": 463.48,
      "duration": 6
    },
    {
      "lang": "en",
      "text": "weapons, he needs some of their aid to do that \nas well. So he has to keep his mouth shut. But  ",
      "offset": 469.48,
      "duration": 4.32
    },
    {
      "lang": "en",
      "text": "once he detonates an atomic weapon, here's what he \ntells the Russians, and they just about lose it.  ",
      "offset": 473.8,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "There are too many places occupied by the Soviet \nUnion. The Russians took everything they could.  ",
      "offset": 478.88,
      "duration": 4.36
    },
    {
      "lang": "en",
      "text": "We have not yet presented an account of this \nlist. Under the czars, the Russians took from the  ",
      "offset": 483.24,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "Chinese sphere of influence territory exceeding US \neast of the Mississippi. Think the Chinese didn't  ",
      "offset": 489.04,
      "duration": 6.12
    },
    {
      "lang": "en",
      "text": "notice? Yes, they noticed. So Mao all of a sudden \nis calling that. And the Russians are appalled. ",
      "offset": 495.16,
      "duration": 7.08
    },
    {
      "lang": "en",
      "text": "But Mao has other gripes against the Russians. \nStalin, in the lead up to World War II,  ",
      "offset": 502.24,
      "duration": 6.64
    },
    {
      "lang": "en",
      "text": "had made sure to set up the Chinese to fight Japan \nso that he wouldn't have to. So that leaves him  ",
      "offset": 508.88,
      "duration": 5.96
    },
    {
      "lang": "en",
      "text": "just fighting Nazis, not Nazis and Japanese. And \nthen Stalin takes Mongolia, which had formerly  ",
      "offset": 514.84,
      "duration": 6.6
    },
    {
      "lang": "en",
      "text": "been a part of the Chinese sphere of influence. \nAnd in the Korean War, he's more than happy to  ",
      "offset": 521.44,
      "duration": 4.28
    },
    {
      "lang": "en",
      "text": "fight to the last Chinese. And then during the \nChinese Civil War, the Russians tell Mao, oh,  ",
      "offset": 525.72,
      "duration": 5.76
    },
    {
      "lang": "en",
      "text": "stop, Yangtze, you need to take a little breather \nhere. Because he wants a divided China like the  ",
      "offset": 531.48,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "divided Germany he has, and then the divided Korea \nhe's going to get. You want to be surrounded by  ",
      "offset": 536.56,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "these little broken states around you if you're a \ncontinental power. And then when Stalin dies and  ",
      "offset": 541.16,
      "duration": 6.32
    },
    {
      "lang": "en",
      "text": "Mao wants to be senior statesman of communism, \nKhrushchev is appalled by that. Then Mao is  ",
      "offset": 547.48,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "appalled when Khrushchev does de-Stalinization, \nbecause Mao has his own cult of personality. And  ",
      "offset": 553.28,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "then Khrushchev wants to do peaceful coexistence \nwith the west, while Mao is ramping it up in the  ",
      "offset": 558.36,
      "duration": 4.36
    },
    {
      "lang": "en",
      "text": "Cultural Revolution, so there's no meeting \nof the minds. And then all this becomes very  ",
      "offset": 562.72,
      "duration": 4.8
    },
    {
      "lang": "en",
      "text": "public when it hits the propaganda press of the \nCommunists, of the Sino-Soviet split in 1960. ",
      "offset": 567.52,
      "duration": 5.32
    },
    {
      "lang": "en",
      "text": "All right, the Russians have their own gripes \nabout the Chinese, and here's how they go. The  ",
      "offset": 572.84,
      "duration": 6.4
    },
    {
      "lang": "en",
      "text": "Russians look around at the west and particularly \nthe United States and go, wow, they got bases  ",
      "offset": 579.24,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "everywhere. The British have got bases everywhere. \nHow come our allies won't give us bases? I mean,  ",
      "offset": 583.4,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "well, if you occupy Eastern Europe, the whole \nplace is a base, but that's a different matter.  ",
      "offset": 588.28,
      "duration": 4.04
    },
    {
      "lang": "en",
      "text": "So the Russians want the Chinese to let them \nkeep a couple of remaining czarist treaty ports,  ",
      "offset": 592.32,
      "duration": 6
    },
    {
      "lang": "en",
      "text": "essentially, and want to expand them. And \nthe Chinese say, forget it. And in fact,  ",
      "offset": 598.32,
      "duration": 5.6
    },
    {
      "lang": "en",
      "text": "after the Korean War, when the Chinese have \ntroops all up in Manchuria, which is where these  ",
      "offset": 603.92,
      "duration": 4.64
    },
    {
      "lang": "en",
      "text": "bases were located, and there's a succession \nstruggle going on because Stalin's just died,  ",
      "offset": 608.56,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "the Russians have to return the bases because \nthere's just too much bad stuff happening where  ",
      "offset": 614,
      "duration": 3.32
    },
    {
      "lang": "en",
      "text": "they live, live. And then what Mao does in \n‘54 and ‘58, which just appalls the Russians,  ",
      "offset": 617.32,
      "duration": 5.56
    },
    {
      "lang": "en",
      "text": "are these two Taiwanese Strait crises. What's \ngoing on? Mao is lobbing all kinds of ordnance  ",
      "offset": 622.88,
      "duration": 6.44
    },
    {
      "lang": "en",
      "text": "on these islands that are owned by Taiwan, \nthat are very close to the People's Republic's  ",
      "offset": 629.88,
      "duration": 4.76
    },
    {
      "lang": "en",
      "text": "shores. And the Russians are appalled they are not \nconsulted, and yet they have a friendship treaty  ",
      "offset": 634.64,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "that obligates them to provide to join a war under \ncertain circumstances. And the Russians are going,  ",
      "offset": 640.08,
      "duration": 5.12
    },
    {
      "lang": "en",
      "text": "whoa, whoa, whoa, whoa, there could be nuclear \nfollow-on from this stuff. So the Russians then  ",
      "offset": 645.2,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "asked the Chinese if it's okay if they have a \ncombined naval base on China's shores. And China  ",
      "offset": 650.92,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "says, forget it. The Russians are thinking, okay, \nwell then we're not going to give you any of the  ",
      "offset": 655.08,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "plans for the atomic weapon. And it all devolves. \nSo there's no love lost on either side. And then  ",
      "offset": 659.76,
      "duration": 6.88
    },
    {
      "lang": "en",
      "text": "what exacerbates these tensions is the Vietnam \nWar where China wants influence over neighbor  ",
      "offset": 666.64,
      "duration": 7.08
    },
    {
      "lang": "en",
      "text": "Vietnam. That is pretty typical. But Russia wants \ninfluence over Vietnam to do a pincer on China,  ",
      "offset": 673.72,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "which China doesn't like at all. Meanwhile, \nboth of them want to prove their revolutionary  ",
      "offset": 679.44,
      "duration": 4.12
    },
    {
      "lang": "en",
      "text": "credentials by aiding the Vietnamese, North \nVietnamese. So Russia's aid needs to come by train  ",
      "offset": 683.56,
      "duration": 5.96
    },
    {
      "lang": "en",
      "text": "over China, lest the United States sink at the \ngood stuff if it goes by sea. So the Chinese feel  ",
      "offset": 689.52,
      "duration": 7.76
    },
    {
      "lang": "en",
      "text": "obliged to let it go through, but they're just \nhassling Russians the whole time through. They  ",
      "offset": 697.28,
      "duration": 4.64
    },
    {
      "lang": "en",
      "text": "take it apart, tear it apart, say it was from \nChina. And the Russians are just apoplectic.  ",
      "offset": 701.92,
      "duration": 4.32
    },
    {
      "lang": "en",
      "text": "So their relations are getting worse and worse \nand worse and the squabbling is just incessant. ",
      "offset": 706.24,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "So it's not surprising that the Sino-Soviet border \nconflict of 1969 breaks out - during the Vietnam  ",
      "offset": 711.68,
      "duration": 6.04
    },
    {
      "lang": "en",
      "text": "War. And while all this is going on, this is one \nof the river islands, the Amur river forms much  ",
      "offset": 717.72,
      "duration": 5.92
    },
    {
      "lang": "en",
      "text": "of their border, and this is one of the islands \nthere. And there's much fighting over it. And the  ",
      "offset": 723.64,
      "duration": 5.16
    },
    {
      "lang": "en",
      "text": "Russians come to us, the Americans, and say, “is \nit okay if we nuke these people?” And the United  ",
      "offset": 728.8,
      "duration": 6.16
    },
    {
      "lang": "en",
      "text": "States says, “no, there's no way it's okay to \nnuke these people”. And Mao figures it out. The  ",
      "offset": 734.96,
      "duration": 5.6
    },
    {
      "lang": "en",
      "text": "one that wants to nuke you, that's the primary \nadversary. So prior to that moment, the United  ",
      "offset": 740.56,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "States is the primary adversary of both Russia and \nChina. Now with this, they're primary adversaries  ",
      "offset": 746.36,
      "duration": 6.24
    },
    {
      "lang": "en",
      "text": "of each other. It causes a reshuffling of the \nallies, and I'll get to that later. So, okay,  ",
      "offset": 752.6,
      "duration": 5.56
    },
    {
      "lang": "en",
      "text": "I've done the playing field of these decisions \nthat delimited it. But now I'm going to get to the  ",
      "offset": 758.16,
      "duration": 7.16
    },
    {
      "lang": "en",
      "text": "allies, and some allies are better than others. \nAnd here we got Mao and Khrushchev. Look at these  ",
      "offset": 765.32,
      "duration": 4.44
    },
    {
      "lang": "en",
      "text": "lovebirds. Boy, when that divorce took place, boy \ndid it mess up the extended family. Nevermind.\n  ",
      "offset": 769.76,
      "duration": 7.28
    },
    {
      "lang": "en",
      "text": "And the point, for my purposes tonight, I'm going \nto use the word &quot;alliance&quot; really loosely. If you  ",
      "offset": 777.04,
      "duration": 6.12
    },
    {
      "lang": "en",
      "text": "sign a mutual defense pact - for my purposes \ntonight that makes you an alliance - allies.  ",
      "offset": 783.16,
      "duration": 5.4
    },
    {
      "lang": "en",
      "text": "And if you're a political scientist, you've \ngot something that's much more complicated,  ",
      "offset": 788.56,
      "duration": 2.44
    },
    {
      "lang": "en",
      "text": "but forget it, I just can't handle it. So \nwe're going to do it this way. All right? ",
      "offset": 791,
      "duration": 3.8
    },
    {
      "lang": "en",
      "text": "So Stalin didn't think much of Nehru at all. He \nthought he was a lackey of British colonialism.  ",
      "offset": 794.8,
      "duration": 6.36
    },
    {
      "lang": "en",
      "text": "But Khrushchev thought India was really important \nto counterbalance China. And here's Nehru thinking  ",
      "offset": 801.16,
      "duration": 7.04
    },
    {
      "lang": "en",
      "text": "about it. Well, look, we have to be on friendly \nterms with both Russia and America. But actually  ",
      "offset": 808.2,
      "duration": 4.12
    },
    {
      "lang": "en",
      "text": "he felt much more in common with Russia. \nWhy? Because he favored Fabian socialist  ",
      "offset": 812.32,
      "duration": 6.56
    },
    {
      "lang": "en",
      "text": "economic policies that were much more akin \nto what's going on in Russia than it was in  ",
      "offset": 818.88,
      "duration": 4.92
    },
    {
      "lang": "en",
      "text": "the United States. Moreover, the United States was \nsegregated, which appalled Nehru. And in addition,  ",
      "offset": 823.8,
      "duration": 6.88
    },
    {
      "lang": "en",
      "text": "the United States was cozying up to all the \ncolonial powers. So Nehru thought the Russians  ",
      "offset": 830.68,
      "duration": 4.96
    },
    {
      "lang": "en",
      "text": "were the better bet. While all this is going on, \nthe Indians were non-aligned and they treated  ",
      "offset": 835.64,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "the Chinese really generously. And I've got a \nwhole list of generosity. So India immediately  ",
      "offset": 841.48,
      "duration": 6.56
    },
    {
      "lang": "en",
      "text": "recognizes China in 1950. Countries like the \nUnited States didn't, for forever. And when the  ",
      "offset": 848.04,
      "duration": 6.44
    },
    {
      "lang": "en",
      "text": "San Francisco Treaty, I think, is signed in 1951 \nin the United States, ending the war with Japan,  ",
      "offset": 854.48,
      "duration": 6.32
    },
    {
      "lang": "en",
      "text": "India refuses to sign because China and Russia \naren't there to sign as well. And then to help  ",
      "offset": 860.8,
      "duration": 6.76
    },
    {
      "lang": "en",
      "text": "China break out of its diplomatic isolation \nat the end of the Korean War, India signs a  ",
      "offset": 867.56,
      "duration": 4.72
    },
    {
      "lang": "en",
      "text": "friendship treaty with China. And as part of \nthat friendship treaty, it recognizes Chinese  ",
      "offset": 872.28,
      "duration": 6
    },
    {
      "lang": "en",
      "text": "sovereignty over Tibet. Under international law, \ncontrary to what Vladimir Putin is doing lately,  ",
      "offset": 878.28,
      "duration": 5.88
    },
    {
      "lang": "en",
      "text": "under international law, if you recognize \nsomeone's sovereignty over territory that is  ",
      "offset": 884.16,
      "duration": 6.72
    },
    {
      "lang": "en",
      "text": "permanent, you cannot back out of it legally under \ninternational law. So the Chinese promise, I don't  ",
      "offset": 890.88,
      "duration": 7.44
    },
    {
      "lang": "en",
      "text": "know, there's some like, peaceful coexistence \nor whatever they're promising the Indians, but  ",
      "offset": 898.32,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "that has no permanence under international law, \nwhereas this thing does. And then from 1960 on,  ",
      "offset": 902.92,
      "duration": 6.8
    },
    {
      "lang": "en",
      "text": "the Indians are voting to seat the People's \nRepublic of China, not Taiwan, on the UN. ",
      "offset": 909.72,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "Meanwhile, in the background, all this \nroad-building is going on. Those roads  ",
      "offset": 915.16,
      "duration": 3.88
    },
    {
      "lang": "en",
      "text": "are being built between 1950 and 1957. \nAnd the Indians aren't going to figure  ",
      "offset": 919.04,
      "duration": 4.64
    },
    {
      "lang": "en",
      "text": "out until 1958 that the roads are \nthere. Meanwhile, road's completed.  ",
      "offset": 923.68,
      "duration": 5.28
    },
    {
      "lang": "en",
      "text": "The Chinese want to complete their control over \nTibet, and so they're going to send big armies up  ",
      "offset": 931.72,
      "duration": 7.24
    },
    {
      "lang": "en",
      "text": "there. And Tibetan culture is much more…It's of \nIndian origin, it's not Chinese origin. So this  ",
      "offset": 938.96,
      "duration": 7.28
    },
    {
      "lang": "en",
      "text": "repression of Tibetan culture just appalls \nthe Indians. And then two days before the  ",
      "offset": 946.24,
      "duration": 4.96
    },
    {
      "lang": "en",
      "text": "People's Liberation of Army is going to make \nit into Lhasa, which is the capital of Tibet,  ",
      "offset": 951.2,
      "duration": 4.52
    },
    {
      "lang": "en",
      "text": "the Dalai Lama flees-he's the spiritual leader \nof Tibet-he flees to India where he's remained  ",
      "offset": 955.72,
      "duration": 5.28
    },
    {
      "lang": "en",
      "text": "ever since to the absolute horror and anger of \nChina. So at about this time, the Chinese come  ",
      "offset": 961,
      "duration": 7.12
    },
    {
      "lang": "en",
      "text": "to the Indians and say, “look, why don't we \ndo a swap on sovereignty?” You recognize our  ",
      "offset": 968.12,
      "duration": 6.36
    },
    {
      "lang": "en",
      "text": "sovereignty over that Aksai Chin Plateau where \nnobody lives, but it's really good for the roads,  ",
      "offset": 974.48,
      "duration": 4.64
    },
    {
      "lang": "en",
      "text": "China's western route. And then we'll recognize \nyour sovereignty over this much more densely  ",
      "offset": 979.88,
      "duration": 5.88
    },
    {
      "lang": "en",
      "text": "populated Arunachal Pradesh. And Nehru \ndoesn't want to hear anything about it. ",
      "offset": 985.76,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "So during the Cuban Missile Crisis, when Russia \nis much too busy worrying about who's going to  ",
      "offset": 990.64,
      "duration": 6.16
    },
    {
      "lang": "en",
      "text": "be lobbying nukes at home, this is when China \nlaunches in the 1960s Sino-Indian War and China  ",
      "offset": 996.8,
      "duration": 6.8
    },
    {
      "lang": "en",
      "text": "just takes the Aksai Chin Plateau. The Indians are \nappalled because they don't have any roads to be  ",
      "offset": 1003.6,
      "duration": 6.76
    },
    {
      "lang": "en",
      "text": "able to deploy up there, whereas the Chinese do. \nTheir defeat is just total. And they can't believe  ",
      "offset": 1010.36,
      "duration": 6.68
    },
    {
      "lang": "en",
      "text": "the Chinese did this to them. Here's Nehru \nafterwards. There are not many instances in  ",
      "offset": 1017.04,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "history where one country, that is India, has gone \nout of her way to be friendly and cooperative with  ",
      "offset": 1021.6,
      "duration": 4.44
    },
    {
      "lang": "en",
      "text": "the Chinese government and people and plead their \ncause in the councils of the world. And then for  ",
      "offset": 1026.04,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "the Chinese government to return evil for good and \neven to go to the extent of committing aggression  ",
      "offset": 1030.72,
      "duration": 5.32
    },
    {
      "lang": "en",
      "text": "and invade our sacred land. Who does this? So \nI get it. The Chinese get the territory they  ",
      "offset": 1036.04,
      "duration": 7.24
    },
    {
      "lang": "en",
      "text": "want. That was the goal of that war. But what they \nhave done is taken a country, India, which had its  ",
      "offset": 1043.28,
      "duration": 7.92
    },
    {
      "lang": "en",
      "text": "leadership terribly idealistic, not interested in \nbecoming militarized at all and making them angry  ",
      "offset": 1051.2,
      "duration": 6.84
    },
    {
      "lang": "en",
      "text": "forever. India immediately doubles the size of \nits army within the next 10 years to up to 750,000  ",
      "offset": 1058.04,
      "duration": 7.96
    },
    {
      "lang": "en",
      "text": "people. Creates 10 mountain divisions useful \nagainst China. And they've never ceased being  ",
      "offset": 1066,
      "duration": 6.2
    },
    {
      "lang": "en",
      "text": "so angry. And then if you think about this, what \nif instead of playing this game this way, China  ",
      "offset": 1072.2,
      "duration": 6.88
    },
    {
      "lang": "en",
      "text": "and India had teamed up? I would suspect we would \nbe in a completely very different world order now,  ",
      "offset": 1079.08,
      "duration": 6.56
    },
    {
      "lang": "en",
      "text": "if that is what they'd done instead. But this is \nChina's decision, not India's fault on this one. ",
      "offset": 1085.64,
      "duration": 5.48
    },
    {
      "lang": "en",
      "text": "All right, so that wasn't great. So let's check \nout other possibilities once that happens to  ",
      "offset": 1091.12,
      "duration": 8.04
    },
    {
      "lang": "en",
      "text": "India. India is all of a sudden looking for \nRussia to counterbalance China. And you also  ",
      "offset": 1099.16,
      "duration": 6.32
    },
    {
      "lang": "en",
      "text": "have Pakistan wondering what to do and what \nthe Pakistani notice after all this: well,  ",
      "offset": 1105.48,
      "duration": 7.28
    },
    {
      "lang": "en",
      "text": "the Chinese are not going to be teaming up with \nIndia, right? They've just invaded the place. And  ",
      "offset": 1112.76,
      "duration": 4.04
    },
    {
      "lang": "en",
      "text": "so this is when Pakistan sees that China might \nhave real possibilities as an ally. And Bhutto  ",
      "offset": 1116.8,
      "duration": 7.28
    },
    {
      "lang": "en",
      "text": "is going to play the China card for the nuclear \nchip, trying to get Chinese help for all of that.  ",
      "offset": 1124.08,
      "duration": 6.76
    },
    {
      "lang": "en",
      "text": "And here's what happens. So you have the '62 war, \nand then in 1963, Pakistan really inexplicably is  ",
      "offset": 1130.84,
      "duration": 6.52
    },
    {
      "lang": "en",
      "text": "ceding territory to China. Who does that? And \nthere are various possibilities down here, but  ",
      "offset": 1137.36,
      "duration": 5.64
    },
    {
      "lang": "en",
      "text": "I'm surmising it's because it's going to help on \nnuclear development. That would explain why you  ",
      "offset": 1143,
      "duration": 5
    },
    {
      "lang": "en",
      "text": "would give a lot of territory. But we don't know. \nThere was supposed to be some mutual defense pact  ",
      "offset": 1148,
      "duration": 4.24
    },
    {
      "lang": "en",
      "text": "maybe, and there's some other things going on. \nAnyway, you can imagine what it may or may not  ",
      "offset": 1152.24,
      "duration": 3.52
    },
    {
      "lang": "en",
      "text": "have been. Okay, in the case of Pakistan and \nChina and India and Russia, they had quite a  ",
      "offset": 1155.76,
      "duration": 7.04
    },
    {
      "lang": "en",
      "text": "good relationship because the Pakistanis and the \nChinese shared India as their problem, and the  ",
      "offset": 1162.8,
      "duration": 7.64
    },
    {
      "lang": "en",
      "text": "Russians and the Indians shared China as their \nproblem. And that worked pretty well. But the  ",
      "offset": 1170.44,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "United States was just a disaster from both Indian \nand Pakistani point of view, and vice versa,  ",
      "offset": 1175.04,
      "duration": 7.2
    },
    {
      "lang": "en",
      "text": "because the United States wanted to befriend \nboth of them. But if you befriend one, the other  ",
      "offset": 1182.24,
      "duration": 3.96
    },
    {
      "lang": "en",
      "text": "is appalled. And so the United States wound up \nappalling everybody. And so what the United States  ",
      "offset": 1186.2,
      "duration": 6.76
    },
    {
      "lang": "en",
      "text": "wanted to have happen is for India and Pakistan \nto put aside their differences and then combine  ",
      "offset": 1192.96,
      "duration": 6
    },
    {
      "lang": "en",
      "text": "against China and stop communism from spreading. \nIndia and Pakistan want to use the United States  ",
      "offset": 1198.96,
      "duration": 6.92
    },
    {
      "lang": "en",
      "text": "for maximum aid to use against the other, which \nis a non-starter for the United States. And then  ",
      "offset": 1205.88,
      "duration": 4.72
    },
    {
      "lang": "en",
      "text": "Pakistan really would like it if the United States \nwould be nice with China as well, because Pakistan  ",
      "offset": 1210.6,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "wants to have good relations with the United \nStates and China. And that's a non-starter  ",
      "offset": 1216.28,
      "duration": 3.84
    },
    {
      "lang": "en",
      "text": "for the United States until 1971, when there are \nsecret visits and things going on. It's later on.\n  ",
      "offset": 1220.12,
      "duration": 8.68
    },
    {
      "lang": "en",
      "text": "Okay, so in 1962, India gets trounced in this \nwar with China. They look like they're militarily  ",
      "offset": 1228.8,
      "duration": 6.8
    },
    {
      "lang": "en",
      "text": "feckless. And then in 1964, Nehru dies, right? \nHe'd been the head of India since independence in  ",
      "offset": 1235.6,
      "duration": 7.4
    },
    {
      "lang": "en",
      "text": "1947. He'd been there a long time, so he's dead. \nSo 1965, if you're Pakistani, it looks like a good  ",
      "offset": 1243,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "year to settle border problems. And so what they \ndo is first they invade through the south, if you  ",
      "offset": 1248.08,
      "duration": 7.04
    },
    {
      "lang": "en",
      "text": "look way down at the bottom there, the Rana Kuch, \nand that seems to go pretty well. And then they  ",
      "offset": 1255.12,
      "duration": 3.8
    },
    {
      "lang": "en",
      "text": "decide they want to go for the thing they really \ncare about, which is Kashmir, and they do that  ",
      "offset": 1258.92,
      "duration": 4.36
    },
    {
      "lang": "en",
      "text": "well, the enemy gets the vote. And the Indians \ninvaded straight through Lahore, which isn't  ",
      "offset": 1263.28,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "remotely what the Pakistanis had in mind. And then \nthe United States does a double arms embargo on  ",
      "offset": 1269.08,
      "duration": 6.96
    },
    {
      "lang": "en",
      "text": "both of them for doing this. And the problem is \nthe Pakistanis are much more dependent on U.S.  ",
      "offset": 1276.04,
      "duration": 4.96
    },
    {
      "lang": "en",
      "text": "military aid. The Indians were more diversified, \nso they just didn't have enough spare parts to  ",
      "offset": 1281,
      "duration": 6.72
    },
    {
      "lang": "en",
      "text": "continue this thing. So it's a very unhappy event \nfor them. They lose it, and what happens, neither  ",
      "offset": 1287.72,
      "duration": 9.76
    },
    {
      "lang": "en",
      "text": "the United States nor Russia wants either one of \nthem fighting that war. The Russians are thinking,  ",
      "offset": 1297.48,
      "duration": 5
    },
    {
      "lang": "en",
      "text": "we want the military aid to go to India in order \nto counterbalance China, not to decimate the  ",
      "offset": 1302.48,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "Pakistanis. And the United States doesn't want it \neither. So the United States is very happy that  ",
      "offset": 1308.16,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "the Soviets broker the Tashkent Declaration that \nends this war. But Pakistan is worse off after  ",
      "offset": 1313.04,
      "duration": 7.88
    },
    {
      "lang": "en",
      "text": "this thing. And India has restored its reputation \nfor knowing what it's doing on the battlefield. ",
      "offset": 1320.92,
      "duration": 7.64
    },
    {
      "lang": "en",
      "text": "So for Pakistan, the United States is really \nproblematic because we're interested in being  ",
      "offset": 1328.56,
      "duration": 8.44
    },
    {
      "lang": "en",
      "text": "nice to them when we want something out of \nthem, and then we're not so interested when  ",
      "offset": 1337,
      "duration": 3.32
    },
    {
      "lang": "en",
      "text": "we don't want something out of them because we \ndon't share a primary enemy. So what we really  ",
      "offset": 1340.32,
      "duration": 4.44
    },
    {
      "lang": "en",
      "text": "wanted were listening bases. The technology of \nthe day was such that if you want to surveil  ",
      "offset": 1344.76,
      "duration": 7.8
    },
    {
      "lang": "en",
      "text": "the Soviet Union, you want to send these \nbig U2 planes over and given their ranges,  ",
      "offset": 1352.56,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "and you're not supposed to be doing it. And so \nwe had U2 bases, I think Norway, West Germany,  ",
      "offset": 1357.12,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "Turkey, Pakistan, and then Japan. And in addition, \nwe had a listening base at Badaber. And these are  ",
      "offset": 1362.8,
      "duration": 7.08
    },
    {
      "lang": "en",
      "text": "really important things for us during this period. \nSo we're paying the Pakistanis a lot of money to  ",
      "offset": 1369.88,
      "duration": 5.16
    },
    {
      "lang": "en",
      "text": "get it. And except there was one of these U2 \nplanes, gets shot down over the Soviet Union.  ",
      "offset": 1375.04,
      "duration": 5
    },
    {
      "lang": "en",
      "text": "They finally get it so they can. Because they \nfly at really high altitudes, [but] they shoot  ",
      "offset": 1380.04,
      "duration": 4.08
    },
    {
      "lang": "en",
      "text": "it down. And Khrushchev is furious. He hauls in \nthe Pakistani ambassador in Moscow and he goes,  ",
      "offset": 1384.12,
      "duration": 6.6
    },
    {
      "lang": "en",
      "text": "where is this place Peshawar? We've circled \nit on the map, and we're going to blow it  ",
      "offset": 1390.72,
      "duration": 5.24
    },
    {
      "lang": "en",
      "text": "off the map if you all don't wise up. And the \nPakistani is like, whoa, whoa, whoa, whoa, whoa. ",
      "offset": 1395.96,
      "duration": 4.96
    },
    {
      "lang": "en",
      "text": "And so between these sort of threats in 1960 about \nthe U2 and then the United States freezing arms in  ",
      "offset": 1400.92,
      "duration": 9.44
    },
    {
      "lang": "en",
      "text": "the 1965 war, which the Pakistanis believe they \nlost it over that. Oh, yeah, and by the way,  ",
      "offset": 1410.36,
      "duration": 6.24
    },
    {
      "lang": "en",
      "text": "in that 1965 war the United States had, when we \nprovided arms to everybody, we said, oh, we will  ",
      "offset": 1416.6,
      "duration": 6.84
    },
    {
      "lang": "en",
      "text": "guarantee that no one uses it, that Pakistanis \nand Indians don't use it against each other. And  ",
      "offset": 1423.44,
      "duration": 6.52
    },
    {
      "lang": "en",
      "text": "of course, we could do nothing about that. And in \nthe 1965 war, the Pakistanis are using US tanks to  ",
      "offset": 1429.96,
      "duration": 6.92
    },
    {
      "lang": "en",
      "text": "go after Indians in the largest tank war battle \nsince World War II. So there are a lot of upset  ",
      "offset": 1436.88,
      "duration": 5.28
    },
    {
      "lang": "en",
      "text": "people in South Asia. But here is Ayub Khan, \nleader of Pakistan, telling the United States  ",
      "offset": 1442.16,
      "duration": 6.6
    },
    {
      "lang": "en",
      "text": "that the United States forgets that our security \nhazards and political liabilities have increased  ",
      "offset": 1448.76,
      "duration": 5
    },
    {
      "lang": "en",
      "text": "to a dangerous level due to this U2 stuff. And we \nkept our part of the contract whilst the Americans  ",
      "offset": 1453.76,
      "duration": 7.28
    },
    {
      "lang": "en",
      "text": "betrayed us at every turn. They built up India \nagainst us, they failed to help us in the ‘65  ",
      "offset": 1461.04,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "war and finally stopped military aid. They think \nthat we exist for their convenience and that our  ",
      "offset": 1466.12,
      "duration": 5.16
    },
    {
      "lang": "en",
      "text": "freedom is negotiable. Dream on. So when the lease \ncame up for the listening post at Badaber in 1968,  ",
      "offset": 1471.28,
      "duration": 8.72
    },
    {
      "lang": "en",
      "text": "the Pakistanis canceled it. They're sick of it.\nMeanwhile, the Indians weren't too thrilled  ",
      "offset": 1480,
      "duration": 5.2
    },
    {
      "lang": "en",
      "text": "about the United States either. This is earlier \nwhen Franklin Delano Roosevelt was president:  ",
      "offset": 1485.2,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "here's Mahatma Gandhi telling him allied support \nfor freedom and democracy seems hollow so long as  ",
      "offset": 1490.88,
      "duration": 6.12
    },
    {
      "lang": "en",
      "text": "America has the Negro problem in her own home. \nIndians were appalled by segregation. They knew  ",
      "offset": 1497,
      "duration": 5.76
    },
    {
      "lang": "en",
      "text": "exactly which end of the bus they'd be sitting \non. So there are issues both ways. And in fact,  ",
      "offset": 1502.76,
      "duration": 6.12
    },
    {
      "lang": "en",
      "text": "Nehru and his daughter Indira Gandhi found the \nUnited States really impossible to work with. And  ",
      "offset": 1508.88,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "they looked at capitalism as the way station to \nimperialism and fascism, whereas Americans looked  ",
      "offset": 1514.68,
      "duration": 7.04
    },
    {
      "lang": "en",
      "text": "at socialism as the way station to communism. \nSo there's no meeting of minds on all of this.  ",
      "offset": 1522.24,
      "duration": 6.12
    },
    {
      "lang": "en",
      "text": "And so if you look at the alignments of \nprimary adversaries India and Pakistan,  ",
      "offset": 1528.36,
      "duration": 6
    },
    {
      "lang": "en",
      "text": "from most of the time our primary adversaries: \nIndia is always Pakistan's primary enemy. But you  ",
      "offset": 1534.36,
      "duration": 8.08
    },
    {
      "lang": "en",
      "text": "could argue that with the ‘62 war, is it Pakistan \nor is it China who is the primary adversary of  ",
      "offset": 1542.44,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "India? And then when you get to the 1971 war, \nwhich I'll discuss a little more in a second,  ",
      "offset": 1548.24,
      "duration": 5.88
    },
    {
      "lang": "en",
      "text": "where Bangladesh is broken off and then Pakistan \nis left, has less than half the population,  ",
      "offset": 1554.12,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "then you could argue that for India, China is the \nprimary adversary. And then if you look at that  ",
      "offset": 1559.8,
      "duration": 8.8
    },
    {
      "lang": "en",
      "text": "reshuffling, if you also look at the 1969 war, \nthat reshuffles the nuclear powers. So formerly  ",
      "offset": 1568.6,
      "duration": 8.64
    },
    {
      "lang": "en",
      "text": "Russia and China had shared the United States \nas their primary enemy. But after the ‘69 war,  ",
      "offset": 1577.96,
      "duration": 4.76
    },
    {
      "lang": "en",
      "text": "they're each other's primary enemy. And this \ngives the United States the swing position of  ",
      "offset": 1582.72,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "team up with A or team up with B. And the United \nStates teamed up with China to overextend Russia  ",
      "offset": 1586.88,
      "duration": 5.2
    },
    {
      "lang": "en",
      "text": "in the Cold War, because I had always felt that \nthe Soviets were the bigger threat in those days. ",
      "offset": 1592.08,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "So anyway, as you're looking at alignments, you \ncan apply this kind of framework to any country on  ",
      "offset": 1597.8,
      "duration": 4.36
    },
    {
      "lang": "en",
      "text": "the planet to try to figure out what's going on. \nAnd think about how alliances work. If I look at  ",
      "offset": 1602.16,
      "duration": 6.04
    },
    {
      "lang": "en",
      "text": "The World War II Allies, probably one of the most \neffective alliances in world history, if you think  ",
      "offset": 1608.2,
      "duration": 4.84
    },
    {
      "lang": "en",
      "text": "about what people ultimately want, the British \nwant an empire in which the sun never sets,  ",
      "offset": 1613.04,
      "duration": 6.12
    },
    {
      "lang": "en",
      "text": "the United States wants to decolonize everybody, \nand Joe Stalin wants a communist wonderland. Those  ",
      "offset": 1619.16,
      "duration": 5.56
    },
    {
      "lang": "en",
      "text": "are mutually exclusive. But to get there you have \nto go through the common way station of getting  ",
      "offset": 1624.72,
      "duration": 5.56
    },
    {
      "lang": "en",
      "text": "rid of Hitler. So the common existential threat \ncan be a superglue of the most unlikely partners. ",
      "offset": 1630.28,
      "duration": 8.2
    },
    {
      "lang": "en",
      "text": "But let's look at the Axis. What they want at \nthe end of the war are series of influence in  ",
      "offset": 1638.48,
      "duration": 5.64
    },
    {
      "lang": "en",
      "text": "different parts of the world. So for Italy, it's \nempire in the Mediterranean, Japan in the Pacific,  ",
      "offset": 1644.12,
      "duration": 6.6
    },
    {
      "lang": "en",
      "text": "and then Hitler, it's all over Eurasia. That's not \nmutually exclusive. But if you look who they're  ",
      "offset": 1650.72,
      "duration": 5
    },
    {
      "lang": "en",
      "text": "the primary enemy, who stands in the way of those \nplans, it's Britain for Italy, it's Russia, for  ",
      "offset": 1655.72,
      "duration": 6.12
    },
    {
      "lang": "en",
      "text": "the Germans and for the Japanese, it's first China \nand then the United States. None of it aligns. So  ",
      "offset": 1661.84,
      "duration": 5.76
    },
    {
      "lang": "en",
      "text": "they fight parallel wars and allow the allies \nto, to take them out in detail. So when you're  ",
      "offset": 1667.6,
      "duration": 6.4
    },
    {
      "lang": "en",
      "text": "thinking about alliances in the world today, when \nyou're wondering what's going on with Iran or  ",
      "offset": 1674,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "whatever, figure out who's their real primary \nenemy, get it straight. Does that primary enemy,  ",
      "offset": 1678.6,
      "duration": 7.48
    },
    {
      "lang": "en",
      "text": "is that an existential threat for them? So if \nyou've got countries that line up on same primary  ",
      "offset": 1686.88,
      "duration": 5.4
    },
    {
      "lang": "en",
      "text": "enemy, existential threat for all around, the most \nunlikely people will cooperate. On the other hand,  ",
      "offset": 1692.28,
      "duration": 6.28
    },
    {
      "lang": "en",
      "text": "people who are very likely to cooperate, \nmaybe like the fascists, they all shared this  ",
      "offset": 1698.56,
      "duration": 5.36
    },
    {
      "lang": "en",
      "text": "basic ideology. But if they don't have the same \nprimary enemy and the same theater of interest,  ",
      "offset": 1703.92,
      "duration": 6.24
    },
    {
      "lang": "en",
      "text": "geographically the same theater, they may \nnot cooperate very well at all. So you  ",
      "offset": 1710.16,
      "duration": 4.12
    },
    {
      "lang": "en",
      "text": "can apply this to anything you want to apply to.\nSo back to my game here. If you're looking at the  ",
      "offset": 1714.28,
      "duration": 6.24
    },
    {
      "lang": "en",
      "text": "cards people have to play. The United States has \nlousy cards because we don't share primary enemies  ",
      "offset": 1720.52,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "with anybody. So it's a stalemate. You help India, \nthe Pakistanis hate you. You help Pakistanis,  ",
      "offset": 1725.96,
      "duration": 5.12
    },
    {
      "lang": "en",
      "text": "the Indians hate you, it's no win. But if you look \nat India, India and Russia share a China problem.  ",
      "offset": 1731.08,
      "duration": 6.36
    },
    {
      "lang": "en",
      "text": "That's good, they can cooperate on that. And then \nyou have Pakistan and China, they share an India  ",
      "offset": 1737.44,
      "duration": 4.8
    },
    {
      "lang": "en",
      "text": "problem. They can make things happen over that. \nSo there are cards for them to play and 0 for the  ",
      "offset": 1742.24,
      "duration": 4.8
    },
    {
      "lang": "en",
      "text": "United States to play. It's just the way it is. \nSo the name of the game and strategy is to get  ",
      "offset": 1747.04,
      "duration": 8.4
    },
    {
      "lang": "en",
      "text": "the outcome that you want to have happen. And it's \nlike, how do you play this game of five person,  ",
      "offset": 1755.44,
      "duration": 8.16
    },
    {
      "lang": "en",
      "text": "five country cutthroat billiards to get remotely \nwhat you want out of it? So for the English majors  ",
      "offset": 1763.6,
      "duration": 6.4
    },
    {
      "lang": "en",
      "text": "among you, I have a metaphor. For the rest of \nyou, you can just bear with us. Imagine a game  ",
      "offset": 1770,
      "duration": 7.08
    },
    {
      "lang": "en",
      "text": "in which every ball can be a cue ball and players \ncan take turns, come, leave, do whatever at will.  ",
      "offset": 1777.08,
      "duration": 8.32
    },
    {
      "lang": "en",
      "text": "Sometimes they'll cooperate some of the time, but \nthey don't necessarily want to put the same ball  ",
      "offset": 1785.4,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "in the same pocket. And so if that's the case, \nthere's going to be no enduring cooperation. And  ",
      "offset": 1791.24,
      "duration": 8.2
    },
    {
      "lang": "en",
      "text": "understand that you want to have your goal is \ngoing to be the ultimate shot you want to take.  ",
      "offset": 1799.44,
      "duration": 4.12
    },
    {
      "lang": "en",
      "text": "But as you're taking the intervening shots, people \nare going to try to disrupt it. How on earth do  ",
      "offset": 1803.56,
      "duration": 5.32
    },
    {
      "lang": "en",
      "text": "you get through this game? So this is what the \nnext section is all about. So if you look at  ",
      "offset": 1808.88,
      "duration": 5.52
    },
    {
      "lang": "en",
      "text": "this map and where Pakistan's located, it's this \nvery strategic location right in the center of,  ",
      "offset": 1814.4,
      "duration": 7.2
    },
    {
      "lang": "en",
      "text": "not quite center, but of Eurasia, the \ncenter of the Soviet boundary there. ",
      "offset": 1821.6,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "And I'm going to give you a map. This is from \nHalford Mackinder. He's one of the finest, most  ",
      "offset": 1826.2,
      "duration": 3.48
    },
    {
      "lang": "en",
      "text": "famous people to publish on geopolitics. This is \nhis 1904 map. It's actually quite famous. And he  ",
      "offset": 1829.68,
      "duration": 5.32
    },
    {
      "lang": "en",
      "text": "talked about how Russia occupies the heartland. \nIn his day it was all these railway systems. He  ",
      "offset": 1835,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "thought that was the prime piece of real estate in \nthe world. And then it's surrounded by this inner  ",
      "offset": 1839.68,
      "duration": 4.52
    },
    {
      "lang": "en",
      "text": "marginal crescent. You look where Pakistan's \nlocated, it's right in the center there,  ",
      "offset": 1844.2,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "right up by Russia. And it's a really crucial \nlocation before satellite imagery is available,  ",
      "offset": 1848.76,
      "duration": 7.6
    },
    {
      "lang": "en",
      "text": "to put listening posts on Russia. Russia's \nhuge. You gotta have a bunch of listening  ",
      "offset": 1856.36,
      "duration": 5.12
    },
    {
      "lang": "en",
      "text": "posts to track their missiles and things. \nAnd then if you want access to Afghanistan,  ",
      "offset": 1861.48,
      "duration": 4.72
    },
    {
      "lang": "en",
      "text": "which when the Russians go there, we want access, \nand of course, when we go there, we really want  ",
      "offset": 1866.2,
      "duration": 3.72
    },
    {
      "lang": "en",
      "text": "access. So it's a strategic location. For the \nPakistanis the United States was so frustrating  ",
      "offset": 1869.92,
      "duration": 4.84
    },
    {
      "lang": "en",
      "text": "to deal with because we'd be on-and-off interested \nin them because we don't align on a primary enemy. ",
      "offset": 1874.76,
      "duration": 6.36
    },
    {
      "lang": "en",
      "text": "So pre-satellite-imagery, we really wanted to \ncozy up to the Pakistanis. So we have U2 bases  ",
      "offset": 1881.12,
      "duration": 6.8
    },
    {
      "lang": "en",
      "text": "but then there are technology changes. And before \nwe get facilities in Iran, we want this listening  ",
      "offset": 1887.92,
      "duration": 7.32
    },
    {
      "lang": "en",
      "text": "post in Badaber. But technology will eventually \nchange. And then for a while, we truly want the  ",
      "offset": 1895.24,
      "duration": 5.92
    },
    {
      "lang": "en",
      "text": "Pakistanis to get the mail through to China when \nwe're trying to break China out of diplomatic  ",
      "offset": 1901.16,
      "duration": 4.72
    },
    {
      "lang": "en",
      "text": "isolation and then cooperate against the Soviet \nUnion, and Pakistan delivers the mail. But then  ",
      "offset": 1905.88,
      "duration": 5.28
    },
    {
      "lang": "en",
      "text": "we set up an alternate setup in Paris to go \nthrough our embassies that way, and Pakistan  ",
      "offset": 1911.16,
      "duration": 4.587
    },
    {
      "lang": "en",
      "text": "is again irrelevant. And then when Russia's \nin Afghanistan, Pakistan's essential to get  ",
      "offset": 1915.747,
      "duration": 6.493
    },
    {
      "lang": "en",
      "text": "aid to insurgents to cause the Russians trouble. \nAnd then, of course, when we're in Afghanistan,  ",
      "offset": 1922.24,
      "duration": 4.84
    },
    {
      "lang": "en",
      "text": "we really want to cooperate with the Pakistanis. \nAnd that works until we cap Osama bin Laden  ",
      "offset": 1927.08,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "without telling the Pakistanis in their territory, \nAbbottabad. And then relations are really not  ",
      "offset": 1932.92,
      "duration": 5.32
    },
    {
      "lang": "en",
      "text": "so great. And so it's a very bumpy ride. And in \nthese periods when we really need the Pakistanis,  ",
      "offset": 1938.24,
      "duration": 7.4
    },
    {
      "lang": "en",
      "text": "we don't pay attention to human rights or \nthe really big one, nuclear proliferation.  ",
      "offset": 1945.64,
      "duration": 4.28
    },
    {
      "lang": "en",
      "text": "And so the proliferation is pretty steady.\nSo if you look at after the United States  ",
      "offset": 1949.92,
      "duration": 8.8
    },
    {
      "lang": "en",
      "text": "having trouble negotiating all this so that \nwhatever you do in the short term doesn't  ",
      "offset": 1958.72,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "wreck you in the long term. But in order to get \nto the long term, of course, you've got to go  ",
      "offset": 1964.16,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "through the short term. So after the U2 crash in \nRussia, where it gets shot down and the Pakistanis  ",
      "offset": 1968.32,
      "duration": 6.6
    },
    {
      "lang": "en",
      "text": "are having a heart attack about that, that's \nwhen the Pakistanis look to cultivating more,  ",
      "offset": 1974.92,
      "duration": 4.84
    },
    {
      "lang": "en",
      "text": "better relations with China because the US \nrelationship is just too potentially costly  ",
      "offset": 1979.76,
      "duration": 5.04
    },
    {
      "lang": "en",
      "text": "and the Americans cut off the military aid. And \nthen when the Pakistanis are being very nice  ",
      "offset": 1984.8,
      "duration": 8.48
    },
    {
      "lang": "en",
      "text": "about delivering the mail for Richard Nixon and \nHenry Kissinger to line up invitations in Beijing,  ",
      "offset": 1993.28,
      "duration": 7.44
    },
    {
      "lang": "en",
      "text": "the United States is ignoring a humanitarian \nnightmare because all of this that coincides  ",
      "offset": 2000.72,
      "duration": 7.04
    },
    {
      "lang": "en",
      "text": "with the 1971 Bangladeshi War for independence.\n \nSo let me explain what that is to you. So Pakistan  ",
      "offset": 2008.28,
      "duration": 7.08
    },
    {
      "lang": "en",
      "text": "was holding presidential elections. The dominant \nethnic group in Pakistan are Punjabis, sometimes  ",
      "offset": 2015.36,
      "duration": 6.52
    },
    {
      "lang": "en",
      "text": "the Sindhis, like the Bhutto family. I think \nthey're Sindhi. But anyway, generally speaking,  ",
      "offset": 2021.88,
      "duration": 4.92
    },
    {
      "lang": "en",
      "text": "particularly the army, the Punjabis dominate. \nBengalis, live in Bangladesh. They won the  ",
      "offset": 2026.8,
      "duration": 5.6
    },
    {
      "lang": "en",
      "text": "election and the Punjabis are furious. So they \nsend the army to start butchering people in East  ",
      "offset": 2032.4,
      "duration": 6.72
    },
    {
      "lang": "en",
      "text": "Pakistan to overturn the election. So there \nare refugees pouring into India. So this is  ",
      "offset": 2039.12,
      "duration": 6.32
    },
    {
      "lang": "en",
      "text": "the backdrop of what is going on there. And for \nanyone who wasn't in the know, the United States  ",
      "offset": 2045.44,
      "duration": 6
    },
    {
      "lang": "en",
      "text": "is saying nothing about this. The United States, \nthere's this massive humanitarian crisis in the  ",
      "offset": 2051.44,
      "duration": 5.2
    },
    {
      "lang": "en",
      "text": "United States. Got nothing to say. The United \nStates has Something to say about everything. But  ",
      "offset": 2056.64,
      "duration": 3.56
    },
    {
      "lang": "en",
      "text": "it had to do with,this is the moment that Nixon is \ntrying to get himself invited to Beijing so that  ",
      "offset": 2060.2,
      "duration": 7.6
    },
    {
      "lang": "en",
      "text": "he can talk to Mao about cooperating. With the \nSoviets. No, with the Chinese. To overextend the  ",
      "offset": 2067.8,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "Soviets in the Cold War, which is ultimately what \nwe do. And it's very important to win the Cold  ",
      "offset": 2072.48,
      "duration": 4.48
    },
    {
      "lang": "en",
      "text": "War. And this is integral to this. But everyone \nelse is looking and going, what on earth is going  ",
      "offset": 2076.96,
      "duration": 4.64
    },
    {
      "lang": "en",
      "text": "on? So you have Nixon's doing the mediation in \nthe background. We got refugees flying all over  ",
      "offset": 2081.6,
      "duration": 6.92
    },
    {
      "lang": "en",
      "text": "the place. India comes to the United States \nand says, look, you need to tell the Chinese  ",
      "offset": 2088.52,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "not to intervene in this thing. And not only \ndid we not do that. Oh, the Indians also say,  ",
      "offset": 2093.4,
      "duration": 3
    },
    {
      "lang": "en",
      "text": "you need to bring this up at the UN, the human \nrights stuff, because India is literally getting  ",
      "offset": 2096.4,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "millions of refugees trying to flee this, this \nmess. And the United States won't do any of it.\n  ",
      "offset": 2101,
      "duration": 5.04
    },
    {
      "lang": "en",
      "text": "It gets even better. The United States has the \ngall to blame the Indians for the war. Dream on.  ",
      "offset": 2106.04,
      "duration": 6.44
    },
    {
      "lang": "en",
      "text": "So Indira Gandhi is just furious at this one. And \nso the United States had wished that India would  ",
      "offset": 2112.48,
      "duration": 7.72
    },
    {
      "lang": "en",
      "text": "cease being non-aligned and align with the West. \nWell, they cease being non-aligned, all right.  ",
      "offset": 2120.2,
      "duration": 5.32
    },
    {
      "lang": "en",
      "text": "They sign a military pact with Russia over this. \nAnd then they upgrade their relationship with  ",
      "offset": 2125.52,
      "duration": 6.36
    },
    {
      "lang": "en",
      "text": "Vietnam, which totally upsets the United States. \nAnd it gets even better. They shut down Indians.  ",
      "offset": 2131.88,
      "duration": 7.2
    },
    {
      "lang": "en",
      "text": "They won't give scholars any visas to come \nto India to study India. So you wonder why  ",
      "offset": 2139.08,
      "duration": 4.52
    },
    {
      "lang": "en",
      "text": "US Universities didn't have any Indian studies \nprograms? It's all about this. So that explains  ",
      "offset": 2143.6,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "what's going on with all of that. Total mess.\nMeanwhile. But for Pakistan, as all this is  ",
      "offset": 2149.32,
      "duration": 7.32
    },
    {
      "lang": "en",
      "text": "going on, the Shah of Iran falls in, I think \nit's like February 1979. And then the Russians  ",
      "offset": 2156.64,
      "duration": 8.12
    },
    {
      "lang": "en",
      "text": "invade Afghanistan in December 1979. And \nsuddenly Pakistan is totally essential once  ",
      "offset": 2164.76,
      "duration": 8.24
    },
    {
      "lang": "en",
      "text": "again. And the Pakistanis are really getting \nsick of being kicked around. So when outgoing  ",
      "offset": 2173,
      "duration": 7.6
    },
    {
      "lang": "en",
      "text": "President Jimmy Carter offers them, I don't \nknow, $400 million or something, this is Zia  ",
      "offset": 2180.6,
      "duration": 5.16
    },
    {
      "lang": "en",
      "text": "here going peanuts to the peanut farmer. And the \nincoming Reagan administration then ups it to $3.2  ",
      "offset": 2185.76,
      "duration": 8.2
    },
    {
      "lang": "en",
      "text": "billion and that money gets funneled through the \nInter-Services Intelligence directorate. That's  ",
      "offset": 2193.96,
      "duration": 6.84
    },
    {
      "lang": "en",
      "text": "like, I don't know – the CIA+++ of Pakistan. \nAnd when you put that kind of money into that  ",
      "offset": 2200.8,
      "duration": 6.32
    },
    {
      "lang": "en",
      "text": "kind of bureaucracy, you're going to make them \nincredibly powerful. And then they're the ones  ",
      "offset": 2207.12,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "who decide how they're going to allocate money \nto insurgents in Afghanistan. And I get it. There  ",
      "offset": 2212.96,
      "duration": 4.92
    },
    {
      "lang": "en",
      "text": "weren't any great choices, but they're arming some \nreally anti-Western folks in there, probably some  ",
      "offset": 2217.88,
      "duration": 7.56
    },
    {
      "lang": "en",
      "text": "guy named Osama, last name Bin Laden. But anyway \nI'm not sure of the details on that one, but it  ",
      "offset": 2225.44,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "is going to have 9/11 follow-on effects. And also \nthe Pakistani, the ISI is also taking some of that  ",
      "offset": 2231.16,
      "duration": 6.8
    },
    {
      "lang": "en",
      "text": "money and putting it into Kashmir which is going \nto have real problems for India later on. So there  ",
      "offset": 2237.96,
      "duration": 6.36
    },
    {
      "lang": "en",
      "text": "are real ramifications for all of this of needing \nPakistan. But actually what is happening anyway.  ",
      "offset": 2244.32,
      "duration": 6.48
    },
    {
      "lang": "en",
      "text": "And then, throughout, there is the Pakistanis \nare getting closer and closer to building  ",
      "offset": 2250.8,
      "duration": 4.92
    },
    {
      "lang": "en",
      "text": "the bomb. So when the Russians go piling into \nAfghanistan, here's Zbigniew Brzezinski Carter  ",
      "offset": 2255.72,
      "duration": 7.24
    },
    {
      "lang": "en",
      "text": "national security advisor telling him our security \npolicy cannot be dictated by our non proliferation  ",
      "offset": 2262.96,
      "duration": 5.2
    },
    {
      "lang": "en",
      "text": "policy. Really? I thought that was our security \npolicy. And the problem with proliferation is it  ",
      "offset": 2268.16,
      "duration": 7.32
    },
    {
      "lang": "en",
      "text": "tends to be a one way street whereas Afghanistan \nhas been anything but. And then here Deng Xiaoping  ",
      "offset": 2275.48,
      "duration": 6.4
    },
    {
      "lang": "en",
      "text": "was in town and he told Carter, we applaud your \ndecision to basically toss all these proliferation  ",
      "offset": 2281.88,
      "duration": 6.52
    },
    {
      "lang": "en",
      "text": "human rights considerations for Pakistan and \njust arm them. No kidding. Because the Chinese  ",
      "offset": 2288.4,
      "duration": 4.64
    },
    {
      "lang": "en",
      "text": "are providing the nuclear spare parts. So the \nUnited States isn't the only country to have  ",
      "offset": 2293.04,
      "duration": 6.2
    },
    {
      "lang": "en",
      "text": "trouble navigating this cutthroat billiards. \nThe Pakistanis have their share of boomerangs. ",
      "offset": 2299.24,
      "duration": 6.16
    },
    {
      "lang": "en",
      "text": "Just look how the wars work. So wars create \nincredible costs. So the 1965 war, the Pakistanis  ",
      "offset": 2305.4,
      "duration": 9.12
    },
    {
      "lang": "en",
      "text": "get exactly nothing. And the United States, \nPakistan had been the largest aid recipient  ",
      "offset": 2314.52,
      "duration": 6.76
    },
    {
      "lang": "en",
      "text": "of the. I'm not sure if I got that right. But \nanyway they're a huge aid recipient from the  ",
      "offset": 2321.28,
      "duration": 4.04
    },
    {
      "lang": "en",
      "text": "United States. Well after this war were not so \ninterested. So that's a lot of money down the  ",
      "offset": 2325.32,
      "duration": 4
    },
    {
      "lang": "en",
      "text": "tubes. And then in 1971 war, great guys, you lose \nBangladesh which, by the way, has over half your  ",
      "offset": 2329.32,
      "duration": 8.32
    },
    {
      "lang": "en",
      "text": "population. So Pakistan is no longer the most \npopulous Muslim country, Indonesia is. And  ",
      "offset": 2337.64,
      "duration": 7.52
    },
    {
      "lang": "en",
      "text": "if you look at the Kargil War in 1999, this is \nwhen Pakistan tries to again go below the line  ",
      "offset": 2345.16,
      "duration": 6
    },
    {
      "lang": "en",
      "text": "of control in Kashmir to try to take some more of \nKashmir back. Pakistan has to cross right back and  ",
      "offset": 2351.16,
      "duration": 7.8
    },
    {
      "lang": "en",
      "text": "then it gets sanctioned for all of this. So none \nof these wars have actually worked out very well  ",
      "offset": 2358.96,
      "duration": 3.72
    },
    {
      "lang": "en",
      "text": "for Pakistan. And then if you think about it, \nIndia and Pakistan are natural trade partners. ",
      "offset": 2362.68,
      "duration": 6.52
    },
    {
      "lang": "en",
      "text": "So if you take all these wars and just add up all \nthe costs and then think of the opportunity costs  ",
      "offset": 2369.2,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "if Pakistan had been able to take this money \nand spend it on road systems, on education,  ",
      "offset": 2373.88,
      "duration": 5.4
    },
    {
      "lang": "en",
      "text": "and then all the lost trade, it gives you a \nsense of the real cost of all of this. Okay,  ",
      "offset": 2379.28,
      "duration": 7.16
    },
    {
      "lang": "en",
      "text": "well those are Pakistan's Problems. India has \nits own problems. Here you've got Indira Gandhi  ",
      "offset": 2386.44,
      "duration": 6.2
    },
    {
      "lang": "en",
      "text": "and Richard Nixon, they really didn't like \neach other. I mean look at her, she looks as  ",
      "offset": 2392.64,
      "duration": 4
    },
    {
      "lang": "en",
      "text": "if she's just been fed bad fish and he looks like \nhe served it up. And they just, they cannot abide  ",
      "offset": 2396.64,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "by each other. So in the 1940s when Kashmir \nis erupting, Indira Gandhi thinks – well no,  ",
      "offset": 2402.36,
      "duration": 8.28
    },
    {
      "lang": "en",
      "text": "it's Nehru – her dad thinks that the United States \nshould be supporting India because it's secular  ",
      "offset": 2410.64,
      "duration": 5.4
    },
    {
      "lang": "en",
      "text": "and it's a democracy. And the United States is \nappalled during the Korean War when India remains  ",
      "offset": 2416.04,
      "duration": 5.48
    },
    {
      "lang": "en",
      "text": "non-aligned instead of supporting the United \nStates because it's secular and democratic.  ",
      "offset": 2421.52,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "And the Pakistanis are totally outraged \nbecause they're looking at this go, okay,  ",
      "offset": 2428.08,
      "duration": 5.28
    },
    {
      "lang": "en",
      "text": "these Indians are non-aligned. We're aligned. \nWe're taking these risks for Peshawar and stuff  ",
      "offset": 2433.36,
      "duration": 6.28
    },
    {
      "lang": "en",
      "text": "with the U2s and you're helping these people \nwho are about to ally with the Soviet Union,  ",
      "offset": 2439.64,
      "duration": 4.96
    },
    {
      "lang": "en",
      "text": "who are you kidding? So it's a total mess. So \nthe Indians have their own self inflicted blows.  ",
      "offset": 2444.6,
      "duration": 7.16
    },
    {
      "lang": "en",
      "text": "Nehru and his very controversial, but devoted \nadvisor Krishna Menon and his daughter Indira  ",
      "offset": 2451.76,
      "duration": 6.6
    },
    {
      "lang": "en",
      "text": "Gandhi were really good at making these totally \ninsulting remarks to American VIPs. Okay, it hits  ",
      "offset": 2458.36,
      "duration": 6.6
    },
    {
      "lang": "en",
      "text": "the target without a doubt, but the ego that \nhas just been hit is huge and like an elephant  ",
      "offset": 2464.96,
      "duration": 4.8
    },
    {
      "lang": "en",
      "text": "is not about to forget. And meanwhile Pakistan \nin contrast is just being this welcoming host. ",
      "offset": 2469.76,
      "duration": 6.52
    },
    {
      "lang": "en",
      "text": "So the United States is going “ugh India and \nPakistan”. And it makes really bad trend lines for  ",
      "offset": 2476.28,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "India because in the 1962 war the United States \nsupported India. In the 1965 war, it's neutral.  ",
      "offset": 2482.12,
      "duration": 5.24
    },
    {
      "lang": "en",
      "text": "In the 1971 war it supports Pakistan. That's \nnot great. And then India's own very heavy  ",
      "offset": 2487.36,
      "duration": 5.546
    },
    {
      "lang": "en",
      "text": "handed treatment of solutions to the insurgency \nof Kashmir doesn't make that thing go away, it  ",
      "offset": 2492.905,
      "duration": 5.855
    },
    {
      "lang": "en",
      "text": "just gets worse. So they have their own problems.\nChina also has its problems with the interaction.  ",
      "offset": 2498.76,
      "duration": 5.24
    },
    {
      "lang": "en",
      "text": "It's complicated. So on the one hand, \non the Sino-Indian war, absolutely,  ",
      "offset": 2504,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "China gets the territory, but at what cost? You've \ngot this permanent enemy forever. And as opposed  ",
      "offset": 2509.8,
      "duration": 7.24
    },
    {
      "lang": "en",
      "text": "to teaming up with them, if they teamed up, they \nactually would have had incredible leverage for  ",
      "offset": 2517.04,
      "duration": 4.64
    },
    {
      "lang": "en",
      "text": "what the global order is going to look like. \nBut that's just not to be. And moreover,  ",
      "offset": 2521.68,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "if you look at the 1971 war, after the United \nStates won't help with China, India's going,  ",
      "offset": 2526.28,
      "duration": 7.4
    },
    {
      "lang": "en",
      "text": "okay, I think we need nuclear weapons because then \nwe'll be able to protect ourselves against China.  ",
      "offset": 2533.68,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "And after that war, when Pakistan's lost over \nhalf its population and has to deal with Indian  ",
      "offset": 2539.52,
      "duration": 5.28
    },
    {
      "lang": "en",
      "text": "population and territorial, just overwhelming \nsuperiority, the Pakistanis go, “I think we need  ",
      "offset": 2544.8,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "nuclear weapons in order to solve this problem”. \nSo there's proliferation all over the place. ",
      "offset": 2549.36,
      "duration": 4.72
    },
    {
      "lang": "en",
      "text": "But as a result of the 1971 war, where Pakistan \ntries to overturn the elections, here you have  ",
      "offset": 2554.08,
      "duration": 8.72
    },
    {
      "lang": "en",
      "text": "an Indian defense analyst, Subrahmanyam, saying \nthe Pakistani decision to overturn its elections  ",
      "offset": 2562.8,
      "duration": 6.52
    },
    {
      "lang": "en",
      "text": "by deploying the army to East Pakistan gave India \nan opportunity the like of which will never come  ",
      "offset": 2569.32,
      "duration": 5.48
    },
    {
      "lang": "en",
      "text": "again. And what they did is they armed insurgents \nin East Pakistan then sent the conventional army  ",
      "offset": 2574.8,
      "duration": 5.24
    },
    {
      "lang": "en",
      "text": "in and that was it for Pakistan: in East Pakistan \nover. The interaction for Russia works a little  ",
      "offset": 2580.04,
      "duration": 7.48
    },
    {
      "lang": "en",
      "text": "better. For Russia and India, it's really quite \na good relationship. What Russia offers to India,  ",
      "offset": 2587.52,
      "duration": 5.92
    },
    {
      "lang": "en",
      "text": "not only military and economic aid, but also very \nuseful vetoes on the UN Security Council. India  ",
      "offset": 2593.44,
      "duration": 6.56
    },
    {
      "lang": "en",
      "text": "does not want plebiscites in Kashmir that it might \nlose, so it gets the Soviet Union to veto those  ",
      "offset": 2600,
      "duration": 6.24
    },
    {
      "lang": "en",
      "text": "things. So there are no plebiscites. And then \nas India is trouncing Pakistan in the 1970 war,  ",
      "offset": 2606.24,
      "duration": 5.88
    },
    {
      "lang": "en",
      "text": "starting one war, and the United \nStates wants them to halt India,  ",
      "offset": 2612.12,
      "duration": 4.24
    },
    {
      "lang": "en",
      "text": "no way. India wants to finish the job. So it gets \nthe Soviet Union to veto that one. And India does  ",
      "offset": 2616.36,
      "duration": 4.4
    },
    {
      "lang": "en",
      "text": "indeed finish the job. And meanwhile, for Russia, \nIndia is really useful. It's a good counterbalance  ",
      "offset": 2620.76,
      "duration": 6.68
    },
    {
      "lang": "en",
      "text": "for China. So theirs is rather a beautiful \nrelationship. They have very cordial relations. ",
      "offset": 2627.44,
      "duration": 5.6
    },
    {
      "lang": "en",
      "text": "Okay, so I think I've now covered the playing \nfield, right? And I've covered the players and  ",
      "offset": 2633.04,
      "duration": 8.8
    },
    {
      "lang": "en",
      "text": "teams and their problems with interacting. That's \nvery difficult. Now for some of the plays and the  ",
      "offset": 2641.84,
      "duration": 7.32
    },
    {
      "lang": "en",
      "text": "instruments of national power. And here's the menu \nof choices. You can start with the light items.  ",
      "offset": 2649.16,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "Diplomacy, public support and denial of public \nsupport. You can move into more expensive things  ",
      "offset": 2654.24,
      "duration": 5.92
    },
    {
      "lang": "en",
      "text": "down the menu. One of the things you can do is \nhelp negotiate a really useful treaty, which the  ",
      "offset": 2660.16,
      "duration": 8.2
    },
    {
      "lang": "en",
      "text": "United States did. It brokered this Indus Waters \nTreaty of 1960. It's the only time that I know of,  ",
      "offset": 2668.36,
      "duration": 5.32
    },
    {
      "lang": "en",
      "text": "maybe you all know of something, where India and \nPakistan have signed an agreement to the massive  ",
      "offset": 2673.68,
      "duration": 4.76
    },
    {
      "lang": "en",
      "text": "benefit of both of them. What does this agreement \ndo? You can see it's a really dense river system.  ",
      "offset": 2678.44,
      "duration": 5.32
    },
    {
      "lang": "en",
      "text": "Both India and Pakistan need to irrigate. To do \nthat efficiently, you need dams. And both of them  ",
      "offset": 2683.76,
      "duration": 5.4
    },
    {
      "lang": "en",
      "text": "were poor and didn't have the dams. They were \ngoing to cost a billion dollars. And the United  ",
      "offset": 2689.16,
      "duration": 3.52
    },
    {
      "lang": "en",
      "text": "States was willing to kick in half that money if \nthey would both sign the treaty. And no terrorist  ",
      "offset": 2692.68,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "event or anything derailed it, so they signed it. \nAnd this treaty has been, it's been operating some  ",
      "offset": 2698.12,
      "duration": 5.76
    },
    {
      "lang": "en",
      "text": "of these dams ever since to the enormous benefit \nof both countries. Does the United States get  ",
      "offset": 2703.88,
      "duration": 4.36
    },
    {
      "lang": "en",
      "text": "any enduring gratitude from either one for doing \nthis? No. Zip. Okay, next one is the United States  ",
      "offset": 2708.24,
      "duration": 8.08
    },
    {
      "lang": "en",
      "text": "tried to exercise diplomacy and to convince the \nPakistanis and Indians to settle their differences  ",
      "offset": 2716.32,
      "duration": 7.48
    },
    {
      "lang": "en",
      "text": "and it was a total flop. And because if you're \ngoing to try to befriend both India and Pakistan,  ",
      "offset": 2723.8,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "you wind up becoming the enemy of one or the \nother. And the United States diplomacy was based  ",
      "offset": 2729.64,
      "duration": 5.52
    },
    {
      "lang": "en",
      "text": "on certain false assumptions, which are one, that \nIndia and Pakistan could be cajoled into settling  ",
      "offset": 2735.16,
      "duration": 7.08
    },
    {
      "lang": "en",
      "text": "their differences. And their idea is, anyone \nwho's so stupid as to think that is crazy. And  ",
      "offset": 2742.24,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "if you're going, well, what are the origins of \nthese differences? Partition was brutal. So the  ",
      "offset": 2748.04,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "British colonized the Indian subcontinent and then \nthey left in 1947 and they left really rapidly so  ",
      "offset": 2753.72,
      "duration": 8.08
    },
    {
      "lang": "en",
      "text": "that there was no time to set up any institutional \nframework. And also, you're talking millions of  ",
      "offset": 2761.8,
      "duration": 7.68
    },
    {
      "lang": "en",
      "text": "people. And so Pakistan's going to be one thing \nand then India's going to be the other. And so  ",
      "offset": 2769.48,
      "duration": 8.52
    },
    {
      "lang": "en",
      "text": "Hindus are just fleeing and Sikhs are fleeing out \nof Pakistan and Muslims are fleeing out of India,  ",
      "offset": 2778,
      "duration": 8.28
    },
    {
      "lang": "en",
      "text": "going back and forth and millions are killed \nwhile this is going on. So this is the origin,  ",
      "offset": 2786.28,
      "duration": 5.16
    },
    {
      "lang": "en",
      "text": "at least the modern origin, of why Pakistanis and \nIndians are so bitter. In addition, the United  ",
      "offset": 2791.44,
      "duration": 5.88
    },
    {
      "lang": "en",
      "text": "States thought, well, surely the China threat is \ngoing to make the Indians come around and realize  ",
      "offset": 2797.32,
      "duration": 4.76
    },
    {
      "lang": "en",
      "text": "this non-aligned stuff's nonsense. Not quite. \nYeah, When India aligns, it aligns with Russia,  ",
      "offset": 2802.08,
      "duration": 10.56
    },
    {
      "lang": "en",
      "text": "not the United States. So that doesn't remotely \nwork out the way the United States wanted. ",
      "offset": 2812.64,
      "duration": 4.4
    },
    {
      "lang": "en",
      "text": "And then the United States thought, well, hey, \nwe in the west were rich. We give Indians and  ",
      "offset": 2817.04,
      "duration": 4.52
    },
    {
      "lang": "en",
      "text": "Pakistanis all this aid. This will force them to \nbe nice to us and be less nice to the communists.  ",
      "offset": 2821.56,
      "duration": 6.32
    },
    {
      "lang": "en",
      "text": "Wrong. India and Pakistan are really astute and \nthey get lots of aid from everybody. So when the  ",
      "offset": 2827.88,
      "duration": 6.76
    },
    {
      "lang": "en",
      "text": "great powers do align, Russia, China, us, or at \nleast two of those align, then you can actually  ",
      "offset": 2834.64,
      "duration": 6.96
    },
    {
      "lang": "en",
      "text": "get stuff done. So that's when you get the \nTashkent Agreement for the 1965 war. This is: the  ",
      "offset": 2841.6,
      "duration": 5.56
    },
    {
      "lang": "en",
      "text": "United States and Russia both want India and \nPakistan to cease and desist and stop blowing  ",
      "offset": 2847.16,
      "duration": 5.48
    },
    {
      "lang": "en",
      "text": "each other off the map. And also in the Kargil \nconflict, when Pakistan is yet again trying to  ",
      "offset": 2852.64,
      "duration": 6.56
    },
    {
      "lang": "en",
      "text": "resolve Kashmir by invading and then gets itself \ninto trouble. And this guy Nawaz Sharif, who is  ",
      "offset": 2859.2,
      "duration": 6.72
    },
    {
      "lang": "en",
      "text": "the head of Pakistan, he all of a sudden ups and \ngets on a plane with his family. It looks like  ",
      "offset": 2865.92,
      "duration": 4.76
    },
    {
      "lang": "en",
      "text": "he's coming into exile and he's trying to fly into \nthe United States. And the United States goes,  ",
      "offset": 2870.68,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "whoa, Whoa, whoa, whoa, whoa, what do you think \nyou're doing? And says, you're not coming in here  ",
      "offset": 2874.84,
      "duration": 5.16
    },
    {
      "lang": "en",
      "text": "until you admit that you crossed the line of \ncontrol. And then you need to get right back.  ",
      "offset": 2880,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "And so he agrees to sign the Washington agreement \nto go right back. But it's absolutely humiliating  ",
      "offset": 2885.44,
      "duration": 7.72
    },
    {
      "lang": "en",
      "text": "for the Pakistanis to go, oh, yeah, we went \nsouth of the line of control. And then, well,  ",
      "offset": 2893.16,
      "duration": 4.2
    },
    {
      "lang": "en",
      "text": "that didn't work out. So now we have to go right \nback. He had gone to China already and pleaded his  ",
      "offset": 2897.36,
      "duration": 5.32
    },
    {
      "lang": "en",
      "text": "case to the Chinese, and they told him to get \nright back because there was a lot of nuclear  ",
      "offset": 2902.68,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "saber-rattling going on, and the Chinese were \nnot interested in a nuclear war over this. So  ",
      "offset": 2906.84,
      "duration": 4.48
    },
    {
      "lang": "en",
      "text": "Pakistan had the choice of, okay, fight India by \nyour lonesome or cross back. So they crossed back. ",
      "offset": 2911.32,
      "duration": 7.6
    },
    {
      "lang": "en",
      "text": "And there were other cases in the inter-Cold-War \nperiod when the great powers cooperated and tamped  ",
      "offset": 2918.92,
      "duration": 8.64
    },
    {
      "lang": "en",
      "text": "things down, like terrorist incidents in New \nDelhi and in Mumbai that didn't go anywhere  ",
      "offset": 2927.56,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "because the great powers told the Indians \nand the Pakistanis to just dial it back.  ",
      "offset": 2932.64,
      "duration": 4.44
    },
    {
      "lang": "en",
      "text": "All right? Another thing you can do is to publicly \nsupport someone. And this is what goes on with  ",
      "offset": 2937.08,
      "duration": 6.04
    },
    {
      "lang": "en",
      "text": "Goa, which is a Portuguese colony. The Indians \nwanted it back. The Portuguese said, no way, you  ",
      "offset": 2943.12,
      "duration": 5.4
    },
    {
      "lang": "en",
      "text": "cannot have it back. And the Indians took it back. \nAnd the United States supported Portugal. Why?  ",
      "offset": 2948.52,
      "duration": 5.28
    },
    {
      "lang": "en",
      "text": "It's a NATO ally and we have very important bases \nin Portugal. So we kept the bases, but we made the  ",
      "offset": 2953.8,
      "duration": 5.12
    },
    {
      "lang": "en",
      "text": "Indians really angry. And there are other areas of \npublic support or not criticizing people publicly.  ",
      "offset": 2958.92,
      "duration": 7.8
    },
    {
      "lang": "en",
      "text": "For instance, when the. In the. In the 1971 \nBangladesh war, when the United States refuses  ",
      "offset": 2967.6,
      "duration": 4.32
    },
    {
      "lang": "en",
      "text": "to support India by telling China, don't enter \nthis place. But of course, it was December,  ",
      "offset": 2971.92,
      "duration": 6.32
    },
    {
      "lang": "en",
      "text": "so the road system would have been a little \nrough to even try that, but it made the Indians  ",
      "offset": 2978.24,
      "duration": 3.76
    },
    {
      "lang": "en",
      "text": "mad. Or if you think during the Cold War.\nSo with Nehru, it's the 1956 Hungarian crisis  ",
      "offset": 2982,
      "duration": 7.24
    },
    {
      "lang": "en",
      "text": "where the Russians sent tanks into Hungary, the \nIndians don't say anything about that. There's  ",
      "offset": 2989.24,
      "duration": 3.72
    },
    {
      "lang": "en",
      "text": "a Berlin crisis in 1961 where the Russians are \npretty rough and the Indians don't say anything  ",
      "offset": 2992.96,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "about that. And then Indira Gandhi comes in, and \nwhen the Russians send tanks into Czechoslovakia  ",
      "offset": 2997.52,
      "duration": 4.52
    },
    {
      "lang": "en",
      "text": "in 1968, the Indians say nothing. And then when \nthe Russians invade Afghanistan in '79, again, the  ",
      "offset": 3002.6,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "Indians say nothing. So this is one way that you \nmake your allies feel better about things. Another  ",
      "offset": 3008.28,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "thing is if you're one of the five veto holders \nat the UN Security Council, you can do your public  ",
      "offset": 3013.72,
      "duration": 6.32
    },
    {
      "lang": "en",
      "text": "support that way. And I've already mentioned these \nRussian vetoes on Kashmiri plebiscites that the  ",
      "offset": 3020.04,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "Indians truly didn't want to have happen, or short \ncircuiting the Indian offensive in Bangladesh. So  ",
      "offset": 3025.84,
      "duration": 6.92
    },
    {
      "lang": "en",
      "text": "this is what Russia did for India, and it was \na very valuable thing for them. You can also  ",
      "offset": 3032.76,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "put money where your mouth is. Economic aid. And \nit's interesting, the United States provided far  ",
      "offset": 3037.32,
      "duration": 5.24
    },
    {
      "lang": "en",
      "text": "more economic aid than either the Russians or the \nChinese, but still, both Pakistanis and Indians  ",
      "offset": 3042.56,
      "duration": 8.4
    },
    {
      "lang": "en",
      "text": "preferred China and Russia respectively. And some \nof this aid was really important. During the Bihar  ",
      "offset": 3050.96,
      "duration": 6.96
    },
    {
      "lang": "en",
      "text": "famine in 1967, the United States sent 20% of its \nwheat crop to India. It was worth $1.5 billion.  ",
      "offset": 3057.92,
      "duration": 7.6
    },
    {
      "lang": "en",
      "text": "That's not something to be sneezed at for, I \ndon't know, was it 90 million people? It's a  ",
      "offset": 3065.52,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "lot of people who might have starved to death.\n \nAnd that didn't work out well at all because  ",
      "offset": 3070.4,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "Johnson, at that point, President Johnson at \nthat point was so mad at the Indians because  ",
      "offset": 3076.48,
      "duration": 4.12
    },
    {
      "lang": "en",
      "text": "from his point of view, they were cuddling \nup to the North Vietnamese. And the Vietnam  ",
      "offset": 3080.6,
      "duration": 3.4
    },
    {
      "lang": "en",
      "text": "War wasn't going well for Johnson. So he was \nfurious. So he provided the aid, but he did it  ",
      "offset": 3084,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "always at the last minute, ship to mouth.\nAnd Indira Gandhi was furious. She said,  ",
      "offset": 3088.88,
      "duration": 6
    },
    {
      "lang": "en",
      "text": "I don't ever want us ever to have to beg for \nfood again. And she never did. So the United  ",
      "offset": 3094.88,
      "duration": 8.56
    },
    {
      "lang": "en",
      "text": "States got no gratitude or enduring anything. Oh, \nand a whole other piece of it is that India is not  ",
      "offset": 3103.44,
      "duration": 6.64
    },
    {
      "lang": "en",
      "text": "subject to famines anymore. And part of it's from \nthe Green Revolution. And who does that? It's the  ",
      "offset": 3110.08,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "Ford and Rockefeller foundations who figure out \nthe different strains of grains that you want to  ",
      "offset": 3114.68,
      "duration": 6.04
    },
    {
      "lang": "en",
      "text": "grow. And does the United States get any credit \nfor that? No, zip. And here is Krishna Menon, who  ",
      "offset": 3120.72,
      "duration": 6.8
    },
    {
      "lang": "en",
      "text": "is Nehru's controversial advisor, saying, look, we \nwant to encourage a little competition between the  ",
      "offset": 3127.52,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "donors. And they did. And India just. Even Indira \nGandhi, who hates Nixon, she's racking up the aid. ",
      "offset": 3133.6,
      "duration": 7.268
    },
    {
      "lang": "en",
      "text": "And back in the Eisenhower administration, the \nUnited States had noticed. Secretary of State  ",
      "offset": 3140.868,
      "duration": 0.972
    },
    {
      "lang": "en",
      "text": "John Foster Dulles is saying, look, concerning \nIndia and Pakistan, it's difficult to help one  ",
      "offset": 3141.84,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "without making the enemy of the other. And \nof course, the United States tried to help  ",
      "offset": 3147.12,
      "duration": 3.4
    },
    {
      "lang": "en",
      "text": "both and angered both of them. Amazing.\nSo another instrument of national power  ",
      "offset": 3150.52,
      "duration": 5.4
    },
    {
      "lang": "en",
      "text": "is military aid. It is even more difficult to \ncalibrate than the economic aid. So you can see  ",
      "offset": 3155.92,
      "duration": 6.84
    },
    {
      "lang": "en",
      "text": "with the pactomania event where Eisenhower \nis building these bilateral relations and  ",
      "offset": 3162.76,
      "duration": 8.96
    },
    {
      "lang": "en",
      "text": "treaty organizations to contain the Russians. \nFormerly there'd been no Cold War in South Asia,  ",
      "offset": 3171.72,
      "duration": 6.04
    },
    {
      "lang": "en",
      "text": "but once Eisenhower allies with Pakistan, all of \na sudden the Russians are in there too. So that's  ",
      "offset": 3177.76,
      "duration": 6.96
    },
    {
      "lang": "en",
      "text": "a bit of a boomerang. Another one. So when the \nUnited States provides military aid to Pakistan,  ",
      "offset": 3184.72,
      "duration": 7.36
    },
    {
      "lang": "en",
      "text": "that just drives India to seeking an alliance \nwith Russia, which isn't exactly what the United  ",
      "offset": 3192.08,
      "duration": 4.2
    },
    {
      "lang": "en",
      "text": "States wanted. And then when the United States \nhelps India right after the 1962 war with China,  ",
      "offset": 3196.28,
      "duration": 6.72
    },
    {
      "lang": "en",
      "text": "that alienates the Pakistanis and then they \ntry to buddy buddy with China, not remotely  ",
      "offset": 3203,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "what the United States wanted to happen. And then \nwhen the United States provides aid to the ISI,  ",
      "offset": 3207.6,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "the Inter Services Intelligence Directorate, \nwhich is the Pakistanis then are funding things  ",
      "offset": 3213.04,
      "duration": 5.6
    },
    {
      "lang": "en",
      "text": "to get the Russians out of Afghanistan, they're \nalso diverting it into Kashmir. So in 1989 this  ",
      "offset": 3218.64,
      "duration": 8.12
    },
    {
      "lang": "en",
      "text": "insurgency heats up and it's remained heated ever \nsince. And then you wind up with China providing  ",
      "offset": 3226.76,
      "duration": 7.44
    },
    {
      "lang": "en",
      "text": "nuclear help to the Pakistanis. So it's difficult \nwith these things. You get a short term thing,  ",
      "offset": 3234.2,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "but then the long term thing that winds \nup may not be what you want at all. ",
      "offset": 3239.88,
      "duration": 3.28
    },
    {
      "lang": "en",
      "text": "The other instrument of national power, if you \ngot one, is the carrier battle group. You can  ",
      "offset": 3243.16,
      "duration": 3.12
    },
    {
      "lang": "en",
      "text": "send one of those around, which is what the United \nStates did. Here's Enterprise. It was the United  ",
      "offset": 3246.28,
      "duration": 4.08
    },
    {
      "lang": "en",
      "text": "States’ first nuclear propelled aircraft carrier. \nAnd so during the ‘71 war, the United States sent  ",
      "offset": 3250.36,
      "duration": 6.16
    },
    {
      "lang": "en",
      "text": "this into the Bay of Bengal, the Russians sent \nsome naval assets, had no effect on that war:  ",
      "offset": 3256.52,
      "duration": 5.92
    },
    {
      "lang": "en",
      "text": "Pakistan lost. Right. The Indians were furious. \nThey just regarded this as an absolute threat.  ",
      "offset": 3262.44,
      "duration": 5.36
    },
    {
      "lang": "en",
      "text": "And how dare we do this anyway? And maybe it \nwould have been better to have left Enterprise  ",
      "offset": 3267.8,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "in their home port rather than doing this.\nAnd then of course there's sanctions and  ",
      "offset": 3272.48,
      "duration": 3.88
    },
    {
      "lang": "en",
      "text": "embargoes. The United States does this all the \ntime. And if you look at the list of the times  ",
      "offset": 3276.36,
      "duration": 5.28
    },
    {
      "lang": "en",
      "text": "we're embargoing stuff. So at partition we're \nembargoing everybody. And then during the ‘65  ",
      "offset": 3281.64,
      "duration": 7.6
    },
    {
      "lang": "en",
      "text": "war we're embargoing everybody. And then as \nvarious people are making nuclear progress and  ",
      "offset": 3289.24,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "different things, there are these embargoes that \ncome and go. And Pakistan's really mad because  ",
      "offset": 3295.32,
      "duration": 6.32
    },
    {
      "lang": "en",
      "text": "India does a test, an atomic test in 1974 and \nPakistan doesn't do anything until much later.  ",
      "offset": 3301.64,
      "duration": 6.84
    },
    {
      "lang": "en",
      "text": "And it's looking why are you sanctioning us on \nthis nuclear stuff? The Indians have actually  ",
      "offset": 3308.48,
      "duration": 4.52
    },
    {
      "lang": "en",
      "text": "done this. We haven't. And so if you look at this \nchart, you can see where the ups and downs of  ",
      "offset": 3313,
      "duration": 6.32
    },
    {
      "lang": "en",
      "text": "these sanctions go. And clearly they didn't stop \nproliferation because in 1998 you have these tit  ",
      "offset": 3319.32,
      "duration": 7
    },
    {
      "lang": "en",
      "text": "for tat nuclear atomic tests by both and the \nUnited States tries sanctioning, but then it's  ",
      "offset": 3326.32,
      "duration": 6.6
    },
    {
      "lang": "en",
      "text": "just too late. They've already tested the stuff. \nAnd so the United States basically gives up and  ",
      "offset": 3332.92,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "then after 9/11, of course, we desperately \nneed Pakistan again to deal with Afghanistan.  ",
      "offset": 3338,
      "duration": 5.12
    },
    {
      "lang": "en",
      "text": "So it's a complicated world out there.\nSo another instrument of national power  ",
      "offset": 3343.12,
      "duration": 6.76
    },
    {
      "lang": "en",
      "text": "is you can trade off your territory if \nyou really want to. Most people don't,  ",
      "offset": 3349.88,
      "duration": 4.24
    },
    {
      "lang": "en",
      "text": "but the Pakistanis clearly did that in 1963. And \nwe can all speculate on what they got. I mean,  ",
      "offset": 3354.12,
      "duration": 6.88
    },
    {
      "lang": "en",
      "text": "my hunch would be something to do with nuclear \nthings, but hey, it's not as if this information  ",
      "offset": 3361,
      "duration": 6.36
    },
    {
      "lang": "en",
      "text": "is out there in the public. It isn't.\nOh, another thing you can do is go  ",
      "offset": 3367.36,
      "duration": 3.6
    },
    {
      "lang": "en",
      "text": "fund the insurgency. So you can. And this is \ndone by the United States, Russia, China, India,  ",
      "offset": 3370.96,
      "duration": 7.64
    },
    {
      "lang": "en",
      "text": "Pakistan. Think if you've got a country that you \ndon't like that has some minority people that  ",
      "offset": 3378.6,
      "duration": 6.44
    },
    {
      "lang": "en",
      "text": "want to secede and so they're fighting there, \nwell, you can go fund that insurgency and then  ",
      "offset": 3385.04,
      "duration": 6.44
    },
    {
      "lang": "en",
      "text": "the one you don't like is pinned, because they're \ngoing to be paying attention to that insurgency.  ",
      "offset": 3391.48,
      "duration": 4.96
    },
    {
      "lang": "en",
      "text": "And while they're pinned there, they can't \nprobably do things elsewhere that you might  ",
      "offset": 3396.44,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "care about. So this is the logic of what's going \non. So the United States belatedly decided, ah,  ",
      "offset": 3400.6,
      "duration": 6.84
    },
    {
      "lang": "en",
      "text": "let's help the Tibetans. And so the CIA is helping \nthem between ‘57 and ‘61. But look at the dates we  ",
      "offset": 3407.44,
      "duration": 5.48
    },
    {
      "lang": "en",
      "text": "did the road system. The road system in Tibet's \ncompleted by 1957. It's too late. So all you do  ",
      "offset": 3412.92,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "is get these people killed because the Chinese \nhave got the road system all set up in there.\n  ",
      "offset": 3419,
      "duration": 4.36
    },
    {
      "lang": "en",
      "text": "So that doesn't exactly work. But after the ‘62 \nwar, all the way until 1979, when Deng Xiaoping  ",
      "offset": 3423.36,
      "duration": 9.16
    },
    {
      "lang": "en",
      "text": "calls it off, the Chinese are funding insurgencies \nof, let's see, the Mizos, the Manapuri and the  ",
      "offset": 3432.52,
      "duration": 8.48
    },
    {
      "lang": "en",
      "text": "Naga people all don't like different aspects of \nIndian rule. And the Chinese are more than happy  ",
      "offset": 3441,
      "duration": 5.4
    },
    {
      "lang": "en",
      "text": "to stir that pot. And the really big pot to \nstir are the Naxalites. It's huge. And while  ",
      "offset": 3446.4,
      "duration": 7.36
    },
    {
      "lang": "en",
      "text": "as long as the Pakistanis have got East Pakistan, \nthey can stir some of that up. And by the way,  ",
      "offset": 3453.76,
      "duration": 6.68
    },
    {
      "lang": "en",
      "text": "these Naxalites are still there in India. \nThey have not gone away. It's a serious  ",
      "offset": 3460.44,
      "duration": 4.52
    },
    {
      "lang": "en",
      "text": "part of India where they are. And then, of \ncourse, Pakistan's location right next to  ",
      "offset": 3464.96,
      "duration": 4.72
    },
    {
      "lang": "en",
      "text": "Kashmir means they can stir that forever.\nAnd the tragedy of these, what they  ",
      "offset": 3469.68,
      "duration": 6.04
    },
    {
      "lang": "en",
      "text": "become are frozen conflicts. Is the outside \npower. if they are playing their cards right,  ",
      "offset": 3475.72,
      "duration": 8.76
    },
    {
      "lang": "en",
      "text": "their amoral cards right, they're not bearing any \nof the costs. They're pinning someone they don't  ",
      "offset": 3484.48,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "particularly like. All the costs are borne \nby the local population who are suffering  ",
      "offset": 3490.16,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "horrendous deaths, lack of economic growth. \nYou're just having warfare where you live.  ",
      "offset": 3495.88,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "What a total disaster. So that's how it works.\n… two can play at this game. So the Indians,  ",
      "offset": 3500.48,
      "duration": 8.16
    },
    {
      "lang": "en",
      "text": "according to the Pakistanis, have funded the \nBaloch people. They straddle Iran and Pakistan,  ",
      "offset": 3508.64,
      "duration": 7.92
    },
    {
      "lang": "en",
      "text": "don't particularly like being told what to do. So \napparently India's supposed to have put its finger  ",
      "offset": 3516.56,
      "duration": 5.16
    },
    {
      "lang": "en",
      "text": "on that scale. The other thing the Pakistanis \naccuse Indians of doing is encouraging a Pashtun  ",
      "offset": 3521.72,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "insurgency up north. And that would be a way of \ndiverting Pakistani attentions from Kashmir. If  ",
      "offset": 3527.4,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "they're totally busy with Pashtuns, they can \ndo less in Kashmir. But the result of these  ",
      "offset": 3533.12,
      "duration": 5.6
    },
    {
      "lang": "en",
      "text": "things is people are becoming more and more \nbitter. The hatreds just spike, the economic  ",
      "offset": 3538.72,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "growth isn't happening, poverty everywhere. And it \nmakes these problems more intractable, not less. ",
      "offset": 3544.56,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "So when I think about these frozen conflicts, \nthere are a number of ones that you know about  ",
      "offset": 3550.36,
      "duration": 5
    },
    {
      "lang": "en",
      "text": "besides Kashmir, there's Korea, there's Palestine. \nSo if you look at Kashmir, if I've got it right,  ",
      "offset": 3555.36,
      "duration": 7.4
    },
    {
      "lang": "en",
      "text": "so you fund that thing. And then what's great from \nChina's point of view, if Pakistan is doing that  ",
      "offset": 3562.76,
      "duration": 9.08
    },
    {
      "lang": "en",
      "text": "India is frozen, that it can't do other things \nbecause it's constantly paying attention to what's  ",
      "offset": 3571.84,
      "duration": 5.92
    },
    {
      "lang": "en",
      "text": "going on in Kashmir as opposed to going “hmmm \nChina, I don't know about this”. Or in the Korean  ",
      "offset": 3577.76,
      "duration": 5.64
    },
    {
      "lang": "en",
      "text": "War back in the day, if things are all stirred \nup in Korea, China has to really pay attention  ",
      "offset": 3583.4,
      "duration": 9.24
    },
    {
      "lang": "en",
      "text": "to that. And it delays the rise of China. And in \nthose days that benefited Russia. But these things  ",
      "offset": 3592.64,
      "duration": 5.92
    },
    {
      "lang": "en",
      "text": "can change over time as to who the beneficiary \nis. And then you can play this game and think  ",
      "offset": 3598.56,
      "duration": 4.92
    },
    {
      "lang": "en",
      "text": "about how it works in Palestine. And I'm no expert \nin that part of the world, but I think this frozen  ",
      "offset": 3603.48,
      "duration": 7.36
    },
    {
      "lang": "en",
      "text": "conflict veto player works, that there are these \nveto players who are vetoing peace very easily.  ",
      "offset": 3610.84,
      "duration": 7
    },
    {
      "lang": "en",
      "text": "All you have to do is send a certain number of \npackage bombs and peace is not going to happen. ",
      "offset": 3617.84,
      "duration": 4.12
    },
    {
      "lang": "en",
      "text": "So, cutthroat billiards. What can you take away \nfrom all this? Well, common enemies cannot be  ",
      "offset": 3621.96,
      "duration": 7.92
    },
    {
      "lang": "en",
      "text": "conjured. So check out the alignments of who these \ncommon enemies are before you leave the parking  ",
      "offset": 3629.88,
      "duration": 7.12
    },
    {
      "lang": "en",
      "text": "lot and figure it out for all possible players who \nmight want to crash the party. Like, what's their  ",
      "offset": 3637,
      "duration": 7.44
    },
    {
      "lang": "en",
      "text": "primary objective? Who's their primary adversary? \nWhat primary theater are they truly interested in?  ",
      "offset": 3644.44,
      "duration": 6.24
    },
    {
      "lang": "en",
      "text": "And then you've got your hunches on how you think \nthis is. And then you should reassess early and  ",
      "offset": 3650.68,
      "duration": 5.6
    },
    {
      "lang": "en",
      "text": "often to see if your assumptions are correct and \ndon't worry about changing your mind. Some people  ",
      "offset": 3656.28,
      "duration": 6.64
    },
    {
      "lang": "en",
      "text": "get really hung up about being wrong. Don't worry. \nReassessing is a sign of strength. It's like,  ",
      "offset": 3662.92,
      "duration": 7.64
    },
    {
      "lang": "en",
      "text": "I got more information, I've changed my mind. \nGood thing, don't double down on bad information.  ",
      "offset": 3670.56,
      "duration": 5.52
    },
    {
      "lang": "en",
      "text": "And then if you're looking into areas of the world \nthat are ethnically diverse where people have been  ",
      "offset": 3676.08,
      "duration": 4.8
    },
    {
      "lang": "en",
      "text": "at odds for a long time, expect veto players and \nreal difficulty in settling that matter out. And  ",
      "offset": 3680.88,
      "duration": 6.2
    },
    {
      "lang": "en",
      "text": "part of good strategy is recognizing some problems \nit's not feasible to solve. And then we all have  ",
      "offset": 3687.08,
      "duration": 7.72
    },
    {
      "lang": "en",
      "text": "scarce resources. You can't do everything. Focus \non those things where you think you can solve. But  ",
      "offset": 3694.8,
      "duration": 8.44
    },
    {
      "lang": "en",
      "text": "if the great powers align, things can happen. \nAnd the story is even better than that. That,  ",
      "offset": 3703.24,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "sure there are a few big powers, but the small \nand medium powers, if you add them all up,  ",
      "offset": 3708.68,
      "duration": 6.84
    },
    {
      "lang": "en",
      "text": "are by far the aggregate. Their aggregate wealth \nexceeds any one great power. So if the smaller  ",
      "offset": 3715.52,
      "duration": 9.2
    },
    {
      "lang": "en",
      "text": "powers agree on what they're up to, then the \nbig powers have to pay attention. And that's  ",
      "offset": 3724.72,
      "duration": 4.84
    },
    {
      "lang": "en",
      "text": "a positive thing. So that is what I had to say \nto you this evening and thank you for listening. ",
      "offset": 3729.56,
      "duration": 24.28
    },
    {
      "lang": "en",
      "text": "Q&amp;A\nSo it seems like the lesson from this lecture,  ",
      "offset": 3787.6,
      "duration": 8.36
    },
    {
      "lang": "en",
      "text": "the big lesson, is we couldn't be allies with both \nPakistan and India at the same time. We had to  ",
      "offset": 3795.96,
      "duration": 5.76
    },
    {
      "lang": "en",
      "text": "choose one. So which one should we have chosen?\nOh, well, our primary enemy was pretty much the  ",
      "offset": 3801.72,
      "duration": 6.04
    },
    {
      "lang": "en",
      "text": "Soviet Union for the duration of the Cold War. I \nmean, China was a problem, but the Soviets were  ",
      "offset": 3807.76,
      "duration": 5.52
    },
    {
      "lang": "en",
      "text": "the big problem. And so India and Pakistan never \nfit that bill. And so it had to do with whatever  ",
      "offset": 3813.28,
      "duration": 9.92
    },
    {
      "lang": "en",
      "text": "the problem of the day was. And Pakistan had a \nvery critical location, and so we needed it for  ",
      "offset": 3823.2,
      "duration": 6.48
    },
    {
      "lang": "en",
      "text": "a whole bunch of things, and you can see how that \nworks. While you need them, you pay a lot of money  ",
      "offset": 3829.68,
      "duration": 5.16
    },
    {
      "lang": "en",
      "text": "to them, and presumably the money's worth it for \nthem for the hassles of dealing with a difficult  ",
      "offset": 3834.84,
      "duration": 5.28
    },
    {
      "lang": "en",
      "text": "tenant. So that's how it worked. But nowadays, \nthe relationship with India is changing. In fact,  ",
      "offset": 3840.12,
      "duration": 10.32
    },
    {
      "lang": "en",
      "text": "it has changed because their big buddy Russia is. \nWell, after the end of the Cold War, instead of  ",
      "offset": 3850.44,
      "duration": 5.16
    },
    {
      "lang": "en",
      "text": "being the big friend, it was the big nuisance, \nnot so much for India, but for everybody else.  ",
      "offset": 3855.6,
      "duration": 4.84
    },
    {
      "lang": "en",
      "text": "And now for India, its primary adversary is China, \nwithout a doubt. And the United States, I think,  ",
      "offset": 3860.44,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "is looking at China poses the primary threat. And \nto the extent that both of them see it that way,  ",
      "offset": 3866.24,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "that will make them align and Pakistan less so.\nIt sounds like at the time it was right to choose  ",
      "offset": 3871.96,
      "duration": 6.2
    },
    {
      "lang": "en",
      "text": "Pakistan as the main ally for the United States.\nWell, we tried to choose India too, but yeah,  ",
      "offset": 3878.16,
      "duration": 7
    },
    {
      "lang": "en",
      "text": "we tried to do them simultaneously, but \nIndia's further south, right. And so for  ",
      "offset": 3885.16,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "a long time before we got satellite imagery, \nyou want to have listening posts and things  ",
      "offset": 3889.84,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "up in Pakistan. So India just simply doesn't \nhave the location for that. So that was the  ",
      "offset": 3894.4,
      "duration": 4.4
    },
    {
      "lang": "en",
      "text": "original reason for interest in Pakistan.\nI want to better understand why the Soviet  ",
      "offset": 3898.8,
      "duration": 7.12
    },
    {
      "lang": "en",
      "text": "Union was such a charismatic example for \ncountries that were decolonizing like India. ",
      "offset": 3905.92,
      "duration": 5.96
    },
    {
      "lang": "en",
      "text": "Well, I think go back and put yourself as \na generation of what your life experience  ",
      "offset": 3911.88,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "was. If your life experience was World War I, the \ntotal butchery of it. So you're telling young men  ",
      "offset": 3916.48,
      "duration": 7.76
    },
    {
      "lang": "en",
      "text": "your age “go” – you're in a trench – “I want you \nto go up and over the edge into oncoming machine  ",
      "offset": 3924.24,
      "duration": 5.76
    },
    {
      "lang": "en",
      "text": "gun fire”. We know what's going to happen when \nthat happens, right? And they're literally in  ",
      "offset": 3930,
      "duration": 5.6
    },
    {
      "lang": "en",
      "text": "battles like the Somme, they're losing hundreds \nof thousands of people. I don't mean casualties,  ",
      "offset": 3935.6,
      "duration": 4.52
    },
    {
      "lang": "en",
      "text": "I mean dead, dead. And so, and then you have the \nGreat Depression afterwards and then add to it,  ",
      "offset": 3940.12,
      "duration": 6.92
    },
    {
      "lang": "en",
      "text": "India's been colonized by a bunch of really \nopinionated white people, right? And transferring  ",
      "offset": 3947.04,
      "duration": 5.96
    },
    {
      "lang": "en",
      "text": "a lot of wealth out of India to England.\nAnd so you look at Marxism and boy,  ",
      "offset": 3953,
      "duration": 5.88
    },
    {
      "lang": "en",
      "text": "it sounds plausible, right? It sounds like \nthese evil capitalists, they're just wasting  ",
      "offset": 3958.88,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "lives. And surely this is the explanation. Now \nthe technicalities of Marx's labor theory of  ",
      "offset": 3964.68,
      "duration": 7.44
    },
    {
      "lang": "en",
      "text": "value don't actually turn out to be accurate. \nIt's not just labor that produces value like  ",
      "offset": 3972.12,
      "duration": 5.76
    },
    {
      "lang": "en",
      "text": "Silicon Valley, you understand, it's what comes up \nhere that produces a tremendous amount of value.  ",
      "offset": 3977.88,
      "duration": 6
    },
    {
      "lang": "en",
      "text": "And Marxist theory doesn't recognize that. And so \nthere are massive flaws in theory. And then when  ",
      "offset": 3983.88,
      "duration": 7.6
    },
    {
      "lang": "en",
      "text": "you put communism into practice, if you want \nto have equality, which is what they wanted,  ",
      "offset": 3991.48,
      "duration": 5.52
    },
    {
      "lang": "en",
      "text": "if you can have equality, you're not going to have \nany liberty, right? Because in order to make it  ",
      "offset": 3997,
      "duration": 3.76
    },
    {
      "lang": "en",
      "text": "equal, you just expropriate and then you divvy it \nout to everybody and there's no liberty in that,  ",
      "offset": 4000.76,
      "duration": 7
    },
    {
      "lang": "en",
      "text": "right? And another piece about democracies and \neven flawed ones, even if they have a semi-free  ",
      "offset": 4007.76,
      "duration": 8.12
    },
    {
      "lang": "en",
      "text": "press, a lot of the icky news bubbles up, \nbut in dictatorships it doesn't, right? ",
      "offset": 4015.88,
      "duration": 5.2
    },
    {
      "lang": "en",
      "text": "So you compare the seamy sides of some democracies \nthat aren't doing that well. And then to the  ",
      "offset": 4021.08,
      "duration": 9.76
    },
    {
      "lang": "en",
      "text": "public, the PR thing that the dictatorships \nare presenting. So you can picture Nehru  ",
      "offset": 4031.64,
      "duration": 5.32
    },
    {
      "lang": "en",
      "text": "of his generation, he's sick of the British. \nRight? And so Fabian socialism. He's not for  ",
      "offset": 4036.96,
      "duration": 5.16
    },
    {
      "lang": "en",
      "text": "killing lots of people to impose socialism. \nHe has a much lighter touch than Stalin. ",
      "offset": 4042.12,
      "duration": 6.68
    },
    {
      "lang": "en",
      "text": "One thing I was thinking about while you were \nmentioning the Gandhi and Nehru had a big problem  ",
      "offset": 4048.8,
      "duration": 4.12
    },
    {
      "lang": "en",
      "text": "with American segregation is at the same time in \nthe ‘50s, by that point over 10% of the Soviet  ",
      "offset": 4052.92,
      "duration": 9.12
    },
    {
      "lang": "en",
      "text": "population had at some point been in the gulags \nor are currently in the gulags. And segregation  ",
      "offset": 4062.04,
      "duration": 5.96
    },
    {
      "lang": "en",
      "text": "is very bad, Gulags are even worse. And it's \nthe same proportion of the population that's  ",
      "offset": 4068,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "been in the gulags. Maybe people just \ndidn't know about the gulags back then. ",
      "offset": 4072.56,
      "duration": 2.88
    },
    {
      "lang": "en",
      "text": "I don't think communists let you know those \nthings. Right. This is one for a lot of  ",
      "offset": 4075.96,
      "duration": 5.28
    },
    {
      "lang": "en",
      "text": "Russians because my husband and I were in the \nSoviet Union in the 1988/89 academic year and  ",
      "offset": 4081.24,
      "duration": 7.52
    },
    {
      "lang": "en",
      "text": "that's early Gorbachev before everything totally \nfalls apart and there's no food. So there was,  ",
      "offset": 4088.76,
      "duration": 4.24
    },
    {
      "lang": "en",
      "text": "there wasn't much food, but there was some \nfood. And it was just as the Russians were  ",
      "offset": 4093,
      "duration": 6.04
    },
    {
      "lang": "en",
      "text": "suddenly being able to read in fairly free press \nabout the things that had happened. And they were  ",
      "offset": 4099.04,
      "duration": 6.76
    },
    {
      "lang": "en",
      "text": "appalled about what had gone on under Stalin \nand they just hadn't realized all of it. ",
      "offset": 4105.8,
      "duration": 6.4
    },
    {
      "lang": "en",
      "text": "One of the reasons that socialism was appealing \nto these decolonizing countries was because in  ",
      "offset": 4112.2,
      "duration": 3.96
    },
    {
      "lang": "en",
      "text": "the preceding decades, from the ‘20s to ‘40s, \nthe Soviet Union actually had pretty good growth  ",
      "offset": 4116.16,
      "duration": 5.04
    },
    {
      "lang": "en",
      "text": "rates. In those 20 years, their GDP went from 8% \nto 18% of world production. Was that just catch-up  ",
      "offset": 4121.2,
      "duration": 5.76
    },
    {
      "lang": "en",
      "text": "growth? What was going on by the time Russia did?\nWell, there was tremendous rebuilding after World  ",
      "offset": 4126.96,
      "duration": 6.12
    },
    {
      "lang": "en",
      "text": "War II. There's another piece. It was so weird \nwhen we were in Russia in 88, 89, anything that  ",
      "offset": 4133.08,
      "duration": 7.96
    },
    {
      "lang": "en",
      "text": "was sold at the markets that came from somewhere \nelse, they would market means imported. So the  ",
      "offset": 4141.04,
      "duration": 6.32
    },
    {
      "lang": "en",
      "text": "idea, and I remember thinking this is really weird \nbecause normally you would say it's, I don't know,  ",
      "offset": 4147.36,
      "duration": 4.52
    },
    {
      "lang": "en",
      "text": "Hungarian this and that or whatever. I thought, \nooh, this means that anything from somewhere else  ",
      "offset": 4151.88,
      "duration": 4.84
    },
    {
      "lang": "en",
      "text": "is better than what we got, that it's a really bad \nsign. And they had what I would call a doughnut  ",
      "offset": 4156.72,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "empire. Normally when you think of an empire, \nmother Central is the most developed part. And  ",
      "offset": 4162.56,
      "duration": 5.04
    },
    {
      "lang": "en",
      "text": "then there's the periphery where all the natural \nresources are taken away. That it was an inverted  ",
      "offset": 4167.6,
      "duration": 5.76
    },
    {
      "lang": "en",
      "text": "empire. Russia is the donut. The rich places \nare places like Czechoslovakia and Poland had  ",
      "offset": 4173.36,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "been much richer places. And so the Russians \n– serf owners – are sucking in all the wealth  ",
      "offset": 4178.24,
      "duration": 7.2
    },
    {
      "lang": "en",
      "text": "from these places. And I think that's another \nreason why the shattering of the Soviet Union  ",
      "offset": 4185.44,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "when they lost all of their enserfed Eastern \nEurope, why it was such a mess for Russia,  ",
      "offset": 4189.6,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "they did not realize, and they still don't realize \nthe degree to which they were living off the  ",
      "offset": 4194.48,
      "duration": 5.12
    },
    {
      "lang": "en",
      "text": "wealth, product produced in the west, the European \nportions of Russia that since became independent. ",
      "offset": 4199.6,
      "duration": 8.96
    },
    {
      "lang": "en",
      "text": "Who was the last Soviet leader \nwho truly believed in communism? ",
      "offset": 4208.56,
      "duration": 3.96
    },
    {
      "lang": "en",
      "text": "Gorbachev was a true believer. He did not \nbelieve it was possible to take a U turn  ",
      "offset": 4212.52,
      "duration": 5.36
    },
    {
      "lang": "en",
      "text": "on the road to communism, so that when he was \ndoing his reforms, it was to improve communism,  ",
      "offset": 4217.88,
      "duration": 7.84
    },
    {
      "lang": "en",
      "text": "make it better. So he absolutely believed in it.\nWhen you started your career in Soviet studies and  ",
      "offset": 4225.72,
      "duration": 8.64
    },
    {
      "lang": "en",
      "text": "you're trying to figure out like what's \ngoing on in the Kremlin all the time,  ",
      "offset": 4234.36,
      "duration": 2.44
    },
    {
      "lang": "en",
      "text": "what is it? What is the key to figuring \nout Kremlinology? What is the key to  ",
      "offset": 4236.8,
      "duration": 2.76
    },
    {
      "lang": "en",
      "text": "figuring out what's happening in the Politburo?\nWell, what I did for my doctoral dissertation,  ",
      "offset": 4239.56,
      "duration": 5.76
    },
    {
      "lang": "en",
      "text": "so I wrote a history of the Sino. Well, the \nRusso-Chinese border, when it was figured out,  ",
      "offset": 4245.32,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "which is between 1858 and 1924, this is when all \nthis territory went. And what I did is. So most of  ",
      "offset": 4251.16,
      "duration": 6.72
    },
    {
      "lang": "en",
      "text": "this isn't Soviet, right? It's 17 to 24 is the \nSoviet part. But you go to archives in Russia,  ",
      "offset": 4257.88,
      "duration": 5.52
    },
    {
      "lang": "en",
      "text": "you see what they'll let you see. This is when \nyou could go to those archives. They're closed  ",
      "offset": 4263.4,
      "duration": 4.04
    },
    {
      "lang": "en",
      "text": "now. And I went to Beijing, saw the archives \nyou were allowed to see. And then in Nanjing,  ",
      "offset": 4267.44,
      "duration": 5.16
    },
    {
      "lang": "en",
      "text": "there were some other ones there. And then in \nTaiwan, the ones they would allow you to see,  ",
      "offset": 4272.6,
      "duration": 3.76
    },
    {
      "lang": "en",
      "text": "and then Japan, the ones they would allow you to \nsee. And they're all lying about different things  ",
      "offset": 4276.36,
      "duration": 3.88
    },
    {
      "lang": "en",
      "text": "or covering up different things. So it's a jigsaw \npuzzle. You put it together that way. So that was  ",
      "offset": 4280.24,
      "duration": 6.6
    },
    {
      "lang": "en",
      "text": "how I did it. And also for the whole Kremlinology \nis pay attention to what dictators say because  ",
      "offset": 4286.84,
      "duration": 11.2
    },
    {
      "lang": "en",
      "text": "they've got to communicate at some level to their \nown populations. They quite often tell you exactly  ",
      "offset": 4298.04,
      "duration": 5.56
    },
    {
      "lang": "en",
      "text": "what they want to do and you think that's insane. \nWho would do that? Well, hello. Hello. Right,  ",
      "offset": 4303.6,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "so read what they have to say and read what others \nhave to say. Then you need to read things in the  ",
      "offset": 4309.44,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "Russian language. So I just, I read a lot of \nthings. Just read broadly, read more broadly,  ",
      "offset": 4315.24,
      "duration": 6.72
    },
    {
      "lang": "en",
      "text": "than whatever your topic is, because it's the \nunknown unknowns is what you're after. What are  ",
      "offset": 4321.96,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "the things that are truly important and you have \nno idea about? And the only way you get to those  ",
      "offset": 4326.84,
      "duration": 4.28
    },
    {
      "lang": "en",
      "text": "is archives or reading broadly where you bump \ninto things. Ooh, that turns out to be important. ",
      "offset": 4331.12,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "When you were giving the lecture, it seemed like \nthese primary adversaries, whoever it is, is  ",
      "offset": 4336.8,
      "duration": 3.68
    },
    {
      "lang": "en",
      "text": "like very permanent. And there's some, like, deep \nreason why it has to be this way. But if you look  ",
      "offset": 4340.48,
      "duration": 4.44
    },
    {
      "lang": "en",
      "text": "at the Sino Soviet split, it's just like they're \nboth Communist, they're both Leninist parties,  ",
      "offset": 4344.92,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "and they have this falling out over. There were a \ncouple of things you mentioned, but it's not clear  ",
      "offset": 4349.52,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "why somebody has to be somebody else's primary \nadversary or why you can't turn that around. ",
      "offset": 4355.2,
      "duration": 3.56
    },
    {
      "lang": "en",
      "text": "Well, you can, but Russia and China have these \nterritorial differences and the issues I listed  ",
      "offset": 4358.76,
      "duration": 7.92
    },
    {
      "lang": "en",
      "text": "there of fighting to the last Chinese in the \nKorean War, Mao didn't really like that. There are  ",
      "offset": 4366.68,
      "duration": 5.28
    },
    {
      "lang": "en",
      "text": "a lot of Chinese who die in the Korean War where \nthe Russians sort of get them in there and then  ",
      "offset": 4371.96,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "you're stuck. You have to, for prestige reasons, \nstay there. And the really big one I didn't  ",
      "offset": 4376.64,
      "duration": 5.32
    },
    {
      "lang": "en",
      "text": "discuss in any detail. So Stalin's really worried \nabout a two front war. Nazis in the west and  ",
      "offset": 4381.96,
      "duration": 7.72
    },
    {
      "lang": "en",
      "text": "Japanese in the east. And so he brokers the second \nUnited Front between the Chinese Nationalist under  ",
      "offset": 4389.68,
      "duration": 6.6
    },
    {
      "lang": "en",
      "text": "Chiang Kai Shek and the Chinese Communists under \nMao at a place called Xi'an in late 1930. Wait,  ",
      "offset": 4396.28,
      "duration": 8.72
    },
    {
      "lang": "en",
      "text": "is it 36? And so it's called the Xi'an Incident \nwhere Chiang Kai Shek was reputedly kidnapped  ",
      "offset": 4405,
      "duration": 6.16
    },
    {
      "lang": "en",
      "text": "and up there. But really what's going on is it's \nsetting up the second United Front. And then the  ",
      "offset": 4411.16,
      "duration": 5.36
    },
    {
      "lang": "en",
      "text": "Japanese go ballistic and that's when they invade \nall the way down the coast and up the Yangtze  ",
      "offset": 4416.52,
      "duration": 6.12
    },
    {
      "lang": "en",
      "text": "River. And that means the Chinese are fighting the \nJapanese for you. The Japanese are not going to  ",
      "offset": 4422.64,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "launch into Siberia. So that works for Stalin. But \nthe Chinese realize this and it's not appreciated. ",
      "offset": 4427.32,
      "duration": 7.52
    },
    {
      "lang": "en",
      "text": "Yeah, but then they helped the \nCommunists get into power in China,  ",
      "offset": 4434.84,
      "duration": 2.88
    },
    {
      "lang": "en",
      "text": "right? You think they'd be grateful for that?\nNo, no, he wanted to divide China. He's telling  ",
      "offset": 4437.72,
      "duration": 3.48
    },
    {
      "lang": "en",
      "text": "Mao, oh, stop at the Yangzi stock \nat the Yang. You need a breathing  ",
      "offset": 4441.2,
      "duration": 2.32
    },
    {
      "lang": "en",
      "text": "space there. And Mao's and keeps on going.\nIf you're the president, if you're the Secretary  ",
      "offset": 4443.52,
      "duration": 6.2
    },
    {
      "lang": "en",
      "text": "of State and you're looking at this, where there's \nthese interweaving systems of alliances and you  ",
      "offset": 4449.72,
      "duration": 4.92
    },
    {
      "lang": "en",
      "text": "give some guy aid because you need something \nand pisses everybody else off, how the Hell are  ",
      "offset": 4454.64,
      "duration": 4.24
    },
    {
      "lang": "en",
      "text": "you supposed to keep track of this? Do they have \nthese matrices that you got up there? And they're… ",
      "offset": 4458.88,
      "duration": 4.4
    },
    {
      "lang": "en",
      "text": "We have so many wonderful people working \nin the State Department. I've met a number  ",
      "offset": 4463.28,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "of them because they come, they're students \nat the War College. You should be proud of  ",
      "offset": 4467.88,
      "duration": 4.12
    },
    {
      "lang": "en",
      "text": "all the people who work for the Department of \nState. They're all of these different experts,  ",
      "offset": 4472,
      "duration": 4.08
    },
    {
      "lang": "en",
      "text": "different parts of the world. They get sent around \nhither and yon, very thoughtful people. Also I've  ",
      "offset": 4476.08,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "read in the archives many CIA reports because \nI've gone to these presidential archives starting  ",
      "offset": 4481.52,
      "duration": 5.4
    },
    {
      "lang": "en",
      "text": "with the Truman administration all the way up to \nBush Senior. As you get to the more recent stuff,  ",
      "offset": 4486.92,
      "duration": 5.52
    },
    {
      "lang": "en",
      "text": "less of it's been declassified. So the…I've read \nmost of the CIA reports I've read are for earlier  ",
      "offset": 4492.44,
      "duration": 6.12
    },
    {
      "lang": "en",
      "text": "periods where they've been declassified. It's \nimpressive the level of analysis. And I know that  ",
      "offset": 4498.56,
      "duration": 4.48
    },
    {
      "lang": "en",
      "text": "the CIA has several…there's the analytical part \nof it and then there's the send people out to do,  ",
      "offset": 4503.04,
      "duration": 6.28
    },
    {
      "lang": "en",
      "text": "we aren't even going to talk about what \nthey're, which is completely different.  ",
      "offset": 4509.32,
      "duration": 4.2
    },
    {
      "lang": "en",
      "text": "But they're very fine analysts. And then we have \nlike the Department of Agriculture has very fine  ",
      "offset": 4513.52,
      "duration": 4.64
    },
    {
      "lang": "en",
      "text": "analysts about agriculture, the whole world. So \nwe have a tremendous amount of expertise. And  ",
      "offset": 4518.16,
      "duration": 6.8
    },
    {
      "lang": "en",
      "text": "the other thing that presidents get and \nalso the high level bureaucrats get are  ",
      "offset": 4525.8,
      "duration": 4.76
    },
    {
      "lang": "en",
      "text": "these daily reports where they're very short \nbecause they have to be about what's going on  ",
      "offset": 4530.56,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "everywhere in the world that people think \nis important for them to know. So there  ",
      "offset": 4536.4,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "are a tremendous number of smart, well educated \npeople trying to get information to presidents,  ",
      "offset": 4541.08,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "secretaries of states and things. And then you \nhave all these regional desks where there's I  ",
      "offset": 4546.88,
      "duration": 5
    },
    {
      "lang": "en",
      "text": "don't know, I can't remember exactly. I don't know \nthe organization chart of the State Department.  ",
      "offset": 4551.88,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "But you can look at it by region of the world. \nPeople work there and, and provide this. So there  ",
      "offset": 4556.48,
      "duration": 4.84
    },
    {
      "lang": "en",
      "text": "are wonderful experts that are working on this.\nYou mentioned in the lecture that if China and  ",
      "offset": 4561.32,
      "duration": 6.52
    },
    {
      "lang": "en",
      "text": "India had figured out a way to work together, \nthe world order could have looked completely  ",
      "offset": 4567.84,
      "duration": 2.8
    },
    {
      "lang": "en",
      "text": "different. Spell out the counterfactual \nfor us. How would it have been different? ",
      "offset": 4570.64,
      "duration": 3.54
    },
    {
      "lang": "en",
      "text": "So I spent the grand total of a week in India. It \nwas a trip on the way back from Australia and that  ",
      "offset": 4574.18,
      "duration": 5.54
    },
    {
      "lang": "en",
      "text": "was the amount of time we had. But we went into \nthe Mahatma Gandhi Museum in New Delhi and there's  ",
      "offset": 4579.72,
      "duration": 6.56
    },
    {
      "lang": "en",
      "text": "a whole piece of it where Chiang Kai-shek \nis giving him things. And it became really  ",
      "offset": 4586.28,
      "duration": 5.04
    },
    {
      "lang": "en",
      "text": "clear that Chiang Kai-shek had a really good \nrelationship with India. Deep respect for India.  ",
      "offset": 4591.32,
      "duration": 5.12
    },
    {
      "lang": "en",
      "text": "This shared desire of we want to be independent, \nwe don't want Japanese running around our country,  ",
      "offset": 4596.44,
      "duration": 4.64
    },
    {
      "lang": "en",
      "text": "we don't want a bunch of Westerners running \naround. We share this with India. And so I think  ",
      "offset": 4601.08,
      "duration": 5.48
    },
    {
      "lang": "en",
      "text": "if you get Chiang Kai-shek winning the Chinese \ncivil war and things, you might have had them team  ",
      "offset": 4606.56,
      "duration": 7.36
    },
    {
      "lang": "en",
      "text": "up and had a much more productive relationship.\nThat's interesting because often you think of like  ",
      "offset": 4613.92,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "when you hear Nationalists, you think they're the \nones that are interested in territorial disputes,  ",
      "offset": 4619.36,
      "duration": 4.12
    },
    {
      "lang": "en",
      "text": "but in fact, you know, they wouldn't \nhave cared about Tibet or something. ",
      "offset": 4623.48,
      "duration": 3
    },
    {
      "lang": "en",
      "text": "Well, next time you're in New Delhi, go check out \nthe museum. But when I was there it was like 20  ",
      "offset": 4626.48,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "years ago, but I remember being impressed, \nwow, there's all. And then when Gandhi was  ",
      "offset": 4630.64,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "assassinated, this is Mahatma, not the Indira \nwho's also assassinated. No relations. That  ",
      "offset": 4634.8,
      "duration": 8.44
    },
    {
      "lang": "en",
      "text": "the Chinese, the nationalists sense all sorts \nof condolences and different things. So yeah,  ",
      "offset": 4643.24,
      "duration": 5.88
    },
    {
      "lang": "en",
      "text": "there could have been a different outcome.\nI wonder if the worst thing about the Non-Aligned  ",
      "offset": 4649.12,
      "duration": 5.32
    },
    {
      "lang": "en",
      "text": "Movement was that because they wouldn't \nfall under anyone else's nuclear umbrella,  ",
      "offset": 4654.44,
      "duration": 5.64
    },
    {
      "lang": "en",
      "text": "they wouldn't align with the great power that \nhad nukes. In order to keep up deterrence,  ",
      "offset": 4660.08,
      "duration": 4.8
    },
    {
      "lang": "en",
      "text": "they had to build nukes themselves. And so \nthen you have this nuclear proliferation and  ",
      "offset": 4664.88,
      "duration": 4.92
    },
    {
      "lang": "en",
      "text": "that was like it's really important to get people \nallied with one great power, even if it's not you,  ",
      "offset": 4669.8,
      "duration": 4.84
    },
    {
      "lang": "en",
      "text": "just to prevent the nukes from going wide.\nI think the 1962 war made Nehru realize that  ",
      "offset": 4674.64,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "non-alignment was a non-starter. And that's for \nthe reasons you're talking about. It's like, okay,  ",
      "offset": 4680.08,
      "duration": 6.36
    },
    {
      "lang": "en",
      "text": "we just got eaten alive by the Chinese. Okay, we \nneed a big friend, and we probably need some big  ",
      "offset": 4686.44,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "missiles eventually. And it's not immediately. \nThe Indians don't come around that “we absolutely  ",
      "offset": 4692.24,
      "duration": 6.72
    },
    {
      "lang": "en",
      "text": "need nuclear weapons” until the Bangladesh \nwar when China's become more of a threat. ",
      "offset": 4698.96,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "By 1971 like did Nehru really think that the \nSoviet Union might still win the Cold War? ",
      "offset": 4705.44,
      "duration": 6.6
    },
    {
      "lang": "en",
      "text": "Nehru's dead in like ‘64, so it's his daughter.\nWhen did they become allies with the Soviet Union? ",
      "offset": 4712.04,
      "duration": 7.04
    },
    {
      "lang": "en",
      "text": "Well, the official alliance, I'm just \ndefining, I made up what an alliance  ",
      "offset": 4719.08,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "is. So I would say it is the security \npact that Indira Gandhi signs in 1971. ",
      "offset": 4723.76,
      "duration": 7
    },
    {
      "lang": "en",
      "text": "Right. So at that point, did they really \nthought the Soviet Union could have won  ",
      "offset": 4730.76,
      "duration": 2.52
    },
    {
      "lang": "en",
      "text": "the Cold War? Like, why didn't they \njust choose the winner in retrospect? ",
      "offset": 4733.28,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "Oh, well, I remember the Cold War vividly. We \nfelt we were losing it most of the way through. ",
      "offset": 4737.44,
      "duration": 6.24
    },
    {
      "lang": "en",
      "text": "And why is that?\nWell, we always felt –  ",
      "offset": 4743.68,
      "duration": 3.32
    },
    {
      "lang": "en",
      "text": "because of the propaganda, right? – that “they're \nall living beautifully”. And then they're quite  ",
      "offset": 4747,
      "duration": 4.76
    },
    {
      "lang": "en",
      "text": "good, they're very good at propaganda. So the \nUnited States had massive racial problems. Think  ",
      "offset": 4751.76,
      "duration": 6.76
    },
    {
      "lang": "en",
      "text": "about the 1960s. Martin Luther King are pointing \nout hideous problems with this country. Civil  ",
      "offset": 4758.52,
      "duration": 6.88
    },
    {
      "lang": "en",
      "text": "rights demonstrations everywhere, anti Vietnam War \ndemonstrations everywhere. The women's movement,  ",
      "offset": 4765.4,
      "duration": 6.96
    },
    {
      "lang": "en",
      "text": "the environmental movement. There are loads of \nunhappy people pointing out all of these problems,  ",
      "offset": 4772.36,
      "duration": 5.36
    },
    {
      "lang": "en",
      "text": "which is a good thing because then the United \nStates starts working on fixing some of these  ",
      "offset": 4777.72,
      "duration": 4.48
    },
    {
      "lang": "en",
      "text": "problems. Of course they're not fixed, but there's \nimprovement on them. Whereas in Russia, no one can  ",
      "offset": 4782.2,
      "duration": 5.64
    },
    {
      "lang": "en",
      "text": "travel, so you can't see how unbelievably poor \nthey are. And so you go to Moscow and you think,  ",
      "offset": 4787.84,
      "duration": 7.24
    },
    {
      "lang": "en",
      "text": "well, this is a plausible city. Well, there is \nonly one plausible city in the place. Or maybe  ",
      "offset": 4795.08,
      "duration": 4.08
    },
    {
      "lang": "en",
      "text": "it's two. Saying Petersburg. Well, it's Leningrad \nin those days. So people didn't realize. But yeah,  ",
      "offset": 4799.16,
      "duration": 7
    },
    {
      "lang": "en",
      "text": "we felt we were losing the Cold War. In fact, at \nthe very end of the Cold War, because I was in the  ",
      "offset": 4806.16,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "Bush archives. So Gorbachev's in and Bush, Reagan, \nand then Bush are thinking, well, he just looks  ",
      "offset": 4810.84,
      "duration": 7.24
    },
    {
      "lang": "en",
      "text": "like another one of these people and we're not \ngoing to take the propaganda seriously. And then  ",
      "offset": 4818.08,
      "duration": 5.24
    },
    {
      "lang": "en",
      "text": "they sort of go, whoa, whoa, whoa, whoa. And then \nit's in 88 where Bush is going, whoa, maybe it is  ",
      "offset": 4823.32,
      "duration": 7.44
    },
    {
      "lang": "en",
      "text": "going to end. And then the United States teams \nup with Helmut Kohl of Germany to do the fastest  ",
      "offset": 4830.76,
      "duration": 7.88
    },
    {
      "lang": "en",
      "text": "get the Russians out of Eastern Europe ever. But \nGorbachev is the one who wants to cooperate with  ",
      "offset": 4838.64,
      "duration": 6.64
    },
    {
      "lang": "en",
      "text": "the West. One thing you should know about warfare, \nyou think the winners win it. No, actually,  ",
      "offset": 4845.28,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "it's when the losers decide they've had enough. \nThat's when a war ends. Otherwise it doesn't end.  ",
      "offset": 4849.88,
      "duration": 5.52
    },
    {
      "lang": "en",
      "text": "So the Russians got sick of it and they quit.\nI wonder if there's a lesson in here for what  ",
      "offset": 4855.4,
      "duration": 6.2
    },
    {
      "lang": "en",
      "text": "people call the “Cold War with China” today, where \npeople think it's really competitive, China might  ",
      "offset": 4861.6,
      "duration": 4.28
    },
    {
      "lang": "en",
      "text": "have a bigger economy than us soon. And really, \nif you actually got to see what's happening day  ",
      "offset": 4865.88,
      "duration": 3.56
    },
    {
      "lang": "en",
      "text": "to day in China, maybe you might decide, like the \nSoviet Union, there's a bunch of things broken  ",
      "offset": 4869.44,
      "duration": 3.72
    },
    {
      "lang": "en",
      "text": "with it. They're not really competitive in the \nlong run economically. And so we're going to win. ",
      "offset": 4873.16,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "Well, I don't know, win, lose. But they have a \nvery low per capita standard of living. Do the  ",
      "offset": 4877.76,
      "duration": 5.56
    },
    {
      "lang": "en",
      "text": "math. You go, yeah, they've got a big economy \nbecause they're, they're not a third of the  ",
      "offset": 4883.32,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "world's population now, but it's, it's huge. \nAnd divide the 1.3 billion, whatever it is,  ",
      "offset": 4887.48,
      "duration": 7.44
    },
    {
      "lang": "en",
      "text": "you come up with a low number for per capita \nstandard of living. And I think for human beings,  ",
      "offset": 4894.92,
      "duration": 4.84
    },
    {
      "lang": "en",
      "text": "that's the number that matters, right. \nOf what is your family income look like?  ",
      "offset": 4899.76,
      "duration": 6.48
    },
    {
      "lang": "en",
      "text": "So they got a long way to go on that one.\nI want to go back to Kissinger in 1971. So  ",
      "offset": 4906.24,
      "duration": 8.44
    },
    {
      "lang": "en",
      "text": "because they want somebody to like, send the \nmessage along to China to open up, they shut  ",
      "offset": 4914.68,
      "duration": 6.28
    },
    {
      "lang": "en",
      "text": "up about Pakistan's genocide. In Bangladesh, where \nnumbers vary, but somewhere between 300,000 and 3  ",
      "offset": 4920.96,
      "duration": 6.32
    },
    {
      "lang": "en",
      "text": "million people died.\nIt's awful. ",
      "offset": 4927.28,
      "duration": 1.4
    },
    {
      "lang": "en",
      "text": "Hundreds of thousands of people were \nraped. I know they didn't have email  ",
      "offset": 4928.68,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "back when there was no other way to get the \nmessage across. You have to abet a genocide  ",
      "offset": 4933.24,
      "duration": 3.88
    },
    {
      "lang": "en",
      "text": "in order to get a message across to Mao.\nWell, first of all, the Cold War is a  ",
      "offset": 4937.12,
      "duration": 4.96
    },
    {
      "lang": "en",
      "text": "misnomer because the bloodshed in the third world \nwas horrendous. And I will eventually compile the  ",
      "offset": 4942.08,
      "duration": 7.28
    },
    {
      "lang": "en",
      "text": "stats on this. Not that they're great stats, but \nit's obscene numbers. I think Congo had a civil  ",
      "offset": 4949.36,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "war where literally over 10 million people died. \nAnd that's only just one of these things. So the  ",
      "offset": 4955.44,
      "duration": 6.4
    },
    {
      "lang": "en",
      "text": "United States cannot deal with all of these. \nAnd if you think about it, the time when the  ",
      "offset": 4961.84,
      "duration": 6.48
    },
    {
      "lang": "en",
      "text": "United States was really quite idealistic, \nthe Iraq war, goes in, they create democracy  ",
      "offset": 4968.32,
      "duration": 6.52
    },
    {
      "lang": "en",
      "text": "in this place. It's a massive civil war, and then \nwe're blamed for it. So be careful about where you  ",
      "offset": 4974.84,
      "duration": 7.08
    },
    {
      "lang": "en",
      "text": "intervene because you may not be able to stop a \nthing and then you'll get blamed for what's going  ",
      "offset": 4981.92,
      "duration": 5.76
    },
    {
      "lang": "en",
      "text": "on. So Bangladesh is horrible, but it is not our \nfault. You will get overextended if you intervene  ",
      "offset": 4987.68,
      "duration": 8.56
    },
    {
      "lang": "en",
      "text": "in everything under the planet. Also, there's a \nquestion of why the United States or anyone should  ",
      "offset": 4996.24,
      "duration": 4.4
    },
    {
      "lang": "en",
      "text": "be doing all of it. Shouldn't it be through the UN \nand other things? The really key thing was winning  ",
      "offset": 5000.64,
      "duration": 6.04
    },
    {
      "lang": "en",
      "text": "the Cold War. So Nixon absolutely did prioritize \ngetting the mail through to Mao. He did. So 1971,  ",
      "offset": 5006.68,
      "duration": 8.44
    },
    {
      "lang": "en",
      "text": "good old Henry, “Hack”, as he's known in the \narchives, Henry A. Kissinger. He gets his secret  ",
      "offset": 5015.12,
      "duration": 6.52
    },
    {
      "lang": "en",
      "text": "trip in there, lines up Nixon's trip in ‘72, and \nthen it's going to overextend Russia in the Cold  ",
      "offset": 5021.64,
      "duration": 6.72
    },
    {
      "lang": "en",
      "text": "War. Why? Because with this Sino, Soviet split \nand all the rest of it, Russia has to militarize  ",
      "offset": 5028.36,
      "duration": 6.92
    },
    {
      "lang": "en",
      "text": "its entire border with China. It's already \nmilitarized its entire border with Europe.  ",
      "offset": 5035.28,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "Right. Think about this. And you're talking about \nmechanized nuclear armed forces with all the tanks  ",
      "offset": 5040.96,
      "duration": 6.36
    },
    {
      "lang": "en",
      "text": "and everything else that goes with them. It is not \ncheap. Imagine if the United States had to do this  ",
      "offset": 5047.32,
      "duration": 4.28
    },
    {
      "lang": "en",
      "text": "on our Canadian and Mexican borders. Bankrupting, \nright? And we're a lot richer than they are. So  ",
      "offset": 5051.6,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "we team up with China, we provide them all kinds \nof naval technology, which is not going to bother  ",
      "offset": 5057.68,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "us. They give us listening posts again, we \nlove listening posts right up on the Russian  ",
      "offset": 5063.4,
      "duration": 7.04
    },
    {
      "lang": "en",
      "text": "border. And the Russians are scared stiff of the \nChinese. The Chinese with good military equipment,  ",
      "offset": 5070.44,
      "duration": 4.28
    },
    {
      "lang": "en",
      "text": "that wouldn't be a good thing for them.\nWhen I asked how was President and he  ",
      "offset": 5074.72,
      "duration": 4.36
    },
    {
      "lang": "en",
      "text": "built these bases in Pakistan to have the U2 \nplanes go to Russia. We had bases in Turkey,  ",
      "offset": 5079.08,
      "duration": 5.12
    },
    {
      "lang": "en",
      "text": "we had bases in Japan, we had bases in a lot of \nother places in Europe. This marginal increase in  ",
      "offset": 5084.2,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "coverage, was it really worth breaking off the \nalliance with India or like pissing off India? ",
      "offset": 5090.04,
      "duration": 5.48
    },
    {
      "lang": "en",
      "text": "Oh, yeah, yeah, yeah, sorry, India. I think at the \ntime people felt we absolutely have to be able to  ",
      "offset": 5095.52,
      "duration": 7.44
    },
    {
      "lang": "en",
      "text": "cover everything. And I don't know the details \nof where they had their nuclear this and that  ",
      "offset": 5102.96,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "stored and things and all their testing areas. \nBut I'm sure you needed to have the entire place  ",
      "offset": 5108.4,
      "duration": 5.48
    },
    {
      "lang": "en",
      "text": "covered. And so, yeah, it was very serious on \nthese nuclear weapons. They can reach the United  ",
      "offset": 5113.88,
      "duration": 6.72
    },
    {
      "lang": "en",
      "text": "States. So we had better know what's going on.\nSo new books about the Cold War are coming out  ",
      "offset": 5120.6,
      "duration": 6.44
    },
    {
      "lang": "en",
      "text": "all the time. New books about World War II are \ncoming out all the time. People are writing like  ",
      "offset": 5127.04,
      "duration": 3.88
    },
    {
      "lang": "en",
      "text": "thousands of papers about this stuff all the time. \nHow much new stuff are we learning every year?  ",
      "offset": 5130.92,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "All these scholars are still setting this up. \nWhat kinds of new things do we keep unearthing? ",
      "offset": 5135.48,
      "duration": 4.24
    },
    {
      "lang": "en",
      "text": "Well, I'm personally sick of writing about \nWorld War II. I've done enough of it and so I'm  ",
      "offset": 5139.72,
      "duration": 8.64
    },
    {
      "lang": "en",
      "text": "personally not going in that direction. Yeah, it's \nendless. I think for a lot of the books of these  ",
      "offset": 5148.36,
      "duration": 4.8
    },
    {
      "lang": "en",
      "text": "narrative feel good histories. Like I'll tell you \nabout some Regimen and all the heroic stuff they  ",
      "offset": 5153.16,
      "duration": 5.16
    },
    {
      "lang": "en",
      "text": "did. And it's nice, light, airplane read. And a \nlot of people like that stuff. I personally like  ",
      "offset": 5158.32,
      "duration": 5.24
    },
    {
      "lang": "en",
      "text": "things where I learn things that are conceptual \nthat I can then apply to other problems which  ",
      "offset": 5163.56,
      "duration": 5.64
    },
    {
      "lang": "en",
      "text": "those books wouldn't help me, but that's just me.\nHow do you decide which are the good history  ",
      "offset": 5169.2,
      "duration": 3.68
    },
    {
      "lang": "en",
      "text": "books and which aren't? You're just \non Amazon. You can't like, read it  ",
      "offset": 5172.88,
      "duration": 3.2
    },
    {
      "lang": "en",
      "text": "yet. You're just like, looking out on Amazon.\nIt's hard. What I would say is give it a book.  ",
      "offset": 5176.08,
      "duration": 4.84
    },
    {
      "lang": "en",
      "text": "The 30 second test. And what's that? If the book's \nabout another part of the world, flip through  ",
      "offset": 5180.92,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "the bibliography, which you can do on Amazon, and \nzing through there for about 30 seconds and see is  ",
      "offset": 5186.72,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "there anything in the language of the country in \nquestion in the bibliography, like, how much? And  ",
      "offset": 5192.44,
      "duration": 6.16
    },
    {
      "lang": "en",
      "text": "if there is zip, I would toss it. I'm curious how \nmany of you would be interested in reading a book  ",
      "offset": 5198.6,
      "duration": 7.68
    },
    {
      "lang": "en",
      "text": "that says it knows everything about the United \nStates and there's not a single English source  ",
      "offset": 5206.28,
      "duration": 4.2
    },
    {
      "lang": "en",
      "text": "cited? I think you'd regard the book as garbage, \nand that Americans do this routinely. And it's a  ",
      "offset": 5210.48,
      "duration": 6.48
    },
    {
      "lang": "en",
      "text": "problem with political science degrees where it \nwould be very easy to require anyone who's going  ",
      "offset": 5216.96,
      "duration": 5.96
    },
    {
      "lang": "en",
      "text": "to do a specialty in comparative politics or IR \ninternational relations that, hey, you need to  ",
      "offset": 5222.92,
      "duration": 6.68
    },
    {
      "lang": "en",
      "text": "pass a language test. And don't try Spanish if \nyou think you're going to talk about the Middle  ",
      "offset": 5229.6,
      "duration": 4
    },
    {
      "lang": "en",
      "text": "east. Right? If it's going to be Middle east, it \nbetter be something like Arabic, Farsi, Turkic,  ",
      "offset": 5233.6,
      "duration": 6.48
    },
    {
      "lang": "en",
      "text": "Hebrew. And better yet, if you're really going to \nbe a serious Middle Eastern expert, try all four.  ",
      "offset": 5240.08,
      "duration": 4.04
    },
    {
      "lang": "en",
      "text": "Right? I mean, that would be true expertise and \nwhere you can read books in the language and get  ",
      "offset": 5245.88,
      "duration": 9.24
    },
    {
      "lang": "en",
      "text": "what other people are thinking about things. \nSo that would be my basic is find people who  ",
      "offset": 5255.12,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "aren't playing half court tennis all about \nTeam America. Get to the other side of the  ",
      "offset": 5260.96,
      "duration": 3.48
    },
    {
      "lang": "en",
      "text": "net and try and figure out what other people \nare thinking. Doesn't mean you have to agree  ",
      "offset": 5264.44,
      "duration": 3.04
    },
    {
      "lang": "en",
      "text": "with them, but it means you are making the \neffort to see where they’re coming from. ",
      "offset": 5267.48,
      "duration": 5.12
    },
    {
      "lang": "en",
      "text": "During the Cold War, all these proxy \nwars, was it good that we were just  ",
      "offset": 5272.6,
      "duration": 3.48
    },
    {
      "lang": "en",
      "text": "like letting off steam in these smaller ways and \ntherefore we could avoid the bigger great War? ",
      "offset": 5276.08,
      "duration": 5.32
    },
    {
      "lang": "en",
      "text": "It wasn't letting off steam. It was horrendous. \nI don't know the answer. In fact, my current  ",
      "offset": 5281.4,
      "duration": 7.44
    },
    {
      "lang": "en",
      "text": "project is a history of the Cold War and I've \nread a lot of things and I will, I'm going to  ",
      "offset": 5288.84,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "compile a lot of tables on things like this. Just \nputting the data together, it'll take a long time,  ",
      "offset": 5293.92,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "but then when you get the table, it'll be a \nreally quick, really quick skim. So if you've got  ",
      "offset": 5298.52,
      "duration": 5.6
    },
    {
      "lang": "en",
      "text": "a civil war turning somewhere in Latin America \nor somewhere in Africa, so no one's aiding it,  ",
      "offset": 5305.72,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "fine. Then if you have Russia put its finger \non the scale, then of course we're going to  ",
      "offset": 5311.8,
      "duration": 5.2
    },
    {
      "lang": "en",
      "text": "put our finger on the scale. So that means the \nRussians are providing industrial age weapons,  ",
      "offset": 5317,
      "duration": 5.2
    },
    {
      "lang": "en",
      "text": "we're providing Industrial age weapons. What \nhappens? Casualties just go through the roof.  ",
      "offset": 5322.2,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "And that's what went on through the Cold \nWar. And then there was this magical inner  ",
      "offset": 5327.08,
      "duration": 5.6
    },
    {
      "lang": "en",
      "text": "Cold War period when all that stopped. And \nthat's when you get this tremendous growth  ",
      "offset": 5332.68,
      "duration": 4.4
    },
    {
      "lang": "en",
      "text": "across the third World because there aren't \nthese insurgencies just tearing up wealth. ",
      "offset": 5337.08,
      "duration": 6.12
    },
    {
      "lang": "en",
      "text": "And then you could see recently, look \nat North Africa – it's a mess right now,  ",
      "offset": 5343.2,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "right? It's both ISIS or whatever it is in there \ndoing its stuff, and then you have Wagner group  ",
      "offset": 5347.88,
      "duration": 5.36
    },
    {
      "lang": "en",
      "text": "or whatever they are in there, and then you have \nthe Chinese further south and everybody's feeling  ",
      "offset": 5353.24,
      "duration": 5.56
    },
    {
      "lang": "en",
      "text": "everything. You got civil war all over the place. \nAnd then that means military age males want to get  ",
      "offset": 5358.8,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "out because people kill you, right? Or they'll \neither dragoon you into fighting where you don't  ",
      "offset": 5364.88,
      "duration": 4.44
    },
    {
      "lang": "en",
      "text": "want to fight, or they'll just kill you outright. \nSo they're all trying to get into boats to Europe,  ",
      "offset": 5369.32,
      "duration": 3.84
    },
    {
      "lang": "en",
      "text": "which is destabilizing. It's a mess. We're in \nthe second Cold War and this is part of it. ",
      "offset": 5373.16,
      "duration": 5.64
    },
    {
      "lang": "en",
      "text": "What was the biggest, when you're doing this \nproject on the Cold War, what were the biggest  ",
      "offset": 5378.8,
      "duration": 3.12
    },
    {
      "lang": "en",
      "text": "miscalculations that people were making? \nWere they too suspicious of the other side?  ",
      "offset": 5381.92,
      "duration": 3.64
    },
    {
      "lang": "en",
      "text": "Were they not suspicious enough? Were they too \nconcerned about bases or what were they missing? ",
      "offset": 5385.56,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "I need to think more about that because I think \nthere are probably all sorts of things. And  ",
      "offset": 5390.16,
      "duration": 4
    },
    {
      "lang": "en",
      "text": "also it's impossible to know the right thing to \ndo. And then afterwards, when it pans, you go,  ",
      "offset": 5394.16,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "well, that was a mess. It's hard to know, but \nI think it was probably a terrible mistake when  ",
      "offset": 5398.76,
      "duration": 7.76
    },
    {
      "lang": "en",
      "text": "Eisenhower thought, here's the Supreme Command \nallied commander of World War II, who knows all  ",
      "offset": 5406.52,
      "duration": 6.44
    },
    {
      "lang": "en",
      "text": "about hot wars, doesn't want to do that. When the \nUnited States deposes Mosaddegh in Iran in 1954,  ",
      "offset": 5412.96,
      "duration": 7.6
    },
    {
      "lang": "en",
      "text": "I could see Eisenhower's view as, hey, we're \njust deposing one guy and we're going to avoid  ",
      "offset": 5420.56,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "the Russians taking oil fields here, etc. And \nhe thinks that's a better trade off. Well, the  ",
      "offset": 5425.64,
      "duration": 6
    },
    {
      "lang": "en",
      "text": "Iranians have never forgotten that they're furious \nto this day. Wouldn't you be if you're Iranian?  ",
      "offset": 5431.64,
      "duration": 5.28
    },
    {
      "lang": "en",
      "text": "Mosaddegh was democratically elected. Or another \ntime, actually, in Vietnam, we didn't want to  ",
      "offset": 5436.92,
      "duration": 9.8
    },
    {
      "lang": "en",
      "text": "hold, we didn't push the South Vietnamese to hold \nelections because we knew Ho Chi Minh would win.  ",
      "offset": 5446.72,
      "duration": 6.24
    },
    {
      "lang": "en",
      "text": "He was the only national figure in Vietnam. So \nthe United States is all about free elections. The  ",
      "offset": 5452.96,
      "duration": 5.96
    },
    {
      "lang": "en",
      "text": "Vietnamese could have run a free election and Ho \nChi Minh would have won. That was our assessment,  ",
      "offset": 5458.92,
      "duration": 4.36
    },
    {
      "lang": "en",
      "text": "that he would win. Okay, well, if you're for free \nelections, it means you don't get the outcome you  ",
      "offset": 5463.28,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "want. And I wonder if that wasn't a terrible \nmistake, because the Vietnamese actually can't  ",
      "offset": 5467.84,
      "duration": 6.28
    },
    {
      "lang": "en",
      "text": "stand the Chinese. So they were always going to \nbe a counterbalance to the Chinese. But due to the  ",
      "offset": 5474.12,
      "duration": 6.64
    },
    {
      "lang": "en",
      "text": "McCarthy era, we purged all of our China experts. \nAll these children of missionaries who knew a  ",
      "offset": 5480.76,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "great deal about China, less so about Vietnam, \nbut at least it's a related cultural group. So  ",
      "offset": 5486.2,
      "duration": 4.8
    },
    {
      "lang": "en",
      "text": "we had gotten rid of all that expertise in the \nMcCarthy era. So we're running blind in Asia. ",
      "offset": 5491,
      "duration": 7.96
    },
    {
      "lang": "en",
      "text": "What you just mentioned about the fact that we \nwould curtail what kinds of elections you can  ",
      "offset": 5498.96,
      "duration": 3.76
    },
    {
      "lang": "en",
      "text": "hold in these countries after Germany and \nJapan surrendered, if they tried to elect  ",
      "offset": 5502.72,
      "duration": 5.52
    },
    {
      "lang": "en",
      "text": "another fascist party, we wouldn't have been like, \nall right, well, that's what you guys voted for.  ",
      "offset": 5508.24,
      "duration": 3.4
    },
    {
      "lang": "en",
      "text": "They're in charge now. We would have, you know. \nAnd so why is the principle different in Vietnam? ",
      "offset": 5511.64,
      "duration": 4.72
    },
    {
      "lang": "en",
      "text": "Because the South Vietnamese would have voted \nfor them as well. We've just been fighting a  ",
      "offset": 5516.36,
      "duration": 5.2
    },
    {
      "lang": "en",
      "text": "massive war with Japan and Germany. There's no \nway we're going to let the Germans and Japanese  ",
      "offset": 5521.56,
      "duration": 5.96
    },
    {
      "lang": "en",
      "text": "decide anything initially. But what we did \ndo for both Germany, our half, West Germany,  ",
      "offset": 5527.52,
      "duration": 8.48
    },
    {
      "lang": "en",
      "text": "and Japan is we did our best to set up democratic \ninstitutions that within a cycle or two, they're  ",
      "offset": 5536,
      "duration": 6.48
    },
    {
      "lang": "en",
      "text": "making their decisions, whom they're electing, we \nare not choosing their leaders. And it was a very  ",
      "offset": 5542.48,
      "duration": 4.84
    },
    {
      "lang": "en",
      "text": "generous peace. It was realizing In World War \nI, ostracizing Germans, ostracizing Russians,  ",
      "offset": 5547.32,
      "duration": 8.44
    },
    {
      "lang": "en",
      "text": "it probably doesn't. You need to bring \nthem back into the family of nations,  ",
      "offset": 5555.76,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "because they're on the planet. They're not leaving \nthe planet. And the generous peace with Germany,  ",
      "offset": 5560.84,
      "duration": 5.32
    },
    {
      "lang": "en",
      "text": "look at them. They're the most wonderful \nallies, as are the Japanese. They're terrific. ",
      "offset": 5566.16,
      "duration": 4.84
    },
    {
      "lang": "en",
      "text": "During the Cold War, the USSR is constantly \nfunding these communist parties around the world,  ",
      "offset": 5571,
      "duration": 6.12
    },
    {
      "lang": "en",
      "text": "and these parties are doing, like, exactly \ntheir bidding. Whatever Stalin says they'll do. ",
      "offset": 5579.08,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "I don't know about that.\nYeah, Feel free to clarify, but it doesn't feel  ",
      "offset": 5583.24,
      "duration": 3.72
    },
    {
      "lang": "en",
      "text": "like any other country managed to pull this off. \nThere's not like an American party in the French  ",
      "offset": 5586.96,
      "duration": 3.72
    },
    {
      "lang": "en",
      "text": "parliament that does exactly what the president \nwould tell them to do. How did they pull this off? ",
      "offset": 5590.68,
      "duration": 3.44
    },
    {
      "lang": "en",
      "text": "I don't think it's that they did exactly what \nanyone wanted. What the Communists have is  ",
      "offset": 5594.12,
      "duration": 6.96
    },
    {
      "lang": "en",
      "text": "a really powerful doctrine for how you go from \nnothing to something in a failing state. How you  ",
      "offset": 5601.08,
      "duration": 9.28
    },
    {
      "lang": "en",
      "text": "start out with a bunch of people on some campus. \nMao literally starts out as a junior librarian in  ",
      "offset": 5610.36,
      "duration": 5.36
    },
    {
      "lang": "en",
      "text": "Beijing University. So I don't know, he's there \nwith the librarians, I don't know the ladies. Who  ",
      "offset": 5615.72,
      "duration": 4.24
    },
    {
      "lang": "en",
      "text": "knows what it is? It's probably guys in those \ndays. And then he's turning these people into  ",
      "offset": 5619.96,
      "duration": 4.96
    },
    {
      "lang": "en",
      "text": "cadres and eventually to guerrillas and eventually \nconventional army. But they have a really good  ",
      "offset": 5624.92,
      "duration": 5.36
    },
    {
      "lang": "en",
      "text": "program that works the world over, and it's very \neffective for taking power within a broken state.  ",
      "offset": 5630.28,
      "duration": 8.56
    },
    {
      "lang": "en",
      "text": "It's lousy at producing prosperity thereafter. \nRight. And you look at the Communist Party today,  ",
      "offset": 5638.84,
      "duration": 5.52
    },
    {
      "lang": "en",
      "text": "they're really good at staying in power. For \na while there, under Deng Xiaoping, it ran in  ",
      "offset": 5644.36,
      "duration": 5.24
    },
    {
      "lang": "en",
      "text": "parallel what the economic reforms needed to be to \nproduce wealth and what the Party needed in order  ",
      "offset": 5649.6,
      "duration": 6.44
    },
    {
      "lang": "en",
      "text": "to be more powerful. But now that's running \nat cross purposes, because for the party to  ",
      "offset": 5656.04,
      "duration": 6.04
    },
    {
      "lang": "en",
      "text": "maintain its monopoly, well, all these much more \neducated Chinese aren't going to be interested  ",
      "offset": 5662.08,
      "duration": 4.64
    },
    {
      "lang": "en",
      "text": "in that anymore. And so it's time to lock those \npeople up. And then you're going to have trouble  ",
      "offset": 5666.72,
      "duration": 5.24
    },
    {
      "lang": "en",
      "text": "with keeping your economic growth rate going.\nMao dies, and immediately things improve. China  ",
      "offset": 5671.96,
      "duration": 8.56
    },
    {
      "lang": "en",
      "text": "experiences its growth trajectory. Stalin dies, \nand you know Khrushchev is not a teddy bear,  ",
      "offset": 5680.52,
      "duration": 6.2
    },
    {
      "lang": "en",
      "text": "but at least you cut down the Gulag system. And \nso it does seem like if you have an especially  ",
      "offset": 5686.72,
      "duration": 4.76
    },
    {
      "lang": "en",
      "text": "bad dictator, you do have this sort of regression \nto the mean, where the next guy's probably not as  ",
      "offset": 5691.48,
      "duration": 4.4
    },
    {
      "lang": "en",
      "text": "bad as the worst guy who's ever been in charge of \nthe country. And I wonder if that implies that,  ",
      "offset": 5695.88,
      "duration": 3.96
    },
    {
      "lang": "en",
      "text": "you know, if we got rid of Kim Jong \nUn or the Ayatollah or something,  ",
      "offset": 5699.84,
      "duration": 3.52
    },
    {
      "lang": "en",
      "text": "the next guy probably won't be as bad.\nI don't know. But I think iconic leaders  ",
      "offset": 5703.36,
      "duration": 5.6
    },
    {
      "lang": "en",
      "text": "like Mao and Stalin, they were canonized by \nwinning their wars, Stalin by winning World War  ",
      "offset": 5708.96,
      "duration": 7.6
    },
    {
      "lang": "en",
      "text": "II. The Russians revered him for doing that. And \nthey had experienced. Every Russian experienced  ",
      "offset": 5716.56,
      "duration": 8.48
    },
    {
      "lang": "en",
      "text": "World War II. It was central to their lives to \nwin that thing. So Stalin is canonized for doing  ",
      "offset": 5725.04,
      "duration": 6.48
    },
    {
      "lang": "en",
      "text": "that. And now the man who puts Humpty Dumpty back \ntogether again when no one else could and then  ",
      "offset": 5731.52,
      "duration": 5.48
    },
    {
      "lang": "en",
      "text": "fights the great powers, capitalist powers, to \na stalemate in Korea, he's again been canonized.  ",
      "offset": 5737,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "Whoever comes after them is not going to have that \nlevel of prestige. It's just going to devolve.  ",
      "offset": 5742.44,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "That's period. And then for the successors \nof Stalin, they were sick of being terrified  ",
      "offset": 5747.32,
      "duration": 6.6
    },
    {
      "lang": "en",
      "text": "about whether they were going to be purged. \nHe kept putting bullets in people's heads,  ",
      "offset": 5753.92,
      "duration": 3.92
    },
    {
      "lang": "en",
      "text": "like Vladimir Putin. You do this long enough \nthat people are horrified and don't want to  ",
      "offset": 5757.84,
      "duration": 6.16
    },
    {
      "lang": "en",
      "text": "have it. They don't want to live that way \nanymore. So there's that piece of it as well. ",
      "offset": 5764,
      "duration": 6.4
    },
    {
      "lang": "en",
      "text": "I guess I'm not sure what the answer is today. \nIf you found out tomorrow that Putin is dead,  ",
      "offset": 5770.4,
      "duration": 4.48
    },
    {
      "lang": "en",
      "text": "is your estimation that things \nare going to improve or get worse? ",
      "offset": 5774.88,
      "duration": 3.48
    },
    {
      "lang": "en",
      "text": "My estimation in that kind of system is there's \ngoing to be a leadership struggle. That's the  ",
      "offset": 5778.88,
      "duration": 4.76
    },
    {
      "lang": "en",
      "text": "problem with dictatorships. They're absolutely \nbrittle. And that's what's wonderful about having  ",
      "offset": 5783.64,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "elections. You just every four years or whatever \nit is, you have an election. Whoever it is,  ",
      "offset": 5788.32,
      "duration": 4.2
    },
    {
      "lang": "en",
      "text": "it's going to be whatever it is. But in these \ndictatorships, no one knows. And so everyone.  ",
      "offset": 5792.52,
      "duration": 6.16
    },
    {
      "lang": "en",
      "text": "So Stalin, literally, I think he didn't show up \nat breakfast. No one wanted to open the door.  ",
      "offset": 5798.68,
      "duration": 8.92
    },
    {
      "lang": "en",
      "text": "And then probably they decided, let's not open the \ndoor. Let's just let that door stay shut for a few  ",
      "offset": 5807.6,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "days. And then when it starts stinking, well, no, \nperfect. So that's how he dies. So you're going to  ",
      "offset": 5812.48,
      "duration": 8.36
    },
    {
      "lang": "en",
      "text": "be guaranteed a free for all. So if there's \na free for all for something like Ukraine,  ",
      "offset": 5820.84,
      "duration": 5.88
    },
    {
      "lang": "en",
      "text": "they will probably have to call that off because \nthey got to focus on Moscow. That's what happened  ",
      "offset": 5826.72,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "with the Korean War. Why is the Korean War and \nStalin dies? Russians want it over because they  ",
      "offset": 5832.52,
      "duration": 5.88
    },
    {
      "lang": "en",
      "text": "got all kinds of unrest. Various prisons in their \nown gulags,they're having riots. They're having,  ",
      "offset": 5838.4,
      "duration": 8.28
    },
    {
      "lang": "en",
      "text": "I think, some Bulgaria, maybe East Germany as \nwell. They got problems. So they don't want  ",
      "offset": 5846.68,
      "duration": 3.88
    },
    {
      "lang": "en",
      "text": "to deal with the Korean War anymore. It’s \nlike, who cares? Forget about it. So you  ",
      "offset": 5850.56,
      "duration": 4.12
    },
    {
      "lang": "en",
      "text": "would be guaranteed that, which might be highly \nbeneficial for Ukraine. But knowing Putin, he's  ",
      "offset": 5854.68,
      "duration": 5
    },
    {
      "lang": "en",
      "text": "an evil man. He'll probably stick around forever.\nWhile you're starting this Cold War history. How  ",
      "offset": 5859.68,
      "duration": 7.12
    },
    {
      "lang": "en",
      "text": "close did we get to a nuclear bomb? Some people \nargue that, like, you know, there were all these  ",
      "offset": 5866.8,
      "duration": 3.96
    },
    {
      "lang": "en",
      "text": "“close miss incidents’. It like, basically \nshould have happened almost in the sense of  ",
      "offset": 5870.76,
      "duration": 3.72
    },
    {
      "lang": "en",
      "text": "like, the odds. And some people say, like, it \nwasn't going…, MAD had worked, it wasn't going  ",
      "offset": 5874.48,
      "duration": 4.52
    },
    {
      "lang": "en",
      "text": "to happen, why would they risk a first strike?\nOh, it's miracle world here. I think in the Cuban  ",
      "offset": 5879,
      "duration": 4.96
    },
    {
      "lang": "en",
      "text": "Missile Crisis, it came down to a Soviet sub \nCaptain. They had like the political commissar,  ",
      "offset": 5883.96,
      "duration": 7.04
    },
    {
      "lang": "en",
      "text": "the military commissar, I have to reread this, \nbut I don't know whether you needed a vote of  ",
      "offset": 5891,
      "duration": 3.96
    },
    {
      "lang": "en",
      "text": "2 out of 3 to launch a nuclear weapon or whether \none guy was senior and you have to get him to come  ",
      "offset": 5894.96,
      "duration": 5.96
    },
    {
      "lang": "en",
      "text": "along. I have to read the data. But basically, \nsomeone put their foot down in the Soviet sub  ",
      "offset": 5900.92,
      "duration": 6.36
    },
    {
      "lang": "en",
      "text": "not to launch a nuke. Okay, we lucked out of that \none. And then I think under Reagan there was an  ",
      "offset": 5907.28,
      "duration": 6.56
    },
    {
      "lang": "en",
      "text": "able Archer missile test, or we were doing a war \ngame or something, and the Russians looked at it  ",
      "offset": 5913.84,
      "duration": 6.68
    },
    {
      "lang": "en",
      "text": "and thought it was the real thing for a while. \nAnd that just scared the bejesus out of them.  ",
      "offset": 5920.52,
      "duration": 4
    },
    {
      "lang": "en",
      "text": "And I think it was after that that Ronald Reagan \nstarted moderating his rhetoric. It's like, whoa,  ",
      "offset": 5924.52,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "you don't want to have them on the edge like \nthis. This is not going to be beneficial. So  ",
      "offset": 5928.68,
      "duration": 4.84
    },
    {
      "lang": "en",
      "text": "it was quite close. The advantage in the \nCold War is all our leaders all the way  ",
      "offset": 5933.52,
      "duration": 7.52
    },
    {
      "lang": "en",
      "text": "through Bush Sr. were all veterans of World War \nI. In one way or another they'd served, some of  ",
      "offset": 5941.04,
      "duration": 6.44
    },
    {
      "lang": "en",
      "text": "them on the battle line like Bush senior had, \nand others near enough so that they understood  ",
      "offset": 5947.48,
      "duration": 6.6
    },
    {
      "lang": "en",
      "text": "how dangerous it was. And like all the Soviet \nleaders, Brezhnev and all those people had seen  ",
      "offset": 5954.08,
      "duration": 6.04
    },
    {
      "lang": "en",
      "text": "all sorts of people be butchered. So they were \ncautious in a way I don't think Vladimir Putin is. ",
      "offset": 5960.12,
      "duration": 5.76
    },
    {
      "lang": "en",
      "text": "Going back to the lecture if it's true \nthat you can't get primary adversaries  ",
      "offset": 5965.88,
      "duration": 3.76
    },
    {
      "lang": "en",
      "text": "to be friends with each other. And if \nyou want to be friends with one of them,  ",
      "offset": 5969.64,
      "duration": 2.32
    },
    {
      "lang": "en",
      "text": "you're going to make enemies of the other one. The \nworld is full of people who are enemies with each  ",
      "offset": 5971.96,
      "duration": 4.8
    },
    {
      "lang": "en",
      "text": "other. Does that mean that at once America can \nonly be friends with half the world? And it's got  ",
      "offset": 5976.76,
      "duration": 4.44
    },
    {
      "lang": "en",
      "text": "to be anyways with the half that this half hates.\nWith India and Pakistan, it was so intense because  ",
      "offset": 5981.2,
      "duration": 6
    },
    {
      "lang": "en",
      "text": "of partition, of so many people who died. And it \nwas recent. Right. ‘47. And so you wouldn't expect  ",
      "offset": 5987.2,
      "duration": 6.88
    },
    {
      "lang": "en",
      "text": "those animosities to die down. And also there are \nnew states trying to establish their legitimacy.  ",
      "offset": 5994.68,
      "duration": 6.24
    },
    {
      "lang": "en",
      "text": "So that was particularly difficult. I \ndon't know that most countries in the  ",
      "offset": 6000.92,
      "duration": 3.2
    },
    {
      "lang": "en",
      "text": "world necessarily want to kill all of their \nneighbors. And then you can look at things:  ",
      "offset": 6004.12,
      "duration": 6.16
    },
    {
      "lang": "en",
      "text": "forever, Britain and France were going at it, and \nthen Germany became the primary problem between  ",
      "offset": 6010.28,
      "duration": 8.8
    },
    {
      "lang": "en",
      "text": "World War I and World War II. So then Britain is \nteaming up with France, its former primary enemy,  ",
      "offset": 6019.08,
      "duration": 5.04
    },
    {
      "lang": "en",
      "text": "and that whole problem goes away. And then you \nhave the generous peace after World War II. Not  ",
      "offset": 6024.12,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "one, World War I was not a generous peace. And \nalso we have the mismanaged Great Depression  ",
      "offset": 6030.2,
      "duration": 5.04
    },
    {
      "lang": "en",
      "text": "that allows fascists to rise all over the place. \nBut after World War II, generosity to the Germans,  ",
      "offset": 6035.24,
      "duration": 8.44
    },
    {
      "lang": "en",
      "text": "it's over. Look at Europe. If you study European \nhistory, they're all trying to butcher each other  ",
      "offset": 6043.68,
      "duration": 5
    },
    {
      "lang": "en",
      "text": "for centuries. And then they realize, what a \nwaste. Let's just trade, play by the rules. ",
      "offset": 6048.68,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "Should we have cut off Lend-Lease aid to \nStalin after 1943, when it's obvious that– ",
      "offset": 6054.16,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "–Bad idea–\n…when it's obvious that they're winning against  ",
      "offset": 6059.84,
      "duration": 2.32
    },
    {
      "lang": "en",
      "text": "the Germans? If you'd done that, then they would \nhave stopped advancing as fast in Eastern Europe. ",
      "offset": 6062.16,
      "duration": 3.96
    },
    {
      "lang": "en",
      "text": "Is that what you're thinking? No, no.\nMore of Europe could have been free earlier on. ",
      "offset": 6066.12,
      "duration": 4.52
    },
    {
      "lang": "en",
      "text": "No, because you're assuming that World War II was \nnot a closely run thing. I think it's a much more  ",
      "offset": 6070.64,
      "duration": 8.6
    },
    {
      "lang": "en",
      "text": "closely run thing than you think. And there's \nno. No one's sure of how it's going to turn  ",
      "offset": 6079.24,
      "duration": 10.2
    },
    {
      "lang": "en",
      "text": "out. Everyone knows if it goes longer, it's more \nof my kids who are dying. So there's no way you  ",
      "offset": 6089.44,
      "duration": 7.36
    },
    {
      "lang": "en",
      "text": "are going to cut aid to the army that's fighting \nWorld War II. All right, here's a concept for you.  ",
      "offset": 6096.8,
      "duration": 7.52
    },
    {
      "lang": "en",
      "text": "There's a main theater in the war. How do I know \nwhat the main theater is? That's where most of  ",
      "offset": 6104.32,
      "duration": 4.48
    },
    {
      "lang": "en",
      "text": "the people fighting are. That's the main front. \nMain theater. Russians fought between 2/3 and 3/4  ",
      "offset": 6108.8,
      "duration": 8.2
    },
    {
      "lang": "en",
      "text": "of the Nazi army, always. That makes the eastern \nfront the main theater. So you all think, Pearl,  ",
      "offset": 6117,
      "duration": 5.76
    },
    {
      "lang": "en",
      "text": "that you all think that the Normandy invasion was \na big deal. No, that is a peripheral operation.  ",
      "offset": 6122.76,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "It is peripheral to the main theater. And if \nthe Russians hadn't been doing Bagration, this  ",
      "offset": 6128.56,
      "duration": 6.56
    },
    {
      "lang": "en",
      "text": "big operation that coincides with Normandy, no way \nwould we ever have gotten onto the continent. And  ",
      "offset": 6135.12,
      "duration": 7.48
    },
    {
      "lang": "en",
      "text": "that's in 1944. So cutting lend-lease aid? Insane. \nBut you're eliminating the problem of fascism  ",
      "offset": 6142.6,
      "duration": 8.88
    },
    {
      "lang": "en",
      "text": "until people have forgotten what fascism meant. \nBut you're left with the problem of communism. ",
      "offset": 6151.48,
      "duration": 6.96
    },
    {
      "lang": "en",
      "text": "By that same logic, look, the main theater \nin the Pacific War was in China, where most  ",
      "offset": 6159.48,
      "duration": 4.76
    },
    {
      "lang": "en",
      "text": "of the fighting was happening. Our Lend Lease \naid to Chiang kai Shek was 1 to 2% of what we  ",
      "offset": 6164.24,
      "duration": 4.84
    },
    {
      "lang": "en",
      "text": "were sending to Stalin. In today's dollars we send \nStalin $1 trillion worth of aid. Just tremendous  ",
      "offset": 6169.08,
      "duration": 8.16
    },
    {
      "lang": "en",
      "text": "amounts of supplies he used to then instil \n“install” meantl a communist totalitarianism  ",
      "offset": 6177.24,
      "duration": 3.24
    },
    {
      "lang": "en",
      "text": "on Eastern Europe. If he had sent a fraction \nof that aid to Chiang Kai Shek, and help us  ",
      "offset": 6180.48,
      "duration": 5.04
    },
    {
      "lang": "en",
      "text": "with the Japanese, maybe we somewhat unclear if \nDwarkesh says “we” or “he” here would still be  ",
      "offset": 6185.52,
      "duration": 1.76
    },
    {
      "lang": "en",
      "text": "in power. We wouldn't have to fight as much.\nWe couldn't get it in. It's because if you  ",
      "offset": 6187.28,
      "duration": 3.56
    },
    {
      "lang": "en",
      "text": "want to deliver Lend-Lease, this is a problem \nin World War I. It's why did Russia fall in  ",
      "offset": 6190.84,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "World War I? Why would you ever let that \nhappen? There's no way to get the aid in  ",
      "offset": 6196.68,
      "duration": 3.96
    },
    {
      "lang": "en",
      "text": "because Russia hadn't built its Murmansk Railway, \nwhich goes way up north. And it hasn't completed  ",
      "offset": 6200.64,
      "duration": 5.52
    },
    {
      "lang": "en",
      "text": "the Trans-Siberian Railway. It doesn't do those \nthings until, Murmansk is early in 1917 and the  ",
      "offset": 6206.16,
      "duration": 7.32
    },
    {
      "lang": "en",
      "text": "Trans-Siberian’s in 1916. That's like right \nbefore the Tsar falls. And so couldn't aid  ",
      "offset": 6213.48,
      "duration": 6.2
    },
    {
      "lang": "en",
      "text": "Russia in World War I. It falls for lack of arms. \nAnd then the blockade that the Japanese did was  ",
      "offset": 6219.68,
      "duration": 7.52
    },
    {
      "lang": "en",
      "text": "really effective. So to get aid in, you need \nrailways and you need ports. The Japanese had  ",
      "offset": 6227.2,
      "duration": 6.36
    },
    {
      "lang": "en",
      "text": "covered all that and they owned all the railway \nsystems. So the only way we could get stuff in  ",
      "offset": 6233.56,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "is we're flying over the hump, the Himalayas. \nOkay, so you're going to fly in aviation fuel  ",
      "offset": 6238.24,
      "duration": 7.64
    },
    {
      "lang": "en",
      "text": "plus the airplanes and then you're going to \ntry to bomb Japan from China. Imagine flying  ",
      "offset": 6245.88,
      "duration": 6.68
    },
    {
      "lang": "en",
      "text": "in aviation fuel. It's like a non-starter. And I \nthink the best argument you can make is, on that,  ",
      "offset": 6252.56,
      "duration": 8.48
    },
    {
      "lang": "en",
      "text": "is that rather than getting Chiang Kai Shek to \ndo the Burma campaign, ‘43–44, and he was dead  ",
      "offset": 6261.04,
      "duration": 8.84
    },
    {
      "lang": "en",
      "text": "against it, is let him keep all that equipment, \nwhatever you got over the hump, instead of  ",
      "offset": 6269.88,
      "duration": 3.84
    },
    {
      "lang": "en",
      "text": "sending it over to Burma, which is strategically \nirrelevant, turns out in this war, let him keep  ",
      "offset": 6273.72,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "everything. Because when the Japanese try to do \nIchigo, it's their biggest offense of the war.  ",
      "offset": 6278.6,
      "duration": 4.28
    },
    {
      "lang": "en",
      "text": "They're going right down through central China \nbecause the United States is cutting off so much  ",
      "offset": 6282.88,
      "duration": 5.16
    },
    {
      "lang": "en",
      "text": "of their maritime stuff, they want to be able to \nhave railways all the way through central China. ",
      "offset": 6288.04,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "Anyway. Chiang Kai-shek gets wrecked in that. \nMaybe if more of the equipment had been available  ",
      "offset": 6293.48,
      "duration": 5.88
    },
    {
      "lang": "en",
      "text": "to him, maybe, maybe he would have been in better \nshape to then put on a better showing in the civil  ",
      "offset": 6299.36,
      "duration": 8.16
    },
    {
      "lang": "en",
      "text": "war. Also not look to the Chinese people as like a \nserial loser. And it's not his fault. It's because  ",
      "offset": 6307.52,
      "duration": 6.68
    },
    {
      "lang": "en",
      "text": "he's an unindustrialized country trying to deal \nwith the Japanese. Whom we found very difficult  ",
      "offset": 6314.2,
      "duration": 4.48
    },
    {
      "lang": "en",
      "text": "to fight. So why wouldn't he find them difficult.\nBut we kept Lend-Lease going even after Berlin had  ",
      "offset": 6318.68,
      "duration": 5.96
    },
    {
      "lang": "en",
      "text": "fallen and Stalin used that aid in order to. \nEven after the first atomic bomb is dropped,  ",
      "offset": 6324.64,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "only then does Stalin break the non aggression \npact with Japan and invade Manchuria. So he  ",
      "offset": 6330.08,
      "duration": 6.52
    },
    {
      "lang": "en",
      "text": "basically had no moral right to Manchuria. \nIt was the Chinese who had been doing all  ",
      "offset": 6336.6,
      "duration": 2.76
    },
    {
      "lang": "en",
      "text": "the fighting. And he gets Manchuria. Should \nhave stopped the Lend Lease by then. Right?  ",
      "offset": 6339.36,
      "duration": 4
    },
    {
      "lang": "en",
      "text": "Just to make sure like Chiang Kai Shek…\nI think we stopped it very rapidly at the  ",
      "offset": 6343.36,
      "duration": 3.72
    },
    {
      "lang": "en",
      "text": "end of the war. So, yeah, the British were \nappalled how rapidly the Lend Lease aid  ",
      "offset": 6347.08,
      "duration": 5.96
    },
    {
      "lang": "en",
      "text": "stopped because they desperately needed it \nbecause they'd been wrecked by the war. So yeah,  ",
      "offset": 6353.04,
      "duration": 4.64
    },
    {
      "lang": "en",
      "text": "we did cut it off, but I don't, you definitely \nwant Nazi Germany gone and you want to keep  ",
      "offset": 6357.68,
      "duration": 8.08
    },
    {
      "lang": "en",
      "text": "support Russia until that happens.\nCan I try another idea on you? ",
      "offset": 6365.76,
      "duration": 5.36
    },
    {
      "lang": "en",
      "text": "Yeah.\nSo it seems like one of the big achievements  ",
      "offset": 6371.12,
      "duration": 2.84
    },
    {
      "lang": "en",
      "text": "of modernity is that we get countries to stop \ncaring about history. The idea is like, look, if  ",
      "offset": 6373.96,
      "duration": 7.92
    },
    {
      "lang": "en",
      "text": "you hear people talk about the Israeli-Palestinian \nconflict on both sides, they'll go back like two,  ",
      "offset": 6381.88,
      "duration": 4
    },
    {
      "lang": "en",
      "text": "three thousand years about who has rights. On \nthe Tucker Carlson interview, Putin was talking  ",
      "offset": 6385.88,
      "duration": 3.8
    },
    {
      "lang": "en",
      "text": "about things that happened in like 500 BC. And \nthen so the big achievement is just like, look,  ",
      "offset": 6389.68,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "the past is the past. Whatever the borders \nare right now, we're going to enforce those.  ",
      "offset": 6394.36,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "We don't care who claims to have rights to it \nbecause of what happened in 1700s or something. ",
      "offset": 6398.52,
      "duration": 4.4
    },
    {
      "lang": "en",
      "text": "That is modern international law. And I don't know \nwhat. You'd have to be a lawyer. That's probably  ",
      "offset": 6402.92,
      "duration": 4.72
    },
    {
      "lang": "en",
      "text": "a lawyer who actually knows of when you decide \nmodern international law begins. But certainly  ",
      "offset": 6407.64,
      "duration": 5.2
    },
    {
      "lang": "en",
      "text": "by the time you're getting through World Wars, \nwe're in modern international law. And that's the  ",
      "offset": 6413.36,
      "duration": 5.32
    },
    {
      "lang": "en",
      "text": "problem with what Putin's, his magic he's working \non Ukraine, is they signed multiple times at the  ",
      "offset": 6418.68,
      "duration": 6.76
    },
    {
      "lang": "en",
      "text": "breakup of the Soviet Union and then afterwards \nwhat Ukraine's borders were and they're violating  ",
      "offset": 6425.44,
      "duration": 4.8
    },
    {
      "lang": "en",
      "text": "all of that. Well, have fun with it, because \nthe Chinese can play that game in reverse on  ",
      "offset": 6430.24,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "Siberia and we'll see how happily that one ends. \nBut I think there is a realization that these  ",
      "offset": 6434.4,
      "duration": 8.72
    },
    {
      "lang": "en",
      "text": "disputes go back forever. And it's like musical \nchairs. We're now freezing whatever chair you're  ",
      "offset": 6443.12,
      "duration": 5.6
    },
    {
      "lang": "en",
      "text": "in. That's it. And that's modern international \nlaw. And it turns out that those countries that  ",
      "offset": 6448.72,
      "duration": 6.68
    },
    {
      "lang": "en",
      "text": "focus on territory of ripping it off from someone \nelse or… it's negative sum, you're going to fight  ",
      "offset": 6455.4,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "over it, you're going to destroy it in the \nprocess, whatever. And the Europeans are a  ",
      "offset": 6461.48,
      "duration": 6.28
    },
    {
      "lang": "en",
      "text": "great example to us all of just call it a day. \nLet everybody travel, go get a rental property  ",
      "offset": 6467.76,
      "duration": 6.76
    },
    {
      "lang": "en",
      "text": "somewhere. Right. And run your businesses. \nYou really don't need to own Luxembourg or  ",
      "offset": 6474.52,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "whatever it is. What a hassle. You want to offload \ntheir crazy domestic problems anyway and just run  ",
      "offset": 6480.2,
      "duration": 6.72
    },
    {
      "lang": "en",
      "text": "your transactions. This is the miracle of the \nrules based order. It is the only way to have  ",
      "offset": 6486.92,
      "duration": 8.2
    },
    {
      "lang": "en",
      "text": "a compounded, rapid, compounded growth. And you \ngo, well, how's it possible that China had this  ",
      "offset": 6498.12,
      "duration": 6.32
    },
    {
      "lang": "en",
      "text": "rapid growth for a while? And their dictatorship, \nhow'd that work? It's because they had the growth  ",
      "offset": 6504.44,
      "duration": 4.52
    },
    {
      "lang": "en",
      "text": "when they cooperated with the international order. \nWhen they rejoined the family of nations. Yeah.  ",
      "offset": 6508.96,
      "duration": 4.84
    },
    {
      "lang": "en",
      "text": "That's when they, they prospered. When now Xi \nJinping is going to do a U turn on that. Have fun. ",
      "offset": 6513.8,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "The real motivation for the CCP is to keep itself \nin power. It's not a democratic system. And if  ",
      "offset": 6523.16,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "keeping yourself in power doesn't align with \nmaking your country rich and therefore staying  ",
      "offset": 6529.24,
      "duration": 3.68
    },
    {
      "lang": "en",
      "text": "in the international order, if that is a correct \nmental model, then like what's the pitch to Xi?  ",
      "offset": 6532.92,
      "duration": 4.96
    },
    {
      "lang": "en",
      "text": "Why should he abide by the international \norder? Because we want him to abide by the  ",
      "offset": 6537.88,
      "duration": 2.56
    },
    {
      "lang": "en",
      "text": "international order, right?. And if the idea is \nlike, well, it's not going to work out for you… ",
      "offset": 6540.44,
      "duration": 3
    },
    {
      "lang": "en",
      "text": "I don’t think it will work out \nfor him or for the Chinese people. ",
      "offset": 6545.12,
      "duration": 2.96
    },
    {
      "lang": "en",
      "text": "That's not a great sales pitch.\nYeah, but there are things that you just  ",
      "offset": 6548.08,
      "duration": 3.32
    },
    {
      "lang": "en",
      "text": "cannot convince other people. Another key thing \nin strategy is you can have a very worthy goal,  ",
      "offset": 6551.4,
      "duration": 8.92
    },
    {
      "lang": "en",
      "text": "but you need to look at it carefully and go, \nis it feasible? I don't think it's feasible to  ",
      "offset": 6560.32,
      "duration": 5
    },
    {
      "lang": "en",
      "text": "make Xi Jinping change his mind. Because he's \nof a particular background and this is what  ",
      "offset": 6565.32,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "he believes. And he has a whole bunch of other \nChinese people around him who believe the same  ",
      "offset": 6571.4,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "thing. And we're going to second Cold War. It's \ngoing to be a long wait ‘til they change their  ",
      "offset": 6577.12,
      "duration": 5.28
    },
    {
      "lang": "en",
      "text": "mind. If you think about Gorbachev's generation, \nthey decided Gorbachev said over and over again,  ",
      "offset": 6582.4,
      "duration": 6.04
    },
    {
      "lang": "en",
      "text": "we cannot live like this anymore. The realization \nis that their standard of living was lousy  ",
      "offset": 6588.44,
      "duration": 7.52
    },
    {
      "lang": "en",
      "text": "compared to the west. So clearly they needed to \nreform and do things. But that was his decision  ",
      "offset": 6595.96,
      "duration": 6.24
    },
    {
      "lang": "en",
      "text": "and his generation's decision to reassess and do \nsomething else. It's going to be a long wait until  ",
      "offset": 6602.92,
      "duration": 7.08
    },
    {
      "lang": "en",
      "text": "the Chinese reassess or the Russians reassess. \nSo then you have to think about protecting  ",
      "offset": 6610,
      "duration": 5.88
    },
    {
      "lang": "en",
      "text": "yourself and working with allies, your friends.\nIn the first Cold War, the Sino Soviet split,  ",
      "offset": 6615.88,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "getting China to oppose the Soviet Union was \na big deal in terms of winning that war. Who  ",
      "offset": 6621.32,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "plays the role that China played in \nthe first Cold War against China? ",
      "offset": 6627,
      "duration": 3.68
    },
    {
      "lang": "en",
      "text": "Oh, they still played. It's interesting. So Putin \nhas Russia lost. The Soviet Union fractured at  ",
      "offset": 6630.68,
      "duration": 10.8
    },
    {
      "lang": "en",
      "text": "precisely the time that China's rising. So during \nthe Cold War, China's really weak and Russia's  ",
      "offset": 6641.48,
      "duration": 5.32
    },
    {
      "lang": "en",
      "text": "in the dominant position. Well, I guess that's \nreversed. So Putin is dumping all his ordnance  ",
      "offset": 6646.8,
      "duration": 6.12
    },
    {
      "lang": "en",
      "text": "on Ukraine, his Cold War stockpile, and \nhe is leaving Siberia open, wide open to  ",
      "offset": 6652.92,
      "duration": 10.8
    },
    {
      "lang": "en",
      "text": "Chinese predations. And I believe Siberia has \nprecisely the resources that China covets on  ",
      "offset": 6663.72,
      "duration": 7.12
    },
    {
      "lang": "en",
      "text": "lands the Tsars stole. And I think there's a big \nbody of water out there called Lake Baikal. It's  ",
      "offset": 6670.84,
      "duration": 5.56
    },
    {
      "lang": "en",
      "text": "20% of the world's surface fresh water. China is \nchronically short of fresh water in North China.  ",
      "offset": 6676.4,
      "duration": 7.4
    },
    {
      "lang": "en",
      "text": "Baikal is the only fix, and I think it's flat \nenough that you could pipe it around. So I don't  ",
      "offset": 6683.8,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "think the question is when. It's not a question \nof whether the Xi-Putin bromance is going to end,  ",
      "offset": 6688.36,
      "duration": 6.64
    },
    {
      "lang": "en",
      "text": "it's when. And I assure you, the Chinese will pick \nthe moment that is least convenient for Putin. ",
      "offset": 6695,
      "duration": 6.24
    },
    {
      "lang": "en",
      "text": "You think they'd actually go to war \nabout it, or would they just negotiate? ",
      "offset": 6701.24,
      "duration": 2.76
    },
    {
      "lang": "en",
      "text": "Oh, I bet it'll be negotiation of just you \nget them in a corner and say, okay, buddy,  ",
      "offset": 6704,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "this is what we want. This, this, this, this. \nAnd then he'll want some things from them and… ",
      "offset": 6709.72,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "Sounds like what Zhou Enlai tried \nto do to Nehru, it didn't work out. ",
      "offset": 6714.8,
      "duration": 3.52
    },
    {
      "lang": "en",
      "text": "What do you mean? Zhou Enlai absolutely got the \nAksai Chin Plateau. Yeah, he offered the deal to  ",
      "offset": 6719.92,
      "duration": 7.68
    },
    {
      "lang": "en",
      "text": "Nehru. Nehru wouldn't take it. It's like, okay. I \ndon't think, since they both have nuclear weapons,  ",
      "offset": 6727.6,
      "duration": 7.32
    },
    {
      "lang": "en",
      "text": "I don't think that kind of play is probably the \nplay to make. But as long as Putin's desperate  ",
      "offset": 6734.92,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "for whatever, for ordnance and other things, \nPutin's getting himself into a grand old corner. ",
      "offset": 6741,
      "duration": 8.88
    },
    {
      "lang": "en",
      "text": "You wrote a textbook about Chinese history. \nFrom 1644 onwards. In Silicon Valley,  ",
      "offset": 6749.88,
      "duration": 5.76
    },
    {
      "lang": "en",
      "text": "there's this community called Progress Studies, \nand they're very interested in why the Industrial  ",
      "offset": 6755.64,
      "duration": 3.76
    },
    {
      "lang": "en",
      "text": "Revolution happened, how to increase growth, \nwhat has the history of progress been like.  ",
      "offset": 6759.4,
      "duration": 5.2
    },
    {
      "lang": "en",
      "text": "And one big question is, why didn't China have \nthe Industrial revolution first in 1750? That  ",
      "offset": 6764.6,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "much higher fraction of the population, much \nhigher fraction of world output during this  ",
      "offset": 6770.44,
      "duration": 4.52
    },
    {
      "lang": "en",
      "text": "period. Why didn't they have higher growth \nrates and come up with all these technologies? ",
      "offset": 6774.96,
      "duration": 4.2
    },
    {
      "lang": "en",
      "text": "Well, there are whole books on the subject that \nI haven't read that look into this. But I would  ",
      "offset": 6779.16,
      "duration": 4.96
    },
    {
      "lang": "en",
      "text": "flip it around and go, well, the Industrial \nRevolution starts in Europe. That's the  ",
      "offset": 6784.12,
      "duration": 4.08
    },
    {
      "lang": "en",
      "text": "unusual thing. So the question isn't why China \ndidn't, but why Europe did. And I have some,  ",
      "offset": 6788.2,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "some guesses, but they're really…There are very \nthoughtful books on this subject and you can go  ",
      "offset": 6794,
      "duration": 4.48
    },
    {
      "lang": "en",
      "text": "find them and have fun reading them. But if you \nlook at Europe, it's a peninsula and then it's  ",
      "offset": 6798.48,
      "duration": 8.56
    },
    {
      "lang": "en",
      "text": "got the Mediterranean there. And so the Europeans, \nand they've got quite a very good river system,  ",
      "offset": 6807.04,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "the Danube and the Rhine and the Ruhr, all these \ndifferent rivers. And so they have…have always  ",
      "offset": 6812.12,
      "duration": 6.76
    },
    {
      "lang": "en",
      "text": "been a lot of trade going on. And then it was… \nNo one's ever been able to make a big empire in  ",
      "offset": 6818.88,
      "duration": 7.68
    },
    {
      "lang": "en",
      "text": "Europe stick. The Romans did quite well for quite \na bit of time. Napoleon tries not so good. Nazis,  ",
      "offset": 6826.56,
      "duration": 6.36
    },
    {
      "lang": "en",
      "text": "not so good at all. And I guess the French tried \non and off and it didn't succeed. So you have all  ",
      "offset": 6832.92,
      "duration": 6
    },
    {
      "lang": "en",
      "text": "of these competing countries. And I think a lot of \nthat was essential to the Industrial Revolution of  ",
      "offset": 6838.92,
      "duration": 5.52
    },
    {
      "lang": "en",
      "text": "having, you're focusing on commerce, and you've \ngot a lot of competing places. So you don't have  ",
      "offset": 6844.44,
      "duration": 7
    },
    {
      "lang": "en",
      "text": "one big empire that can just sit there, be fat, \ndumb and happy that you have to innovate in order  ",
      "offset": 6851.44,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "to survive against all these other little states.\nEarlier, talking about how in North Africa or  ",
      "offset": 6857.16,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "other regions there's been a bunch of chaos \nbecause people are constantly... There's these  ",
      "offset": 6861.84,
      "duration": 3.24
    },
    {
      "lang": "en",
      "text": "insurgencies, there's these civil wars, there's \nthese smaller wars happening all the time and that  ",
      "offset": 6865.08,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "causes chaos. But if you look at Europe throughout \nthis period, these countries are constantly at war  ",
      "offset": 6869.68,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "with each other. And the fact that because \nof that no one big empire forms apparently  ",
      "offset": 6874.76,
      "duration": 4.96
    },
    {
      "lang": "en",
      "text": "helps explain the Industrial Revolution. \nSo it seems to imply that we should see  ",
      "offset": 6879.72,
      "duration": 5.04
    },
    {
      "lang": "en",
      "text": "a bunch of growth in North Africa or something.\nIt's a tremendous innovation. And look at things  ",
      "offset": 6884.76,
      "duration": 5.24
    },
    {
      "lang": "en",
      "text": "long prior, like Michelangelo and things Leonardo \nda Vinci. It's just a lot of these really bright  ",
      "offset": 6890,
      "duration": 7.6
    },
    {
      "lang": "en",
      "text": "people. Oh, yeah, it's my guess it's related to \nall of this. And I think the Industrial Revolution  ",
      "offset": 6897.6,
      "duration": 9.2
    },
    {
      "lang": "en",
      "text": "doesn't begin in England. And the Industrial \nRevolution isn't strictly industry. Yeah, it's  ",
      "offset": 6906.8,
      "duration": 7.64
    },
    {
      "lang": "en",
      "text": "about textiles and steam engines and railroads \nand things, but it's also about institutions. One  ",
      "offset": 6914.44,
      "duration": 5.56
    },
    {
      "lang": "en",
      "text": "of the big things for the British was insurance. \nSo that when you do your trading vessel and the  ",
      "offset": 6920,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "whole thing sinks, you don't bankrupt all your \ninvestors, because you've got that boat insured.  ",
      "offset": 6924.16,
      "duration": 5.88
    },
    {
      "lang": "en",
      "text": "And then banking, banking rules. So you can't \njust rip off everybody's cash. And so Britain,  ",
      "offset": 6930.04,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "because it's surrounded with the moat, becomes a \nbanking center. Because it's unlikely in a war to  ",
      "offset": 6935.76,
      "duration": 6.56
    },
    {
      "lang": "en",
      "text": "have some alien army come and just open all the \nvaults and take everyone's money. So there are  ",
      "offset": 6942.32,
      "duration": 4.76
    },
    {
      "lang": "en",
      "text": "these institutional things. And then the British \ntrading countries like the Dutch Empire want to  ",
      "offset": 6947.08,
      "duration": 8.84
    },
    {
      "lang": "en",
      "text": "have to be able to trade in peace. So they want \npeople just follow laws. So it's not surprising  ",
      "offset": 6955.92,
      "duration": 5
    },
    {
      "lang": "en",
      "text": "the founding father of international law is a \nmember of the Dutch Republic, Hugo Grotius. And  ",
      "offset": 6960.92,
      "duration": 7.28
    },
    {
      "lang": "en",
      "text": "so it's all a piece. It's this gravitation. the \nRomans are gravitating towards law and institution  ",
      "offset": 6968.2,
      "duration": 7.76
    },
    {
      "lang": "en",
      "text": "and then these competing places so no one \ncontrols. I think the question is why do these.  ",
      "offset": 6975.96,
      "duration": 6.68
    },
    {
      "lang": "en",
      "text": "What's special about Europe rather than \nwhy it should have been somewhere else? ",
      "offset": 6982.64,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "What's mysterious about China is not only that \nit doesn't have the Industrial Revolution first,  ",
      "offset": 6988.32,
      "duration": 4.28
    },
    {
      "lang": "en",
      "text": "but its development starts so slow. So Japan \ncopies Western institutions during the Meiji  ",
      "offset": 6992.6,
      "duration": 6.12
    },
    {
      "lang": "en",
      "text": "Reformation and industrializes almost a century \nbefore China is able to do the same thing. And  ",
      "offset": 6998.72,
      "duration": 5.36
    },
    {
      "lang": "en",
      "text": "look, they're communists for a while. So it makes \nsense that during the Mao period or during the  ",
      "offset": 7004.08,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "civil war that would impede development. But \neven during the Qing dynasty or something,  ",
      "offset": 7008.24,
      "duration": 4
    },
    {
      "lang": "en",
      "text": "it takes till 1980 for them to start \ndevelopment. That just seems awfully slow. ",
      "offset": 7013.4,
      "duration": 4.32
    },
    {
      "lang": "en",
      "text": "Well, communism is a really lousy system. So \nthey did that. In the 19th century they have all  ",
      "offset": 7017.72,
      "duration": 5.92
    },
    {
      "lang": "en",
      "text": "these peasant rebellions where they're literally \nlosing tens of millions of people that are just  ",
      "offset": 7023.64,
      "duration": 4.24
    },
    {
      "lang": "en",
      "text": "devastating the country. So that's why the 19th \ncentury is a lost century of all of that going  ",
      "offset": 7027.88,
      "duration": 7.68
    },
    {
      "lang": "en",
      "text": "on. So it's hard. And then there's another piece \nthat's hard for the Chinese. If you've been such  ",
      "offset": 7035.56,
      "duration": 7.36
    },
    {
      "lang": "en",
      "text": "a successful civilization in Asia the way they \nhad been, they were the center of everything  ",
      "offset": 7042.92,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "culturally, science, governmental institutions, \nyou name the area of human achievement and the  ",
      "offset": 7048,
      "duration": 8.84
    },
    {
      "lang": "en",
      "text": "Chinese were at the top of it all in Asia. With \nthat kind of success, it's pretty hard to reform  ",
      "offset": 7056.84,
      "duration": 6.2
    },
    {
      "lang": "en",
      "text": "yourself. And so they also fed themselves the \nKool-aid that the Chinese never absorbed foreign  ",
      "offset": 7063.04,
      "duration": 7.6
    },
    {
      "lang": "en",
      "text": "ideas. It was always foreigners absorbed their \nideas. And of course that's nonsense because they  ",
      "offset": 7070.64,
      "duration": 4.64
    },
    {
      "lang": "en",
      "text": "were conquered by Manchus and actually absorbed a \nlot of Manchuans’ institutions. But that's not the  ",
      "offset": 7075.28,
      "duration": 6.48
    },
    {
      "lang": "en",
      "text": "story they're telling. Whereas the Japanese are \nwell aware they're absorbing Chinese institutions  ",
      "offset": 7081.76,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "originally, Western institutions later. And so \nthat isn't antithetical to who the Japanese are. ",
      "offset": 7086.84,
      "duration": 8.56
    },
    {
      "lang": "en",
      "text": "That's interesting. The past civilizational \ngreatness may be an impediment to development. ",
      "offset": 7095.4,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "Yeah, it's hard. Well, also because \nthe way they define civilization,  ",
      "offset": 7100,
      "duration": 2.96
    },
    {
      "lang": "en",
      "text": "there's only one everybody else are barbarians. \nPeople come and kowtow to China. Okay, great. But  ",
      "offset": 7102.96,
      "duration": 6.8
    },
    {
      "lang": "en",
      "text": "this doesn't set you up to learn from others.\nOne of the big dichotomies you talk about is  ",
      "offset": 7109.76,
      "duration": 7.36
    },
    {
      "lang": "en",
      "text": "the difference between limited and total \nobjectives. How does Bismarck illustrate  ",
      "offset": 7118.32,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "the value of having limited objectives?\nLimited and unlimited objectives? Yeah,  ",
      "offset": 7124.4,
      "duration": 3.08
    },
    {
      "lang": "en",
      "text": "Bismarck does illustrate that an \nunlimited objective is. The simplest  ",
      "offset": 7127.48,
      "duration": 4.8
    },
    {
      "lang": "en",
      "text": "way to look at it is regime change. So if I have \nan unlimited objective against you, I win the war,  ",
      "offset": 7132.28,
      "duration": 6.64
    },
    {
      "lang": "en",
      "text": "you're going to be out of power. Versus I \nwin the war, and yeah, you lose a province,  ",
      "offset": 7138.92,
      "duration": 6.32
    },
    {
      "lang": "en",
      "text": "but you'll be in power. So what Bismarck does, \nhe's very clever. Well, he's operating in an age  ",
      "offset": 7145.24,
      "duration": 7.2
    },
    {
      "lang": "en",
      "text": "of kings. And actually his achievements illustrate \nwhy you truly don't need royal families running  ",
      "offset": 7152.44,
      "duration": 5.36
    },
    {
      "lang": "en",
      "text": "the show. It's breathtakingly incompetent. So \ninitially he fights the Danish War, so that's way  ",
      "offset": 7157.8,
      "duration": 7.16
    },
    {
      "lang": "en",
      "text": "up north and it's over these two provinces. And \nhe wants to set his fingers on the scale of the  ",
      "offset": 7164.96,
      "duration": 6.28
    },
    {
      "lang": "en",
      "text": "more northerly province because then that'll give \nhim the rights to march troops, I think through  ",
      "offset": 7171.24,
      "duration": 5.48
    },
    {
      "lang": "en",
      "text": "the more southerly one to cause problems later. \nSo war number one's the Danish war. No one thinks  ",
      "offset": 7176.72,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "too much about it. Prussia gets an extra province \nas part of Denmark. Was part of Denmark, no big  ",
      "offset": 7181.6,
      "duration": 5.36
    },
    {
      "lang": "en",
      "text": "deal. But then he fights the Austro-Prussian War \nand then what he's after is there are all these  ",
      "offset": 7186.96,
      "duration": 8.24
    },
    {
      "lang": "en",
      "text": "little Germanic states and Austria had dominated \na bunch of them and in that war, a whole bunch of  ",
      "offset": 7195.2,
      "duration": 9.84
    },
    {
      "lang": "en",
      "text": "them as a result of that war, he collects a whole \nbunch of these other states and no one is really  ",
      "offset": 7205.04,
      "duration": 9.32
    },
    {
      "lang": "en",
      "text": "paying attention that he's actually upending \nthe balance of power in Europe. They're just  ",
      "offset": 7214.36,
      "duration": 5.68
    },
    {
      "lang": "en",
      "text": "looking at it. It's limited. He's not toppling the \nAustrian government, he's not toppling the Danish  ",
      "offset": 7220.04,
      "duration": 6.16
    },
    {
      "lang": "en",
      "text": "government. And then he fights the Franco-Prussian \nWar, where he takes Alsace-Lorraine, which are  ",
      "offset": 7226.2,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "these provinces, if you look at it's like \na salient into one country or the other. He  ",
      "offset": 7231.28,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "takes that and the French never forgive him, \nand that leads into World War I later. But by  ",
      "offset": 7235.84,
      "duration": 5.48
    },
    {
      "lang": "en",
      "text": "the time it's over, he's overthrown the balance \nof power in Europe that all of a sudden Germany,  ",
      "offset": 7241.32,
      "duration": 4.76
    },
    {
      "lang": "en",
      "text": "Prussia, which was the weakest of five great \npowers, suddenly has a central position,  ",
      "offset": 7246.08,
      "duration": 4.48
    },
    {
      "lang": "en",
      "text": "the Germanic states, and it owns the whole thing. \nAnd Britain and others who'd been asleep at the  ",
      "offset": 7250.56,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "switch like ooh. Cause they could have weighed \nin on the scale at any point in these things to  ",
      "offset": 7256.4,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "altered outcomes, and they didn't. There's a real \nreason why. And the people who are losing out here  ",
      "offset": 7262.12,
      "duration": 5
    },
    {
      "lang": "en",
      "text": "are all. They're all monarchies. There's a reason \nwhy you don't want to have people inherit offices.  ",
      "offset": 7267.12,
      "duration": 6.56
    },
    {
      "lang": "en",
      "text": "They don't tend to be very good at it.\nActually, so World War I. I'm not sure  ",
      "offset": 7273.68,
      "duration": 4.4
    },
    {
      "lang": "en",
      "text": "how you explain World War I using limited \nand sorry, was it ultimate objectives? ",
      "offset": 7278.08,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "It's limited or. Well, they're different. There \nare. It's useful in warfare to think about limited  ",
      "offset": 7282.96,
      "duration": 6.12
    },
    {
      "lang": "en",
      "text": "versus unlimited objectives. So if you look \nat Ukraine today, Putin has one of the most  ",
      "offset": 7289.08,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "unlimited kinds of objectives from Ukraine. He \nnot only wants to topple the Ukrainian government,  ",
      "offset": 7293.96,
      "duration": 4.12
    },
    {
      "lang": "en",
      "text": "but he wants to eliminate Ukrainian culture. \nAnd if you look up genocide in the dictionary,  ",
      "offset": 7298.08,
      "duration": 4.64
    },
    {
      "lang": "en",
      "text": "genocide can mean kill everybody, but it can \nalso mean destroy their culture. That also  ",
      "offset": 7302.72,
      "duration": 3.76
    },
    {
      "lang": "en",
      "text": "applies to genocide. So Putin has a very unlimited \nobjective. Kyiv, on the other hand, does not have  ",
      "offset": 7306.48,
      "duration": 6.24
    },
    {
      "lang": "en",
      "text": "an unlimited objective. I mean, as much as they'd \nlike Putin to go, they just, they want Russia to  ",
      "offset": 7312.72,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "get out of Ukraine. Right. Just get out of \nUkrainian territory, stay in Russia. That's  ",
      "offset": 7318.8,
      "duration": 3.72
    },
    {
      "lang": "en",
      "text": "their objective. So the Ukrainians are a limited \nobjective. Putin has an unlimited objective. ",
      "offset": 7322.52,
      "duration": 4.48
    },
    {
      "lang": "en",
      "text": "Yeah. In World War I, I mean, maybe other \nthan like the Austro Hungarian Empire,  ",
      "offset": 7327,
      "duration": 3.08
    },
    {
      "lang": "en",
      "text": "there's like. Germany doesn't have a unlimited \nobjective with respect to France or Russia. ",
      "offset": 7330.08,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "No, it doesn't.\nBut it still  ",
      "offset": 7334.64,
      "duration": 1.12
    },
    {
      "lang": "en",
      "text": "devolves into this. 10 million people die.\nIt doesn't. Although the effect on Russia  ",
      "offset": 7335.76,
      "duration": 5.2
    },
    {
      "lang": "en",
      "text": "is to overthrow the government. In fact, \nit winds up overthrowing one government  ",
      "offset": 7340.96,
      "duration": 4.12
    },
    {
      "lang": "en",
      "text": "after another. I think as that war goes on and as \nyou lose a lot of people, then you start think,  ",
      "offset": 7345.08,
      "duration": 7.84
    },
    {
      "lang": "en",
      "text": "then the objectives become more unlimited. \nWhereas, like originally it was just get back  ",
      "offset": 7352.92,
      "duration": 4.52
    },
    {
      "lang": "en",
      "text": "into German territory. After a while it's no, we \nwant to overthrow your government for doing this. ",
      "offset": 7357.44,
      "duration": 7
    },
    {
      "lang": "en",
      "text": "On a different topic. So your name is Sarah Paine?\nYeah. ",
      "offset": 7364.44,
      "duration": 3.84
    },
    {
      "lang": "en",
      "text": "When I go on Amazon and I find your books, they're \nnot listed as Sarah Payne, they're listed under  ",
      "offset": 7368.28,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "the author SCM Payne.\nThat's correct. ",
      "offset": 7374.12,
      "duration": 2.2
    },
    {
      "lang": "en",
      "text": "Why is that?\nWell, it's interesting. When I first started out,  ",
      "offset": 7376.32,
      "duration": 3.2
    },
    {
      "lang": "en",
      "text": "I just wanted my books to be read by what the \ncontent of the book was. I didn't want it to be  ",
      "offset": 7379.52,
      "duration": 4.96
    },
    {
      "lang": "en",
      "text": "read whether I was male or female. Just read it \nfor being a book. And then when the first reviews  ",
      "offset": 7384.48,
      "duration": 7.36
    },
    {
      "lang": "en",
      "text": "came out, it was he, he, he, he, he, he, he. And \nthis is by Americans doing this. And I thought,  ",
      "offset": 7391.84,
      "duration": 5.56
    },
    {
      "lang": "en",
      "text": "wow. I guess the idea, because I wasn't doing \nwomen's history and this was a serious topic that,  ",
      "offset": 7397.4,
      "duration": 6.28
    },
    {
      "lang": "en",
      "text": "you know, women don't do serious topics. So \nI guess I'm glad I did it. So it looks like  ",
      "offset": 7403.68,
      "duration": 4.6
    },
    {
      "lang": "en",
      "text": "I'm a Briton, right? Because Britons love all \nthe initials. And then why do I have all the  ",
      "offset": 7408.28,
      "duration": 5
    },
    {
      "lang": "en",
      "text": "initials? It's because my dad named all – from \nhis side of the family — my three older brothers,  ",
      "offset": 7413.28,
      "duration": 6.52
    },
    {
      "lang": "en",
      "text": "and there's me. And my mom felt that some names \nfrom her family ought to be dumped on me. And so  ",
      "offset": 7419.8,
      "duration": 5.56
    },
    {
      "lang": "en",
      "text": "since there were three older brothers anyway, \nshe had a lot of extra names going around. So  ",
      "offset": 7425.36,
      "duration": 4.32
    },
    {
      "lang": "en",
      "text": "she gave them to me and I had no say in this.\nWhen you're training these Officers in the  ",
      "offset": 7429.68,
      "duration": 5.2
    },
    {
      "lang": "en",
      "text": "U.S. Naval War College, you've done it over \nmany decades. Has the quality of the people  ",
      "offset": 7434.88,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "you're training, has it improved, decreased \nover time? What's your class been like? ",
      "offset": 7440.96,
      "duration": 4.48
    },
    {
      "lang": "en",
      "text": "They're wonderful people. And also I don't look \nat people like linear, I just. It's a classroom,  ",
      "offset": 7445.44,
      "duration": 8.28
    },
    {
      "lang": "en",
      "text": "it has wonderful people in there. They're the \nnext generation and I will do everything I can for  ",
      "offset": 7453.72,
      "duration": 5.44
    },
    {
      "lang": "en",
      "text": "every single one of them to catapult them as far \nforward as I possibly can. So that's what it is. ",
      "offset": 7459.16,
      "duration": 6.24
    },
    {
      "lang": "en",
      "text": "Do other countries have some equivalent of \nthe Naval War College where they have this  ",
      "offset": 7465.4,
      "duration": 4.64
    },
    {
      "lang": "en",
      "text": "professional cadre of historians and strategists \nwho are going through the archives trying to  ",
      "offset": 7470.04,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "figure out insights for current leaders?\nOh, not all my colleagues publish much of  ",
      "offset": 7474.92,
      "duration": 6.36
    },
    {
      "lang": "en",
      "text": "anything. So it varies. The Naval War College has \nalways had a few very A-list people. And the most  ",
      "offset": 7481.28,
      "duration": 10.44
    },
    {
      "lang": "en",
      "text": "famous person by far ever to work there is Alfred \nThayer Mahan, and he's 19th century (well, he dies  ",
      "offset": 7491.72,
      "duration": 7.36
    },
    {
      "lang": "en",
      "text": "early 20th century). But he's the guy who, when \nthe United States had been doing Manifest Destiny,  ",
      "offset": 7499.08,
      "duration": 7.76
    },
    {
      "lang": "en",
      "text": "a continental, continental paradigm because we're \nexpanding, taking territory all the way to the  ",
      "offset": 7506.84,
      "duration": 6.68
    },
    {
      "lang": "en",
      "text": "Pacific. And he's the guy who says, hmm, you know, \npower and position in the world really is about  ",
      "offset": 7513.52,
      "duration": 4.8
    },
    {
      "lang": "en",
      "text": "trade. And he writes these enduring books that \nhave lasted to the present. So there are these  ",
      "offset": 7518.32,
      "duration": 8.08
    },
    {
      "lang": "en",
      "text": "occasional people like Alfred Thayer Mahan who are \nvery special. And as for some cadre of anybody's:  ",
      "offset": 7526.4,
      "duration": 7.32
    },
    {
      "lang": "en",
      "text": "we're just professors, we teach mid level and \nsenior officers. And then most of them never  ",
      "offset": 7534.76,
      "duration": 6.48
    },
    {
      "lang": "en",
      "text": "become flag-rank with the kind of leaders you're \nthinking about. So I mean, I've talked to the  ",
      "offset": 7541.24,
      "duration": 7.2
    },
    {
      "lang": "en",
      "text": "occasional flag officer, but I'm just a minion.\nSo you started in Soviet studies and you found  ",
      "offset": 7548.44,
      "duration": 7.96
    },
    {
      "lang": "en",
      "text": "yourself in the Soviet Union during its fall in \n‘88, ‘89. Why was that the field you started in? ",
      "offset": 7556.4,
      "duration": 8.16
    },
    {
      "lang": "en",
      "text": "Oh. So I grew up during the height of the Cold War \nand listened to family dinnertime conversations  ",
      "offset": 7564.56,
      "duration": 7.4
    },
    {
      "lang": "en",
      "text": "all about it. And then you listened people \ndescribing the Russians as being totally evil.  ",
      "offset": 7571.96,
      "duration": 7.08
    },
    {
      "lang": "en",
      "text": "And I thought, well, I'll learn more about this. \nI'm curious. And then I realized, whoa, it's just  ",
      "offset": 7579.04,
      "duration": 6.12
    },
    {
      "lang": "en",
      "text": "unbelievable how cruel the Russians have been to \neach other and others. It's like they're a class  ",
      "offset": 7585.16,
      "duration": 4.96
    },
    {
      "lang": "en",
      "text": "by themselves. I don't make it up. So. And then \nthe question is, why? And learning more about it. ",
      "offset": 7590.12,
      "duration": 7.92
    },
    {
      "lang": "en",
      "text": "And then in history, you do a minor field as \nwell. And I think the typical minor field for  ",
      "offset": 7598.04,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "Russian history would be French or German. And \nI thought, “no, I want to learn about China”  ",
      "offset": 7602.72,
      "duration": 4.2
    },
    {
      "lang": "en",
      "text": "and – just curious. And then learn about China and \nthen realize that Russia and China have relations.  ",
      "offset": 7606.92,
      "duration": 5.64
    },
    {
      "lang": "en",
      "text": "But then Japan always weighs in. So then I had \nto learn more about Japan. So that's where all  ",
      "offset": 7612.56,
      "duration": 5.76
    },
    {
      "lang": "en",
      "text": "of that led. And then I also thought, I don't want \nto be studying the United States. That's where I'm  ",
      "offset": 7618.32,
      "duration": 4.52
    },
    {
      "lang": "en",
      "text": "from. And I want to learn about other countries. \nAlso, my presumption is my bias would be pretty  ",
      "offset": 7622.84,
      "duration": 5.36
    },
    {
      "lang": "en",
      "text": "bad about the United States or things I wouldn't \nsee. I thought, I'm going to study other places  ",
      "offset": 7628.2,
      "duration": 4.96
    },
    {
      "lang": "en",
      "text": "because I don't have any family ties. I mean, I'm \nnot a descendant of Russian immigrants or Chinese  ",
      "offset": 7633.16,
      "duration": 6.04
    },
    {
      "lang": "en",
      "text": "or Japanese immigrants, obviously. So these are \nplaces that I'm not related to. And just curious. ",
      "offset": 7639.2,
      "duration": 6.88
    },
    {
      "lang": "en",
      "text": "What is the answer to that? You said you \nwere trying to figure out why the Russians  ",
      "offset": 7646.08,
      "duration": 2.36
    },
    {
      "lang": "en",
      "text": "have been so cruel to each other through \nhistory and then especially, I guess,  ",
      "offset": 7648.44,
      "duration": 4.52
    },
    {
      "lang": "en",
      "text": "after the communist revolution, why is it?\nI don't know the answer, but I know…I was,  ",
      "offset": 7652.96,
      "duration": 7.2
    },
    {
      "lang": "en",
      "text": "I've just recently read Aleksandr Solzhenitsyn. \nI should have read it years ago when it came out,  ",
      "offset": 7660.16,
      "duration": 5.52
    },
    {
      "lang": "en",
      "text": "but I didn't. So I finally read it. And if \nyou read that, look at the level of cruelty.  ",
      "offset": 7665.68,
      "duration": 6.08
    },
    {
      "lang": "en",
      "text": "It's mind blowing. It isn't simply that the \nprisoners are mean to each other, or that the  ",
      "offset": 7671.76,
      "duration": 5
    },
    {
      "lang": "en",
      "text": "prison guards are mean to the prisoners, or \nthe guards are mean to each other. All that's  ",
      "offset": 7676.76,
      "duration": 3.88
    },
    {
      "lang": "en",
      "text": "true. And it's not simply that the civilians \noutside of the Gulag are mean to everybody.  ",
      "offset": 7680.64,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "It's family members who are mean to people who \nare in the Gulag, the neighbors are mean to  ",
      "offset": 7686.36,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "the family members who have anyone who's in the \nGulag. And you start looking, going, who's not  ",
      "offset": 7692.16,
      "duration": 5.12
    },
    {
      "lang": "en",
      "text": "being mean in this place? They're all being mean.\nAnd then you look at, oh, then I haven't got the  ",
      "offset": 7697.28,
      "duration": 7.48
    },
    {
      "lang": "en",
      "text": "list of all the words. But then I was reading \na lot of Russian stuff last winter and then  ",
      "offset": 7704.76,
      "duration": 6.44
    },
    {
      "lang": "en",
      "text": "maintaining a list of words in Russian: “sila”, it \nmeans strength or coercion in Russia. In English,  ",
      "offset": 7711.2,
      "duration": 9
    },
    {
      "lang": "en",
      "text": "strength doesn't mean coercion, it just \nmeans having power. Right? But in Russian,  ",
      "offset": 7720.2,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "it also means coercion. Or detente. It comes \nfrom the French, which means a relaxation  ",
      "offset": 7726,
      "duration": 5.72
    },
    {
      "lang": "en",
      "text": "of pressure. The Russian word, what it means is \nunloading a gun. So if you look at their language,  ",
      "offset": 7731.72,
      "duration": 8.6
    },
    {
      "lang": "en",
      "text": "it's so coercive. And I think probably if you're \nliving in a really dangerous piece of real estate,  ",
      "offset": 7740.32,
      "duration": 6.12
    },
    {
      "lang": "en",
      "text": "which they are, no defensible boundaries. So \nyou're always fighting people. And their answer to  ",
      "offset": 7746.44,
      "duration": 6
    },
    {
      "lang": "en",
      "text": "surviving that is to be meaner than anybody else. \nAnd they just do scorched-earth. You mess with  ",
      "offset": 7752.44,
      "duration": 5.8
    },
    {
      "lang": "en",
      "text": "them, they kill everybody, and they just don't \ncare. And okay, you want to. We have the modern  ",
      "offset": 7758.24,
      "duration": 5.76
    },
    {
      "lang": "en",
      "text": "world now where we can deal with each other, \nwith international law, so none of that stuff is  ",
      "offset": 7764,
      "duration": 5.64
    },
    {
      "lang": "en",
      "text": "necessary. But the Russians have not pulled from \nthat tradition. And you can read in the newspaper  ",
      "offset": 7769.64,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "how absolutely cruel they are to their men in \nservice, right? They don't allow any of them to  ",
      "offset": 7774.52,
      "duration": 5.84
    },
    {
      "lang": "en",
      "text": "retreat. They've got the execution battalions \nbehind them. So any kid who turns around,  ",
      "offset": 7780.36,
      "duration": 6.32
    },
    {
      "lang": "en",
      "text": "they're immediately murdered by their compatriots. \nWho treats their own people like this?  ",
      "offset": 7786.68,
      "duration": 4.64
    },
    {
      "lang": "en",
      "text": "Russians do, but other people don't.\nI mean, Solzhenitsyn talks in that  ",
      "offset": 7791.84,
      "duration": 5.2
    },
    {
      "lang": "en",
      "text": "part about that this is the direct result \nof the communist regime's policy where if  ",
      "offset": 7797.04,
      "duration": 7.12
    },
    {
      "lang": "en",
      "text": "somebody's an orphan because their parents went \nto the gulags, if you try to help the orphan,  ",
      "offset": 7804.16,
      "duration": 4.24
    },
    {
      "lang": "en",
      "text": "you must be a sympathizer for the criminals, and \ntherefore you must also be sent to the Gulags.  ",
      "offset": 7808.4,
      "duration": 4.16
    },
    {
      "lang": "en",
      "text": "And so, like, you have these orphans running \naround who's like parents have been sent away. ",
      "offset": 7812.56,
      "duration": 3.76
    },
    {
      "lang": "en",
      "text": "The orphans – a lot of them were put into \norphanages, and then they wound up being set  ",
      "offset": 7816.32,
      "duration": 4.44
    },
    {
      "lang": "en",
      "text": "up to join the KGB in other places. So they were \nprobably some of the execution battalion people,  ",
      "offset": 7820.76,
      "duration": 6.4
    },
    {
      "lang": "en",
      "text": "I don't know the details, but there's some \nof that going on. And the cruelty in Russia  ",
      "offset": 7827.16,
      "duration": 3.76
    },
    {
      "lang": "en",
      "text": "was remarked by Europeans who were traveling \nthere in the, I don't know, 17th century. So  ",
      "offset": 7830.92,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "it goes back a long time, about the level of \ncruelty. Peter the Great, back in the day,  ",
      "offset": 7836,
      "duration": 4.56
    },
    {
      "lang": "en",
      "text": "he tortured his son to death. Who does that? \nHe didn't have a replacement son either. ",
      "offset": 7840.56,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "Unlike Stalin. Final question. This new \nproject you're doing on the Cold War,  ",
      "offset": 7848.44,
      "duration": 8.52
    },
    {
      "lang": "en",
      "text": "is it going to be a book? How will it come out?\nSlowly. Oh, I've been working on it for years.  ",
      "offset": 7856.96,
      "duration": 7.32
    },
    {
      "lang": "en",
      "text": "It'll be a culmination of previous research. \nStarts in 1917. It will end in 1991ish. Why 1917?:  ",
      "offset": 7864.28,
      "duration": 9.48
    },
    {
      "lang": "en",
      "text": "We may not have noticed that these crazy \ncommunists in Russia were serious, but they  ",
      "offset": 7874.28,
      "duration": 5.2
    },
    {
      "lang": "en",
      "text": "did declare war on the capitalist order. It is \nreally clear. The documentation is just there.  ",
      "offset": 7879.48,
      "duration": 5.96
    },
    {
      "lang": "en",
      "text": "And they were trying to fund people to overthrow \ngovernments in Europe, all around the world,  ",
      "offset": 7885.44,
      "duration": 5.4
    },
    {
      "lang": "en",
      "text": "immediately. This is in the teens, and then \ncertainly in the 20s. So just because they weren't  ",
      "offset": 7890.84,
      "duration": 6.2
    },
    {
      "lang": "en",
      "text": "remotely powerful enough to do it, but they were \nlike, what is it? A Maoist phase-one insurgency  ",
      "offset": 7897.04,
      "duration": 6.16
    },
    {
      "lang": "en",
      "text": "where people aren't paying attention. They're, \nlike, below the radar. They're doing stuff. ",
      "offset": 7903.2,
      "duration": 4.68
    },
    {
      "lang": "en",
      "text": "And it's going to be looking at all the strategies \nthat the Russians played, that we played,  ",
      "offset": 7908.72,
      "duration": 4.32
    },
    {
      "lang": "en",
      "text": "what medium powers played and what worked and \nwhat didn't. And it's going to be organized around  ",
      "offset": 7913.04,
      "duration": 5.88
    },
    {
      "lang": "en",
      "text": "concepts to understand these things. So on the one \nlevel, if I can do it right, it'll be a history of  ",
      "offset": 7918.92,
      "duration": 8.52
    },
    {
      "lang": "en",
      "text": "the Cold War from one year to another year. So \nthere's that, and then there's another one about  ",
      "offset": 7927.44,
      "duration": 4.88
    },
    {
      "lang": "en",
      "text": "strategy. Okay. People are trying to achieve \nobjectives, and they're trying different things  ",
      "offset": 7932.32,
      "duration": 3.96
    },
    {
      "lang": "en",
      "text": "and integrating different elements of national \npower. So it'll be that. And then what I found  ",
      "offset": 7936.28,
      "duration": 4.52
    },
    {
      "lang": "en",
      "text": "helpful in my own career are these concepts like \nlimited and unlimited war or primary adversary,  ",
      "offset": 7940.8,
      "duration": 5.08
    },
    {
      "lang": "en",
      "text": "primary theater or frozen conflict, or veto \nplayer. I find these things helpful. And so  ",
      "offset": 7945.88,
      "duration": 6.32
    },
    {
      "lang": "en",
      "text": "I'm going to put as many of those things in \nthere as possible. And I'm of a certain age,  ",
      "offset": 7952.2,
      "duration": 4.96
    },
    {
      "lang": "en",
      "text": "so it's passing the baton to the next generation. \nSay this is what I've managed to figure out as I  ",
      "offset": 7957.16,
      "duration": 6.2
    },
    {
      "lang": "en",
      "text": "go putt-putt-putt reading in archives, and \nthen others can skim it and see if there's  ",
      "offset": 7963.36,
      "duration": 4.24
    },
    {
      "lang": "en",
      "text": "anything worthwhile. If not – I tried, right?\nI hope you'll come back on the podcast once  ",
      "offset": 7967.6,
      "duration": 5.6
    },
    {
      "lang": "en",
      "text": "the book is ready.\nThank you.",
      "offset": 7973.2,
      "duration": 2.16
    }
  ],
  "cleanText": null,
  "dumpedAt": "2025-07-21T18:43:26.030Z"
}