{
  "id": "9nK4g6vgRDg",
  "title": "Joe Rogan Experience #2340 - Charley Crockett",
  "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
  "publishedAt": "2025-06-19T17:00:14.000Z",
  "cleanText": "Joe Rogan podcast. Check it out. The Joe Rogan Experience. Train by day. Joe Rogan podcast by night. All day.\nYeah. The doing something at the Viper Room and then trying to come here the next day.\nThe Viper Room is just notorious. Like even when you're in the building, it just feel like it is notorious. Yeah.\nAnd it's funny because I the only way I'd ever been in there was through that, you know, the door on the side street there. Uh-huh. You know, and uh but they, you know, they had all the cameras out and took me around the I'd never come in through the door on Sunset before even recognized the place. No, I never been through that door either. Yeah. I've like I said, I've only been there once. I was there for a comedy show. It just feels weird. It's a there there's certain buildings that just have bizarre history. Yeah. Well, shooter was telling me last night, man, uh, River Phoenix died on the sidewalk right out that door on the I didn't know that. I thought it was in front of the I thought it was in front of the whiskey for some reason.\nNo, no, it was the Viper room. I never realized that. No, it's [ __ ] up place.\nHey, man. Nice to meet you. Pleasure is all mine, Joe. Thanks. I love your music. Really? Yeah. Yeah. Yeah. Well, my friend Jake turned me on to you. Your music is like you've lived a life. You can't fake that. You know what I mean? There's something about certain dudes voices and songs. They're like, &quot;All right, that guy's done some living.&quot; You know, you can't create that with AI, right? They're going to try. Everybody I mean, it's crazy. We were uh I mean, we're what that we're kind of reaching singularity, you know? Yeah. Where nobody can tell the difference. I know. I think we're right right about there. There was a new one that just got released today. Did you hear the new one today? It's even even better than the Google one that was insane that was released last week. Yeah, it's weird. What What are you talking about? Uh some new AI engine that does video. I'll send it to you, Jamie. It's uh it's pretty incredible. This the the the way they're able to make stuff now where it looks exactly like like real human beings. Like it doesn't it doesn't look fake even a little bit. Yeah. I'll send it to you, Jamie.\nis called um Bite Dance. So, is that the China one? That's the company. Oh, okay. Dance is the company that owns like Tik Tok and stuff. Oh, yeah. China. Yeah. Yeah. Um this is their new AI. So, this is all fake. All fake people. All done by computers. Indistinguishable, you know. It's like very strange. You got it. Throw that up. Give me some sound.\nYou got to click on it.\nThis is all fake.\nI mean, what the [ __ ] man?\n[Music]\nWe are living in the weirdest time ever, Charley Crockett. Oh man, you're right. This is the weirdest time ever to be alive because we are so close to not being able to tell what's real and what's fake. We're so close. I mean, we're essentially right there with video and then eventually it's going to move into some sort of perception. It's going to be feel. You're going to be able to put a helmet on and go into some bizarre world and you can't stop it. You can't stop it. It's coming. It's coming. It's And the people that are working on it in America like we have to because China's working on them. Okay, I guess that's just what we're doing. Space race, even if it's just a show. Yeah, it's essentially the Manhattan Project for artificial intelligence is a race around the world.\nJoe, did we go to the moon? I don't think so. You know, I don't think so either. I don't think so. It's It makes you sound [ __ ] completely insane to say it, but I lost a lot of friends when I was younger when I started talking like that. I did, too. I gained a lot of friends, too, though. I gained a lot of SC Listen, man. I've talked to scientists that don't want to talk about it publicly. Yeah, scientists. Well, see, you know what I figured? I figured that would be the one time in the history of civilization that human beings got to a new place and said, &quot;Nah, I'm good.&quot; and turned around. Exactly. I don't want to look around there anymore. Well, Bart Sabrell, he's this uh researcher that's been doing these documentaries on the moon landing, and he's been saying it's fake since like I met him sometime in the early 2000s, I believe. And he put out this this documentary called A Funny Thing Happened on the Way to the Moon. And he's got a great quote and he says, &quot;There's not a single thing that's not easier, faster, and cheaper to reproduce today from 1969 except the moon landing. It's the one thing.&quot; Well, and everybody go, &quot;Oh, but they spent so much money. Why would they spend the money on that again? Well, why why would they spend money on all the things they spend money on? Like, what are you talking about? It doesn't make any sense. The the moon is has trillions of dollars in rare minerals on it. There's all sorts of [ __ ] on the moon that would be very beneficial to society. And it was always going to be that we're going to have a base on the moon. They were going to use that to go to other places. Mhm. I don't think so. I mean, if you look at the just the the way they filmed it, like when you watched it on television, the people that watched it on television, it was the first time ever there were where there was a news thing where the the news stations, the the networks didn't have a direct feed. What they had was they filmed the moon landing. They they showed it on a projection screen and then the networks pointed their camera at the projection screen. That's why it looks so shitty.\nWow. Do you do you remember there was a a movie that came out? It wasn't that far back. And it's all about this, like a legit movie. And I I should remember this actor's name because he's getting better and better known. He's a really great actor. He played the uh he played the law man in Killers of the Flower Moon that shows up there at the near the end and finally kind of takes them down. but he's been on a lot of other stuff and it's this really great movie about faking the moon landing and all that stuff for like, you know, American kind of um cultural and economic dominance over Russia and all that. Oh, so it's like it's a re it's recent. Oh, okay.\nHey, Jamie, can you tell Jeff to bring in some coffee? Oh, yeah. Um, so it's um so it's a doc a drama. A drama. It's a drama. Yeah, it's a Hollywood Hollywood movie. Oh, Jamie will find out what it is when he gets back. Yeah, I only saw it once, but it was good. And you know this actor cuz he's been everywhere, man. He's been in everything. I should know his name. I need to call him out. I think I saw him at the airport in Burbank a few months ago, actually.\nIt seems like a stupid thing to say, but I don't think it is. I don't think And after COVID realizing how much stuff they can lie about, how much stuff the government can hide, how much stuff that people will just accept as being true despite all the evidence to the contrary, how much experts will go along with things, how easy it is to keep a secret. M. It's not that hard to keep a secret. Especially a secret that is essentially set up to let us Thank you, sir. Dang. That's how I know my wife stopped by. Yerba Mate, is that what you're into? I love them, man. Yeah, they're good. You know why I like it? Really? I didn't realize it for like a year or two and now I realize it because it tastes just like Coca-Cola.\nDoes it really? It does. It's close. I think that's the secret. It tastes like Coca-Cola. Yeah. You know, I would like to try the original Coca-Cola with cocaine in it. Oh [ __ ] I wonder what that was like. Non-habit forming. Yeah, allegedly. Yeah. Another lie.\nIs it Do you Was it true right that that Bear Barrett first had heroin in it or opium? Really? The original version of it. Yeah. The the original product.\nWe'll find that out. Yeah, I think it I think it did. Well, that makes sense. I'm sure. That's real great for headaches.\nI mean, more lies, right? How many times have we been lied to? But you know what it is? It's um you know I think it's I'm preaching to the choir here, but I think it's a perception thing right with uh you know it's like planting that flag on the moon was a cultural thing you know a uh an American pop culture thing. Sure. Right. Well, they wanted us to be dominant militarily over Russia. [ __ ] worked. Yeah. I mean sort of kind of kind of I guess. Yeah. I mean, we definitely are dominant over, you know, militarily. We definitely were back then, essentially. I mean, here it is. Heroin.\nWow. Bear had heroin. Non-habit forming, right? I got to get the non-habit forming kind. But I mean, like, what is the difference between that and doctors prescribing Oxycontton? It's not that much. Sears Robuck once sold heroin. Jesus Christ. Must have been a wild time back then, man. That's a great uh that's a great illustration there. Yeah, look at that. Two needles, two vitals of heroin. Only a $150, less than $50 adjusted for inflation. Wow. This was in the 19th century. So the 1800 Sears catalog used to offer a heroin kit. I think the actor you're talking about was Jesse Plemens, but I don't know what about See if you can find it. Jesse Plemens. Just Google Moon. Yeah, Moon. Moon. I Well, the flowers of the summer moon keeps popping up. But do but do do space um h discovery. The discovery.\nThat's 2015. No, 2017. Try Jesse Plyman's uh moon conspiracy or space conspiracy.\nHuh?\nAre you sure it wasn't AI?\nCuz there's a lot of those. I I I thought Keano Reeves really was in a new Dracula movie.\nFake. I don't No. No. I'm just going to look. I just possibly fake. What was the other question we had? We had Oh, bare heroin. Yeah, man. They've been, you know, they've been tricking people for a long [ __ ] time. You know, if they can make money, they'll trick you. Yeah. Back then, they were probably being tricked themselves. People didn't really understand what was addictive and what wasn't. You know, doctors used to recommend cigarettes for people with emphyma.\nYou got asthma, you need cigarettes.\nYeah. They were drinking athletes were drinking Coca-Cola on the on the on the court. Well, you know who drinks Coca-Cola? Floyd Mayweather. Floyd Mayweather after training would drink Coca-Cola. And there's actually some science to that. Like having sugar like right after a really hard workout actually replenishes replenishes glucose in the body like Gatorade. Yeah, it's probably not a bad idea as long as my wife's got me drinking Gatorade again. That shit's not good for you. There's there's better versions of electrolytes, you know.\nYeah, you're right. Electrolytes are good for you. Gatorade's okay. It's just it's got a lot of [ __ ] in it, you know. Corn syrup and Here you go. Here it is. Fly me to the moon. Channing Tatum. Oh, Channing Tatum. Is that it? Oh, that's the one.\n2024.\n2024. So, Oh, that's the one. Yeah, he's not he's not even in it. No, he is in it, I think. But historical romantic comedy drama, huh? Tasked with creating a false moon landing. Apple TV. Didn't see it. Interesting. What year was it? Came out last year, like a year ago. I never even heard of it. Oh, I think it's still How do you have a movie with Channing Tatum and Scarlett Johansson and you never heard of it? Isn't that crazy? There's too many goddamn movies, bro. You know what I saw last night? I think I'm still thinking of a different one, but that I never There's another one. There's another one. Really? I think so. I saw it, man. It was a It was a wild movie. And they they find they realize that that the whole landing is is being faked and then they and then and then I mean, I don't want to spoil it, but you know, then they get taken out.\nUh apparently Moon Landing, JFK. I mean, what's the damn difference? Yeah, there's a lot of those, man. There's a lot of I mean there's almost nothing Vietnam, Gulf of Tonkan, there's almost nothing from history that's exactly as we're being told. Almost nothing. Yeah. It's all cracker [ __ ] It's Coke and Pepsi, you know, because I was thinking like, you know, that's the one thing that that they did that everybody liked and then they've kept that. As long as they keep that flavor, right? Right. You they can they can muscle everybody out, you know? It's like those like my RC cola [ __ ] like that. Yeah. Nobody's into that. Yeah. And only if you can't couldn't afford the Coca-Cola price, right? And the, you know, Coke machine. Excuse me. Bless you. Thank you. When I was a kid, that was the only reason we drank RC cola is cuz it was 25 cents, right? Cuz it was cheap. That's it. And you drank it and you knew it wasn't Coke. Yeah. Yeah. They tried new Coke. Do you remember that? When I was a kid, God, I think I was in high school. They came up with a new formula of Coca-Cola somewhere around the 80s. I think it was terrible. They\n\n\nThey knew Coke, and everybody's like, \"What the [ __ ] are you doing? Why would you get rid of Coke? It's perfect.\"\nYeah. Don't change that. They can change and try everything else and buy everybody out as long as they keep Coca-Cola flowing.\nYeah. And then Pepsi is always like for weirdos, people who prefer Pepsi.\nI never liked it.\nYeah. It's weird.\nI like Dr. Pepper.\nWell, you know, Coca-Cola is to this day flavored with cocaine.\nDo you know that?\nYou mean like the cocoa leaves?\nThat's the secret to the flavor of Coca-Cola.\nCoca-Cola, the company that makes Coca-Cola, they are the biggest producers of medical grade cocaine for real.\nWow. So they take the cocoa leaves, they extract the flavonoids out of the cocoa leaves, and they extract the cocaine.\nSo there's no cocaine in Coca-Cola, but then they take those cocoa leaves and the flavor goes into Coca-Cola, and then the cocaine goes into medical cocaine.\nWow. Yeah. To this day, I think they're the only company that's allowed to use cocoa leaves.\nI think they're grandfathered in.\nI think that's exact, is that how it works?\nI believe they're grandfathered in.\nBut to this day, that's what they use as I sniff.\nAs I sniffle.\nBut these are real sniffles, folks.\nThese are allergy sniffles.\nI watched the [ __ ] craziest movie last night, The Substance.\nHave you heard of that movie?\nI've heard of it.\nThat's that new Dememore movie.\nYeah, I was afraid to watch it.\nHoly [ __ ] man.\nIt's intense.\nOh my god.\nOne of the most insane movies I've ever seen in my life.\nIt's about this lady who's getting older, and uh someone approaches her with this new experimental drug that allows you to live as a young person for 7 days, and then you have to switch back to the old person for 7 days.\nI don't want to spoil it for anybody, but it was [ __ ] insane.\nLike, like I left, I was like, I got to watch something stupid on YouTube for a couple hours before I go to bed because I'm I'm weirded out by this movie.\nYeah, that's the reason I haven't watched it yet.\nHard time.\nThat's the I'm just saying, guys.\nI never liked, I never liked uh like the sensory overload like horror movies.\nOh yeah.\nI like classic horror movies.\nThis is a sensory overload times 10.\nI mean, it's it's [ __ ] insane.\nIt's an insane movie.\nIt's really good.\nI mean, it it really grips you.\nIt's very entertaining, but just good lord.\nHave you seen uh um Uncut Gems?\nYes.\nLove that movie.\nIsn't that a good movie?\nOh my god.\nIt was like a little much for me, but it was so good, and it wasn't so crazy, you know?\nYeah.\nWell, I grew up with a lot of gambling addicts.\nSo, for that movie, that movie like really hit home for me.\nI was like, \"Oh, god.\nGee, like got anxiety.\"\nHoward, is that his name?\nHowie Howard?\nYou know, uh, Sandler's character, is that what his name is?\nHowie?\nYeah.\nAnd he's a he's selling diamonds on 42nd Street or whatever.\nThat's that's uh that's that's that's every manager in the music business is that guy.\nA lot of them.\nBunch of gambling addicts that they're that guy right there.\nYou know, they're they're juggling all these balls in front of you, which is fine.\nI don't mind guys juggling.\nWhat I don't like is when somebody's got all these balls in the air, they're juggling in front of me, and they're like, \"Charlie, I'm not juggling.\"\nOh, yeah.\nThe music business.\nYeah.\nWell, there he is.\nHe's great in that movie, too.\nMan, this is Yeah, he's incredible.\nYou know, I never knew he could act dramatically, you know?\nI mean, he's always been great in comedies, but he's he's incredible in that movie.\nIncredible.\nHe had another one he did real that was like a serious flick way back.\nYou remember Punch Drunk Love?\nDo you ever see that one?\nNo, I never saw that.\nThat's a masterpiece.\nYeah, I never saw it.\nYeah.\nBut Uncut Gems, the the gambling aspect of it, like that sickness, that the gambling sickness is a wild sickness.\nI grew up around gamblers, too.\nYeah.\nYeah.\nMy uncle was always a big gambler, and my cousin, I spent a lot of time in casinos with him down in New Orleans on the Mississippi coast and all that.\nOh, Riverbull gamblers, man.\nYep.\nExactly.\nThe craziest man.\nI did I did I I didn't mind, you know.\nHe let he let my me and my cousin run all run all over the place.\nOh.\nSo, we were we were stoked.\nSo, you like the fact that he was a degenerate?\nYeah.\nWell, and anytime he won, like if he won big, we used to play his bingo.\nHe used to run this bingo hall in uh in New Orleans.\nAnd me and my cousin, we got we could both of us, but those bingo dobbers, we could play like we could play nine card pages for them.\nWe got that good that we could keep up with it.\nAnd because he was running the place, nobody in there ever said [ __ ] about me and my cousin being like, you know, 8 and 11 or whatever.\nAnd if we hit though, it was always a good time.\nIt was Toys R Us and fried shrimp.\nWith how much your privacy is being invaded online, VPNs are no longer just a nice thing to have.\nIt's a necessity.\nSome people think, \"I don't need a VPN because I have nothing to hide.\"\nBut that's exactly what data brokers want you to think because their profits depend on you having nothing to hide.\nWhat you do online is your business.\nAnd if you want to keep it your business, you need ExpressVPN.\nWith ExpressVPN, 100% of your online activity travels through secure encrypted servers.\nIt hides your IP address so no one can use it to track and sell your online activity, and your privacy is restored.\nExpressVPN is also a great tool to secure your sensitive information from hackers.\nIf you're using public Wi-Fi, like at a hotel, airport, or coffee shop, anyone can hijack your connection and access your most sensitive information.\nWith ExpressVPN, you know that your passwords and banking info are safe and secure.\nExpressVPN is the number one ranked VPN by the experts at CNET and The Verge.\nAnd right now, you can get an amazing deal.\nThey're offering four extra months free if you go to expressvpn.com/rogan or tap the banner.\nAnd if you're watching on YouTube, you can get your four free months by scanning the QR code on screen or clicking the link in the description.\nFor some people, that's that's their juice, man.\nThat's that's what keeps them going in life, just that next bet.\nYou know, I I grew up uh around a lot of pool halls and um you know, when I was in my early 20s, and I was just around so many people that just live for gambling.\nThey would go straight from offtrack betting right to the pool hall, and you know, they'd bet on anything.\nThey'd bet on two raindrops coming down a window pane.\nThey'd bet on roaches.\nThey'd bet on anything.\nAny you name it.\nThey'd flip a coin for 10.\nI saw dudes flip a coin for thousands of dollars.\nThey a guy would win a tournament.\nLike this is like a famous thing in pool.\nGuys would win win a tournament, win $10,000, flip a coin, lose the whole thing.\nAnd you had to have heart.\nYou had to be will like that was like part of the culture.\nYou had to be willing to bet, right?\nAnd everybody's always because the the only way it's fun.\nYeah.\nThe only way it's fun is if money's constantly flowing.\nSo if someone's trying to be conservative, someone trying to save them, they called them a knit.\nLike you're a knit.\nThey didn't like you.\nYou know, nobody likes a knit.\nLike those those are the guys that get shunned by the pool hall.\nThey're bad action.\nWhere'd you grow up?\nWell, all over the place really.\nBut, uh, where were those pool halls?\nNew York.\nWhen I moved to New York when I was in my 20s, my early 20s, like 23, and that's when I got indoctrinated into pool culture.\nWow.\nYeah.\nIt was just the most fun group of degenerates and weirdos and outcasts.\nAnd, you know, as a comedian, I never felt like I fit in in normal society, you know.\nAnd then I'm around those dudes, I'm like, \"Oh, okay.\nYou guys are just like me.\nYou don't fit in either.\nLike you're a bunch of [ __ ] weirdos, man.\nYou know things what I just thought about Joe when I was on the street in New York.\nI, you know, I played up there, and I'm sure you know, but um I'd play on the street all day, and at first I was playing in the parks, and then I went moved downtown, and I was trying to play on street corners in the villages and all that, and you're dealing with traffic and cops, and that's what drove me down into the into the subway platforms, and those were really competitive too.\nSo even there I started playing at the stations that nobody wanted or you know, weren't desirable or weren't you know, nobody's really competing for the spots or whatever.\nUm, and I would do that all day, and then I would hit open mics all over the five burrows every night, everywhere.\nUm, and the comedy the comedy guys were always the coolest because all of them because we weren't in competition, you know, like I know comedians can be really competitive on the circuit, and obviously same thing on the music side, but I ended up like playing a lot of I would open up for a lot of guys like I'm like at the Red Door and like in the circuit there in the city and [ __ ] Oh, cool.\nOpen guys up with two or three songs or play their breaks or whatever.\nAnd you know, all the comedy folks liked me, I think, because you know, I wasn't one of them.\nYeah.\nWe were cousins or something, right?\nRight.\nThat's There's always been a relationship like that.\nLike Oliver Anthony was at the mothership this weekend, and it's the first music act we've ever had performed there.\nThat's cool.\nYeah.\nYou could perform there too if you ever want to, man.\nI know where it's at.\nYeah.\nIt'd be fun.\nI like that you've got it down there, man.\nIt's a great spot.\nSixth Street is just a such a [ __ ] wild place.\nTo have it right there is perfect.\nAnd to have it at the old Ritz.\nYeah, it's amazing.\nSo, you know, it was great.\nIs that Is that what it is in the old Ritz?\nYeah.\nYeah, we bought the old Ritz.\nYeah.\nYeah.\nWe have to keep the Ritz sign cuz it's uh you know, one of those historical buildings.\nThat was a great sign.\nOh, it's a great sign.\nIt's got so much history.\nIn the tunnel on the way to the stage, there's a big picture of uh Steve Rayvon on the stage in 1983.\nYeah.\nYou like SRV?\n[ __ ] yeah.\nCome on.\nCome on, man.\nCome on.\nHe's the only dude who could play Voodoo Child.\nDoesn't make me sick, man.\nYou know, other than Hrix, just two dudes.\nYeah, you're right.\nHrix and him.\nI mean, other people I'm sure other people could do it.\nI've never heard.\nNo, [ __ ] that.\nJust them.\nOh, yeah, man.\nThere's certain songs There's certain songs that you can't [ __ ] with.\nAlthough, I did see one time I saw Honey Honey and Gary Clark Jr. played Midnight Rider, and I didn't think anybody else could play Midnight Rider.\nAnd to hear Gary's song with Midnight Rider with that, you know, like Gary's signature sound.\nOh man.\nYeah.\nThat signature guitar.\nYou've seen Gary?\nYou've been You've seen Gary live?\nOh yeah.\nI'm friends with Gary, man.\nYeah, I've seen him a bunch of times.\nYeah, I love Gary, too.\nI love that dude.\nThat guy.\nHe's so good, man.\nI remember Oh, I gave something to him, and I got it for you, too.\nWhat is it?\nThis is a real genuine woolly mammoth guitar pick that is made out of woolly mammoth tusk.\nDamn, that is something fierce, bud.\n10,000 plus years old.\nAnd then that's a shout out to my friend John Reeves from the Boneyard in Alaska.\nI got a buddy of mine who has this spot in Alaska where they just pull all kinds of crazy mastadon, woolly mammoth, [ __ ] cave bear, all kinds of skulls, all kinds of wild [ __ ] out of this one piece of property where a lot of animals died.\nAnd he's taken a lot of the woolly m That's where I got this, too.\nThis is a tooth.\nThis is a tooth that was carved.\nWow.\nInto a piece of art with a mammoth in it.\nThat's a big old goddamn tooth, son.\nImagine how heavy that is.\nIsn't that crazy?\nIt's crazy, right?\nIt's beautiful, too, man.\nYeah.\nSo, that that guitar pick is yours, brother.\nMan, thanks, Joe.\nYeah.\nAny cool guys who play guitar, give them one of them picks.\nUh, you know, I never been good at holding holding a pick.\nUm, so I I learned how to play with my hands, and I because I could never hold a pick well, but some of a lot of guys I know that are really great pickers, they play these really hard picks, you know, and can real precise with them, and I just I still can't hold them.\nYou you learned with your fingers.\nYeah.\nYeah.\nI never never hel I just couldn't hold the pick.\nI would try to hold it, and it get sideways, and I never like all this, you know, like the straight cowboy chords, you know, CFG, whatever.\nUm, I couldn't hold any of those chords like when I was teaching myself.\nThe positioning was weird for me, you know, and so like I kind of threw away the book, and I did what you call choking the chicken on the on the fret, you know, kind of hold it like you're choking the chicken.\nMhm.\nAnd that's kind of where I developed my style.\nAnd then I\n\n\nI learned all the regular chords many years later, you know.\n\nDid you, are you totally self-taught?\n\nOh, yeah.\n\nWow.\n\nWhen did you start?\n\nUm, uh, I was 17.\nMy mama got me a guitar out of a pawn shop in South Irving.\nWow.\nHoner guitar.\nAnd you just started messing around with it?\n\nYeah.\nYeah.\nYou know, my mom had tried to get me on the piano when I was younger and I just couldn't focus.\nAnd um, yeah, I don't know.\n17 was like the right age.\nI, I needed it, you know.\nUh, started banging around on that guitar and, and I mean, it must have sounded terrible.\nAnd, and we, me and my mama lived in this little ass place, this tiny place.\nAnd I didn't, I was like scared to play in front of her, you know, but, but I was at first.\nAnd I would say, \"Mama, am I any good?\"\nYou know, and she wasn't going to lie to me.\nAnd she said, \"Well, son, when you play, people will believe you.\"\nShe wasn't going to lie to me and tell me I was good, but she was trying to say, you know, just be honest with your music and the rest will take care of it.\nThat's great advice.\nYeah.\nWhen you play, people will believe you.\nThat's what she said.\nYeah.\nYeah.\nYep.\nAnd then the next time anybody believed in me was until I started hitchhiking.\nAnd I remember, cuz I've been out in California a bunch recently and it was, I had caught a ride with this guy.\nWe were playing at this place called the Shanty up in uh, Farmers Branch in Dallas Fort Worth area years ago.\nAnd there was this witch lady that, I mean, they called her a witch, this kind of um, kind of magic woman who had a barn out behind her house and they called it the shanty and she would have people over on the weekends and just kind of any random night, travelers, misfits, whatever back there in the barn and everybody'd be telling stories and trading songs and, you know, taking potions, stuff like that.\nLong story short, this guy I met one night, his parents had like worked, they worked for like Texas Instruments and he had disowned them, you know, because his parents were like scientists.\nAnd he woke up one day as a young man and realized they were like, his parents were manufacturing like weapons, you know, and I never saw this guy again, but that was his whole deal why he left Texas.\nOh, wow.\nAnd he was just back visiting this, this gal that had this shanty deal.\nAnd uh, I talked to that guy that he promis, he would, he was describing this town of Booneville, uh, which is this community in Menescino County, Northern California.\nAnd uh, the way he was describing it to me at this in this barn or whatever, it sounded like uh, the Garden of Eden or something, you know what I mean?\nLike, and, and I wanted so badly to go with him.\nAnd he promised me and this other guy that was playing guitar too that he would take us and we passed out at the lady's house.\nWhen we woke up that next morning, he was still there and I was like, \"Man, you ready to go to California?\"\nAnd he was like, \"What are you talking about?\nWhat are you talking about?\"\nLike when I pressed him, he's like, \"Man, I was on acid.\nI was on acid.\nI, I don't remember any of that.\nI don't have any room for you.\"\nAnd I, I begged that, I begged him like my life depended on it.\nAnd he took me and this old boy who was playing guitar.\nActually taught me a lot of songs back then.\nHe took us to California.\nUh, but as we got closer to Booneville and we were talking, two naive young Texas boys who had never been anywhere, he realized he, you know, didn't want us going anywhere near those hippies he was living with there in Booneville.\nSo he left us, like he pulled into like a grocery store and left us in this parking lot in Bakavville.\nAnd that's when I really started hitchhiking in my life is like when we kind of got abandoned in a parking lot.\nWow.\nKind of along the five.\nRight.\nHow old were you?\n20, one, probably 22, something like that.\nAnd I had done some a little bit of hitching before, like around South Texas and like Louisiana, but I'd never really been way out there.\nAnd uh, anyway, I started hitchhiking around um, because I had to.\nBut I remember it was in California the first time by anybody besides my mama ever looked at me playing guitar as it having any kind of value, you know, like any economic value or like it was a, it was a trade of, you know, recognition, you know, it was kind of the, was the first time I was out there, out there.\nSo you'd been playing about four, four or five years back then?\n\nYeah.\nYeah.\nI was playing outside because our place was so small.\nI wasn't playing outside to like make money or anything like that.\nI would go to this park, had like a baseball diamond on it, sit on these bleachers or whatever.\nAnd I'll never forget the first time anybody threw like just a pocket full of change in my case.\nI'm sure it's because they, you know, were worried about me, felt bad for me or, or whatever, you know.\nAnd it wasn't like that.\nIt wasn't like that money hit the case and, and then like a light went off or anything, you know?\nIt was a slow, it was a slow, gradual deal like I was playing outside because there was, you know, there wasn't enough room to play in the h, in the house or whatever, you know, and then, you know, I got in a lot of trouble with the law.\nUm, which kind of put me on the run, put me on the road.\nAnd what was the trouble with the law?\n\nUh, you know, my, I've said it a lot and it's funny.\nI'm a lot better known than I used to be.\nSo, it's like you say stuff about your family and they hear about it and they get mad.\nThey get mad.\nBut, uh, it's so funny cuz it's all over the internet and uh, they're the ones that had the government on their ass, not me.\nBut anyways, yeah, we just kind of, you know, [ __ ] hit the fan, got up in the newspapers.\nMy brother didn't go to high school, you know, neither my sister, neither of them went to high school.\nThey both dropped out, you know, cuz I'm from South Texas.\nI was born in the real Grand Valley.\nThey were born up in Dallas, but my mama had moved down there to uh, South Padre Island area, Macallen, Haringen area there.\nAnd um, anyway, it's poor and pretty hard living down there.\nAnd you know, hell, I didn't wear shoes till I was probably nine or 10 years old, you know, playing outside.\nAnd my brother and sister, they're 10 years older than me, half brother and sister.\nAnd uh, we have different daddies.\nAnd uh, they really lived wild, you know.\nIt was things were pretty, pretty tough back then or whatever.\nI'm telling you that background because my brother became a hustler, you know, because he had to because of a lack of education, lack of access, you know, because of poverty.\nUm, and I've honestly always respected him for that, you know.\nUm, he took, he used to take me around door to door selling newspapers when I was 11, right?\nAnd you want to know why?\nCuz I had, I had broken my arm.\nAnd he realized if you carted that young boy out in front of those, those apartments when that lady entered the door and it's these two brothers and one of them's got a broken arm, she's going to buy the, she's going to go ahead and subscribe.\nYeah.\nBad.\nYeah.\nAnd in a, in a, in a nutshell, man, he, you know, through all that stuff, you know, he, he started out as a door to door salesman, you know, hustling newspaper subscriptions, right?\nThen he started like selling neck ties and like men's clothing door too in downtown Dallas office buildings, you know, and as a very young man and eventually he graduated to, you know, hard knock boiler room type of guys, you know, you keep knocking on those doors in that Wild West business scene of towns like Dallas, you know, or Houston, you know, eventually you're going to find what you're looking for.\nAnd he got in with some big old wolves, you know, and eventually it, it knocked everybody out and a lot of people died, a lot of people went to prison and um, you know, we were in the paper and uh, I couldn't, all I found myself not being able to get a bank account and nobody I knew would go near me, you know, and um, so it ended up being like a Bob Marley type of thing, you know, like, you know, he said uh, if you're not living good, travel wide, right?\nAnd I literally just walked out of town because, you know, we had Scarlet Letters on our chest.\nAnd that's when I, that's when I really started learning how to stand behind that guitar and write songs and slowly but surely start, I, I learned how to play basically in front of people and people just were giving me money kind of over time.\nThat and, you know, food and shelter in exchange for my story at their back door.\nThis episode is brought to you by NETFLIX.\nDo you think your family's got drama?\nWait till you meet the Buckleys.\nI'm talking about the new NETFLIX drama, THE WATERFRONT.\nSet in a coastal town in North Carolina, it follows the powerful Buckley family who've ruled Havenport for decades.\nBut now, their fishing empire is falling apart fast, and their legacy is on the line.\nThere's power grabs, addiction, legacy, love.\nFrom the creator of Scream and Dawson's Creek, THE WATERFRONT is messy, twisty, and totally binge-worthy.\nWatch THE WATERFRONT now only on NETFLIX.\nYou know, do you ever wonder like how things could have gone?\nCuz things turned out great.\nLike look, you're popular music artist now, you know, worldwide.\nYou're famous.\nI'm surprised, I, I'm, you know what I'm surprised by?\nI'm surprised I never got heavily addicted to drugs.\nYeah, I am.\nYou know, my, my sister passed away 10 years ago from substances and hard living and all that kind of stuff.\nAnd hell, my whole family is in AA.\nEverybody top to bottom, left to right, turn them inside out.\nI think about it a lot, but I really do, you know, and I remember I was living with that guy who uh, was at the shanty that was playing guitar.\nHe's on the football team.\nI knew him from sports.\nHis name was Daniel Harmon.\nAnd he went out there to California with me that first time.\nAnd we were living on farms and I was working for Ganja farmers, uh, working on horse farms, working for guy, uh, uh, wine makers, all kind of people, you know, just, just doing grunt work for them, doing the fence work they, they, they didn't want to do, moving soil for people, you know what I mean?\nDigging ditches, you know, laying pipe across really hard, you know, rocky roads.\nNot anything anybody can do.\nYou just need, you know, broad back and a, you know, to be young, right?\nAnd um, but before I ever left Texas, I moved in with his, his sister.\nAnd I remember and she was just my friend.\nI was never in a relationship with her or anything, but she was working at Silver City in West Dallas, the gentleman's club at 18 and making more money than anybody I'd ever seen.\nThe girl was 18, you know, and just making crazy, crazy money and I was live.\nShe let me rent a room from her and kind of gave me a deal and all that.\nAnd uh, I ended up writing a song kind of about it more recently called Easy Money that I did with Shooter on this on the Lonesome Drifter record.\nAnd it's kind of that thing, you know, if you're poor kid from Texas, there's no such thing, you know, as easy money.\nBut um, not, I can't remember why I was telling you that, but um, it was hard on, I just remember like seeing, you'd see like young women working in strip clubs making big money and the ones that I was around and have been around, very, very hard for that line of work, my line of work, your line of work not to become addicted.\nYeah.\nYou know, and I don't have a problem with, you know, a lot of the best, most, most best artists I ever saw struggled, struggled with addiction, you know.\nUm, but I have, in that way, I have been very fortunate.\nVery, very fortunate that.\nHow did you avoid it?\nI don't know.\nYou know what it is, man.\nI never had no kind of, no, had no kind of tolerance, you know.\nI'm, I've always been like, I guess get drunk off of one drink and it's never changed.\nI just felt it all like really strong, you know, like that's probably good.\nYeah, maybe it's a survival instinct, too.\nI've never really thought about why, you know, but I've considered it because my brother's been through, you know, he, he did a lot of time in prison and, you know, my, my sister had and my mama, you know, I mean, they both had their first kid, you know, when they were teenagers, you know, um, a lot of it I do credit to my mama, you know, it's like, you know, she told me something, I remember that stuck with me.\nI've been saying this all the time, Joe, and like we had a lot of trouble in our family and a lot of people that we knew, a lot of dysfunction, a lot of trauma.\nUm, but what my, my mama kind of got out of that, she kind of is the person in the family that said, \"I'm going to change the trajectory of this line in now in my generation, you know, and she didn't have an education and um, you know, she took herself back to school after I was born.\nUm, you know, and cleaned up her act and, and, and got out of it and, and isolated me from a lot of that [ __ ] and um, which I think is a big part of the reason that I maybe didn't.\nRight.\nYou had a role model.\nYeah, I had a role model.\nYou know, I didn't, there was no male role models, at least not at home.\nThey were only, they were only pro aletes and coaches at school, you, I mean, it's increasingly difficult for young men to find strong men of courage and vision that can help them grow into good men, too.\nI mean, it's, it's, it seems almost impossible these days.\nIt's unbelievable, right?\nIt's very difficult to find in\n\n\nYour personal life. It's hard, man. You have to find it in other ways. You have to find it people online, or I found it world athletes in, in, um, like, uh, like excellence in like athletics, right? You know, um, where the only way you can get there is hard work. Yeah. And odds are stacked against you, and it requires incredible focus. I mean, I just, I think that's why I'm always so s, you know, in such awe of of those people when they're able to um, succeed like that. But what I wanted to say to you that my mama said, she said, \"What happened to you when you were young, it's not your fault, but now you're a man and it's your responsibility.\" And I've been living, I've been living off of that, you know, for a long time, you know, cuz it's like if you don't take responsibility at some point, man, it'll, it'll, it'll never leave you alone, right? You can't think that you're a victim.\nYeah. You can't think that it's not your fault. You got to take responsibility. That's hard for people to accept when they know they've been victimized, when they know they've been dealt a shitty hand of cards, you can just kind of wallow in it. But that's a trap. That's a trap that'll [ __ ] you up. It'll [ __ ] up everybody around you, too. Damn right. Yeah. But it's a mindset thing. It's like you can, you can think your way out of that. You just, you have to have an example though. Either you have to be your own example or you have to find an example of someone else who thought their way out of it.\nAnd for my brother, you know, for my brother, for all the trouble that he's been in, you know, in a way like, you know, he, I think he was trying to, he also was trying to help me, you know, and so, you know, his hustle and his work ethic in another sense, you know, was that's been helpful to me, too, you know, cuz I remember he used to hand out flyers and [ __ ] all over the place. And when I'd be like a teenager, he'd be like, he'd be like, \"Listen to me now. If you go, if you leave an event at the other day that you're handing out flyers and you're flooding it with promotion, if you can even see that pavement underneath the, you know, pamphlets that you're handing out, you didn't promote it.\" Wow. That's what he used to tell me. I was like 15, 16. And that all has come, that mentality came in handy for me because, you know, I was just a street performer, just an itinerant performer. And um, you know, I did have to learn how to market myself, you know, and and um, part of the reason that I was, man, sometimes being underestimated is like the best thing that could happen to you, you know, because I think one of the biggest challenges for like in the music industry at least is that the way the business works now is they're almost exclusively, you know, you ever seen Moneyball?\nBrad Pitt flick, Moneyball. Yeah. Right. Yeah. How they, you know, they introduced that concept of looking at the data to like maximize the potential of the athletes and all that kind of stuff, which is totally changed the game, you know, all the games. Uh, I kind of call it money guitar, right? Which is like, you know, the business is seeding the young amateur and for the way that they spend and invest and can move on if it doesn't work out. It's like kind of a, you know, it's kind of a pump and dump, you know, and the thing about that, and it works like if somebody has a, you know, if somebody like some of these guys you mentioned, Oliver Anthony and some of these guys, they have a viral hit out of nowhere, they've never played a venue or anything in their life, you know, um, it can happen really fast and then obviously there's tremendous challenges is, you know, down the line trying to keep that, you know, astronomical, you know, quick rise up there. Um, but back in the day, the business deals weren't any good. You know, that they were terrible, right? What they were good about though, in a lot of cases, was developing these artists on these rosters. Even if they were taking advantage of these poor farm boys, taking advantage, you know, of, you know, poor black artists from the south or women or whatever. Nobody was getting a good deal, basically. But you know, like guys like Willie Nelson and Whan Jennings, those guys were making two, three records a year. Wow. You know, and you think about when Whan breaks through, right, in the mid-70s, you know, like as he's doing, you know, coming into his own in 1974, 1975.\nI mean, how many records in is he at that point? You Wow. He's how many, I mean, you know, Willy's Reddit Stranger, which revolutionized country music or like the Outlaws compilation record that the two of them were on together, which was basically a compilation and kind of marketed as the outlaw subgenre. Um, you know, those guys were 15, those guys were 15, 16, 17 records in. You know, Artha Franklin popped off on her ninth or tth record. Wow. You know, and these most of these artists, the way the business works, they won't make nine or 10 records in their career, right?\nThat's crazy to me. That is crazy. And what better way to develop than to just keep constantly producing new music and learn along the way in, in being neglected or misunderstood by the business when I was first dealing with it. That was the It was a really, really a blessing because I ended up making so many records, you know. Yeah.\nThe music business has always been so predatory. But it's, it's, it's like it's the way I describe a lot of things. It's like when you get something that's good combined with a bunch of people that want to make money off that something that's good, you know, whether it's medicine or whether it's music or even in comedy, you get the same thing. You get a bunch of people that just think they can make money off you. Man, I always thought comedy was the hardest. Always figured it was the hardest, right? Because you mean like you got to make them laugh or they're going to [ __ ] kill you and you have new [ __ ] all the time. There's nothing, there's nothing behind you. There's not even a guitar covering you up, right? It's crazy to me just to watch all those guys do their bit and [ __ ]. So like I was always amazed by even attemp people going up at like the open mics and like trying out their routine, you know? That always terrified me. It terrifies me still when I watch open mics. I watch open mics and I watch someone bombing. I, I got to leave the room cuz I, I, I fear it's contagious. Like if, uh, if I was on the road and I didn't get to pick my opening acts, like if I was working at a club and they had, uh, some local act in Florida or something like that and the guy was [ __ ] terrible, I would literally have to like not listen. I'd have to leave the room and just sort of time when I was going to go on stage so I go on stage with a fresh mindset. I couldn't think that this audience had been poisoned by this guy's shitty comedy. I get that. You know what I mean? It's like you're, it's, it's terrible and it's like you, you think that nothing can be funny. Yeah. He just, it's like this, like he's hypnotized them right into this like mediocre state of mind, like I can't listen. I got to hide. Yeah. And it's crazy that they could have that, that strong an effect on the audience like that, that quick. I mean, somebody can be up there [ __ ] it up like crazy musically. Yeah. And you kind of get a pass, you know, right? You know, poetic license or whatever. Well, you know, people, it's tolerable if the guy's into it. You know, he could be into his own music and you're like, I'm not into it, but he's into it. At least he's like doing his song. If you're not into, if you're doing comedy and the audience is not into it, you're [ __ ]. You're like really [ __ ]. You have to engage those people. I see that. It's unbelievable. You got to be connected to those people. And you can't fake it. Like, you can't even be saying the words perfectly and not be thinking about it. You have to be thinking about what you're saying. They know. They're little animals. They smell you. They know. They know if you're faking it. And you just got to lock in, man. And you got to learn how to lock in. It takes about 10 years. It takes 10 years of eating [ __ ], just [ __ ] bombing and traveling around and opening up for people and and barely getting by. That's the same thing with music, though, about the 10-year deal, you know, the 10,000 hour thing. Mhm.\nThere's no doubt about it. I think it's probably almost everything. Yeah. Almost everything. Anything you dedicate yourself to, you know? Uh, you like Nam Chosky? Yeah, sure. You ever seen like old Nam Chosky? Yeah. I listen to him today. I'm like, Jesus, stop talking. Yeah, he's popping off, isn't he? Well, he just went the COVID vaccine stuff. He was out of his [ __ ] mind. He was wanted people to be isolated and quarantined and taken away from society if they weren't willing to take this [ __ ] experimental [ __ ] that turned out. I haven't kept up with him in, in recent years. Well, he's old, right? And old people. Unfortunately, also he's an academic, so academics tend to trust experts in whatever field they're in. And if he doesn't have an understand, like he, he has a deep understanding of how compromised people are politically by money, you know, and he's written some brilliant work on essentially the, the way the, the media is compromised and the way, you know, politics are compromised. I don't think he applied that same skepticism towards the pharmaceutical industrial complex, which is strange. Well, people have their blind spots. Yeah, we all, we all do. And they trust experts and if you, you know, he's got experts that are academics and you trust them and and also he's old and old people get real scared of diseases. They get real scared because they know how [ __ ] vulnerable they are. All the people that I knew that were old had the craziest reaction to CO. Terrified. Even my own parents tried to, you know, talk them through some of this stuff. They didn't want to hear it. They only wanted to listen to doctors. They want like, I don't think this is what they're telling you. Yeah. Doctors are crazy. They're just, they got a cabinet full of pills that they've been, they've been sold to. Mhm. sell you and they're incentivized. That's what's really crazy when I found that out that I mean, I, I learned so much during the pandemic about the medical industry where I, I just thought they were there to, I didn't even, I'm so naive. I didn't even realize that hospitals are privately owned. I thought these were things set up by the government to make sure that people can get healed, right? You know, I thought it was all about making people better. And it's No, they're not public. The closest thing to public. They're as if they're owned by like a, you know, religious organization, a church. Yeah. Isn't that crazy? It's crazy. Yeah. It's crazy. And they're just [ __ ] shuffling people in and out trying to prescribe them as many things and they're financially incentivized to prescribe things and then they have extreme overhead because they have liability insurance. They have student loan debt and they have, you know, a high overhead to keep their practice running. And where's Bernie Sanders when you need him? Yeah. Well, well, no. See, so I had, I had open heart surgery right here in Austin, uh, to fix a, what was wrong with your heart valve here? Well, I was born with wolf Parkinson's white disease. It's a, it's an electrical issue. Um, in your heart, basically, like your heart misfires. All this electricity is moving through it all the time. Uh, you know, like a semiconductor or whatever. And there was like a section of it that was like misfiring and it would cause my an arhythmia with me. Wow. Um, and when I was a kid in South Texas, we were told that was all I knew about and we were told that it was an annoyance. Um, cuz I almost died a couple times when I was really, really young from it. And you know, my mama noticed and saved my life a couple times by getting driving in, you know, into the city there in the San Benito and them hooking me up to all the wires and saving me. Anyways, they told me as I got older that it would just, um, I could get, you know, abl an ablation for it where they apply heat, basically, and close this electrical channel that's stuck in a loop or whatever. Um, but it, but it wasn't life-threatening.\nAnd then I got out here, you know, I was on the street for years. And then when I was coming off the street through kind of blues jams and I had been, you know, I was working on Ganja Farms and had started selling, you know, weed in the mail and all that to kind of get off street, buy myself some better clothes, get myself good guitar and an amp and all that. Started showing up at blues jams and then I could like, you know, cuz everything takes money, you know, like problem of being a street player was you can go play the open mics that have a two damn drink minimum, right? And they'd see my crazy ass coming and knew, knew that I was, you know, pretty wild and they didn't have any money and it didn't smell and I didn't smell good. So, they really didn't like me for the, you know, for the longest time or whatever. But I threw blues jams. I started leading bands in bars. Deep Ellum, first gig I ever got. And Austin was, uh, right there at Darwin's Pub, you know, on Sixth Street playing kind of solo in the afternoon. It was the only guy CJ was the only guy that give me a gig even on Sixth Street. I always owed him for that. And I think he was giving me 50 bucks, you know. He wanted me to get paid out of the, uh, Well, whiskey and those\n\n\nThose, uh, what does he sell over there?\nThose gyros or whatever the hell he's got over there.\nUm, anyway, I get on the road.\nI get an agent.\nI was standing out a green hall handing CDs out on a street corner cuz I couldn't get into the show.\nHanded a guy a CD.\nHis name's Evan Felker.\nI didn't know who he was at the time, but he's front man for Turnpike Triadors.\nUm, I gave him a CD and, uh, he, uh, well, he took it home and he listened to it with his then girlfriend and now wife.\nAnd lo and behold, his agent, John Folk, called me up and started booking me.\nAnd then that's when I started playing the old, uh, red dirt, I like to call it the Hank Williams circuit, you know, the kind of old country chitlin circuit.\nJohn Folk had kind of inherited it, inherited it from like, uh, Buddy Lee attractions from an earlier generation that goes all the way back to Lucky Mohler and that old South Circuit that all the R&B and the and the Hillbilly Country Boys were on, and Folk kind of inherited it and rebuilt it.\nAnd then they, you know, then Coke and Pepsi came in, you know, CIA and, uh, William Morris and Werman and bought it all off, you know, bought it all out and you had no choice.\nI mean, they were going to part it out no matter what.\nAnd that's the way that it works, right?\nWhen you get Coca-Cola's attention, right?\nAnd they show up and they're like, \"Good job.\nYou're taking some of our money away from us.\nWe're going to buy you out, son.\"\nAnd right, I think you can refuse them once or twice and they'll come back with a better deal.\nRight.\nAfter that, if you keep turning them down, then they put all their energy into knocking you out, you know?\nYeah.\nThat's what I mean.\nAs long as Coke doesn't change the flavor of Coca-Cola, right, they can, you know, that gangster [ __ ] all the other gangster [ __ ] they do works really well as long as they don't [ __ ] up the original flavor.\nRight.\nRight.\nSo, I'm on that circuit working my ass off.\n200 and whatever shows a year for a bunch of years in a row.\nPlaying all over the place.\nSeems like sometimes we play 21 nights in a row out there, you know, for [ __ ] kickers at Bonita Creek Hall and punk rock clubs in New Jersey and [ __ ] you know, playing at the [ __ ] you know, the Saint, that little club, the Saint in Asbury Park.\nIt's like a 40 cap, man.\nIt's a badass place.\nAnyway, um, my I was like blacking out.\nI moved up to a bus and [ __ ] and I was like my I was getting really laded and I'd be sitting in the back of the bus and I would be so lightheaded.\nBe blacking out a lot, right?\nJust sitting there, short of breath.\nBut I just thought, you know, I'm grinding.\nI'm playing all these shows.\nI'm going I'm going as hard as you can go, taking potions, you know, just doing all this dumb [ __ ] working hard.\nAnd, uh, I was playing at the old Shady Grove here in town that's now closed down.\nThey used to do, it was the KGSR radio thing.\nMarsha Milum put it on or whatever and then it turned into, you know, ACL radio and then Shady Grove closed down there on Barton Springs or whatever.\nBut I played it a handful of times.\nFirst time I played it, there was nobody there.\nSecond time I played it, it was packed and I had I had Willy's old tour bus, the Reded Stranger.\nIt was one of the ones he lost in the IRS era that he never got back.\nOh wow.\nAnd this [ __ ] shyer, Chuck Lian, I remember he some he some [ __ ] was selling this thing on the side of the highway up in Oklahoma.\nThe reddited stranger with the murals on it and [ __ ] It's a beautiful bus.\nSomehow this guy gets it.\nI shouldn't call him a shyer, but he definitely shy me.\nThat's a shyer then.\nYeah.\nYeah.\nYou know, the music business is crazy because So there it is.\nYeah.\nWow.\nThat's the one, man.\nYeah, that's the one.\nIt on the other side it says, uh, driven only by the finest bass players.\nWow.\nYou know, cuz somebody in the band always drove those old buses.\nI had that bus.\nI used that bus exclusively for about a year or whatever.\nAnd we get off the stage at Shady Grove and my heart had gone out of rhythm.\nHow just say this?\nI almost died in the back of that bus.\nI end up finding because it won't go.\nHere I am 30ome years old or in my early 30s.\nMy arhythmia is out.\nIt's It's going out and it's getting harder and harder to get back in to shock it back into normal rhythm.\nAnd I just kept ignoring it because somebody told me in South Texas in the 80s not to not to worry about it.\nAnyway, um, you know, I turned out that my heart had enlarged and all this [ __ ] was going on and I had to get surgery.\nThe point long round point that I'm making to you about medical industry that I learned the hard way, man, is like no one's advocating for you.\nOnly you.\nYou have to be your own advocate.\nThey don't give a [ __ ] you know?\nThey don't like they were just going to automatically put a mechanical valve in my heart, right?\nAutomatically didn't present any other options, anything, right?\nUm, and I get there on the American Heart Association web page or whatever because I didn't have insurance at the time or anything, nothing, you know.\nUm, the only reason that they covered me at the time was the Affordable Care Act and I had the right window where they could not deny me, right?\nOtherwise, I don't know what I would have done and that is absolutely an imperfect system, right?\nI just didn't have health insurance.\nSo, here they are covering me and probably because I don't have money and they're dealing with, you know, how it is, you know, American business practices or whatever, they're like, \"Here's this mechanical valve.\"\nAnd I go and look it up, Joe, and it's like, you know, um, if you have a mechanical valve, you automatically are on blood thinner the rest of your life.\nAutomatically, no matter what.\nThere's And you can't That's just how it's going to be.\nUh, it lasts twice as long as a prosthetic valve, which I had not heard of at that point, but that was the whole thing.\nThis can last up to 20 years.\nBut guess what?\nYou have like 300% higher risk of a stroke with a mechanical valve as a prosthetic, a boprothetic cow valve.\nUm, and then the third thing was that you can hear that thing clicking.\nYou can hear the valve Yeah.\nTicking.\nMy buddy Everlast has one of those.\nReally?\nYeah.\nHe could go like this.\nYou can hear it.\nYeah.\nAnd I was reading about that and man, I'm like neurotic.\nLike I knew I'm like I'll never get over it.\nSo that's when I found out about the about the boine cow valve.\nSo it's made out of a cow.\nYeah.\nEdward Scientific makes it.\nI carry a little card around in my wallet with the tag of the of, you know, that product number in case somebody sees me on the finds me on the sidewalk.\nWow.\nYou know, and that How long does that last?\nThey're supposed to last around 10 years.\nAnd I had mine in, uh, I had mine done in right there at Seatin, you know, seat medical there on 38th in, uh, January 2019.\nSo, we're coming back around to it.\nI'm kind of So you have to get another operation.\nYeah.\nBut what they did is they put a they put a the way they did it and here's the thing about right medical and anything right the medical industry is I think really [ __ ] up and really predatory totally profit driven and like you know people's health and preventative well-being and all that.\nI mean, we don't get they don't give we don't give a [ __ ] about that, right, in this country, you know?\nI mean, there's no money to be made off of people look taking care of themselves and eating right and being preventative and like, right, you know, there's there's there's nothing in that.\nThe part about it that is amazing though, even in the like kind of insanity of all the land of cheap traders is the technological advancements.\nYeah.\nThe technological advancements in the medical field though not really you know, um, available to the common person, um, they are incredible advancements, right?\nSo it's like they're moving so quickly that by the time I need to get another one I don't think they'll ever have to open me cut me open open again because they can like go in through a scope now wow they could do it at that time it was just more experimental and they didn't want to do it they were only doing it on really high-risk older patients you But I think it's already kind of gone more mainstream from where when they cut me open to like if I did it right now, I could probably get around cutting it, you know?\nRight.\nSo they'll go in through an artery.\nYeah.\nAnd then what do they have to do to it?\nWell, so with me, what was happening was is so I had the wolf Parkinson's white.\nI had to get the ablation first to deal to before I could deal with what it, uh, aortic valve disease is what it's called.\nAnd what it what it basically is is that, um, over your aorta there's these three valves that sit on the over the top of your aorta that they look like a Mercedes symbol is what they look like.\nIt's like the best example.\nIt really looks like a Mercedes symbol.\nAnd, uh, some people, uh, it's a bicuspit or whatever.\nSome people are born with two of the three fused together or just one missing altogether.\nAnd it turned out that I was missing one.\nIt's like a leaky carburetor, you know?\nSo, like as the time goes, that old carburetor in that truck over time just leaking more and more and more.\nWow.\nYou know, and I mean, I just got lucky, man, cuz I was like in the back of that [ __ ] bus and there was this lady driving us back then that like was like holding seances and burning sage over the top of me while I was like laying in the back of that bus.\nLike, that was going to heal me.\n[ __ ] That [ __ ] didn't work.\nAnd she doesn't drive me anymore.\nGet yourself a good bus driver.\nYou have to get a good bus driver or you'll never get good sleep.\nYeah, because you'll be freaking out.\nYou'd be thinking, \"What if this person falls asleep?\"\nYeah, there's a lot of them.\nEspecially the late night drives.\nOh, man.\nLate night drives are scary.\nThat that highway starts hypnotizing you.\nThere was this guy, there was a video going around.\nHe drove us around for a little bit and there was this video passing around the industry.\nThis guy called Jimbo.\nIt was this bus driver that was like, you know, just a speed freak.\nAnd it was like this video of him where he was like on whatever he was on and somebody had recorded him or like they'd put a phone up or something because they knew his nuts and he was like having one of those [ __ ] like you know methamphetamine freakouts like you know driving the bus down the road and it was getting all passed around the industry and I saw it because like he was driving us at the time.\nJeez.\nI remember we woke up and I remember we woke up somewhere in New Mexico one morning cuz we're going on this road all of a sudden and we get up and I go to the front of the bus and he's we're like on some [ __ ] twotrack you know Khichi [ __ ] dirt road that was like behind behind a gate in a bus that bus right and I get up there and he's looking all crazy and the door handle the inside door handle of the bus had been pulled off and [ __ ]\nIt was crazy, man.\nWhen we got when we got to the when we got back down here in Texas, man, I never saw a fool again.\nJesus Christ.\nWell, you got to think if you're driving buses all through the night, there's a high likelihood you're on amphetamines.\nYeah.\nExactly.\nHigh likelihood.\nIt's for the business.\nIt's like probably the best way to stay awake.\nOh, no doubt about it.\nYeah.\nAnd then obviously that shit's very addictive.\nMhm.\nAnd you need it.\nThis band has to get to Cincinnati.\nYeah, we got to get to Cincinnati.\nIt's an 8 hour drive.\nThere's only one way to do it.\nWe got to drive through the night.\nThat's why all the old performers were all on pills, you know?\nThey were getting prescri I mean, you know, and they were getting prescribed that [ __ ] by the doctor.\nYeah.\nYou know.\nOh, yeah.\nDoes this give you a a greater appreciation for life, the value of life, like knowing you almost lost it?\nYeah.\nOh, yeah.\nYeah.\nI don't know.\nI I hadn't thought about immediately after that I started think I just c started think about my mortality you know I hadn't really thought about it before you know of course everybody feels invulnerable when you're young especially if you're young and you live you're living that wild you know transient moving around no roots when I was in my 20s I guess I really looking back now I was like man I was young like I thought I could live like that forever I thought I thought I could live hand and mouth and, you know, sleep in people's pastures and Mhm.\nYou know, do the gentleman hobo thing forever.\nBut, you know, I was 26.\nThere's something romantic about that, too, right?\nYeah.\nOh, I loved it.\nI I I wouldn't take it back, man.\nI mean like you know I believe that you know, um, you know, I think mental slavery is something that is real and but so much of it is us like we do it to ourselves.\nMhm.\nYou know.\nYeah.\nAnd so that's what I was going to say about Chsky.\nI haven't kept up with him in years, but I remember something he said long time ago that stuck with me where he was talking about like American, you know, consumerism over the last hundred years.\nIt really kind of illuminated my my kind of mind was he was saying he was like\n\n\nThere are people working really, really, really hard to eliminate your sense of purpose for the explicit goal of making you a more efficient consumer, right?\nAll human beings live for and desire a life of purpose.\nYeah, purpose.\nWell, it doesn't matter what it is, something that you can dedicate yourself to the 10,000 hours, the 10 years.\nIt can be, you know, anything, uh, wood making or your buddy with this ancient tooth that he's carving into this beautiful piece of art or whatever it is, you know.\nYeah.\nUm, I don't know.\nI guess some it's like a heavy thing, but I kind of realized when I became a transient that a lot of who I was was like this amalgamation of a bunch of people just trying to sell me products, you know?\n90s radio just blasting my brain as a kid, right?\nLike programming that, like, it's like the so much programming is so hard for me to watch because you know that it's only a vehicle for the commercials, right?\nRight, right.\nSo, whenever I'm watching something and as soon as I think that it's not that good, I can't stop thinking about, like, well, this is just a vehicle for me to, you know, think I need whatever the they're selling.\nYeah, you know, so I feel like I, I feel like I killed like a lot of the false version of me that I was becoming that I, I only realized when I walked, when I like walked away from Crystal City, you know what I mean?\nMhm.\nAnd then, and then I could, um, and then I really started becoming, you know, me.\nThat's when I really started becoming me.\nA lot of people are prisoners to that their whole life because the only value they place is in how much stuff they're able to acquire.\nThat's the only value that they see in life.\nThey look at numbers on a ledger.\nSo they look at numbers in their bank account and they look at the stuff they're willing to acquire or that they're able to acquire, right?\nAnd that's their only measure of success in this life.\nYeah.\nThe very definition of the word rich has changed so much over the last, you know, hundred years.\nYou know, it's kind of moved entire.\nIt really, it really richness wasn't a material idea, you know, but it what did it used to be?\nYou know, richness of life, uh, fullness of life, right?\nYou know, um, fulfillment, fulfillment, um, purpose, health, health.\nYeah, you know, community.\nCommunity, family.\nYeah.\nYeah, friends.\nYeah, real life.\nBut so many people, they, they, they forego all that.\nThey'll throw everything out the window just for the numbers, for numbers.\nAnd they, they think they're successful.\nI mean, it's the way that it's being run, you know?\nLike, I mean, there's no such thing as a free lunch.\nYou know, all this free social media ain't free.\nNo.\nYou know, you give up your attention.\nYour attention is very, very valuable.\nYour data and attention.\nYeah.\nYour privacy, the transparent society.\nBut man, like, you know, you're pulling, y'all pulled up that AI stuff.\nI remember, I, I won't tell you the whole thing, but I, I was playing on the street in Europe when, uh, when I was younger.\nI had met a guy down on the Lower East Side.\nHe's a Danish jazz singer and he would show up over in the states a couple times a year and he was doing really well there in Denmark and the state really sponsors the arts there in a big way and it's a small country, high quality of life, like he really had it made over there and when he was coming over to states to play music, it was almost more of a leisure thing for him.\nBenjamin Augerbach is his name, great singer, great jazz singer, and he'd show up at the open mics and all this, and he, I think he really liked me because he saw the way that I was living this American gypsy lifestyle.\nAnd he eventually helped me get over to Europe and I played the club circuit in Copenhagen for like six weeks or whatever.\nAnd I was really rough around the edges and like the American novelty in the folk and like blues clubs around Copenhagen wore off really quick.\nAnd I wound up back on the street, but this time in Europe and as soon as I started playing on street in Copenhagen, man, then being a real Texan in Europe in front of tourists on the street, man, I started, that's when I started making money.\nIt was crazy.\nMy money like quadrupled because all of a sudden I was like a truly exotic.\nTexas is exotic and everywhere you go in the world, it means something, right?\nThey either want to shake your hand or they step back and it matter where you go in the world, there's no, there's not an inch of the world that hadn't heard of Texas, you know, and, um, and that said and so musically, you know it and I think culturally it means something no matter what, you know, and to play music and be a Texan is worth a lot on its own.\nYou know what I mean?\nIt's a big part of it is just being a Texan.\nGary Clark Jr. learning how to hold his own under the tradition of Austin blues players in Texas guitar slingers.\nI mean, that's it's second to none in the world, you know?\nAnd so, if you've seen them live, you know what it is.\nAnd, uh, but I remember seeing, like, there were no self-checkouts at grocery stores and in the United States back then.\nNot one.\nAnd then I was like, I ended up down in France cuz it was getting cold in Copenhagen.\nAnd I had like, I had like two or 300 croner left and I put it all on a bus ticket to Paris because of my mama's favorite city.\nAnd I grew up quite a bit in Louisiana having some of that French heritage.\nAnd I went down there.\nI'm glad I didn't think about it, man, because the language barrier was really difficult.\nAnd I didn't really realize it till I was pulling into the city, you know.\nActually, there was this Algerian guy who spoke English that was like, man, go to Monmark.\nGo to Le Sakraore.\nGo to Le Sakur.\nThat's where the tourists are, whatever.\nAnd I kind of learned how to hustle tourists with gypsies kind of that would were let were using me kind of as a decoy on the steps.\nAnd I thought, \"This is great.\nThey, these gypsies love me.\"\nAnd I'm sitting there playing and while I'm playing, I realize that I'm just a distraction while they're pickpocketing these tourists.\nIt was a good trick.\nOf course, I didn't say anything.\nAlso, I didn't stick with them too much.\nBut like so like the automation thing, you know, they're, they're Europe is way ahead of us on all of that because in a lot of ways America, when you try to like analyze America against Europe and these countries over there, like in some ways it's similar, but we're more similar to Latin or South America in a lot of ways with just how big the country is, you know.\nAnd you know, the, the a, you know, um, because the country is so big, we got the states that are divided up, all that type of stuff.\nThose kind of technologies to like hit the people and become mainstream.\nIt's slow.\nIt's a slower process here, right?\nAnd one of the things, you know, about the pandemic that is obvious to me now is, you know, a lot of people realize that they could speed that up, you know, and, you know, I mean, they think they've been trying to eliminate, you know, the risks and uh, what's the word?\nWhat are they like, you know, externalizing cost, right?\nOnce like how do we get, how do we get these machines in here and these people out and it, we've probably jumped ahead in that process in America a decade or more in just a couple of years and I just remember this was probably 2010, you'd go into a grocery store in Paris and there was, there was only one person working there and everything else was self-checkout and that was years before I saw it here.\nAnd then you think about the way that that's hitting in every single industry in America.\nYeah.\nRight.\nWell, it's so easy for people to be completely disconnected from other people now.\nYou know, you don't, you don't have to interact, you know, and that's part of it.\nAnd if they don't have to pay people, they can maximize their profits.\nThen it becomes a very impersonal experience.\nSoylent Green is coming, baby.\nIt's coming.\nYou seen that movie?\nYeah.\nIt's a good movie, man.\nThat's a good movie.\nIt's a scary movie.\nYeah.\nWell, I think all the dystopian movies about the future, they undersold it, it's going to get real weird real soon.\nAnd because automation is not just going to apply to self-checkout, it's going to apply to everything.\nAll the all that truck driving stuff, that's all gone.\nThat's going to be gone, right?\nIt's all going to be self-driving trucks and they're going to be more efficient, less accidents, safer.\nJust remember those big business people.\nJust remember those people.\nI know a whole lot of people who have relied on undocumented workers in this state for decades voting against the very thing that they were using themselves this entire time.\nYep.\nRely.\nHow you going to rely on undocumented workers, right?\nYourself, right?\nYou ain't paying taxes on it.\nYou're not, you know, those people got no safety net or anything, right?\nAnd then, you know, here comes the, that's where it's going to happen.\nAnd you know, I'm not saying this just as a negative thing.\nLike, I think you can already see in social media.\nI do think there's this um, this exhaustion even in the youth with this, with this monolith, you know, with this thing, the phones.\nYeah, you know, and I've been saying that in the music business, like in country music, you know, like Mark Twain said, history doesn't um, it doesn't repeat, it rhymes, right?\nYou know, and so it's like it's 25 now, but I was thinking of it last year in 2024 cuz like 1974 in music was this crazy year, you know, and like thinking about the Nashville system.\nThe reason that Charley Crockett is different than anybody else is because Whan's the specific guy who breaks the strangle hold that the Nashville system has on its artists that you can't use your band.\nYou can't choose your studio, right?\nLike any of that, like Whan, you have to think how crazy that is.\nYou couldn't use your band and you couldn't even pick the studio.\nYou couldn't produce.\nYou didn't have creative control at all.\nWhan's the guy that breaks that through that wall.\nHow did he do it?\nI think, I think a couple of ways.\nIt's all, it's the yin and yang of Willie Nelson and Waylon Jennings.\nThey were both on RCA.\nWillie was, you know, at first, you know, it's like Stapleton.\nStapleton made his career as a songwriter early on, you know, and and that's what catapulted really for everything, you know, that he's got going on on now.\nThere's a really great foundation there of a guy that's spent his whole life writing songs and that's what Willie did, you know.\nSo Willie actually had success pretty early when he got to Nashville with, you know, songs like uh Nightlife and Crazy and all that kind of stuff and Baron Young and Paty Klein and these kinds of really big artists were cutting his songs pretty early on, right?\nBut he was so weird to the establishment at the time and so um, you know, kind of had this like philosophical thing into his writing that was going over the heads of the Hillbilly deal.\nSo he was really neglected as a, you know, Willie Nelson records with him singing them.\nWhan was more favored actually by like Chad Atkins and them.\nUm, but like you'd be, you'd be number one on the country charts in Nashville in the mid-60s and be in debt.\nWow.\nYou know, that's what Waylon said.\nWaylon was like, \"Man, I'd be number one all the time and I was dead broke.\"\nYou know?\nHe's like, \"Man, they got you out there seven nights a week and you're coming back and Lucky Mohler's telling them that you owe him 10 grand.\"\nYou know, that was it was a crazy system.\nWillie ends up leaving RCA.\nThey're over him.\nHe leaves RCA because Jerry Wexler is coming down and ANR and Texans out of this progressive central Texas scene of that era that was so unique and it happened then and just totally unique the whole scene, everything here, the movement, the hippies and the cowboys, the the where everybody could like here in the capital of Texas, you know, it was weird, but they were in the same rooms, we're still doing that here, you know, which is what I'm, what I'm really proud of, you know, and glad that this town never turned into Nashville or LA or any of those towns.\nThe best thing that ever happened to us is that the business didn't grow up like that, right?\nI really do believe that because it's allowed our unique culture to continue to grow.\nUm, even if it's like I said, and sometimes it's, it's, it's good to be neglected by that machine for sure.\nBut so Willie leaves because Jerry Wexler pulls him out of there because RCA doesn't give a about him anyway, right?\nHe goes to Atlantic, sells 400,000 records.\nThe boys up in New York don't even realize there's a country division after Willie sells 400,000 records, which is a lot, right?\nThey close the division and that's when Willie lands at Colombia and he's having success.\nWell, they were starting to think that Whan was past his prime, too.\nBut then Willy's blowing up on the other label and Willie and Whan got the same manager at the time, Neil Russian.\nAnd what's Russian doing?\nRussian's leveraging it all.\nAnd so Whan was about to leave RCA.\nAnd they doubled down and matched kind of Willy's deal because they didn't want because they didn't want to lose Whan.\nAnd Whan was like, \"I'm only, I'm only Stan, you know, if I, like, I got to be producing my own records.\nI got got to be my band and I got to pick the place that I'm playing, you know, and he, he manages to do that.\"\nSo, it's not just Whan.\nI mean, it's Willie and Whan together.\nThat's why they're so tied together, you know, as these two guys.\n\n\nTheir careers just kept, you know, they just kept cut, they're chasing each other kind of through the record books, you know what I mean?\nAnd uh, you know, cuz you'd be in Nashville, it's still like this now, right?\nLike when I got signed in Nashville uh by 30 Tigers, it was purely because John Folk was my agent.\nAnd those guys, they'd tell you this themselves.\nThey didn't understand what is what I was doing.\nThey didn't get it.\nI was only put on the roster as a favor to my agent because they were having success with some other artists openly saying, \"I don't understand this, right?\"\nWhich at least they're being honest about, you know.\nUm, but then what they would do that was so weird is like they'd give you like if a major label would give you, you know, half a million dollars on your deal, these guys would give you 50 grand, right?\nLike a tenth of that, you know, kind of on the independent alt country Americana circuit.\nBut they would, what frustrated me, what frustrated me about it, Joe, was that they're only giving you a tenth of money, but they're behaving like major labels with these like two-year record cycles.\nThat just kills an artist that's like that.\nNo, that hasn't broken through.\nIt just kills you.\nThat's a that's a 100% industry model because they can always get another horse.\nYou know what I mean?\nThey can always get another horse and they can always, you know, they bet on 10 young guys and and one of those kind of amateur realist blows up, you know, they're good, right?\nBut you're never going to get a Whan Jennings out of that model, right?\nIt's not going to you know what I mean?\nIt's not it's not going to happen, you know?\nAnd so how did But how did Whan get it so that he could do whatever he wanted?\nbecause Willie left, right?\nAnd they because Willie left and all of a sudden Whan was really gonna leave.\nThat's all of a sudden that was his leverage.\nThey gave him everything.\nThey gave him everything and and and everything was changing.\nEverything was changing in Nashville cuz we're talking about when I say like 1974 here, you got to think about it.\nYou know, this is America in Vietnam.\nM you know this is America coming out of the '60s you know it's coming everything was you could I feel like in a lot of ways what was happening is like you know the commercial culture was really starting to take off you know what I mean and then by the time we get to the 80s you know it's like this level of like pop culture and like American pop culture as a global export, you know, by it's like I guess maybe it's finally truly realized by maybe by the time Michael Jordan becomes the like most visible person on the planet, you know, kind of in the 80s and 90s.\nIt's like Nashville was such an old system.\nIt's kind of like in country music today, like one of the reasons everybody's sprinting into it, right, is because it's one, it's like one of the only places left where there was like um loyalty, long-term loyalty in the fan base compared to like, you know, what happened with pop music in the last 20 years with pop and hip-hop and all that.\nI mean, I can't.\nEvery one of those guys called me at one point were like, \"I want to get into country music cuz you got loyal fans.\"\nWow.\nAll hip-hop industry guys.\nWow.\nAll of them.\nEvery last one of them.\nAnd they've had success with a whole bunch of guys since then.\nI just didn't do it.\nWell, country music has always been connected to authenticity.\nYeah.\nAnd that's the reason why you keep the loyal fans, right?\nBecause people know that it's real.\nWhether it's Charley Crockett or who whoever it is, it's authentic.\nYou hear it and you go, \"This is not mass produced.\nThis is not a bunch of executives sitting around looking at a focus group trying to figure out what's going to hit.\nThat's right.\nYeah, man.\nYou mentioned Coulter.\nI wanted to say this.\nThis is something I wanted to bring up with the Willie and Whan thing and I've been meaning to tell Coulter this.\nI'll just tell him on your show.\nSo, we were both on the 30 Tigers roster for years.\nI met Coulter out at Willy's Ranch, goddamn 10 years ago, right?\nAnd uh he's one of my favorites.\nI've always always loved his songwriting.\nI mean, everything he puts out is great.\nDon't you agree?\nYeah.\nI love him.\nSpecial, you know, really special.\nSome people Jamie turned me on to him when I heard Kate McCannon the first time.\nJamie Johnson.\nNo, Jamie.\nThis Jamie.\nOh, this Jamie.\nYeah.\nHe He texted me and he's like, \"You're going to love this guy.\"\nYeah.\nHe sent me that song.\nI was like, \"Holy shit.\"\nWhen I found out he was 21 when he made that song, I'm like, \"You got to be kidding me.\nThat sounds like a 60-year-old chain smoker.\"\nMan, it bowled us all over.\nAnd you know what's funny, man?\nHe's just getting better.\nYeah.\nYou know, he is.\nAnd he's incredible.\nHere's something about that.\nBut uh I I told him I need to I'm going to I wanted to buy him a pickup truck as a gift for this.\nThis is why.\nSo he was on the roster.\nI was on the roster and I started way down at the back of the line, right?\nAnd made a lot of records and more and more of the labels are calling and each record I'm putting out is doing better than the previous one.\nAnd um there's more money and promotion going into each album.\nBut all a lot of outside guys are calling.\nYou know, all the coastal labels are calling.\nNew York and LA are all over me.\nCoulter ends up pulling up stakes and going to RCA.\nAnd he didn't just go to RCA, he took everything with him.\nHe took the whole catalog over there.\nUm, and I wasn't really aware of that.\nI didn't know what was going on.\nUm, and RCA was like they had hollered at me like through one of their ANR guys or whatever, but it their big guys were never really interested in me out there, right?\nThey so they weren't one of the ones that was like really hot on me.\nBut David MSAS at 30 Tigers, very similar to what I'm saying is is Coulter to me is kind of like Willie left RCA back in the day and when he left all of the sudden those guys because he took everything with him were about to lose me and they [ __ ] handed the keys over to me.\nYou know what I mean?\nBecause and I think a lot of it had to do with the fact that Coulter had left and just took everything.\nAnd so that ended up happening on a on a on a record cycle for me uh for an album called $10 cowboy.\nAnd I was this close to going to, you know, the New York Boys and MSUS comes in last minute and beats them all on the royalty rate, on the money, on everything, right?\nSo uh I guess what I'm saying is Coulter is kind of my Willie Nelson.\nAppreciate you, bud.\nYou're doing good.\nYeah.\nHe won't do podcasts.\nI try to get him in.\nYeah.\nSent me a bunch of records, sent me some cool [ __ ] said sorry, but no.\nYeah.\nBut I mean, that's probably better.\nI mean, he wants to just be as authentic as possible.\nThe dude spends time actually working on a ranch.\nWell, that's what he loves to do.\nYeah.\nYou ever been up there to Saskatchewan?\nNo, man.\nIt's in their blood.\nYeah.\nThat's the what that land is.\nThat's what they do up there.\nYeah.\nI've been right through Saskatoon, even that big town there, you know.\nHe's I guess he's not too far down south from there, but like it's uh those are ranching folks.\nYeah.\nWell, it's in his music clearly.\nMhm.\nYou know, I mean that that guy screams authenticity.\nYep.\nHe does.\nAnd he grew up on on, you know, Whan and all that stuff, you know, and all the cowboy and all the, you know, he knows that cowboy music probably better than anybody.\nYeah.\nYeah.\nthat well that's that's the thing that when you're talking about these hip-hop artists and pop artists that that's what they fe you know all artists I mean even someone is a pop artist what what do they want to be they want they want something that resonates with people they want something that really connects with people you know and if they think the vehicle to doing that is a hit pop song they'll take that route but then they'll hear something like Kate McCannon like god damn that's what I really want to do yeah you know and you can't you can't duplicate that the Only the only way to do that is to live it.\nYeah.\nIt's got to be real.\nIt's got to be, you know, there's something just like I was talking about with comedy, like they they have to know that you're really thinking that.\nIt's something in music, too.\nThey have to know that this is and they like when you write your own [ __ ] too.\nYou know, you know that it's coming from someone's someone's mind and their their soul.\nIt's coming from their life experience.\nIt's who they are as a human being.\nThis is their art.\nThis is a true expression of their their their being and that that's what makes people loyal.\nThat's those pop artists just want to take a picture standing next to authenticity.\nYeah, they do.\nWell, they want to be it, but they don't know how to get there and they don't know how to do it and they've never lived it and they've been, you know, they've been paying attention to all the polls and the focus groups and they've been listening to the executives and they've been taking the advances and driving the Mercedes.\nThey're doing all the [ __ ] that leads you down the wrong path.\nAnd then one day you realize like, [ __ ] it's not what I want.\nYou know, it's it's interesting because it's like, you know, there's always going to be these examples of something that pops through that's real that people gravitate towards and then there's always going to be these people trying to capitalize on it and make money off of it and trying to figure out how to recreate it in an inauthentic way.\nIt's not possible.\nThat's the one thing that might save us from this AI [ __ ] Yeah.\nExactly.\nCuz AI is going to create a bunch of really catchy songs, you know, but it's never going to create an Oliver Anthony song.\nIt's never going to create hard times, you know?\nIt's never going to create some of your [ __ ] It's not It's not going to It's got to come from a real human being.\nAnd there's a thing that people are always going to want, you know?\nYou're always going to want something that, you know, a real human being made that there's something in it.\nYou know, that's why this building's filled with art.\nYou know, I I love looking at something that somebody made.\nyou know, it came from their their soul.\nIt came from whoever they are as a human.\nThey laid it down.\nWhether it's music or whether it's art, comedy, whatever it is, it's like that that's coming from a human being, you know, and that's we're always going to want to be connected to that.\nYeah.\nI was looking at you saying that with your Joe Rogan Experience sign and you telling me in the hallway that it's named for Hendricks.\nYeah.\nYeah.\nI stole it from Jimmy.\nOh, the when we first started doing the great the greats never reveal their sources.\nOh, I couldn't help it.\nI'm just kidding.\nI had to I had Well, it's obvious.\nI had to give it up.\nIt wasn't obvious to me, man.\nThat's what I'm saying.\nI'm kind of slow.\nWell, I had to give it up.\nIt's like But, you know, Austin, Texas or Bust.\nIt says right there.\nI used to listen to Jimmy all the time on the way to the comedy store.\nThat was like Jimmy and Led Zeppelin.\nM I'd listen to a whole lot of love and if six was nine I'd listen to that all the time on the way down Laurel Canyon.\nCan you imagine how that crazy that must have sounded?\nOh man.\nComing through the radio or coming through like people's sound systems in America in the in the late60s.\nWell, my friend Phil Hartman when he was a kid, he used to work uh at the whiskey.\nHe was like, you know, like a grip.\nAnd it was his job.\nThe the speakers were precariously placed on the edge of the stage and Jimmy performed there.\nAnd it was his job to stand there and make sure that Jimmy didn't kick over the speaker into the audience.\nSo he stood right there while Hrix played right above him.\nM and the way he talked about it, man, it's like it was just to him it was like this magical moment cuz I think he was a teenager at the time and it was Was he like in somebody else's band or something?\nNo, he was just working for the club, you know.\nHe was just a guy that was hired to work there, you know, just a kid.\nWow.\nAnd he was basically literally just there to make sure the speaker doesn't fall into the crowd.\nAnd uh you know, Jimmy was playing right above him, just right there.\nWow.\nAnd he said it was incredible.\nIt was insane.\nHe said it was just like this magical moment cuz Jimmy live, you know, there's something about seeing someone live, you know, like I was talking about when I saw Gary play Midnight Rider.\nThere's something live and I was with my oldest daughter and we were at this downtown LA club and it was like a Monday or Tuesday night.\nIt was a week night and it was a midnight show.\nIt was like a real late night show and it was uh sponsored by an alcohol company.\nI wish I could remember the company, but they put together this very small show and it was just they it was a total impromptu session and Suzanne, my friend Suzanne Santo, who's the lead singer of Honey Honey at the time, she's incredibly talented.\nShe was singing it and she didn't know the exact words, so she had to get the words off of her phone.\nSo, she's singing Midnight Rider off her phone and Gary's in the background and I recorded it on my phone and I up See if you can find it, J.\nI have your version, but I have somebody else's version.\nOh, [ __ ]\nThat's\n\n\nWhat I'm talking about right there.\nJameson.\nIt was Jameson.\n[Music]\nCome on.\nI just love when he gets into it.\nYeah.\n[Music]\nYeah.\n[Music]\nHeat.\n[Music]\nThe blues will never go out of style.\nWoo.\n[Music]\nHeat.\nHeat.\n[Music]\nCome on, Gary.\nLet's go.\n[Music]\n[Music]\nAre we out of That's a nice jacket, G.\nYeah.\nOh, that's a Uber in my Instagram.\nJamie, see if you can find Midnight Rider on my Instagram.\nI know it's on there.\nI want to I want to play that part because it's just it was [ __ ] insane.\nIt was just one of those magical moments where you see someone perform live.\nThere's just something about you.\nYou get a lot of it.\nThere it is.\nI love\n[Music]\nit.\n[Music]\n[Applause]\n[Music]\nHeat.\n[Music]\nHeat.\n[Music]\nSee how she's looking at her phone?\nShe had to read the lyrics off her phone.\nIt was They're all doing that now.\nIt's crazy.\nShe had to cuz she didn't know exactly the lyrics.\nWhat if you didn't What if you What if you didn't have this [ __ ] thing though?\nWell, then you might might have to remember them.\nWell, she would have had to get a piece of paper or make some [ __ ] up.\nYeah, make some [ __ ] up.\nYou know, man, you know, listening to Gary do that and you talking about how much you love Stevie Rayvon, it just, you know, it reminds me it's like, you know, this to me it's like, you know, it's like country is everything and country is nothing, you know, because if you're in if you're in Texas, all that [ __ ] over there on the other side of Mississippi, like it goes away for us, you know.\nThere's a there's a there's a brashness.\nThere's a there's a boldness in any sound, whether it's coming out of honky tonk or coming out of a blues joint.\nIn Texas, it's a totally different sound.\nYou know, it's like Billy Gibbons talked about this a lot.\nYou know, like when those guys were trying to break through on the national scene, the idea of Texas is just a total stigma, right?\nIt's all hillbillies.\nIt's all provincial.\nYeah.\nYou know, and all this [ __ ] you know, and so it's like you go to Nashville or whatever and it's all Appalachia.\nIt's all, you know what I mean?\nIt's cuz it's and that's the thing.\nIt's like I give a [ __ ] about some genres, you know, because you get classified.\nBut one thing you can't explain away is place, right?\nYou can't explain away region, right?\nLike you are from where you're from.\nYeah.\nGary Clark Jr. is from right here.\nYeah.\nAnd he [ __ ] sounds like it.\nYou know what I mean?\nHe sounds like it.\nAnd it's like it's not that it's rock, blues, soul, country, whatever.\nIt's it's Texas.\nAnd what happens with Texans of any background, right?\nThey discount you for sure.\nLook at us as provincial, right?\nUm I mean, people got some ideas about what Texas is who have never stepped foot in the state.\nThat's not any different than, you know, people who've never been to California claiming to be an expert on it.\nRight.\nAnd so it's like there's two roads for a Texas artist.\nYou either let somebody in Nashville or New York or LA convince you to lose your accent.\nYou know, wash the Texas off.\nDo it our way.\nOr, which is the only way, is to take your brand of Texas to the world.\nWhatever it is, I whether it's Gary or Selena or anybody.\nSteve Rayvon.\nStevie Rayvon, man.\nYeah.\nYeah.\nYeah.\nThat's with comedy, too, man.\nI mean, Bill Hicks, who's one of the greatest of all time.\nHe's my favorite.\nRight.\nFrom here.\nThat's right.\nThe scene was hot, man.\nThe scene was hot.\nIt was hot because of him.\nIt was hot because of him and Kenisonson.\nHe's Texas, you know.\nI remember.\nDid you know Hicks?\nNo.\nMet him once.\nMet him once real briefly.\nDidn't even even get a chance to talk to him, but I saw him perform live a few times before he died.\nYou did see him live?\nYeah, saw Kenisonson a few times live.\nI I saw Kenisonson live before he died, too, but he had already passed his prime.\nKenison passed his prime real quick cuz it was He's a cautionary tale because of the partying, you know, like he was the [ __ ] man.\nOh, y'all got a party scene.\nY'all you comedians got a party scene.\nOh, it's a Well, that party scene in LA at the time was the cocaine party scene.\nIt was It was a different party scene, you know.\nMark Marin said that he hung out with Kenisonson and they did so much coke that he had voices in his head for a [ __ ] year afterwards.\nA year.\nLike literally like schizophrenic, you know, like hearing voices in his [ __ ] head for a year before they stopped talking to him.\nWow.\nYeah.\nThey were doing cocaine, man.\nAnd they were doing at the hyper room everywhere.\nThey were doing Yeah, he was doing it everywhere.\nYeah, but Kenison became almost like a caricature of himself.\nHe became sort of captured by this the the perception by this character that that that they had created.\nAnd Kenisonson is what birthed Hicks.\nYou know, Hicks was Hicks was a great comic, but he was one of the outlaws.\nIt was Kenisonson and Hicks that that sort of defined the Texas style.\nAnd when we were living in um at the time I was living in New York and there was there was really two places in the country.\nThere was LA where you wanted to go to get on TV.\nEverybody wanted to go get a [ __ ] sitcom.\nThey all wanted to be Jerry Seinfeld.\nAnd New York, which is like the club comics.\nThat was like the Davids and the these guys that would like, you know, the the guys would do the clubs and they were they were thought of as like the real pure comics, you know.\nAnd then there was this new scene, this new scene out of Houston, this new scene out of the Laugh Stop in River Oaks.\nAnd I remember the first time I ever worked there, man, you could feel it in the building.\nYou could feel that they had been there.\nYou know, they were both gone.\nBy the time I had worked there, they were both dead, but you could feel it in the building, man.\nYou could feel it in the the comics, the open mic scene.\nYou could feel they were pure.\nYou know, there was a there was a Texas quality to the way they were doing comedy.\nIt was a [ __ ] you.\nYeah.\n[ __ ] you.\nThat's what I like.\nYeah.\nHicks would [ __ ] with both sides of the room.\nAbsolutely.\nAnd get and and then and just [ __ ] him up and Yep.\nCross him over and put him in his pocket.\nAnd no one knew what where what he was.\nThey didn't know what he was.\nThat's right.\nThe first time I ever saw him, he bombed.\nHe bombed except for the comedians.\nWe were dying laughing.\nSee, cuz you know, there's quite there's quite a bit of video of him from these clubs here and in Houston when he was younger because they were even in the, you know, in the 90s they were filming.\nYeah.\nAnd I've seen some of those clips where he's like like you're talking about he just couldn't [ __ ] the whole room's afraid of him.\nLike he no one no one's laughing, everyone's afraid and he's like super [ __ ] up.\nWell, he was the first comic really that had a message, right?\nYou know, he had like a there was a there was a social commentary to his like a dark poetry to his comedy and so many people tried to emulate it that at the the green room the punchline in Atlanta there was a like people wrote a bunch of [ __ ] on the walls in the green room but one of the big ones that said quit trying to be Hicks.\nWow.\nI remember seeing that going yes everybody did.\nWe all did.\nEverybody wanted to be Hicks.\nDude, you come.\nSo after Stevie Rayvon passed, right?\nI remember, you know, we were up in Dallas Fort Worth and you'd come down here.\nWe'd come down here in in in high school and [ __ ] and go up and down Sixth Street.\nI will never forget this.\nEvery single guitar player in every little bar on Sixth Street, every single one of them was playing like Stevie Rayvon.\nYeah.\nEvery single one of them.\nAnd there were 30 of them.\nLike there were 30 different ones that coming in and out of bars doing all the [ __ ] It was It was unbelievable.\nYeah, there's always going to be someone like that that like sets this stage.\nQuit trying to be Hicks.\nYeah, quit trying to be Hicks.\nBut it was like that was a My daddy died for that flag.\nOh, really?\nHow about I How about mine at Kmart?\nIt's made in China.\nBut he could do it because he because he was a Texan.\nYes.\nThe vernacular is real.\nAnd then he'd turn around and Yeah.\nYou know, [ __ ] up the other side.\nYeah.\nNo, it was genius.\nWell, when I when I first saw him, he went on in Boston and it was at Nick's Comedy Stop.\nAnd the guy who went on before him was this he was a nice guy, but he was a hack, you know?\nHe was just like cops and donuts, normal [ __ ] stupid jokes, but the stupid jokes were working.\nIt was cartoon character smoking pot.\nYou know, what would happen if Daffy Duck smoked a, you know, joint with Donald Duck?\nIt was dumb.\nBut it watered down Dangerfield, but it was getting people to laugh.\nAnd then Hicks went on stage and uh like immediately started bombing, you know, and immediately he opened up with saying that he's tired of performing and tired of going up and telling people a bunch of [ __ ] you couldn't possibly think up on your own.\nBut the comics were dying and it was there was like 300 people in the room.\nBy the time he was done performing, there was 50.\nThere was 50.\nAnd it was maybe me and my friend Greg Fitz Simmons were in the back of the room just dying laughing and maybe 10 comics.\nWe had all come to see Hicks because we had heard about him.\nAnd then I saw him a month later at the Comedy Connection and he [ __ ] murdered.\nThe Comedy Connection was this little tiny club.\nIt was like 150 seats, real low ceilings.\nBoston as well.\nThis is when I was first starting.\nSo this is like 1988 and it is before he had really popped.\nI had heard about him from the Rodney Dangerfield HBO special, you know.\nSo the Rod Rodney Dangerfield had these young comedian specials.\nRodney was the best at like introducing the world to talented comedians and he had these Rodney Dangerfield young comedian specials where he'd have on like Robert Shiml and Lenny Clark and Andrew Dice Clay and that's where Kenisonson emerged and Hicks Hicks was one of them too and I remember I'd seen Hicks on that.\nSo I went to see him live and like I said the first time he bombed the second time he [ __ ] murdered it was Tiffany meeting Jimmyi Hendris at the mall.\nHe was doing this bit about Jimmyi Hend like Tiffany playing at the mall and Jimmyi Hendrick shows up and it was it was this [ __ ] just genius bit and it was so funny man.\nIs that something that's out there?\nCan you see that?\nI wonder, man.\nI wonder cuz I don't think he ever put that on anything.\nIt might be on an album somewhere, but it was back when there was all this like pop mall comedy or pop mall music and he [ __ ] hated it, you know, and it was uh and he was just rallying.\nThere's a genre for you right there.\nYeah.\nRallying against corporatism.\nIt's going to make a comeback, that little subg genre.\nYeah.\nI mean, it has do something new with it.\nIt It kind of has.\nAustin has a great comedy scene right now.\nIt really does.\nAnd it's really just emerged from the pandemic.\nWas that like the main thing that drew you here?\nWell, we all moved here to start it.\nWe didn't even move here to start it.\nWe moved here to just keep doing what we were doing in LA.\nBut LA had shut down.\nIn 2020, we were all like we were all without a country, you know?\nWe were living in LA and the comedy store was shut down for a [ __ ] year and a half.\nMan, y'all were wild, man.\nIt was so so shut down out there.\nIt was so shut down.\nAnd I knew I'm I'm one of those dudes.\nIt's just like I've never had faith in systems and government.\nAnd I'm like, these [ __ ] are going to keep us shut down.\nThey're going to keep And I came to Texas and Ron White was already here.\nSo Ron White, who's a very good friend of mine, and Gary, I knew I knew Gary from LA.\nHe used to hang out at the Comedy Store, too.\nAnd that's why I became friends with him.\nAnd he moved here, I think 2017 or 2018, and I talked to him on the phone.\nLike, why why'd you go back to Austin?\nHe's like, &quot;Man, I can't [ __ ] with those people in LA.\nIt's just like I'm tired of it, man.&quot;\nHe goes, &quot;I love Texas.\nI just real home.&quot;\nAnd I was like, &quot;Wow, that sounds right.\nThat sounds right.&quot;\nAnd then when I talked to Ron, and Ron's the same way.\nRon's a Texas boy, too.\nAnd he was like, I can't I just don't want to do this anymore.\nI I'll stay here.\nIt's great.\nHe goes, it's great.\nIt's the middle of the [ __ ] country.\nI can fly anywhere.\n[ __ ] food's good.\nPeople are nice.\nAnd so I knew when I came here, that's all you need to know.\nI was like, at the very least, Ron's here and Ron's a good friend.\nAnd then when we came here, we could perform live in I first started doing shows outside.\nMe and Dave Chappelle started doing shows at Stubs.\n\n\nAnd we were doing outside shows where we had to test the whole crowd. Everybody had to get tested. So, everybody had to show up like two hours in advance. We tested everybody for CO. They had to wear a mask outside. It was so stupid. The whole thing was so ridiculous. But we were hanging out in the back getting drunk, smoking weed, and it was like it was like normal. It was like normal times, and it was like this cultural thing, like we were the only ones doing comedy, and you know, everybody just started coming here, man. They all just started coming here, and then we started doing shows inside at the Vulcan. The Vulcan Gas Company, which is a music club that's on Sixth Street. So, we started performing there. And you know, Nick, the guy who's the owner, is just a wild dude. He's like, \"Fuck it. Let's just do shows.\" And we started doing shows in November of 2020. And it just felt like we were baby killers. We were killing grandma, you know? We were out there just spreading diseases. We were super spreaders. If you spend enough time on Sixth Street anyway, it'll make you immune.\n\nYeah. We had developed some strong antibodies. I never got sick off of Sixth Street. I got sick in Florida. That's what I mean, though. Sixth Street will make you bulletproof to that. Well, except the bullets. So, yeah, except the bullets. And there's a lot of that going on there, too. So, we we started doing shows there live, and then comics started moving, man. They started moving in droves. They started all moving to Texas cuz they could do shows here. We were just lost. I didn't know that. Without doing shows, we just all felt lost. And then by the time 2021 rolled around, there was like 15, 16 world-class comics living in Austin. Wow. And then I was like, \"Fuck it. I'm buying a club.\" And Ron talked me into it. He's like, \"You got to get a club. We got to do this.\" Cuz you know, he knew I got a bunch of money from the Spotify deal. So I was like, \"All right, let's do it.\" And so then in 2022 or three, I guess, we opened up, and it's just been gang busters ever since. And now it's like this is the hub of comedy in the country, which makes it the hub of comedy in the known universe. It's all here in Texas. It's all at that club. I like that. Well, that's really cool, man. Props to you for pulling that off. Well, I mean, I think I pulled it off, but I think it's everybody pulled it off. People are proud of the comedy, you know, history in this town. Yes. You know, and it's a it's a great place, and it's all walks of life, man. You know that everybody likes to use that term inclusive and diversity. Well, our scene is diverse and inclusive, but everybody's great. It's only diverse because they just happen to be everybody's diverse. We're all, you know, you get artists, they're all different weird people. And what we didn't seek that out. It was just what happened. It was just who's good? Who's good? Who's who's really all about this? Who really wants to live this life? Who really wants to just do comedy? And we set it up where we have two nights of open mic nights, and you know we've got Kill Tony on Monday night, so all the amateurs get a chance to to be seen in front of the whole world and the biggest live comedy show in the world on YouTube, and it just became this hub, man, and now it's just every night it's sold out, and it's crazy, and it's just it's a vibrant wild scene, and now on Sixth Street there's five full-time clubs within two blocks of my club. Comedy clubs. Comedy clubs. No. Yeah, the scene is insane. I mean, it's the best scene in the country. It's like there's never been a scene like this before that just emerged, and it and it had all we had to hit every green light. Like the comedy store had to be closed down. So, I hired everybody that was working at the comedy store before we even had a club. I said, \"I'm going to pay you full-time. You get benefits. You get all insurance, all that. Just come move to Austin. We'll call on you in like a year. It's going to take like a year to build this place, but meanwhile, you'll you'll get paid. You'll be able to just like live here, set set your roots, get established. It's a beautiful place to live. Everybody loved it. And then when we opened, we hit the ground running. We opened up one night. We we did did a couple of test shows like, \"Let's try the venues, make sure everything works good.\" And then we was like, \"Fuck it. Let's stay open.\" And we just stayed open. Before you know it, it was seven nights a week. And then it was just It's been almost three years now. You going to keep it rolling? Yeah. Hell yeah. Yeah. We're talking about doing it in other places now.\n\nThat's cool. We just don't want to water it down. You know, we've talked about doing it in some other city and trying to figure out what the next one would be, but it would have to be a city that has a real group of talent. You have to have talent. Like that's every comedy community. The only way it works is you have to have a lot of great comics that live in that town. It's the only way it works. And then we feed off of each other. That's the only way. There's no lone wolves in comedy. You know, comedy only it's only iron sharpens iron. You know, there's no like the best comic in the world living in Pittsburgh. Doesn't exist. Like they all live where they all they're in not in competition but in cooperation with each other. Like you're we're all inspired by each other. Yeah. You you have to have that if you don't and so we had to have like every green light. The comedy store had to be comedy store had to be shut down for a solid year and a half. All those people had to be unemployed. I had to have all this money from Spotify. I had to be in a place like Texas that allows you to open up and have a show indoors when everything in California was clo. They wouldn't even let you do outdoor shows. We weren't even allowed to do show. We tried to do shows in the parking lot, the comedy store, and they wouldn't allow us. It was crazy. No, I remember how it I remember how shut down it was. 70% of all the restaurants went under. I mean, it was madness. Yeah, it's crazy. Yeah. A lot a lot has changed. Yeah. Really fast. Yeah. Real fast. Real fast. Really fast. You know, so we had to hit every green light and we had to have all these people that were willing to take a chance. All the Tom Siguras and Tim Dillons and Tony Hinchcliffs and Duncan Trussels, all these great comics that just was like, \"Fuck it. We'll move there.\" Brian Simpson and Tony Hinchcliffe and all these guys just said, \"Fuck it. Let's let's take a chance. Like, I don't want to live like this. I don't want I want to live where I can't do comedy.\" It's like we were just like junkies with no no fix, you know? Yeah. I was on I was still working the red dirt circuit when the pandemic hit. So to be honest with you, those old those boys was like it never closed. Wow. It didn't not those all those all those old dance halls and beer joints and thank God none of those places closed. Thank God. Thank God they were right. It kept us working, man. You know, was the thing. And I was just working so hard. I never really thought about anything else. But something about the California shutdown that that's funny when you we're talking not funny but but um like the pandemic hit and I was unknown but I had just finished that record Welcome to Hard Times, and it it didn't have anything to do with anything. I had had the two surgeries.\nI had like gone through a relationship that was that crashed and burned in a tail spin. you know, I' I'd got I'd gotten rid of a management relationship that was going nowhere.\nAnd uh I wrote Welcome to Hard Times just kind of out of my own personal kind of dark feelings about where I was going through and just the whole like rigged casino, you know, America's a casino, you know, and I I have thought that since I was a kid because I kind of lived in them, you know, you're talking about being pulls. Um, and then the rec I I cut the record in Georgia, South Georgia was with Mark Neil, right? Like I the whole thing I cut it like I wrote the record in November, cut it in December, got the Masters back and like a week or two later, I remember we me and Taylor Grace, my now wife, we were dating and we were at a a diner in Cloudcraftoft, New Mexico, and my manager at the time called me and said that South by Southwest was cancelled. And that for us here at that time, that's when we knew was real. nothing could stop that machine that was South by Southwest at the time. And strangely for me, I'm not I knew a lot of people that I've known a lot of people that have passed away or anything. So, I'm not saying that all the stuff that happened is a good thing at all, but for me, my career trajectory totally changed early on the pandemic because no one was putting out records. the whole no one had any interest in putting out records. Um, and for that reason, David Msas, because I was riding his ass, actually, thanks to John Folk at the time, he's like, \"Don't let him shove your record. Put that record out right now.\" You know, we're talking about, you know, July 2020. Wow. You know, and um I demanded more money. No one no one had ever put a dollar into marketing my records. I'm talking about nothing. Before the hit the fan, these guys were talking about spending like 10, 15 grand total marketing Welcome to Hard Times. Wow. Total. I mean, I spent twice that or more making it. And that's still a cheap record, but I mean, I I remember a publicist told me once like, you should spend at least double the money marketing your record that it cost you to make it and at least match it, you know? And here I was like, that's what I I was like caught on this like broke dick Americana scene, you know, on these two-year record cycles, you know, with no money, you know. I was on a I was in a broke dick deal just like Whan was talking about, you know, just didn't I don't I'm not I'm not bagging on Americana or anything, you know. I mean, I'm I'm glad I showed up on the map somewhere, but we went ahead and put it out in July of 2020. And I'd been wanting to buy billboards and it just so happened, especially in California, but even in New York, I mean, everything was shut down. I mean, totally shut down. So, I remember we bought a billboard in Silver Lake and in Time Square, right? Static, traditional static billboards for like 80% off cuz nobody was buying. Not a single other billboard over the course of like a nine months or a year in those neighborhoods changed, right? And I bought a one all those billboards I bought like one month billboards and some of those stayed up over six months. Wow. You know what I mean? At like 75% off, you know? And you know sometimes you write a song that get lucky. I was writing about personal experience and it spoke for me. It wasn't a big record. it. But it changed my trajectory because Welcome to Hard Times, the song really spoke to what was happening in America. Yeah. And that's what that's when my train really started rolling. That's when it really started rolling. You know what I mean? It's like and then I I did all those records and Welcome to Hard Times and Music City USA coming like kind of right for the right for the Nashville Machine and then the man from Waco that I made down in Lockheart with Bruce Robinson which was like the first time really that I'd made a studio record with my guys, you know, with more money and Bruce Robinson, a songwriting friend that was not stopping me from being me, you know, and and and then that one was my first one to hit the like uh Billboard 200.\nUm and then $10 cowboy really took off another big step from there. Uh and then I got hooked back up with Shooter. I see I used to open up for Shooter cuz Shooter was getting booked by John Folk too, right? And the two guys that took a liking to me early on like pretty much nobody else did was Evan Felker and Turnpike Juidors and Shooter Jennings. You know, Shooter would take me out and like he didn't have to be cool to me. Damn, he's Whan's son. But he was always so cool. Oh, he's just cool and so thoughtful, you know? Yeah, he's a great guy. And he would give me little things to live by. Like when he saw how hard I was working out there, he's like, \"It says you can't park behind the Nashville Palace, but between me and you, you camp there and nobody's going to say shit.\" And then I lived in that parking lot. That's the kind of you get by on. You know what I mean? Yeah. And uh we uh I've got this movie that I funded. You know how slow the movie business is? that I was going to be called $10 cowboy and I made it's this thing I put together. I like finished my touring season at the rodeo finals in Vegas. And then I get back to Texas and all the pressure of the business is mounting on me. Um, and I'm just trying to get away from my manager and the machine and my and my phone and all that. And I decide to leave the phone at the house. And I had heard from\n\n\nA journalist about this secret shrine in a liquor store dedicated to Waylon Jennings in his hometown of Littlefield, Texas, there on 84.\nI'd known about it, but we in the movie, I, I'm playing like I've never heard of it, and I'm going on this pilgrimage, you know, to find out if this little museum really exists, which it does.\nIt's run by his youngest brother, James D., Waylon's youngest brother.\nOh, wow.\nAnd so when to get the movie going, I needed to get on the phone with Shooter, you know, to get hooked up with James D. and them.\nAnd we got the idea to get his mama, Jessi Colter, involved and all that.\nAnd I was, and I wanted to use some of Waylon's music for the film, and I was scared to death to ask for it.\nUm, but Shooter had always been good to me, and so we ended up having the conversation.\nWe caught up on a lot of stuff, 'cause see, I'd been hearing that he was producing, right?\nBut I couldn't make heads or tails of it, where he was going with it, and truthfully, I was like avoiding producers altogether, 'cause a lot of these guys, it's like, you know, they're such, they're such big names, it overshadows the artist.\nYou know what I mean?\nAnd then they have the deal.\nLike they have the artist deal, right?\nThen the artist just kind of in a lot of ways gets limited to like acting talent, you know, showing up at the [ __ ], you know, movie lot or whatever.\nYeah.\nAnd um, and but I kept hearing records that he was making by people I knew, like Jamie Wyatt.\nI said, \"Man, it's the best thing she's ever done.\"\nShooter Jennings.\nVince Neil Emerson.\nThis is the best thing he's ever done.\nShooter Jennings, like, over and over, and I had been noticing that.\nAnd so we're on the phone, and he's all about the movie.\nYeah, I'm gonna help you license the songs.\nWe'd love that.\nYou know, my mama loves your music and all that.\nYou know, she decided she's in the movie.\nUh, he just was helpful with everything.\nAnd um, I had almost made a record at Sunset Sound there in old downtown Hollywood, the old Sunset Sound studio.\nI'd wanted to go in there because Mark Neil had told me about it, and I was tired of making records in Georgia and didn't want to go over to the wrong side of Mississippi.\nUh, I wanted to make him a record in California, and I told Shooter in passing on the phone that it had fallen through, and you know, did he know Sunset Sound?\nAnd he was like, \"Man, Charley's crazy, I'm signing the lease on studio 3, the print studio, tomorrow.\"\nWow.\nJust in passing, you know, and I'm like, \"Man, well, then let's make a record.\"\nAnd we're right in the middle of a trilogy now.\nI did Lonesome Drifter with them, man.\nAnd then the next one that's coming out is Dollar a Day on 88, which I think is a lucky number.\nAnd then I've got a third one coming after that that we're calling the Sage Brush Trilogy.\nAnd Shooter is the first guy I've ever been in a studio with where I truly don't feel judged.\nYou know what I mean?\nMhm.\nAnd now I can, and because I've got all these, it's just the perfect timing.\nIt's like, wow, that, like, have been out on the road with him 10 plus years ago, and then, you know, like, think, think about what he's been through in the business, right?\nI mean, he started cutting records 20 years ago.\nI mean, he's a crucified son automatically, right?\nYou know what I mean?\nWalking, you know, walking in that shadow.\nThat shadow.\nYeah, man.\nHe said a crazy line to me on the other day.\nHe said, uh, in regards to some other situation he was in, he was like, \"I was,\" he said, \"I went from one shadow to another.\"\nJust a beautiful line.\nI think he was talking about like an old relationship he was in or something.\nBut um, but like he's overcome that because, you know what I mean, like he's stepped into, like, if you listen to his records, you know, when he's starting out, and you compare it to the field, you know, in country music in Nashville at the time, like he's totally, like, he's totally swimming upstream.\nHe's totally going against the grain.\nNobody's sounding like that.\nThey're not sounding traditional and pushing the boundaries like he just was, you know, and I can tell you constitutionally, he's, he's just like his daddy.\nI mean, he drink me and smoke me under the table.\nI'm like, \"You are whining, son.\"\nAnd for some reason, you like get smarter the more weed you smoke.\nAnd I'm, and, and my brain is like, my brain is just like pulverizing, you know?\nBut, but I'm, I'm really proud of and excited about everything that I'm doing with him because it just taken me so long to get where I'm at.\nAnd here I've got a partner, you know, in making records that isn't judging me, but also is pushing me to take it higher, you know, because I'm trying to figure out how to transcend it, too.\nYou know, everybody's always, there's a lot of, you know, I've always been a pretty um, polarizing figure for some reason with audiences.\nIt's either, it's a love-hate thing.\nUm, and I've done a lot of styles, you know, and they've called me a stylistic chameleon.\nUm, here in Austin, even the first time they put me on the Chronicle, you, they called me a stylistic chameleon.\nAnd I had a hard time with that, you know, because I didn't, wasn't taking it as a compliment.\nRight.\nRight.\nIt's not a compliment.\nNo.\nYeah.\nBut um, it's that whole thing where it's like, okay, I can play the blues.\nI can play country music.\nI can play folk music.\nLearn how to play all that [ __ ] on the street.\nMatter of fact, right?\nUm, it's surprising to me that people would question my authenticity and point to me playing in subway cars as this aha moment that I'm not who I said I was.\nI'm like, isn't that hilarious?\nWhy don't you go try to play in those New York City train cars?\nWell, that's people that are just talking, brother.\nI'd rather get on a [ __ ] bull, you know?\nYeah.\nYeah.\nDo you think, man, like that synchronicity, that like fate is a real thing?\nBecause just think about how all that lined up.\nI feel like sometimes, I mean, it's a very ego, ego-centric thing to think, you know, the things are meant to be, like there's a plan for you, it's silly, but it also isn't, you know, fate seems to somehow or another be a real thing, and sometimes the way things synchronize and the way things line up, you're like, \"Man, this seems like it's meant to be.\"\nI think there's certain things that's they just seem like they're meant to be.\nAnd I feel like if you're on the right frequency and you're following the right path, those, those doors open, and these things do happen, and they happen when they're supposed to happen.\nThey happen at the right time for the right reasons, you know.\nI believe completely in fate.\nYeah.\nI don't, I don't really believe in faith.\nMhm.\nI think there's a, there's a surrender and a helplessness in a lot of ways to a lot of people's idea of faith.\nMhm.\nRight.\nWhen people are like, \"Love your struggle.\"\nI never liked that saying.\nIt's like, no, love the strength that your creator gave you to overcome the struggle.\nDon't love the struggle.\nNobody [ __ ] loves the struggle.\nRight.\nRight.\nRight.\nIt's the strength, and especially real struggle.\nYeah.\nLike real, real struggle is not knowing if it's going to work out.\nYou're not going to love that.\nThat's what I mean.\nI never understood that.\nI mean, I guess I get it, but like, but you get it after it's successful.\nFate is a thing that's like, that's destiny.\nYeah.\nYou know, like Waylon, like Shooter, and like the Waylon Jennings thing for me, you know, it's like, you know, I was out there, you know, we were, I, I did my, uh, I debuted at the Houston rodeo back in the spring, and for me that was like my career goal, you know, because of Selena and and George Strait and and everybody.\nHell, Elvis played there twice.\nI mean, it doesn't matter what your background is as a Texan, any background.\nThe Houston rodeo.\nThat's the top culturally, I think, as like a stage for an artist to perform.\nI think it's the Houston rodeo, you know, and it was the Astrodome, and now it's the NRG Stadium.\nAnd I would have never known that.\nIt's the, it's the truth.\nAnd it does, it crosses, you know, everything, economic, racial, everything.\nIt's, it's the Houston rodeo, you know, and it's the biggest rodeo on on earth, you know.\nUm, which is why you got everybody from, like I said, you know, Waylon, Jennings, Merle, George Strait.\nNowadays, you got Post Malone and Beyonce both playing it.\nWow.\nI mean, it doesn't, it doesn't matter who it is.\nLike, that's the, that's the platform.\nAnyway, I played there, and we were mix, we're putting a live record out on it, and me and Shooter were mixing it there at Sunset Sound, and then I stayed the extra night because he had the party at the Viper Room for the announcement of these three unreleased Waylon Jennings records, and they're legit unreleased.\nIt's not AI [ __ ].\nIt's not remixes.\nThis is truly legitimately unreleased music by arguably, you know, the king, certainly the king of all the outlaws.\nYeah.\nBut in my opinion, when it comes to like Nashville country music, whatever you want to call it, man, like, uh, a buddy of mine, John Spong, a journalist here in town, a Texan, he was, we were at the Sage Brush doing an interview a couple years back, and he was saying that like, if Willie Nelson to country music is like Che Guevara, right?\nWaylon Jennings was the long-haired prince of darkness, right?\nAnd like he's the guy that like, he's from West Texas, right?\nThe guy learned, he, he learned how to play bass on stage.\nHe learned how to play bass on [ __ ] stage backing up Buddy Holly, right?\nWho at the time was bigger than Elvis, man?\nYou know, I mean, that style of rock and roll, right?\nIt's coming from everywhere.\nI mean, nobody's just making their, nowadays they're kind of strangely making music in a vacuum in a bedroom, but like in some ways, right?\nBut these guys, it's like whether it's Robert Johnson or B.B. King in the Delta or whatever, or Buddy Holly out in West Texas, you're influenced by the radio and all that, but there's something to be said for like what's out, how hard that earth is out there in West Texas.\nAnd like people talk a lot of [ __ ] about Lick, right?\nSmells like [ __ ] because it's cows everywhere.\nSo [ __ ] flat.\nYou know, the thing you can stand on a [ __ ] ten can and like, you know, see a 100 miles or whatever they say out there, right?\nBut like the best people to play a show for probably anywhere in America in many ways, in my opinion, is like a show in, love it, like there's something about the people in that town where it's like, it's just the best place to play.\nAnd then like Willie Nelson is now in the Rock and Roll Hall of Fame, and he deserves it.\nDolly Parton now, too.\nBut Waylon Jennings was always rock and roll, like.\nHe was never traditional country.\nThere's nothing about him, if you know what you're listening to, even on his very first record, like country folk, folk country, right?\nThere's nothing straight ahead.\nListen to anything coming out of Nashville in like 1965.\nAnything next to Waylon Jennings, he's the long-haired prince of darkness.\nYou know, he is like, he is going to be the their undoing of the, because what they did is they built a, they built a wall around Nashville because the coast had all the money and all the zeit guys power, and in response, Nashville walled themselves off, right?\nYou know what I mean?\nThat's really what they did.\nAnd then Waylon, Waylon busted through.\nAnd I know I'm going back on that a lot, but like my path that led to making records with Shooter was that when I started figuring out like the map is when I like cracked the code and realized why what was doing musically.\nLike I just, I finally fell in love with him musically, and it was on this specific record from 1968 called Hanging On, right?\nAnd like every swinging dick in this business that I ever knew coming up in Texas that had anything to do with Texas songwriters or country, every one of them wanted to be Waylon Jennings, Willie Nelson, Townes Van Zandt, and Billy Joe Shaver.\nEvery single one.\nAnd I naturally stepped of that because everybody I knew was trying to do it.\nAnd like imitating an artist, like for the advanced part of their movement on in and of itself, that's worthless.\nIt's, it's not that it's worthless.\nIt's that you will never touch it if you don't go walk your own path.\nRight.\nSo, a lot of guys I knew when I started playing all the shows with Willie, Willie called me up and got me on with his agent and [ __ ] and put me on like 50 shows.\nAnd a lot of guys I knew were like looking at me like, \"Man, why do you get to play with Willie?\"\nYou know, and at first I didn't even, I didn't know, right?\n'Cause I was realizing guys that I knew, like they knew Willie Nelson [ __ ] in and out.\nWe're literally trying to sing like him.\nSo, they're like, \"Fuck you.\nI should have that spot.\"\nAnd like, you know, I'm nobody at the end of the day, right?\nI'm, I, I'm the best at being me, right?\nYou know, and when sometimes, right?\nBut like how I think I've landed with Shooter and his family and and be playing all those shows with Willie and getting married on his ranch and all that stuff is because not because I worship Willie Nelson, but because I think Willie looked at me and was like, \"I like, I like what you're doing.\nI like how you got where you're at.\nYou can play with me.\"\nYou know, you don't ask to take your picture with Willie.\nHe [ __ ] lets you know when you're going to take your picture with him.\nYou know what I mean?\nHe's going to let you know it's time to get your picture taken with Willie.\nThat's how, that's how they did it.\nWow.\nAnd we're standing, there's like 100 nitrous cans behind us and [ __ ].\nIt was like,\n\n\nThe greatest photo of my life, you know?\nYeah.\nIt's a natural inclination that people have when they want to be authentic to imitate authenticity.\nAnd that's the thing is you got to find your own path.\nYou got to, you got to, you have to put, you have to put yourself out there, you know?\nLike when I was playing on the street, people knew I was different.\nAnd artists, the hipsters like in the Brooklyn scene and in Bushwick and Williamsburg and all over the burrows and [ __ ] like to be on the street playing like there there's credibility to that, right?\nBut and like I didn't want to play in subway cars.\nActually, what it was is young rapper Jaydon Woodard is his name.\nAnd uh he kept seeing me at the um Metropolitan Avenue stop playing there at the platform, you know, for the for the for the cars coming by on the L train or whatever.\nG train down there on Metropolitan.\nG-Train sucks to ride on.\nIt's great for subway performers because there's like it's the slowest train in the world, right?\nSo you get huge audience between every [ __ ] you know, train.\nSo, it's a gold mine for a for a street performer and a terrible drag for the, you know, New Yorkers waiting on it, right?\nAnyways, this kid kept trying to get me.\nHe would always show up with like a different guitar player and [ __ ] with like an amp on his shoulder, which I copied.\nI got an amp ran off a 9volt battery.\nYou get about seven, eight hours of it in this Telecaster.\nAnd I learned it from this guy, Ghost, who was already doing it that was playing with Jaydon, who was like kind of part of Citizen Coke, Clarence Greenwood street team.\nAnd he kept trying to get me to go on the subway cars and I was like man this kid's crazy like he's rapping and [ __ ] and man the subway cars like ah I'm all right you know and eventually he like kind of cornered me actually what it was I kept dodging him and then I was finished one day and I get in the car it's on the L train and I'm riding in the car and I'm just sitting there looking down the train and all of a sudden I see that skinny [ __ ] in a white tee walking toward me and he's moving but he can't really you how the trains can be loud and I'm looking at him I'm trying to put it together and when he gets closer I realize he's rapping and he's got that guitar player with him with the amp behind him it's playing this like really badass bluesy hip-hop beat and he's freestyling like you know the hat you're wearing he's rhyming to it the next stop he's putting it in the verse and [ __ ] and he's got all these mixtapz in his hand and he's handing them out and [ __ ] and he sees me and he hands me one and that's how he got me cuz I saw like it working and he was making money and like dropping product, you know?\nI thought, \"Holy [ __ ], right?\nCuz so like comedy scene, music scene, whatever.\"\nSay you got a place on Sixth Street holds, right?\n100 people and you play there 30, you get a residence and you play there 30 nights a month, right?\nAnd you get 100 you different people show up there every night that what is that?\n3,000 people.\nIt's like, dude, we could hit you could hit 3,000 people in like half a day on the on the train cars once we started working it.\nAnd so it was like it was his it was his and he was a spoken word poet.\nThis kid this kid started [ __ ] rapping on trains at like 15.\nWow.\nIn like Philly, which is [ __ ] man.\nPhillyy's tough.\nI don't have to tell you, Philly's tough.\nLike train cars in Philly.\nThat's mind-blowing, you know.\nAnd then he comes to New York with that and like takes that spoken word improvisational thing and like all the best rappers I saw in that town, they were all like spoken word poets because you know they just were smart and quick, you know, and like we then we got together and like mashed it up and again like I went from making where I would make $30, you know, all of a sudden like we would make $300 and split it, you know, 50/50.\nWow.\nAnd we turned that into a whole like a really fine pretty well-oiled machine where there started being five or six of us and we were bringing guys up and down from New Orleans and [ __ ] So that's where you see the trumpet players, different spoken word rappers.\nWe were squatting in warehouses, you know, owned by Hassids that were like renting out space that was supposed to be for rehearsal, but really everybody was living there and selling drugs and [ __ ] whiling out.\nAnd you know, I cranked that up.\nWe cranked that up and did get and did get discovered by like the heart of the pop machine right there on the R train.\nWow.\nAnd like just what you would think.\nYou can see video of this stuff.\nBut it's like they saw that we were believable.\nYep.\nAnd we're just trying to figure out and that's one of the spoken word dudes right there was Eric.\nHe was from Jacksonville, Florida.\nAnd that hippie right there, that was my uh friend of mine's younger brother from uh high school down here in Texas.\nThere's something about street performing that is there's no net there.\nYou you you're performing for people that are involuntary.\nOh man, they don't want you in there.\nAnd you're breaking like 10 laws.\nYou're breaking 10 laws and they don't want you in there.\nRight.\nBut if you're good, if you're good, it means a lot.\nYou ever see the video of Biggie when he's performing?\nHe's 17 on a street corner in Brooklyn.\nOh yeah.\nOh my god.\nYou pull that one up.\nCan we see it just for fun?\nPull that up.\nThat [ __ ] video is like you watch him this kid.\nThis kid with this talk about even though he I mean I know he's the king but he's still underrated.\nYou know what I mean?\nYeah.\nHe's crazy underrated for that.\nHow smart he was.\nOh, he was so good.\nHe was so good.\nStand standing on a street corner.\nYeah, that's the one.\nLet me hear this.\ndeep until I started hopping off street making a regular passing like a pro.\nI'm the perfect competitors and all that is all that stepping on me that's where you took your fall.\nI stay close to mine like she turn the tough [ __ ] undercover the mother.\nI love you and I love you cuz you're a sweet [ __ ] a crazy like ice cream.\nI spook you my music loose dip and I'm not a booster.\nSo what you got to say?\nIt's not where it's born.\nI got it going once a little.\nThe blues never goes out of style.\nNever.\nWhat do you What do you say?\nLike a uh like a what you say?\nLike ice cream.\nI'll scoop you.\nYeah.\nIt's so clever.\nAnd like Oh, he was so clever.\nIt was so clever.\nThere was comedy in in his lyrics, you know?\nIt was just It was power.\nI met his aunt on the train.\nReally?\nYeah, we did.\nAnd like Jaydon knew who she was cuz he he ran the he was running the trains before I was.\nAnd like he knew all those people because he'd been working it so hard.\nAnd it was like it was crazy some of the people that we'd come in like who you come in contact with on those subway cars.\nYou know what I It's like I saw Jake Gyllenhaal on the train one day and then some other day on the, you know, six train it'd be like the NBA commissioner and [ __ ] gave us a $100 bill.\nWow.\nYou know, it's like to me that's like that's all that's that's all it is.\nYou know, it's like whatever the circuit is, it's like putting yourself out there.\nAnd when you go out in public, man, and when you go out in public and you put yourself out there and you really do that, that's that's a transformation.\nThat's a metamorphosis, you know, for anybody.\nFor anybody.\nYeah.\nYeah.\nIt's It's just undeniable.\nIt's the most authentic form of performance ever, you know.\nThat's not your audience.\nThey don't know you.\nYou You have to earn it.\nYou have to You have to break through.\nYep.\nYou have to break through.\nIt has to It has to hit.\nYeah.\nIt has to be real.\nSo, all I've been doing is swinging at him the whole time, Joe.\nYeah, man.\nWell, you're killing it.\nThey used to call Sometimes they call me the Muhammad Ali of country music.\nThat's too good a compliment, but I I like it.\nBut there's, you know, that's the only way you make Charley Crockett.\nYou got to I mean, your story is is important for people to hear because it's the only way you make someone like you.\nYou know, you don't make someone like you in a mall.\nYou don't make someone like you with a bunch of executives making these decisions based on what they think is going to be popular.\nMan, it was crazy.\nThey were doing that [ __ ] you'd think they would do.\nSo this woman Nell Mulddere saw us in the R train and she was in the Sony system and managing artists and like kind of the star maker that pop machine of like 2010 2011.\nSo they bring us up into the offices in uh Korea Town, right?\nand like on the edge of Hell's Kitchen there.\nAnd her office was off the side of this Sony Legacy uh like kind of catalog room because at the time she was married to Rob Santos, one of the guys at Sony Legacy, and she had so she had this little office off the side of the like library thing, whatever.\nand she brings us in there and they're putting us in front of these like computer screens and showing us like gym class heroes and the Gorillas and Odd Future and Janelle Monae and like all the doing these focus group training things, you know, and where they're going to plug you in to the thing.\nAnd it was like what was so difficult about it for me?\nI'm I'm not they didn't do anything wrong.\nYou know, we were young, desperate men playing in public transit, you know, you Yeah.\nbe careful what you ask for, you know.\nAnd yeah, I was mad for a long time, but I've been eating off that plate forever because it I realized, man, I was like, man, if you don't know what you want, if you don't know where you're going, if you don't know what you're selling, they're going to sell it for you.\nYes.\nYou know what I mean?\nIt doesn't matter who it is.\nYes.\nIt's not their fault.\nThat's what they do.\nNo, I knew that was the best thing that could have happened to me is cuz like I believed that there was some deal.\nI wasn't on the trains for it, but I knew we'd find it.\nI really did.\nI had I had it was fate.\nIt was fate.\nAnd like, you know, it's that whole thing like I got there, it fell apart quick.\nIt wrecked me, man.\nAnd I got that's when I found that's when I got off the street and I went back to California, started working on the Ganja farms because I realized, you know, like Big L said or whatever, you know, I was going to get street struck.\nYou know, you can't stay out there forever.\nYou really can't, right?\nAnd uh that's when, you know, that's when I looked at that's when I looked at it and it's like, man, okay, what what am I willing to sell?\nyou know, like what what is Charley Crockett willing to sell?\nAnd I think that that's stronger than playing it cool, right?\nAnd letting somebody else figure it out for you, you know?\nThat's where it that's where it it it gets dangerous, you know?\nAnd so it's like I know a lot of these guys in the business, they're like, \"Oh man, you know, I don't pay attention to the business [ __ ] and all type of stuff.\"\nMan, you're crazy for that.\ncuz all like I don't care if it was Willie Nelson or James Brown, they were poorer than you.\nThey both picked cotton and they learned the business because they had to.\nSo someone gave me that [ __ ] Well, you need to understand the business if you're in the business.\nIf you don't understand it, you'll be taken over by it.\nThere's no doubt.\nEven if they got you on top.\nYeah.\nAnd then you have to have autonomy.\nYou have to have you have to this personal sense of self or you could avoid the influence.\nYou have to be able to just stick to your guns.\nAnd that's the hard part, right?\nBecause then they dangle that carrot in front of you.\nMan, that carrot is juicy.\nEspecially if you've been out in the street.\nIt's right there.\nOh, it's right there.\nIt's right there and it's so juicy.\nAnd a lot of people bite it.\nA lot of people bite it and then they don't want it anymore and then they don't know how to be authentic.\nWere you Were you Were you dealing with the like in the on that circuit?\nBecause I mean I know you're a comedian and you I know you also like got into the like dealing with the network TV shows and all that kind of stuff.\nLike did did anybody ever [ __ ] get you pretty good?\nWell, I got lucky in that I got on television so early and I didn't want to be on television.\nIt wasn't something that I wanted.\nYeah.\nBut they offered me so much money to be on TV.\nI was like what?\nOkay.\nBut I kept growing and doing my comedy at the comedy store and that was the most important thing that I just kept doing comedy and then the money was just like [ __ ] you money.\nSo it's like because I had the [ __ ] you money I could kind of be myself.\nYeah.\nAnd you know there was a lot of temptation like I remember the producers of Fear Factor like what are you doing?\nLike so because some of my comedy was just out there like you know this get you in trouble this people going to this is not network television comedy.\nI was like well then I won't do network television anymore.\nLike once I had a certain amount in the bank, I was like, \"All right, this is more money than I ever thought I'd ever have in my whole [ __ ] life.\"\nAnd I never thought I'd ever be wealthy and then all of a sudden I have money\n\n\nSo if you have money and you don't say you, what's the point? No one's going to say you then. If you're going to be a prisoner, right, to that money, like you're the like everybody says, \"Man, that's just afraid to be you. Afraid to be yourself.\" Like that's the only time you can really do it is when you have, you know, it's like the universe gives you this gift and what is the the gift is the gift of freedom and you have to choose to either accept it and take it and and run with it or be captured by it and then want more and more and more forever and there's no end. You know, we were talking about my friend Brian has this friend who's worth $3 billion and he feels poor because his friend is worth 80. You know how crazy that is? M think how crazy that is. Like this guy's just constantly chasing to keep up with his friend who's worth 80 billion cuz he's got three. Yep. That's how it works. You could get trapped and then you know still keeping up with the Joneses. Yeah. You got a hit show. You want to hit movie. You got to hit movie. You want to be I want to have a Grammy. I want to start singing. I you know you start getting crazy. You start you just you chase that demon that demon of success that just lures you deeper and deeper into hell. And the next thing you know, you you don't even know who you are. No one knows who you are. And if you don't know who you are, they'll decide. They'll decide who you are. They'll sell you. They'll sell you as a thing. You know, you know what's crazy about the music business? The manager is in many cases the most powerful and the least regulated.\n\nYou know, I think that's what's wild about the music business. There's basically no regulation. You know what I mean? Yeah. It's like I think that's what makes people say it's, you know, the shadiest business. I don't think it's the shadiest business, but a guy told me that in New York, actually, when I got caught up in the Sony thing with the train robbers deal y'all were showing on the screen. Uh, a lot of guys were a lot of people were trying to sign us. Actually, the guys at ANR Wuang, like, uh, DJ Scottfree and Matty C, they were trying to get us into a deal. um Citizen Cope had a deal on the table and all that and it was like um he was the one that that told me that he was like man what you heard this is the shadiest business. Now I had come from a background of dealing with some pretty crazy in Texas, you know, and with everything. Um, but even in that business, like people that are, if you're trying to play the stock market or or whatever, Wall Street, it's a corrupt business and it it is really up, but it's highly regulated com by com I mean, compared to the music business, right? You know what I mean? Right. And you're dealing in like you're, you know, it's the the stock exchange there. It's like it's like you're like it's like they're like dealing in culture, cultural power, right? Cultural wars, whatever you want to call it. It's and there's no there's just very very little regulation and a lot of power man. It's you know so much power and influence and the people that make the most money the people that don't even create the art cuz like you talking about like let's say you got a old boy's got his buddy it's worth 80 billion or whatever still doesn't make you a it doesn't make you a star. Right. Right. It's still not fame actually. That's what's crazy. You know I have a friend who's a billionaire who desperately wants to be famous. That's what I Well, I think it seems like a lot of them want to be. They do because that's the thing they don't have, right? They have everything else. You can't exactly buy that. They can't. Well, you you kind of can kind of But then it turns on you. Yeah. That's what Yeah. It turns on you. Yeah. To be the the rich guy like then you're watching those. I mean, I see some of that stuff playing. I don't like, man, I don't want nothing to do with that. Nothing. Look what they did to Elon. Yeah. You don't want that. Yeah. It's it's a harsh world because there's no sympathy for you. You know, you're the wealthy oligarch. Oh, and you want everybody looking at you, right? Yeah. And then all of a sudden, they're looking at you.\n\nYeah. Just got nervous. They got you under that eye of Sauron. They're trying to find all your flaws and everybody's got them. That's why I got this little bird right here. It tells me tells me all the secrets. What is that bird? I didn't know what this was when I bought it. Right. This is This is Horus, right? Oh, wow. And I just I found it in this place. this this found items place about 10 years ago and I just liked it actually. I just thought I thought it was native, right? I didn't realize it was like Egyptian and I've always liked this one because I felt like it was a little bit of both. Um, and I I didn't know anything about it at first. Um, but the reason I never take it off anymore is like when I started like reading about like what it meant to the Egyptians was that it meant like safe passage as you journey through this world and get ready to go on to the next one. You know what I mean? And protect you against evil, protect you um in, you know, and for health and happiness. M they called it initiation. So it makes a lot of people tie it to stupid like uh you know Illuminati and all that kind of stuff but I mean it's just a it's just a Thunderbird. Well, you know the eye of Horus is essentially the pineal gland where the seat of the soul where the brain produces dimethylryptamine. That's the eye of Horus. Have you ever seen the image of the eye of Horus next to the pineal gland? I'm not sure. Maybe I have but I'm I'm ignorant. I didn't the the ancient what's what's pineal gland? The pineal gland is a it's a gland that's in the center of your brain. It's essentially the third eye. In reptiles, it actually has a retina and a lens. Wow. Or a cornea and a lens. And it's it's where they now they believe that DMT is actually produced by the entire brain. It's also produced by the liver and the lungs, but it's like the most spiritual of all the psychedelics. And they believe that the Egyptians had some sort of they you know there's so little understood about truly ancient Egypt. But look at that. Look what it looks like.\n\nI mean the the eye of Horus essentially is it's a diagram of the pineal gland which is kind of crazy. It's kind of crazy when you see it that way. Wow. Because they they knew things and we don't know what they knew. We don't understand how they built the pyramids. We don't understand how old they are. There's so much speculation about the true age of that civilization. Figuring out like how they harnessed energy and all that stuff. We have no idea. We have no idea. I mean, there's there's this group of scientists that believe that there's structures under the pyramids that go 2 km deep into the earth. And and there's a lot of controversy about that, but these guys are they've multiple readings of these things and they're pretty sure that they're accurate. And they they've been accurate with other things like other temples that are underground that are 50 ft underground. They've mapped those things out with the same technology. So there's a precedent to it. These people knew things and we don't understand how they knew it or what they knew. And we don't know if the people that lived in ancient Egypt that we considered ancient Egypt like, you know, 2,000 BC. We don't know if they found those structures or if those people built those structures. There's so much weirdness with Egypt because the construction is so beyond anything else that exists anywhere on Earth and especially when you're dealing with 4,500 plus years ago. 4,500 years ago is the conventional estimations. But there's a lot of these heretic archaeologists that think, \"No, it's this is a lot older than that.\" I mean, there's a king's list that goes back 30,000 like 30,000 years. Yeah. I mean, this it sounds nuts to people that want to have this conventional dating of the, you know, the dawn of civilization being about 6,000 years ago, but there's a lot of evidence that that's not accurate. There's a lot. And I think the most profound evidence is just the vastness of the Egyptian Empire and what what they just the vastness of the the construction, the way they were able to bring these stones from 500 miles away through the mountains that are 80 tons. How how did they cut them perfectly? How did they put them 120 feet in the air and put them in the ceiling? Like what what the was going on then? What the was going on with people were supposedly just getting out of hunter and gathering? I mean, this is like the emergence. Like a couple thousand years earlier, we're supposed to be like using stone tools and throwing them at animals. And now you have these people that build this immense structure that's perfectly aligned. A true north, south, east, and west has 2,300,000 stones in it. What? It's aligned with Orion stars. The stars in the Orion belt. Like what? Maybe the maybe what happened was is AI took them down too. It might be way way back. It might be. I mean, it's back. I'm just saying, right? It could be. It could stuff could be I forget who said that, but it's like I mean, I'm all for I'm all for science, but in the end of the day, you know, no matter what we think we know, it's still just like a you know, it's like a flame in a dark night, you know. There's there's so much out there beyond beyond what we can see, you know. So I always I always kind of thought that myself. I mean it's a basic thing nowadays, you know, but I was like a kid, you know, a lot of people have had this thought, but it's like you're always like looking up here in the stars and it's like if they're saying that the stars are basically infinite, then it's infinite possibility for other planets with life on it, which basically is a certainty, right? It's basically a certainty. It's a certainty. Yeah, it's basically certainty. And the more we explore in the known universe, the more we understand that it's much more likely that this is not an anomaly, that there's many, many planets out there. Who knows? Maybe an infinite number that have life. So, who knows what was going on with those Egyptians? Well, we don't know how long ago they did this. You know, there's there's just so much speculation. Well, in the the version of Egypt that we're taught about, it was like just the latest stage of it. Oh, yeah. Like I read where there was just there it went on for so many thousands of years and there was this whole evolution of those kingdoms. I'm talking about throughout Africa. Y well all the subsaharan area all of that too. That's where they believe that Atlantis was. I mean there's this thing called the reshot structure that there's again these heretic archaeologists believe was the site of Atlantis. it. I mean, the the South Saharan the Saharan sub subsaharan Africa was a rich rainforest thousands of years ago. There's whale bones. They find whale bones in the Saharan desert. That's crazy. It's madness, man. Like, the history of Earth is so confusing. Like Graham Hancock says it best. We're a species with amnesia, you know? And that's what's wild about all this. We don't remember anything. Well, we definitely don't remember from 20,000 years ago. It's all just speculation. And you know, and people have been in this form, you know, the form of homo sapiens now for 300 plus thousand years. Like, who knows how long? And who knows where they learn this stuff from? I mean, who knows if they learned this stuff from visitors? We don't know. We don't know. I mean, if we did get visited 20,000, 30,000 years ago, what what evidence would be left, you know, and are we being visited now? Well, we're about to find out because if this keeps popping off with Israel and Iran and they start going nuclear, you know, that was the only the the the the great hope of the people that really believe in aliens is that what they're watching over us is to make sure we don't everything up. That we're so close to emerging as a type one civilization. We're to so close to getting out of this barbaric, you know, territorial apes with thermonuclear weapons. We're we're so close to passing this stage that we're in right now as long as we don't it up. And who knows how many times people might have it up in the past that I mean that might be what we're looking at when we're looking at ancient Egypt. There might be the remnants and there's also natural disasters. Yeah. And that's all I meant by AI. Yeah. I mean it could be our greatest natural disaster. You get there and but I like your there's a it's a very positive outlook though when you're talking about getting to the next Yeah. What' you call it? Type what you call type one civilization. What does that mean? Okay, there's there's there's type one, type two, and type three civilizations. And um I don't remember who was the one who formulated this. It might have been Sean. Um Jamie, you pull it up so I don't this up, but Jamie, it's essentially our Here it is. type one civilization known as a planetary civilization defined by our cardev scale as the one that's harnessed and controls all available energy on its planet. This includes utilizing all forms of energy from sources like solar, wind, geothermal, and potentially even harnessing nuclear fusion. A type one civilization is also characterized by a global technologically advanced society with a high degree of interconnectedness\n\n\nAnd the ability to manage planetary\nscale resources and weather. So, we're\non the way to that. And AI in best case\nscenario helps us achieve that. And\nwe're we're close. We're probably a lot\ncloser to that than we think. Type two\ncivilization is stellar, meaning we\npopulate other planets. Type three is\ngalactic. We we populate the cosmos and\nwe we explore the cosmos. Wow. We're on\nour way to that. And this it's\ninevitable. If we used to live in caves\nand now, you know, we fly in hypersonic\njets, this is what's coming. And it's\nwhether or not we [ __ ] it up along the\nway.\n\nThat was beam me up, man.\nWe should probably end on that. Charley\nCrockett, you're the man. I appreciate\nyou, brother. Thank you very much for\nbeing here, man. Pleasure is mine, man.\nTexas\nforever. Thank you, sir. Very much, man.\nThank you. Thank you. All right. Um,\ntell everybody where they can find all\nyour [ __ ] Um, do you have a social\nmedia? Yeah, but you don't got to do all\nthat. Okay. I mean, it's Charley\nCrockett. Charlie with an ey like\nCharlie Pride. That's it. Crockett with\ntwo T's. Just like Davey. That's all\nthing you need to know. That's it. All\nright. Thank you. Bye, everybody.\n\n[Music]\n",
  "metadata": {
    "summary": "In this episode of the Joe Rogan Experience, Joe Rogan hosts Charley Crockett, a country singer-songwriter, to discuss his latest album and career. The conversation spans a variety of subjects, including the potential of AI to create realistic videos, the authenticity of historical narratives, and the challenges within the music industry. They delve into personal anecdotes about gambling, the impact of the pandemic on the comedy scene, and the importance of authenticity in art. The discussion also touches on medical advancements, the nature of purpose, and the influence of Texas culture.",
    "topClaims": [
      {
        "text": "We are so close to not being able to tell what's real and what's fake.",
        "rating": 8.5,
        "chunkId": "ck-9nK4g6vgRDg-2"
      },
      {
        "text": "The moon landing was faked.",
        "rating": 7.8,
        "chunkId": "ck-9nK4g6vgRDg-3"
      },
      {
        "text": "The company that makes Coca-Cola is the biggest producer of medical grade cocaine.",
        "rating": 6.9,
        "chunkId": "ck-9nK4g6vgRDg-11"
      },
      {
        "text": "Dystopian movies about the future undersold the future.",
        "rating": 7.2,
        "chunkId": "ck-9nK4g6vgRDg-59"
      },
      {
        "text": "AI is never going to create an Oliver Anthony song.",
        "rating": 8.1,
        "chunkId": "ck-9nK4g6vgRDg-71"
      }
    ],
    "topQuotes": [
      {
        "text": "We are living in the weirdest time ever.",
        "chunkId": "ck-9nK4g6vgRDg-2",
        "chunkNum": 2,
        "relevance": 8.8,
        "interesting": 9.1
      },
      {
        "text": "There's not a single thing that's not easier, faster, and cheaper to reproduce today from 1969 except the moon landing.",
        "chunkId": "ck-9nK4g6vgRDg-3",
        "chunkNum": 3,
        "relevance": 7.9,
        "interesting": 7.5
      },
      {
        "text": "So there's no cocaine in Coca-Cola, but then they take those cocoa leaves and the flavor goes into Coca-Cola, and then the cocaine goes into medical cocaine.",
        "chunkId": "ck-9nK4g6vgRDg-11",
        "chunkNum": 11,
        "relevance": 7.1,
        "interesting": 6.8
      },
      {
        "text": "It's all going to be self-driving trucks and they're going to be more efficient, less accidents, safer.",
        "chunkId": "ck-9nK4g6vgRDg-60",
        "chunkNum": 60,
        "relevance": 8.5,
        "interesting": 8.2
      },
      {
        "text": "AI is going to create a bunch of really catchy songs, you know, but it's never going to create an Oliver Anthony song.",
        "chunkId": "ck-9nK4g6vgRDg-71",
        "chunkNum": 71,
        "relevance": 9,
        "interesting": 9.3
      }
    ],
    "topTopics": [
      {
        "name": "artificial intelligence",
        "count": 12,
        "description": "The impact of AI on society and art."
      },
      {
        "name": "country music",
        "count": 10,
        "description": "The authenticity and evolution of country music."
      },
      {
        "name": "music industry",
        "count": 8,
        "description": "The challenges and realities of the music business."
      },
      {
        "name": "historical accuracy",
        "count": 7,
        "description": "The nature of truth and historical accuracy."
      },
      {
        "name": "personal experiences",
        "count": 6,
        "description": "Personal experiences and the pursuit of purpose."
      }
    ],
    "videoInfo": {
      "id": "9nK4g6vgRDg",
      "etag": "DGfbtyFhGoDTR2AZCkNqd5SCVFs",
      "kind": "youtube#video",
      "snippet": {
        "tags": [
          "Joe Rogan Experience",
          "JRE",
          "Joe",
          "Rogan",
          "podcast",
          "MMA",
          "comedy",
          "stand",
          "up",
          "funny",
          "Freak",
          "Party"
        ],
        "title": "Joe Rogan Experience #2340 - Charley Crockett",
        "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
        "localized": {
          "title": "Joe Rogan Experience #2340 - Charley Crockett",
          "description": "Charley Crockett is a country singer-songwriter. His most recentl album, \"Lonesome Drifter,\" is available now. \n⁠https://www.charleycrockett.com⁠\n\nGo to https://ExpressVPN.com/ROGANYT to get 4 months free!\nTHE WATERFRONT - NOW PLAYING, ONLY ON NETFLIX"
        },
        "categoryId": "22",
        "thumbnails": {
          "high": {
            "url": "https://i.ytimg.com/vi/9nK4g6vgRDg/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/9nK4g6vgRDg/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/9nK4g6vgRDg/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "default": {
            "url": "https://i.ytimg.com/vi/9nK4g6vgRDg/default.jpg",
            "width": 120,
            "height": 90
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/9nK4g6vgRDg/sddefault.jpg",
            "width": 640,
            "height": 480
          }
        },
        "description": "Charley Crockett is a country singer-songwriter. His most recentl album, \"Lonesome Drifter,\" is available now. \n⁠https://www.charleycrockett.com⁠\n\nGo to https://ExpressVPN.com/ROGANYT to get 4 months free!\nTHE WATERFRONT - NOW PLAYING, ONLY ON NETFLIX",
        "publishedAt": "2025-06-19T17:00:14Z",
        "channelTitle": "PowerfulJRE",
        "defaultLanguage": "en",
        "defaultAudioLanguage": "en-US",
        "liveBroadcastContent": "none"
      },
      "statistics": {
        "likeCount": "6519",
        "viewCount": "348118",
        "commentCount": "1734",
        "favoriteCount": "0"
      },
      "contentDetails": {
        "caption": "false",
        "duration": "PT2H47M23S",
        "dimension": "2d",
        "definition": "hd",
        "projection": "rectangular",
        "contentRating": {},
        "licensedContent": true
      }
    },
    "checkCount": 26,
    "nodeCounts": [
      {
        "node": "Willie Nelson",
        "count": 8
      },
      {
        "node": "Waylon Jennings",
        "count": 8
      },
      {
        "node": "Texas",
        "count": 6
      },
      {
        "node": "Hicks",
        "count": 6
      },
      {
        "node": "music",
        "count": 5
      },
      {
        "node": "AI",
        "count": 5
      },
      {
        "node": "Charley Crockett",
        "count": 5
      },
      {
        "node": "music business",
        "count": 5
      },
      {
        "node": "comedy",
        "count": 5
      },
      {
        "node": "Coca-Cola",
        "count": 4
      },
      {
        "node": "California",
        "count": 4
      },
      {
        "node": "pandemic",
        "count": 4
      },
      {
        "node": "Shooter",
        "count": 4
      },
      {
        "node": "Jamie",
        "count": 3
      },
      {
        "node": "cocaine",
        "count": 3
      },
      {
        "node": "New York",
        "count": 3
      },
      {
        "node": "He",
        "count": 3
      },
      {
        "node": "South Texas",
        "count": 3
      },
      {
        "node": "bombing",
        "count": 3
      },
      {
        "node": "audience",
        "count": 3
      },
      {
        "node": "Sixth Street",
        "count": 3
      },
      {
        "node": "John Folk",
        "count": 3
      },
      {
        "node": "Texan",
        "count": 3
      },
      {
        "node": "Authenticity",
        "count": 3
      },
      {
        "node": "Coulter",
        "count": 3
      },
      {
        "node": "authenticity",
        "count": 3
      },
      {
        "node": "Comedy Store",
        "count": 3
      },
      {
        "node": "Welcome to Hard Times",
        "count": 3
      },
      {
        "node": "Shooter Jennings",
        "count": 3
      },
      {
        "node": "Sunset Sound",
        "count": 3
      },
      {
        "node": "country music",
        "count": 3
      },
      {
        "node": "ancient Egypt",
        "count": 3
      },
      {
        "node": "Viper Room",
        "count": 2
      },
      {
        "node": "Joe",
        "count": 2
      },
      {
        "node": "China",
        "count": 2
      },
      {
        "node": "moon landing",
        "count": 2
      },
      {
        "node": "civilization",
        "count": 2
      },
      {
        "node": "Russia",
        "count": 2
      },
      {
        "node": "government",
        "count": 2
      },
      {
        "node": "Heroin",
        "count": 2
      },
      {
        "node": "American pop culture",
        "count": 2
      },
      {
        "node": "Uncut Gems",
        "count": 2
      },
      {
        "node": "gambling addicts",
        "count": 2
      },
      {
        "node": "manager",
        "count": 2
      },
      {
        "node": "New Orleans",
        "count": 2
      },
      {
        "node": "pool hall",
        "count": 2
      },
      {
        "node": "Gary Clark Jr.",
        "count": 2
      },
      {
        "node": "Oliver Anthony",
        "count": 2
      },
      {
        "node": "Midnight Rider",
        "count": 2
      },
      {
        "node": "Booneville",
        "count": 2
      },
      {
        "node": "I",
        "count": 2
      },
      {
        "node": "Playing guitar",
        "count": 2
      },
      {
        "node": "Louisiana",
        "count": 2
      },
      {
        "node": "Dallas",
        "count": 2
      },
      {
        "node": "Houston",
        "count": 2
      },
      {
        "node": "business",
        "count": 2
      },
      {
        "node": "Evan Felker",
        "count": 2
      },
      {
        "node": "Shady Grove",
        "count": 2
      },
      {
        "node": "medical industry",
        "count": 2
      },
      {
        "node": "mechanical valve",
        "count": 2
      },
      {
        "node": "states",
        "count": 2
      },
      {
        "node": "Copenhagen",
        "count": 2
      },
      {
        "node": "Paris",
        "count": 2
      },
      {
        "node": "automation",
        "count": 2
      },
      {
        "node": "self-checkout",
        "count": 2
      },
      {
        "node": "America",
        "count": 2
      },
      {
        "node": "Willie",
        "count": 2
      },
      {
        "node": "Whan",
        "count": 2
      },
      {
        "node": "Kate McCannon",
        "count": 2
      },
      {
        "node": "30 Tigers",
        "count": 2
      },
      {
        "node": "$10 cowboy",
        "count": 2
      },
      {
        "node": "Ron White",
        "count": 2
      },
      {
        "node": "Austin",
        "count": 2
      },
      {
        "node": "South by Southwest",
        "count": 2
      },
      {
        "node": "Mark Neil",
        "count": 2
      },
      {
        "node": "Nashville",
        "count": 2
      },
      {
        "node": "blues",
        "count": 2
      },
      {
        "node": "subway cars",
        "count": 2
      },
      {
        "node": "fate",
        "count": 2
      },
      {
        "node": "George Strait",
        "count": 2
      },
      {
        "node": "Elvis",
        "count": 2
      },
      {
        "node": "West Texas",
        "count": 2
      },
      {
        "node": "Buddy Holly",
        "count": 2
      },
      {
        "node": "pineal gland",
        "count": 2
      },
      {
        "node": "planets with life",
        "count": 2
      },
      {
        "node": "Joe Rogan podcast",
        "count": 1
      },
      {
        "node": "The Joe Rogan Experience",
        "count": 1
      },
      {
        "node": "Sunset",
        "count": 1
      },
      {
        "node": "River Phoenix",
        "count": 1
      },
      {
        "node": "whiskey",
        "count": 1
      },
      {
        "node": "singularity",
        "count": 1
      },
      {
        "node": "AI engine",
        "count": 1
      },
      {
        "node": "Google",
        "count": 1
      },
      {
        "node": "Jake",
        "count": 1
      },
      {
        "node": "Bite Dance",
        "count": 1
      },
      {
        "node": "Tik Tok",
        "count": 1
      },
      {
        "node": "artificial intelligence",
        "count": 1
      },
      {
        "node": "Manhattan Project",
        "count": 1
      },
      {
        "node": "Space race",
        "count": 1
      },
      {
        "node": "Bart Sabrell",
        "count": 1
      },
      {
        "node": "A Funny Thing Happened on the Way to the Moon",
        "count": 1
      },
      {
        "node": "fake moon landing",
        "count": 1
      },
      {
        "node": "scientists",
        "count": 1
      },
      {
        "node": "moon",
        "count": 1
      },
      {
        "node": "1969",
        "count": 1
      },
      {
        "node": "Spending money",
        "count": 1
      },
      {
        "node": "Rare minerals",
        "count": 1
      },
      {
        "node": "Base on the moon",
        "count": 1
      },
      {
        "node": "Going to other places",
        "count": 1
      },
      {
        "node": "Moon landing filming",
        "count": 1
      },
      {
        "node": "Direct feed",
        "count": 1
      },
      {
        "node": "Moon landing",
        "count": 1
      },
      {
        "node": "Projection screen",
        "count": 1
      },
      {
        "node": "faking the moon landing",
        "count": 1
      },
      {
        "node": "American cultural and economic dominance",
        "count": 1
      },
      {
        "node": "Killers of the Flower Moon",
        "count": 1
      },
      {
        "node": "Hollywood movie",
        "count": 1
      },
      {
        "node": "Burbank",
        "count": 1
      },
      {
        "node": "coffee",
        "count": 1
      },
      {
        "node": "Jeff",
        "count": 1
      },
      {
        "node": "COVID",
        "count": 1
      },
      {
        "node": "secret",
        "count": 1
      },
      {
        "node": "Yerba Mate",
        "count": 1
      },
      {
        "node": "taste",
        "count": 1
      },
      {
        "node": "experts",
        "count": 1
      },
      {
        "node": "Bear Barrett",
        "count": 1
      },
      {
        "node": "Opium",
        "count": 1
      },
      {
        "node": "lies",
        "count": 1
      },
      {
        "node": "planting that flag on the moon",
        "count": 1
      },
      {
        "node": "militarily",
        "count": 1
      },
      {
        "node": "headaches",
        "count": 1
      },
      {
        "node": "Non-habit forming heroin",
        "count": 1
      },
      {
        "node": "Oxycontton",
        "count": 1
      },
      {
        "node": "Sears Robuck",
        "count": 1
      },
      {
        "node": "Jesse Plemens",
        "count": 1
      },
      {
        "node": "Google Moon",
        "count": 1
      },
      {
        "node": "Flowers of the summer moon",
        "count": 1
      },
      {
        "node": "Space discovery",
        "count": 1
      },
      {
        "node": "Moon conspiracy",
        "count": 1
      },
      {
        "node": "Space conspiracy",
        "count": 1
      },
      {
        "node": "Dracula movie",
        "count": 1
      },
      {
        "node": "heroin",
        "count": 1
      },
      {
        "node": "cigarettes",
        "count": 1
      },
      {
        "node": "Floyd Mayweather",
        "count": 1
      },
      {
        "node": "glucose",
        "count": 1
      },
      {
        "node": "Fly me to the moon",
        "count": 1
      },
      {
        "node": "romantic comedy drama",
        "count": 1
      },
      {
        "node": "Gulf of Tonkin",
        "count": 1
      },
      {
        "node": "new Coke",
        "count": 1
      },
      {
        "node": "Pepsi",
        "count": 1
      },
      {
        "node": "Dr. Pepper",
        "count": 1
      },
      {
        "node": "medical grade cocaine",
        "count": 1
      },
      {
        "node": "flavonoids",
        "count": 1
      },
      {
        "node": "cocoa leaves",
        "count": 1
      },
      {
        "node": "flavor",
        "count": 1
      },
      {
        "node": "grandfathered",
        "count": 1
      },
      {
        "node": "allergy sniffles",
        "count": 1
      },
      {
        "node": "The Substance",
        "count": 1
      },
      {
        "node": "Dememore",
        "count": 1
      },
      {
        "node": "experimental drug",
        "count": 1
      },
      {
        "node": "YouTube",
        "count": 1
      },
      {
        "node": "sensory overload",
        "count": 1
      },
      {
        "node": "horror movies",
        "count": 1
      },
      {
        "node": "anxiety",
        "count": 1
      },
      {
        "node": "Howie",
        "count": 1
      },
      {
        "node": "42nd Street",
        "count": 1
      },
      {
        "node": "Charlie",
        "count": 1
      },
      {
        "node": "diamonds",
        "count": 1
      },
      {
        "node": "Dramatic acting",
        "count": 1
      },
      {
        "node": "Comedies",
        "count": 1
      },
      {
        "node": "Serious flick",
        "count": 1
      },
      {
        "node": "Punch Drunk Love",
        "count": 1
      },
      {
        "node": "Gambling sickness",
        "count": 1
      },
      {
        "node": "Casinos",
        "count": 1
      },
      {
        "node": "Mississippi coast",
        "count": 1
      },
      {
        "node": "Riverbull gamblers",
        "count": 1
      },
      {
        "node": "man",
        "count": 1
      },
      {
        "node": "bingo",
        "count": 1
      },
      {
        "node": "Toys R Us",
        "count": 1
      },
      {
        "node": "fried shrimp",
        "count": 1
      },
      {
        "node": "cousin",
        "count": 1
      },
      {
        "node": "privacy invasion",
        "count": 1
      },
      {
        "node": "VPN necessity",
        "count": 1
      },
      {
        "node": "data brokers",
        "count": 1
      },
      {
        "node": "online activity",
        "count": 1
      },
      {
        "node": "ExpressVPN",
        "count": 1
      },
      {
        "node": "encrypted servers",
        "count": 1
      },
      {
        "node": "IP address tracking",
        "count": 1
      },
      {
        "node": "sensitive information",
        "count": 1
      },
      {
        "node": "public Wi-Fi",
        "count": 1
      },
      {
        "node": "CNET and The Verge",
        "count": 1
      },
      {
        "node": "gambling",
        "count": 1
      },
      {
        "node": "gamblers",
        "count": 1
      },
      {
        "node": "offtrack betting",
        "count": 1
      },
      {
        "node": "raindrops",
        "count": 1
      },
      {
        "node": "roaches",
        "count": 1
      },
      {
        "node": "coin flip",
        "count": 1
      },
      {
        "node": "tournament",
        "count": 1
      },
      {
        "node": "betting culture",
        "count": 1
      },
      {
        "node": "money flow",
        "count": 1
      },
      {
        "node": "conservative",
        "count": 1
      },
      {
        "node": "knit",
        "count": 1
      },
      {
        "node": "degenerates",
        "count": 1
      },
      {
        "node": "weirdos",
        "count": 1
      },
      {
        "node": "outcasts",
        "count": 1
      },
      {
        "node": "comedian",
        "count": 1
      },
      {
        "node": "dudes",
        "count": 1
      },
      {
        "node": "pool culture",
        "count": 1
      },
      {
        "node": "Performance",
        "count": 1
      },
      {
        "node": "Ritz",
        "count": 1
      },
      {
        "node": "Steve Rayvon",
        "count": 1
      },
      {
        "node": "Guitar pick",
        "count": 1
      },
      {
        "node": "Boneyard in Alaska",
        "count": 1
      },
      {
        "node": "Voodoo Child",
        "count": 1
      },
      {
        "node": "weapons",
        "count": 1
      },
      {
        "node": "guy",
        "count": 1
      },
      {
        "node": "Menescino County",
        "count": 1
      },
      {
        "node": "Garden of Eden",
        "count": 1
      },
      {
        "node": "lady's house",
        "count": 1
      },
      {
        "node": "guitar player",
        "count": 1
      },
      {
        "node": "shanty deal",
        "count": 1
      },
      {
        "node": "Northern California",
        "count": 1
      },
      {
        "node": "acid",
        "count": 1
      },
      {
        "node": "old boy",
        "count": 1
      },
      {
        "node": "Bakavville",
        "count": 1
      },
      {
        "node": "hitchhiking",
        "count": 1
      },
      {
        "node": "20",
        "count": 1
      },
      {
        "node": "22",
        "count": 1
      },
      {
        "node": "five",
        "count": 1
      },
      {
        "node": "Texas boys",
        "count": 1
      },
      {
        "node": "hippies",
        "count": 1
      },
      {
        "node": "Hitching",
        "count": 1
      },
      {
        "node": "Economic value",
        "count": 1
      },
      {
        "node": "Recognition",
        "count": 1
      },
      {
        "node": "First time",
        "count": 1
      },
      {
        "node": "Playing outside",
        "count": 1
      },
      {
        "node": "Baseball diamond",
        "count": 1
      },
      {
        "node": "Bleachers",
        "count": 1
      },
      {
        "node": "Pocket full of change",
        "count": 1
      },
      {
        "node": "trouble with the law",
        "count": 1
      },
      {
        "node": "family",
        "count": 1
      },
      {
        "node": "on the run",
        "count": 1
      },
      {
        "node": "South Padre Island",
        "count": 1
      },
      {
        "node": "Grand Valley",
        "count": 1
      },
      {
        "node": "Macallen",
        "count": 1
      },
      {
        "node": "Haringen",
        "count": 1
      },
      {
        "node": "lack of education",
        "count": 1
      },
      {
        "node": "poverty",
        "count": 1
      },
      {
        "node": "brother",
        "count": 1
      },
      {
        "node": "childhood",
        "count": 1
      },
      {
        "node": "sister",
        "count": 1
      },
      {
        "node": "half brother",
        "count": 1
      },
      {
        "node": "half sister",
        "count": 1
      },
      {
        "node": "daddies",
        "count": 1
      },
      {
        "node": "hustler",
        "count": 1
      },
      {
        "node": "access",
        "count": 1
      },
      {
        "node": "newspaper subscriptions",
        "count": 1
      },
      {
        "node": "broken arm",
        "count": 1
      },
      {
        "node": "men's clothing",
        "count": 1
      },
      {
        "node": "downtown Dallas",
        "count": 1
      },
      {
        "node": "boiler room",
        "count": 1
      },
      {
        "node": "Wild West business",
        "count": 1
      },
      {
        "node": "THE WATERFRONT",
        "count": 1
      },
      {
        "node": "Havenport",
        "count": 1
      },
      {
        "node": "Buckley family",
        "count": 1
      },
      {
        "node": "Creator of Scream",
        "count": 1
      },
      {
        "node": "Easy Money",
        "count": 1
      },
      {
        "node": "Silver City",
        "count": 1
      },
      {
        "node": "Lonesome Drifter record",
        "count": 1
      },
      {
        "node": "music artist",
        "count": 1
      },
      {
        "node": "Bob Marley",
        "count": 1
      },
      {
        "node": "Daniel Harmon",
        "count": 1
      },
      {
        "node": "promotion",
        "count": 1
      },
      {
        "node": "street performer",
        "count": 1
      },
      {
        "node": "marketing",
        "count": 1
      },
      {
        "node": "underestimated",
        "count": 1
      },
      {
        "node": "music industry",
        "count": 1
      },
      {
        "node": "Moneyball",
        "count": 1
      },
      {
        "node": "maximize the potential",
        "count": 1
      },
      {
        "node": "Brad Pitt",
        "count": 1
      },
      {
        "node": "athletes",
        "count": 1
      },
      {
        "node": "money guitar",
        "count": 1
      },
      {
        "node": "seeding",
        "count": 1
      },
      {
        "node": "pump and dump",
        "count": 1
      },
      {
        "node": "viral hit",
        "count": 1
      },
      {
        "node": "challenges",
        "count": 1
      },
      {
        "node": "developing artists",
        "count": 1
      },
      {
        "node": "astronomical quick rise",
        "count": 1
      },
      {
        "node": "business deals",
        "count": 1
      },
      {
        "node": "Outlaws compilation record",
        "count": 1
      },
      {
        "node": "outlaw subgenre",
        "count": 1
      },
      {
        "node": "poor black artists",
        "count": 1
      },
      {
        "node": "poor farm boys",
        "count": 1
      },
      {
        "node": "Willy's Reddit Stranger",
        "count": 1
      },
      {
        "node": "Artha Franklin",
        "count": 1
      },
      {
        "node": "artists",
        "count": 1
      },
      {
        "node": "make money",
        "count": 1
      },
      {
        "node": "make them laugh",
        "count": 1
      },
      {
        "node": "open mics",
        "count": 1
      },
      {
        "node": "terrified",
        "count": 1
      },
      {
        "node": "local act",
        "count": 1
      },
      {
        "node": "fresh mindset",
        "count": 1
      },
      {
        "node": "routine",
        "count": 1
      },
      {
        "node": "amazed",
        "count": 1
      },
      {
        "node": "mediocre state of mind",
        "count": 1
      },
      {
        "node": "hypnotized",
        "count": 1
      },
      {
        "node": "effect",
        "count": 1
      },
      {
        "node": "listen",
        "count": 1
      },
      {
        "node": "hide",
        "count": 1
      },
      {
        "node": "into it",
        "count": 1
      },
      {
        "node": "tolerable",
        "count": 1
      },
      {
        "node": "poetic license",
        "count": 1
      },
      {
        "node": "engagement",
        "count": 1
      },
      {
        "node": "locking in",
        "count": 1
      },
      {
        "node": "10 years",
        "count": 1
      },
      {
        "node": "opening up",
        "count": 1
      },
      {
        "node": "barely getting by",
        "count": 1
      },
      {
        "node": "10,000 hour thing",
        "count": 1
      },
      {
        "node": "dedicate yourself",
        "count": 1
      },
      {
        "node": "Nam Chosky",
        "count": 1
      },
      {
        "node": "COVID vaccine",
        "count": 1
      },
      {
        "node": "isolated and quarantined",
        "count": 1
      },
      {
        "node": "experimental",
        "count": 1
      },
      {
        "node": "academics",
        "count": 1
      },
      {
        "node": "media",
        "count": 1
      },
      {
        "node": "politics",
        "count": 1
      },
      {
        "node": "Pharmaceutical industrial complex",
        "count": 1
      },
      {
        "node": "Medical industry",
        "count": 1
      },
      {
        "node": "Wolf Parkinson's White disease",
        "count": 1
      },
      {
        "node": "Ablation",
        "count": 1
      },
      {
        "node": "Deep Ellum",
        "count": 1
      },
      {
        "node": "Darwin's Pub",
        "count": 1
      },
      {
        "node": "Ganja Farms",
        "count": 1
      },
      {
        "node": "Bernie Sanders",
        "count": 1
      },
      {
        "node": "Arhythmia",
        "count": 1
      },
      {
        "node": "Turnpike Triadors",
        "count": 1
      },
      {
        "node": "Hank Williams circuit",
        "count": 1
      },
      {
        "node": "Buddy Lee attractions",
        "count": 1
      },
      {
        "node": "Lucky Mohler",
        "count": 1
      },
      {
        "node": "South Circuit",
        "count": 1
      },
      {
        "node": "R&B",
        "count": 1
      },
      {
        "node": "Hillbilly Country Boys",
        "count": 1
      },
      {
        "node": "Gangster",
        "count": 1
      },
      {
        "node": "The Saint",
        "count": 1
      },
      {
        "node": "Punk rock clubs",
        "count": 1
      },
      {
        "node": "Bonita Creek Hall",
        "count": 1
      },
      {
        "node": "Asbury Park",
        "count": 1
      },
      {
        "node": "Circuit",
        "count": 1
      },
      {
        "node": "Blacking out",
        "count": 1
      },
      {
        "node": "Potions",
        "count": 1
      },
      {
        "node": "Lightheaded",
        "count": 1
      },
      {
        "node": "Grinding",
        "count": 1
      },
      {
        "node": "KGSR radio thing",
        "count": 1
      },
      {
        "node": "Marsha Milum",
        "count": 1
      },
      {
        "node": "ACL radio",
        "count": 1
      },
      {
        "node": "Barton Springs",
        "count": 1
      },
      {
        "node": "Reded Stranger",
        "count": 1
      },
      {
        "node": "IRS era",
        "count": 1
      },
      {
        "node": "Chuck Lian",
        "count": 1
      },
      {
        "node": "Oklahoma",
        "count": 1
      },
      {
        "node": "bass players",
        "count": 1
      },
      {
        "node": "old buses",
        "count": 1
      },
      {
        "node": "rhythm",
        "count": 1
      },
      {
        "node": "arhythmia",
        "count": 1
      },
      {
        "node": "heart",
        "count": 1
      },
      {
        "node": "surgery",
        "count": 1
      },
      {
        "node": "advocate",
        "count": 1
      },
      {
        "node": "American Heart Association",
        "count": 1
      },
      {
        "node": "Affordable Care Act",
        "count": 1
      },
      {
        "node": "health insurance",
        "count": 1
      },
      {
        "node": "blood thinner",
        "count": 1
      },
      {
        "node": "prosthetic valve",
        "count": 1
      },
      {
        "node": "stroke",
        "count": 1
      },
      {
        "node": "boprothetic cow valve",
        "count": 1
      },
      {
        "node": "clicking",
        "count": 1
      },
      {
        "node": "Everlast",
        "count": 1
      },
      {
        "node": "American business practices",
        "count": 1
      },
      {
        "node": "stroke risk",
        "count": 1
      },
      {
        "node": "20 years",
        "count": 1
      },
      {
        "node": "boine cow valve",
        "count": 1
      },
      {
        "node": "Edward Scientific",
        "count": 1
      },
      {
        "node": "operation",
        "count": 1
      },
      {
        "node": "Seatin",
        "count": 1
      },
      {
        "node": "preventative well-being",
        "count": 1
      },
      {
        "node": "Technological advancements",
        "count": 1
      },
      {
        "node": "Scope procedures",
        "count": 1
      },
      {
        "node": "Preventative healthcare",
        "count": 1
      },
      {
        "node": "Common person access",
        "count": 1
      },
      {
        "node": "Cheap traders",
        "count": 1
      },
      {
        "node": "Older patients",
        "count": 1
      },
      {
        "node": "ablation",
        "count": 1
      },
      {
        "node": "aortic valve disease",
        "count": 1
      },
      {
        "node": "aorta",
        "count": 1
      },
      {
        "node": "valves",
        "count": 1
      },
      {
        "node": "Mercedes symbol",
        "count": 1
      },
      {
        "node": "Wolf Parkinson's white",
        "count": 1
      },
      {
        "node": "bicuspit",
        "count": 1
      },
      {
        "node": "leaky carburetor",
        "count": 1
      },
      {
        "node": "lady",
        "count": 1
      },
      {
        "node": "seances",
        "count": 1
      },
      {
        "node": "burning sage",
        "count": 1
      },
      {
        "node": "bus driver",
        "count": 1
      },
      {
        "node": "late night drives",
        "count": 1
      },
      {
        "node": "highway",
        "count": 1
      },
      {
        "node": "video",
        "count": 1
      },
      {
        "node": "Jimbo",
        "count": 1
      },
      {
        "node": "methamphetamine freakouts",
        "count": 1
      },
      {
        "node": "industry",
        "count": 1
      },
      {
        "node": "Road trip",
        "count": 1
      },
      {
        "node": "Cincinnati",
        "count": 1
      },
      {
        "node": "Amphetamines",
        "count": 1
      },
      {
        "node": "Mental slavery",
        "count": 1
      },
      {
        "node": "Chsky",
        "count": 1
      },
      {
        "node": "American consumerism",
        "count": 1
      },
      {
        "node": "Mortality",
        "count": 1
      },
      {
        "node": "Gentleman hobo",
        "count": 1
      },
      {
        "node": "Value of life",
        "count": 1
      },
      {
        "node": "sense of purpose",
        "count": 1
      },
      {
        "node": "10,000 hours",
        "count": 1
      },
      {
        "node": "ancient tooth",
        "count": 1
      },
      {
        "node": "transient",
        "count": 1
      },
      {
        "node": "programming",
        "count": 1
      },
      {
        "node": "Crystal City",
        "count": 1
      },
      {
        "node": "acquiring stuff",
        "count": 1
      },
      {
        "node": "bank account",
        "count": 1
      },
      {
        "node": "richness of life",
        "count": 1
      },
      {
        "node": "fulfillment",
        "count": 1
      },
      {
        "node": "free social media",
        "count": 1
      },
      {
        "node": "attention",
        "count": 1
      },
      {
        "node": "transparent society",
        "count": 1
      },
      {
        "node": "Danish jazz singer",
        "count": 1
      },
      {
        "node": "Lower East Side",
        "count": 1
      },
      {
        "node": "Denmark",
        "count": 1
      },
      {
        "node": "arts",
        "count": 1
      },
      {
        "node": "high quality of life",
        "count": 1
      },
      {
        "node": "Benjamin Augerbach",
        "count": 1
      },
      {
        "node": "American gypsy lifestyle",
        "count": 1
      },
      {
        "node": "Europe",
        "count": 1
      },
      {
        "node": "American novelty",
        "count": 1
      },
      {
        "node": "Street performance",
        "count": 1
      },
      {
        "node": "Exotic",
        "count": 1
      },
      {
        "node": "culture",
        "count": 1
      },
      {
        "node": "Austin blues",
        "count": 1
      },
      {
        "node": "Texas guitar slingers",
        "count": 1
      },
      {
        "node": "self-checkouts",
        "count": 1
      },
      {
        "node": "United States",
        "count": 1
      },
      {
        "node": "bus ticket",
        "count": 1
      },
      {
        "node": "language barrier",
        "count": 1
      },
      {
        "node": "Algerian guy",
        "count": 1
      },
      {
        "node": "Monmark",
        "count": 1
      },
      {
        "node": "Le Sakraore",
        "count": 1
      },
      {
        "node": "hustle tourists",
        "count": 1
      },
      {
        "node": "gypsies",
        "count": 1
      },
      {
        "node": "steps",
        "count": 1
      },
      {
        "node": "pickpocketing",
        "count": 1
      },
      {
        "node": "America vs Europe",
        "count": 1
      },
      {
        "node": "America vs Latin America",
        "count": 1
      },
      {
        "node": "technologies",
        "count": 1
      },
      {
        "node": "process",
        "count": 1
      },
      {
        "node": "risks",
        "count": 1
      },
      {
        "node": "cost",
        "count": 1
      },
      {
        "node": "machines",
        "count": 1
      },
      {
        "node": "industries",
        "count": 1
      },
      {
        "node": "disconnection",
        "count": 1
      },
      {
        "node": "maximize profits",
        "count": 1
      },
      {
        "node": "impersonal experience",
        "count": 1
      },
      {
        "node": "Soylent Green",
        "count": 1
      },
      {
        "node": "dystopian movies",
        "count": 1
      },
      {
        "node": "the future",
        "count": 1
      },
      {
        "node": "truck driving",
        "count": 1
      },
      {
        "node": "self-driving trucks",
        "count": 1
      },
      {
        "node": "big business people",
        "count": 1
      },
      {
        "node": "undocumented workers",
        "count": 1
      },
      {
        "node": "safety net",
        "count": 1
      },
      {
        "node": "taxes",
        "count": 1
      },
      {
        "node": "exhaustion",
        "count": 1
      },
      {
        "node": "Nashville system",
        "count": 1
      },
      {
        "node": "1974",
        "count": 1
      },
      {
        "node": "creative control",
        "count": 1
      },
      {
        "node": "use your band",
        "count": 1
      },
      {
        "node": "choose your studio",
        "count": 1
      },
      {
        "node": "strangle hold",
        "count": 1
      },
      {
        "node": "phones",
        "count": 1
      },
      {
        "node": "yin and yang",
        "count": 1
      },
      {
        "node": "central Texas scene",
        "count": 1
      },
      {
        "node": "Jerry Wexler",
        "count": 1
      },
      {
        "node": "Atlantic Records",
        "count": 1
      },
      {
        "node": "Columbia Records",
        "count": 1
      },
      {
        "node": "Neil Russian",
        "count": 1
      },
      {
        "node": "alt country Americana circuit",
        "count": 1
      },
      {
        "node": "Pop music",
        "count": 1
      },
      {
        "node": "Hip-hop",
        "count": 1
      },
      {
        "node": "Country music",
        "count": 1
      },
      {
        "node": "Loyal fans",
        "count": 1
      },
      {
        "node": "Mass produced",
        "count": 1
      },
      {
        "node": "Executives",
        "count": 1
      },
      {
        "node": "Focus group",
        "count": 1
      },
      {
        "node": "Willy's Ranch",
        "count": 1
      },
      {
        "node": "Jamie Johnson",
        "count": 1
      },
      {
        "node": "21",
        "count": 1
      },
      {
        "node": "that song",
        "count": 1
      },
      {
        "node": "pickup truck",
        "count": 1
      },
      {
        "node": "records",
        "count": 1
      },
      {
        "node": "labels",
        "count": 1
      },
      {
        "node": "album",
        "count": 1
      },
      {
        "node": "coastal labels",
        "count": 1
      },
      {
        "node": "RCA",
        "count": 1
      },
      {
        "node": "David MSAS",
        "count": 1
      },
      {
        "node": "catalog",
        "count": 1
      },
      {
        "node": "New York Boys",
        "count": 1
      },
      {
        "node": "MSUS",
        "count": 1
      },
      {
        "node": "royalty rate",
        "count": 1
      },
      {
        "node": "podcasts",
        "count": 1
      },
      {
        "node": "ranch",
        "count": 1
      },
      {
        "node": "Saskatchewan",
        "count": 1
      },
      {
        "node": "Saskatoon",
        "count": 1
      },
      {
        "node": "ranching folks",
        "count": 1
      },
      {
        "node": "cowboy music",
        "count": 1
      },
      {
        "node": "hip-hop artists",
        "count": 1
      },
      {
        "node": "pop artists",
        "count": 1
      },
      {
        "node": "something that resonates",
        "count": 1
      },
      {
        "node": "hit pop song",
        "count": 1
      },
      {
        "node": "Loyalty",
        "count": 1
      },
      {
        "node": "Expression",
        "count": 1
      },
      {
        "node": "Pop artists",
        "count": 1
      },
      {
        "node": "Wrong path",
        "count": 1
      },
      {
        "node": "Soul",
        "count": 1
      },
      {
        "node": "Life experience",
        "count": 1
      },
      {
        "node": "Art",
        "count": 1
      },
      {
        "node": "Human being",
        "count": 1
      },
      {
        "node": "Mind",
        "count": 1
      },
      {
        "node": "Capitalization",
        "count": 1
      },
      {
        "node": "AI Music",
        "count": 1
      },
      {
        "node": "Oliver Anthony song",
        "count": 1
      },
      {
        "node": "Hard times",
        "count": 1
      },
      {
        "node": "Inauthentic content",
        "count": 1
      },
      {
        "node": "Real human being",
        "count": 1
      },
      {
        "node": "Genuine experiences",
        "count": 1
      },
      {
        "node": "Joe Rogan Experience",
        "count": 1
      },
      {
        "node": "Hendricks",
        "count": 1
      },
      {
        "node": "Jimmy",
        "count": 1
      },
      {
        "node": "Austin, Texas or Bust",
        "count": 1
      },
      {
        "node": "Led Zeppelin",
        "count": 1
      },
      {
        "node": "Jimi Hendrix",
        "count": 1
      },
      {
        "node": "Phil Hartman",
        "count": 1
      },
      {
        "node": "Suzanne Santo",
        "count": 1
      },
      {
        "node": "Honey Honey",
        "count": 1
      },
      {
        "node": "party scene",
        "count": 1
      },
      {
        "node": "cocaine party scene",
        "count": 1
      },
      {
        "node": "Mark Marin",
        "count": 1
      },
      {
        "node": "Kenisonson",
        "count": 1
      },
      {
        "node": "voices in his head",
        "count": 1
      },
      {
        "node": "caricature",
        "count": 1
      },
      {
        "node": "Texas style",
        "count": 1
      },
      {
        "node": "hyper room",
        "count": 1
      },
      {
        "node": "club comics",
        "count": 1
      },
      {
        "node": "Laugh Stop",
        "count": 1
      },
      {
        "node": "open mic scene",
        "count": 1
      },
      {
        "node": "Texas quality",
        "count": 1
      },
      {
        "node": "Jerry Seinfeld",
        "count": 1
      },
      {
        "node": "new scene",
        "count": 1
      },
      {
        "node": "pure comics",
        "count": 1
      },
      {
        "node": "sitcom",
        "count": 1
      },
      {
        "node": "Los Angeles",
        "count": 1
      },
      {
        "node": "clubs",
        "count": 1
      },
      {
        "node": "90s",
        "count": 1
      },
      {
        "node": "clips",
        "count": 1
      },
      {
        "node": "comedians",
        "count": 1
      },
      {
        "node": "Social commentary",
        "count": 1
      },
      {
        "node": "Dark poetry",
        "count": 1
      },
      {
        "node": "Emulate Hicks",
        "count": 1
      },
      {
        "node": "Stevie Rayvon",
        "count": 1
      },
      {
        "node": "Dallas Fort Worth",
        "count": 1
      },
      {
        "node": "Kmart",
        "count": 1
      },
      {
        "node": "flag",
        "count": 1
      },
      {
        "node": "Nick's Comedy Stop",
        "count": 1
      },
      {
        "node": "cops and donuts",
        "count": 1
      },
      {
        "node": "Daffy Duck",
        "count": 1
      },
      {
        "node": "Donald Duck",
        "count": 1
      },
      {
        "node": "performing",
        "count": 1
      },
      {
        "node": "300 people",
        "count": 1
      },
      {
        "node": "smoking pot",
        "count": 1
      },
      {
        "node": "telling jokes",
        "count": 1
      },
      {
        "node": "Greg Fitz Simmons",
        "count": 1
      },
      {
        "node": "Comedy Connection",
        "count": 1
      },
      {
        "node": "Rodney Dangerfield HBO special",
        "count": 1
      },
      {
        "node": "Robert Shiml",
        "count": 1
      },
      {
        "node": "Lenny Clark",
        "count": 1
      },
      {
        "node": "Andrew Dice Clay",
        "count": 1
      },
      {
        "node": "Kenison",
        "count": 1
      },
      {
        "node": "Boston",
        "count": 1
      },
      {
        "node": "Rodney Dangerfield",
        "count": 1
      },
      {
        "node": "Tiffany meeting Jimmyi Hendris",
        "count": 1
      },
      {
        "node": "Jimmyi Hendris",
        "count": 1
      },
      {
        "node": "Pop mall comedy",
        "count": 1
      },
      {
        "node": "Pop mall music",
        "count": 1
      },
      {
        "node": "Corporatism",
        "count": 1
      },
      {
        "node": "Subgenre",
        "count": 1
      },
      {
        "node": "Austin comedy scene",
        "count": 1
      },
      {
        "node": "LA",
        "count": 1
      },
      {
        "node": "comedy store",
        "count": 1
      },
      {
        "node": "year and a half",
        "count": 1
      },
      {
        "node": "Gary",
        "count": 1
      },
      {
        "node": "Dave Chappelle",
        "count": 1
      },
      {
        "node": "Stubs",
        "count": 1
      },
      {
        "node": "Vulcan Gas Company",
        "count": 1
      },
      {
        "node": "Kill Tony",
        "count": 1
      },
      {
        "node": "Spotify deal",
        "count": 1
      },
      {
        "node": "comedy community",
        "count": 1
      },
      {
        "node": "lone wolves in comedy",
        "count": 1
      },
      {
        "node": "iron sharpens iron",
        "count": 1
      },
      {
        "node": "best comic in the world",
        "count": 1
      },
      {
        "node": "Spotify money",
        "count": 1
      },
      {
        "node": "outdoor shows",
        "count": 1
      },
      {
        "node": "parking lot shows",
        "count": 1
      },
      {
        "node": "restaurants",
        "count": 1
      },
      {
        "node": "Tom Sigura",
        "count": 1
      },
      {
        "node": "Tim Dillon",
        "count": 1
      },
      {
        "node": "Tony Hinchcliffe",
        "count": 1
      },
      {
        "node": "Duncan Trussell",
        "count": 1
      },
      {
        "node": "Brian Simpson",
        "count": 1
      },
      {
        "node": "red dirt circuit",
        "count": 1
      },
      {
        "node": "dance halls",
        "count": 1
      },
      {
        "node": "beer joints",
        "count": 1
      },
      {
        "node": "California shutdown",
        "count": 1
      },
      {
        "node": "relationship",
        "count": 1
      },
      {
        "node": "management relationship",
        "count": 1
      },
      {
        "node": "rigged casino",
        "count": 1
      },
      {
        "node": "America's a casino",
        "count": 1
      },
      {
        "node": "Cloudcroft, New Mexico",
        "count": 1
      },
      {
        "node": "Taylor Grace",
        "count": 1
      },
      {
        "node": "David Msas",
        "count": 1
      },
      {
        "node": "career trajectory",
        "count": 1
      },
      {
        "node": "marketing records",
        "count": 1
      },
      {
        "node": "Broke dick Americana",
        "count": 1
      },
      {
        "node": "Record cycles",
        "count": 1
      },
      {
        "node": "Silver Lake",
        "count": 1
      },
      {
        "node": "Time Square",
        "count": 1
      },
      {
        "node": "Personal experience",
        "count": 1
      },
      {
        "node": "Billboard",
        "count": 1
      },
      {
        "node": "Music City USA",
        "count": 1
      },
      {
        "node": "Nashville Machine",
        "count": 1
      },
      {
        "node": "Bruce Robinson",
        "count": 1
      },
      {
        "node": "Billboard 200",
        "count": 1
      },
      {
        "node": "$10 Cowboy",
        "count": 1
      },
      {
        "node": "Turnpike Juidors",
        "count": 1
      },
      {
        "node": "Nashville Palace",
        "count": 1
      },
      {
        "node": "movie business",
        "count": 1
      },
      {
        "node": "rodeo finals",
        "count": 1
      },
      {
        "node": "manager and the machine",
        "count": 1
      },
      {
        "node": "secret shrine",
        "count": 1
      },
      {
        "node": "Littlefield, Texas",
        "count": 1
      },
      {
        "node": "Vegas",
        "count": 1
      },
      {
        "node": "movie",
        "count": 1
      },
      {
        "node": "James D.",
        "count": 1
      },
      {
        "node": "Waylon",
        "count": 1
      },
      {
        "node": "Waylon's music",
        "count": 1
      },
      {
        "node": "Jessi Colter",
        "count": 1
      },
      {
        "node": "artist",
        "count": 1
      },
      {
        "node": "museum",
        "count": 1
      },
      {
        "node": "idea",
        "count": 1
      },
      {
        "node": "conversation",
        "count": 1
      },
      {
        "node": "artist deal",
        "count": 1
      },
      {
        "node": "Jamie Wyatt",
        "count": 1
      },
      {
        "node": "Vince Neil Emerson",
        "count": 1
      },
      {
        "node": "downtown Hollywood",
        "count": 1
      },
      {
        "node": "Georgia",
        "count": 1
      },
      {
        "node": "Mississippi",
        "count": 1
      },
      {
        "node": "record",
        "count": 1
      },
      {
        "node": "studio 3",
        "count": 1
      },
      {
        "node": "Sage Brush Trilogy",
        "count": 1
      },
      {
        "node": "Lonesome Drifter",
        "count": 1
      },
      {
        "node": "Dollar a Day on 88",
        "count": 1
      },
      {
        "node": "stylistic chameleon",
        "count": 1
      },
      {
        "node": "folk music",
        "count": 1
      },
      {
        "node": "New York City train cars",
        "count": 1
      },
      {
        "node": "synchronicity",
        "count": 1
      },
      {
        "node": "things are meant to be",
        "count": 1
      },
      {
        "node": "a plan for you",
        "count": 1
      },
      {
        "node": "right frequency",
        "count": 1
      },
      {
        "node": "right path",
        "count": 1
      },
      {
        "node": "doors open",
        "count": 1
      },
      {
        "node": "right time",
        "count": 1
      },
      {
        "node": "right reasons",
        "count": 1
      },
      {
        "node": "faith",
        "count": 1
      },
      {
        "node": "surrender",
        "count": 1
      },
      {
        "node": "Love your struggle",
        "count": 1
      },
      {
        "node": "strength",
        "count": 1
      },
      {
        "node": "struggle",
        "count": 1
      },
      {
        "node": "Fate",
        "count": 1
      },
      {
        "node": "destiny",
        "count": 1
      },
      {
        "node": "Waylon Jennings thing",
        "count": 1
      },
      {
        "node": "Houston rodeo",
        "count": 1
      },
      {
        "node": "Selena",
        "count": 1
      },
      {
        "node": "Astrodome",
        "count": 1
      },
      {
        "node": "NRG Stadium",
        "count": 1
      },
      {
        "node": "Merle Haggard",
        "count": 1
      },
      {
        "node": "Post Malone",
        "count": 1
      },
      {
        "node": "Beyonce",
        "count": 1
      },
      {
        "node": "unreleased Waylon Jennings records",
        "count": 1
      },
      {
        "node": "outlaws",
        "count": 1
      },
      {
        "node": "Nashville country music",
        "count": 1
      },
      {
        "node": "John Spong",
        "count": 1
      },
      {
        "node": "Che Guevara",
        "count": 1
      },
      {
        "node": "rock and roll",
        "count": 1
      },
      {
        "node": "Robert Johnson",
        "count": 1
      },
      {
        "node": "B.B. King",
        "count": 1
      },
      {
        "node": "Delta",
        "count": 1
      },
      {
        "node": "Rock and Roll Hall of Fame",
        "count": 1
      },
      {
        "node": "Dolly Parton",
        "count": 1
      },
      {
        "node": "traditional country",
        "count": 1
      },
      {
        "node": "country folk",
        "count": 1
      },
      {
        "node": "folk country",
        "count": 1
      },
      {
        "node": "the long-haired prince of darkness",
        "count": 1
      },
      {
        "node": "the coast",
        "count": 1
      },
      {
        "node": "zeit guys power",
        "count": 1
      },
      {
        "node": "making records",
        "count": 1
      },
      {
        "node": "Townes Van Zandt",
        "count": 1
      },
      {
        "node": "Billy Joe Shaver",
        "count": 1
      },
      {
        "node": "Hanging On",
        "count": 1
      },
      {
        "node": "Texas songwriters",
        "count": 1
      },
      {
        "node": "Imitating an artist",
        "count": 1
      },
      {
        "node": "Jaydon Woodard",
        "count": 1
      },
      {
        "node": "Citizen Coke",
        "count": 1
      },
      {
        "node": "Clarence Greenwood",
        "count": 1
      },
      {
        "node": "Metropolitan Avenue stop",
        "count": 1
      },
      {
        "node": "L train",
        "count": 1
      },
      {
        "node": "Telecaster",
        "count": 1
      },
      {
        "node": "Ghost",
        "count": 1
      },
      {
        "node": "Biggie",
        "count": 1
      },
      {
        "node": "Eric",
        "count": 1
      },
      {
        "node": "king",
        "count": 1
      },
      {
        "node": "street corner",
        "count": 1
      },
      {
        "node": "competitors",
        "count": 1
      },
      {
        "node": "aunt",
        "count": 1
      },
      {
        "node": "trains",
        "count": 1
      },
      {
        "node": "Jake Gyllenhaal",
        "count": 1
      },
      {
        "node": "NBA commissioner",
        "count": 1
      },
      {
        "node": "$100 bill",
        "count": 1
      },
      {
        "node": "power",
        "count": 1
      },
      {
        "node": "Jaydon",
        "count": 1
      },
      {
        "node": "transformation",
        "count": 1
      },
      {
        "node": "metamorphosis",
        "count": 1
      },
      {
        "node": "performance",
        "count": 1
      },
      {
        "node": "Muhammad Ali",
        "count": 1
      },
      {
        "node": "executives",
        "count": 1
      },
      {
        "node": "Nell Mulddere",
        "count": 1
      },
      {
        "node": "Sony",
        "count": 1
      },
      {
        "node": "Sony system",
        "count": 1
      },
      {
        "node": "star maker",
        "count": 1
      },
      {
        "node": "Korea Town",
        "count": 1
      },
      {
        "node": "Hell's Kitchen",
        "count": 1
      },
      {
        "node": "Sony Legacy",
        "count": 1
      },
      {
        "node": "Gym Class Heroes",
        "count": 1
      },
      {
        "node": "Gorillas",
        "count": 1
      },
      {
        "node": "Odd Future",
        "count": 1
      },
      {
        "node": "public transit",
        "count": 1
      },
      {
        "node": "what you want",
        "count": 1
      },
      {
        "node": "where you're going",
        "count": 1
      },
      {
        "node": "what you're selling",
        "count": 1
      },
      {
        "node": "deal",
        "count": 1
      },
      {
        "node": "Ganja farms",
        "count": 1
      },
      {
        "node": "street struck",
        "count": 1
      },
      {
        "node": "playing it cool",
        "count": 1
      },
      {
        "node": "autonomy",
        "count": 1
      },
      {
        "node": "influence",
        "count": 1
      },
      {
        "node": "carrot",
        "count": 1
      },
      {
        "node": "personal sense of self",
        "count": 1
      },
      {
        "node": "street",
        "count": 1
      },
      {
        "node": "James Brown",
        "count": 1
      },
      {
        "node": "picking cotton",
        "count": 1
      },
      {
        "node": "Authentic",
        "count": 1
      },
      {
        "node": "Network TV shows",
        "count": 1
      },
      {
        "node": "Comedian",
        "count": 1
      },
      {
        "node": "Comedy",
        "count": 1
      },
      {
        "node": "Money",
        "count": 1
      },
      {
        "node": "Television",
        "count": 1
      },
      {
        "node": "Fear Factor",
        "count": 1
      },
      {
        "node": "network television comedy",
        "count": 1
      },
      {
        "node": "gift of freedom",
        "count": 1
      },
      {
        "node": "Keeping up with the Joneses",
        "count": 1
      },
      {
        "node": "demon of success",
        "count": 1
      },
      {
        "node": "Brian",
        "count": 1
      },
      {
        "node": "universe",
        "count": 1
      },
      {
        "node": "Grammy",
        "count": 1
      },
      {
        "node": "third eye",
        "count": 1
      },
      {
        "node": "DMT",
        "count": 1
      },
      {
        "node": "reptiles",
        "count": 1
      },
      {
        "node": "liver",
        "count": 1
      },
      {
        "node": "lungs",
        "count": 1
      },
      {
        "node": "psychedelics",
        "count": 1
      },
      {
        "node": "eye of Horus",
        "count": 1
      },
      {
        "node": "pyramids",
        "count": 1
      },
      {
        "node": "energy",
        "count": 1
      },
      {
        "node": "structures",
        "count": 1
      },
      {
        "node": "temples",
        "count": 1
      },
      {
        "node": "technology",
        "count": 1
      },
      {
        "node": "construction",
        "count": 1
      },
      {
        "node": "dawn of civilization",
        "count": 1
      },
      {
        "node": "king's list",
        "count": 1
      },
      {
        "node": "heretic archaeologists",
        "count": 1
      },
      {
        "node": "conventional dating",
        "count": 1
      },
      {
        "node": "weirdness",
        "count": 1
      },
      {
        "node": "people",
        "count": 1
      },
      {
        "node": "Egyptian Empire",
        "count": 1
      },
      {
        "node": "Stone Transportation",
        "count": 1
      },
      {
        "node": "Stone Cutting and Placement",
        "count": 1
      },
      {
        "node": "Elevated Construction",
        "count": 1
      },
      {
        "node": "Emergence of Civilization",
        "count": 1
      },
      {
        "node": "Aligned Structures",
        "count": 1
      },
      {
        "node": "Orion Alignment",
        "count": 1
      },
      {
        "node": "Orion Belt",
        "count": 1
      },
      {
        "node": "Stone Tools",
        "count": 1
      },
      {
        "node": "infinite possibility",
        "count": 1
      },
      {
        "node": "flame in a dark night",
        "count": 1
      },
      {
        "node": "stars",
        "count": 1
      },
      {
        "node": "certainty",
        "count": 1
      },
      {
        "node": "science",
        "count": 1
      },
      {
        "node": "Egyptians",
        "count": 1
      },
      {
        "node": "kingdoms",
        "count": 1
      },
      {
        "node": "Atlantis",
        "count": 1
      },
      {
        "node": "Saharan Africa",
        "count": 1
      },
      {
        "node": "Reshot structure",
        "count": 1
      },
      {
        "node": "whale bones",
        "count": 1
      },
      {
        "node": "history of Earth",
        "count": 1
      },
      {
        "node": "species with amnesia",
        "count": 1
      },
      {
        "node": "Graham Hancock",
        "count": 1
      },
      {
        "node": "homo sapiens",
        "count": 1
      },
      {
        "node": "type one civilization",
        "count": 1
      },
      {
        "node": "planetary civilization",
        "count": 1
      },
      {
        "node": "Israel and Iran",
        "count": 1
      },
      {
        "node": "global technologically advanced society",
        "count": 1
      },
      {
        "node": "thermonuclear weapons",
        "count": 1
      },
      {
        "node": "Kardashev scale",
        "count": 1
      },
      {
        "node": "nuclear fusion",
        "count": 1
      }
    ],
    "topicGroups": {
      "groups": [
        {
          "topics": [
            "Willie Nelson",
            "Waylon Jennings",
            "Charley Crockett",
            "music",
            "Shooter",
            "John Folk",
            "country music",
            "Gary Clark Jr.",
            "Oliver Anthony",
            "Midnight Rider",
            "Buddy Holly",
            "blues",
            "George Strait",
            "Elvis"
          ],
          "category": {
            "name": "Music",
            "description": "Music genres and related topics."
          }
        },
        {
          "topics": [
            "music business",
            "30 Tigers",
            "manager",
            "Sunset Sound"
          ],
          "category": {
            "name": "Music Business",
            "description": "Topics related to the music industry."
          }
        },
        {
          "topics": [
            "comedy",
            "Comedy Store",
            "Ron White",
            "Joe Rogan podcast",
            "The Joe Rogan Experience"
          ],
          "category": {
            "name": "Comedy",
            "description": "Topics related to comedy and comedians."
          }
        },
        {
          "topics": [
            "Texas",
            "Hicks",
            "South Texas",
            "Texan",
            "Sixth Street",
            "Austin",
            "West Texas",
            "Booneville",
            "Shady Grove",
            "Dallas",
            "Houston"
          ],
          "category": {
            "name": "Texas",
            "description": "Topics related to Texas and its culture."
          }
        },
        {
          "topics": [
            "AI",
            "AI engine",
            "artificial intelligence",
            "automation",
            "singularity"
          ],
          "category": {
            "name": "Artificial Intelligence",
            "description": "Topics related to artificial intelligence."
          }
        },
        {
          "topics": [
            "California",
            "New York",
            "New Orleans",
            "Louisiana",
            "Copenhagen",
            "Paris",
            "America"
          ],
          "category": {
            "name": "Locations",
            "description": "Topics related to places and locations."
          }
        },
        {
          "topics": [
            "Shooter Jennings",
            "Jamie",
            "Coulter",
            "Joe",
            "Willie",
            "Whan",
            "Jake",
            "Mark Neil",
            "Evan Felker",
            "Bart Sabrell"
          ],
          "category": {
            "name": "People",
            "description": "Topics related to people and personalities."
          }
        },
        {
          "topics": [
            "cocaine",
            "Heroin",
            "gambling addicts",
            "whiskey"
          ],
          "category": {
            "name": "Drugs and Addiction",
            "description": "Topics related to drugs and addiction."
          }
        },
        {
          "topics": [
            "bombing",
            "ancient Egypt",
            "Manhattan Project",
            "Space race"
          ],
          "category": {
            "name": "History",
            "description": "Topics related to historical events."
          }
        },
        {
          "topics": [
            "audience",
            "Uncut Gems",
            "Welcome to Hard Times",
            "Sunset",
            "River Phoenix",
            "Bite Dance",
            "Tik Tok"
          ],
          "category": {
            "name": "Media",
            "description": "Topics related to media and entertainment."
          }
        },
        {
          "topics": [
            "business",
            "$10 cowboy",
            "30 Tigers"
          ],
          "category": {
            "name": "Business",
            "description": "Topics related to business and economics."
          }
        },
        {
          "topics": [
            "government",
            "China",
            "Russia",
            "states"
          ],
          "category": {
            "name": "Social and Political",
            "description": "Topics related to social and political issues."
          }
        },
        {
          "topics": [
            "moon landing",
            "planets with life",
            "pineal gland",
            "mechanical valve",
            "self-checkout"
          ],
          "category": {
            "name": "Technology and Science",
            "description": "Topics related to technology and science."
          }
        },
        {
          "topics": [
            "Authenticity",
            "authenticity",
            "American pop culture",
            "civilization",
            "fate"
          ],
          "category": {
            "name": "Culture",
            "description": "Topics related to culture and society."
          }
        },
        {
          "topics": [
            "I",
            "Playing guitar"
          ],
          "category": {
            "name": "Personal",
            "description": "Topics related to personal experiences."
          }
        },
        {
          "topics": [
            "medical industry",
            "pandemic"
          ],
          "category": {
            "name": "Health",
            "description": "Topics related to health and medicine."
          }
        },
        {
          "topics": [
            "Coca-Cola",
            "Google"
          ],
          "category": {
            "name": "Brands",
            "description": "Topics related to brands and products."
          }
        },
        {
          "topics": [
            "South by Southwest"
          ],
          "category": {
            "name": "Events",
            "description": "Topics related to events and gatherings."
          }
        },
        {
          "topics": [
            "Viper Room",
            "pool hall",
            "subway cars"
          ],
          "category": {
            "name": "Venues",
            "description": "Topics related to places and venues."
          }
        },
        {
          "topics": [
            "Kate McCannon"
          ],
          "category": {
            "name": "Individuals",
            "description": "Topics related to individuals."
          }
        }
      ]
    },
    "shortSummary": "Joe Rogan interviews Charley Crockett, discussing his music and career, along with a wide range of topics from AI and historical inaccuracies to the music industry and personal experiences.",
    "lastStoryCheck": "2025-07-14T22:20:51.052Z",
    "storyCheckResults": {
      "missingChunks": [],
      "missingStories": [],
      "totalCategories": 19,
      "totalChunksChecked": 120
    }
  }
}