{
  "id": "nZrt8odCj5s",
  "title": "Joe Rogan Experience #2342 - Jim Norton",
  "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
  "publishedAt": "2025-06-25T17:00:59.000Z",
  "cleanText": "Joe Rogan podcast. Check it out.\nThe Joe Rogan Experience.\nTrain by day. Joe Rogan podcast by night. All day.\nHow do I [ __ ] put this on?\nWhat are you going to do with it?\nYeah, I should have thrown it out, but I'm just I feel like if somebody put effort into it and gave it to me, just keep it.\nYeah, I know. Well, that's how I wind up with this [ __ ] snake on the desk. This is from this during the entire podcast, Harlon Williams had this in his pants and he was saying that he had a he got a worm and he he named his worm Dimmitri and at the end of the podcast he pulls it out and then he got such a [ __ ] kick out of the fact that it was still on the desk when I interviewed Trump.\nI hope you explain where it came from.\nI didn't say president hold that. I think I think it's funny because when you said that I was like, who gave that to you?\nIs that a seven-year-old?\nAnd Mr. Har Williams. All right, it works out perfect. That feels correct.\nHe is so unique.\nHe is. And uh I forgot he was in Something about Mary.\nOh, yeah.\nWhich is literally one of the funniest movies ever made.\nEver.\nAnd I watched him again. I'm like, god damn, I wish I was in that. I wish I had one line in that movie.\nRight. Right. Right. That was one Well, the Farley brothers, they're the best. They they have some bangers, man.\nYou know, Kingpin.\nYeah. Bill Murray.\nGod. I'm going to take these off.\nYou don't like them?\nNo. No. They're fine. I just I I'm so used to I hate my own voice and hearing it come back. It's like I'm doing radio for 20 years and I still don't like to listen to my own [ __ ] voice.\nWell, you used to do one.\nHe used to do the ear thing.\nBut I saw Rich Voss like too many times I've seen clips of Voss and he just does that and I'm like, do I look like that?\nHave I looked like that for two decades?\nI'm like [ __ ] Rich. Put it on or take it off.\nI like one ear. He just likes one ear open.\nHe likes one ear. I I firmly believe that's some kind of like a a a childhood like uh defense thing. Like there was something fishy that happened in childhood where you want to just kind of somehow stay present.\nAlways be aware.\nSomebody fumbled. Yeah. Somebody fumbled around and I just got to keep my ears.\nI don't know. That's a thing though. A lot of people like one ear on. It's not uncommon.\nYou feel when you have both ears covered. I just feel like I'm lost and I'm not in the room. And it's it's I guess I've gotten a little bit better with it, but just now I'm like, \"Wow, I really uh I can't hear.\"\nI always feel like I'm just fully locked in, you know?\nI don't hear anything else.\nI don't hear anyones. Yeah, I like the headphones on. I like to be locked in.\nYeah, I do. But I just feel like it feels like I'm underwater sometimes.\nI don't I went in for an MRI. I just go for them like once a year and just for the [ __ ] of it.\nI I want to Yeah, I'm getting older and I'm like, you know, I want to [ __ ] make sure I'm good. like make sure there's no lumps or anything. And uh they give you those shitty headphones and I'm so claustrophobic. I'm I'm laying there and I'm terrified and the noise.\nBeing married prepares you for that.\nYou get good at blocking out.\nOh my god.\nYou feel claustrophobic. There's a loud noise. You want to kill yourself. Yeah.\nMy wife will be in full conversation with me. I have no idea what she said. I just fully blocked it out.\nYeah. How many things have I agreed to?\nExactly.\nBecause I want her to shut up.\nI told you about it the other day. I'm like, you did?\nI don't want to argue. I'm like, I forgot.\nYeah. I'm sorry. I just tell you, but it's a I asked the guy, he goes, \"Do you want music?\"\nAnd I'm like, \"Yeah, I'll have a\" I'm like, \"Play rock. I just rock.\"\nAnd he was [ __ ] like uh he didn't speak English that well, so he started playing the Rocky theme song over and over. I I actually bailed out and got out of the machine. I couldn't\nYou couldn't hear the song anymore?\nNo, I just was too freaked out.\nI'm like, \"This guy's not hearing me. I'm squeezing that [ __ ] ball they give you. It's awful.\"\nSo, he had to take me out. Um, and I'm like, \"I'll go back in.\"\nHe goes, \"No, we'll have to start over.\"\nCuz once apparently in an MRI, like you have to be in the same position. Yeah.\nSo, I just I said, \"Fuck it.\"\nThey did my whole body and they just they couldn't finish with the brain. I was just like, \"I'm done. I'm out.\"\nYour brain's fine. You don't want to look in there anyway.\nI hope I don't really want to see.\nWho knows what's going on in there?\nNo. No. No. Just little wires across the wrong way.\nImagine if you could look into your brain and see your memories like whoa eventually.\nI mean, Black Mirror did an episode of that where you like with I love how they keep the technology simple where you're just kind of scrolling through something and they could like see all the the memories and you'll eventually be able to to do that. I mean,\nyeah, eventually we'll have a hard drive in our head.\nI would do it too. I like I would absolutely link up uh we I think we talked this last Ray Kurszswwell who talks about like uh singularity. Uh-huh.\nI still think his time frame is wishful thinking. He thinks by like 45, right?\nHe'll be in his like 90s. So, I think he's just trying to hope it happens.\nHe might be right.\nThat makes sense. 20 years from now.\nYeah, I think that's correct.\nI hope so.\nI I think everything's moving in exponential pace. And I think, you know, if you just look at what's happening with AI, AI 10 years ago was non-existent. You never heard anything about it. And now everybody uses it on their phone all the time.\nI use it. Um my wife's obsessed with it, which is irritating because she like literally will just talk to it. And so I'm like, \"All right, let me try it and see.\"\nBut it's great if like you get an error message on your computer, like what does [ __ ] Mac uh error 101 mean?\nAnd then you add it and it actually tells you in a really comprehensive way what that error message mean. It's better than googling something.\nOh yeah.\nSo I'm using it for that. But it's great for a lot of things. Kids are using it though unfortunately for like term papers and [ __ ] and they're getting busted because AI knows when it's AI so they just run the paper into AI and AI goes oh yeah AI made\nOh yeah that's that's my work that I did that yeah but I mean it's good for uh for looking things up right now I'm just using it as a better Google but when I attach it to my brain\nno uh because I was in it the other day and they said we detected suspicious activity so they wanted me to log in maybe because I had a VPN or something because in Texas you can't jerk off without a [ __ ] VPN.\nThey want your license to watch porn. Isn't that crazy?\nThat sucks.\nIt's We're We're protecting children. Too [ __ ] late.\nFirst of all, as if kids don't know about VPNs. They all do. And it's also one of those things where I get you don't want your kids to watch porn.\nThat's fine. And it's a lot harder. It was harder when I was a child to get you to find like magazines in the woods.\nYeah. Yeah.\nUm but I remember the smell of those old shitty magazines and you find them and [ __ ] It was the best.\nBut now, if I had it on my phone or I had the availability, I mean, my sex addiction would have been even worse.\nSo, I guess what I get why they want to protect kids.\nOh, it's got to be [ __ ] kids up. It's not just that, but the violence that they see. You see so much violence. I see way more violence now than I've ever seen in my whole life.\nWay more murders and car accidents and animal attacks. And I see Tom Seagur and I have this horrible text thread. We text each other the worst [ __ ] we find every day. We're trying to freak each other out. And we've been doing it for years. And so it's just my algorithm is [ __ ]\nYeah, it's just [ __ ]\nDo you There's There's certain sites and I never promote the site just because it's like it's just too gruesome. But there's one site I go to where you can everything they beheadings and I would look at this stuff before bed and I don't know why I I wouldn't enjoy seeing it, but I would look at it and it just gives you some kind of a weird horrible feeling. But there's certain things I can't watch at this point. Like I can't watch people burning anymore. That's a rough. Yeah. Yeah. At one point, oh, burning for all the rape. I just I can't watch him anymore. You know, it's old hat.\nThat's such a crazy thing to say. I can't watch people burning anymore. I'm just I'm all burnt out. It bothered me. It was It got to a point where I could I can't see beheadings anymore. Like there was a point where I could watch them and just almost watch Detached, but now I just It's too\nYou remember the journalist?\nIt was like Daniel Pearl.\nYes.\nYeah, that's right. Yeah.\nYeah. He was like the f but the camera band panicked and kind of came off him a little bit and and so they didn't uh it was kind of they showed it but that was the first one.\nYeah.\nAnd then that guy there called Jihad John who was like cuz he was British. They eventually caught him. Um I forget the other people he did but it was like certain contractors and stuff that they would they would put in those orange jumpsuits to mimic Guantanamo and they would just gruesome [ __ ] man. Really gruesome [ __ ]\nGruesome [ __ ]\nAnd it does [ __ ] you up.\n100%. I don't know what it does. Uh, but it [ __ ] you up. Like I don't know how it messes me up, but it it definitely is not healthy.\nWell, it makes you filled with anxiety and just knowing that that exists and then seeing it are two very different things.\nYeah. Knowing it exists and seeing it. And then I'm always like, well, I like watching I can still watch car accidents because it's tangible. Like a car accident is a tangible thing. Like if you if you're not careful and you drive like an [ __ ] this is what happens to you.\nOr if someone's driving like an [ __ ] and you're not paying attention, you got to be aware of everybody, right?\nSo I try not to text and drive anymore.\nI remember one time I was doing a gig and I was in full sex addict mode and [ __ ] Sam Roberts uh he was still an intern uh at that point came with me cuz Kenny was busy. So Sam came to help me sell merchandise. And I remember he was uh I think I did I let him I know I drove but he was in the pastor seat and I was just dirty talk texting the whole way home because I couldn't text and drive because he was in the car and I was like I can't get [ __ ] I can't be texting some woman uh and kill the intern. That would just be a lawsuit waiting to happen. So I It's like the texting and driving thing I've kind of backed off of.\nYeah. Well that's what Apple CarPlay is for, you know.\nNo, you don't do that.\n[ __ ] dude. the idea of I may I did that one time. I connected my phone to a BMW X6. My girlfriend at the time, my ex-girlfriend came with me to the dealership and the guy is telling me, \"Oh, you should connect your phone.\"\nAnd I do and my [ __ ] phone my uh my phone book, my contact list comes up, right?\nAnd one of the girls, you know, I put where how I knew her and it was like a domination fantasy. So that came up her name and Domination Fantasy came up on that little window in the X6 and I'm like I'll never connect anything to my car again. There's just too much going on.\nJust change the name.\nI mean I mean how much time do I have to go back and change all the names?\nChange the name to like personal trainer.\nBut that's another code word.\nIt doesn't have to be.\nI got busted one time talking dirty. I was texting dirty and the girl the the escort's name came up on my phone. Um, and it was like one of those names that cannot be like a regular person. So I ran my and my girlfriend was [ __ ] screaming at me in the car. She's like, \"Who the [ __ ] is that?\"\nAnd I'm like, \"It's [ __ ] Anthony.\"\nI'm like, \"I have a code word for Anthony in case I ever lose my phone.\"\nSo I had to run up into the bathroom and just like my fingers were shaking and change it to Anthony. And then I came in 15 minutes later. I'm like, \"See, it's Anthony.\"\nBut it was by\n\n\nThen it was like, \"You blew it, Jim. You got caught.\"\n\nSo I don't connect anything. Even though I don't, I'm not, you know, [ __ ] anybody else. I still don't. I don't trust it. I don't connect anything to my car.\n\nWell, your phone is listening anyway. Mine is for sure. Mine, I've come to grips with the fact that everything that I text is getting read probably 100%. No questions through the ads, including like stuff that's on Signal. You know, Tucker told me that he said that the s they found his uh the government knew that he was going to meet Putin because they read his signal. And he's like, \"I didn't even know that that was possible.\"\n\nYeah. Um, is that the one that they got, they got caught using in the defense chat? The signal.\n\nBut that was because there was another guy in the signal chat that I think someone let in the signal chat on purpose.\n\nWas it on purpose, or do you think it was one of those things where you [ __ ] up and you just like, you know how you, you'll send something and and a and a predictive text like name comes up and you just hit like if I'm going to text you and I accidentally J and all of a sudden Joe De Roa comes up. Yeah.\n\nAnd I, I just send him. I've done that before, but this was a giant group of people that are in the defense department. How do you include a reporter in that?\n\nThat's a terrible mistake.\n\nThat doesn't make any sense.\n\nMy ex- publicist was badmouthing me to somebody, and she actually sent it to me by mistake. I was like, what did she say about it? vert. It was one of those things where we weren't working together anymore, and I was doing uh Neil Brennan's podcast and uh like, you know, blocks where you, you, you talk about all these things that blocked, and I and she sent something about like, \"Oh, well, Norton's on three blocks already, no shock.\" It was just, it was some comment that was not complimentary and uh and then it was like, \"Oh, sorry, I meant that for him,\" and I just kind of left it there. I'm like, \"I got it. I, I knew you didn't like me. That's why I left you.\"\n\nYour own publicist hate your guts.\n\n[ __ ] publicist can be a such a problem.\n\nThey're so incompatible with people that are wild.\n\nYes. Because all they want to do is, they have to paint it in a way that's palatable to everybody. Like I understand that it's a hard job, and you have some [ __ ] [ __ ] who's out trying to get laid like a guy like you or someone who says wild things, you know? It's like that's part of the fun of being you.\n\nYes. But it also comes back, and it it's it's Here's where it's negative. I do on YouTube. I have the podcast, and I'm trying to do podcast ads. I've never, you know, I never bought ads on YouTube before, but I'm like, it doesn't buy you views. It just puts it like where people will see it, and if they like it, they click on it. Every one of my ads gets shot down. They they accused me of election advertising in the United States. I, I put up an ad, and they said, \"This violates election advertising in the.\" And I didn't even know how to respond to that.\n\nWhat was the ad?\n\nIt It might have been a I had George Santos on, but it was it was just a funny podcast.\n\nThat guy is hilarious, dude. He was [ __ ] He told me how bad uh uh Jerry Nadler smelled cuz I asked him who had the worst breath in Congress, and he wouldn't answer, but he told me the worst body odor was Jerry Nadler, and it was just funny. This is funny.\n\nHe's a character.\n\nHe is.\n\nIt's just amazing that he was a congressman.\n\nI know. I, I have a real affection. You know how it is when you meet somebody, it's like they're they're always more human when you meet them, and it's harder to not like somebody. Like I don't agree with Lauren Bobart, but I met her, and she couldn't have been nicer, and I'm like, \"I can't dislike her. She was nice to me.\" you know, right?\n\nSo, whenever you meet someone, and I had him over, and he was great, he was funny. A sense of humor about himself, and he was shit-talking and catty, and I was like, \"Fuck, I love this guy.\" But they accused me of election advertising. So, now so many times I've tried to put ads after, and they continually say it's either shocking content or election advertising.\n\nOh, they're just targeting you.\n\nThey're just targeting me. And it's like, how are you supposed to advertise comedy?\n\nYeah.\n\nWith with some profanity in it if it's shocking content.\n\nHow was that election? I mean, he's not even running for anything. And it wasn't it wasn't a political uh rally podcast at all. It was just us talking about what happened, and we chatted politics, but I don't I don't push political views on people.\n\nThey've got you labeled right-wing, which is kind of funny, isn't it?\n\nIt it really is. It is so funny.\n\nAnd the people don't know what to like the conservatives. It's so funny. People come see me from Gutfeld because I do Gutfeld a lot, and and his people will come see me, and it's just fun when I talk about my wife to watch the joy drain out of their faces.\n\nIt's a trans woman. Oh, we had no idea. That's not the type of Tucker we like, buddy.\n\nThey get very uh It's a very weird place to be.\n\nYeah.\n\nPeople who like my humor don't necessarily like my personal life, and people who like my personal life don't necessarily like my humor. It's a weird I guess if if nobody feels like you're 100% in in with them, they they don't know what to make of you. Well, you were saying that about Oliver Anthony, and that I wasn't aware of that he was getting in trouble apparently right after \"Richmond North of Richmond\" came out that people were saying he wasn't really conservative.\n\nYeah. They they were giving him [ __ ] about saying like, \"Oh, he's not who we thought he was.\" Meanwhile, he writes this great song, and people love it, and and they they look at his art, and they love his art, but because he feels a little bit differently, a lot of people turned on him, and it was like, \"What? What are you?\"\n\nI wasn't even aware of that at all.\n\nYeah.\n\nI didn't know what I do. Do you know what the subject was?\n\nI don't remember if they if he had said something after, or if they went back and found out things he had said prior that they felt like his politics didn't line up. It's almost like when they got mad about uh [ __ ] Dylan Mulvaney. Like needing to connect to the belief system of somebody who drinks the same beverage is just such [ __ ] psychotic thinking.\n\nThen again, I've drank piss, so I don't expect a whole lot of people to line up politically and rally behind me with [ __ ] yellow flags. But I don't I just don't care. I don't give a [ __ ]. I don't care who who believes it or like I don't care like what the I mean, I'm I'm a [ __ ] Sabbath fan. I don't give a [ __ ] who those guys vote for. It's It's so so stupid, inconsequential to me.\n\nWell, it's just a a symptom of this bizarrely disconnected society where everybody's so separated. It is. And you gota it's got to be driving you crazy, or or maybe you detach from it because you see things. I mean, I know you, so I'll see them say like, \"He's this right way,\" and I'm like, \"You guys don't really know Joe.\" It's it's like it's they don't to see yourself painted in such a way has got to be at one point frustrating, and then you have to just let it go, right? And just\n\nYeah. You got to let it go. But when when I, I mean, the most frustrating thing was seeing it on CNN. I was like, \"Okay, you so this thing that I thought was the news forever, now I know you're not accurate at all because you're you're attacking me, and you're painting me in this very bizarre light because it's convenient for you.\" There's a weird thing, and maybe this is again because I'm in my 50s, and I remember like thinking the news was real and accurate because you remember Walter Kronhite and all that [ __ ] and it's I it's this constant sense of disappointment like [ __ ] like they're really not what I like I'm still an idiot who believes in like the adults, and they're going to do the right thing.\n\nYeah.\n\nAnd it just constantly is a confirmation that Yeah. They are, they're liars. They're [ __ ] biased liars.\n\nYeah. And they're paid to lie. They're just propagandists. But that's what the news, the mainstream news is. I mean, there's real news now. Sure, you can get the real news from Glenn Greenwald. You can get the real news from Matt Taibbe. There's a few people out there that'll give you unbiased news.\n\nBut it's so funny like even them, you know, when they will highlight a very particular thing that maybe Trump did or someone did on the right, and everybody attacks them. It's like, \"Do do you want them to lie?\" Yeah.\n\nJust because you you want your team to be infallible? Like what do you what do you want? And Glenn Greenwald, I, I had never heard of him. I, I don't really follow a lot of like what people are saying. I don't watch debates, but I obviously heard about him when that v video came out, and I saw uh and I loved how he handled that.\n\nYeah, he handled it great.\n\nPrivacy invasions are so [ __ ] disgusting.\n\nThey're disgusting when they're done to anybody. I don't care how much you hate the guy's guts, but I was I was like, \"I don't even know who this guy is, but I like how he addressed that.\" Yeah, it's my private life and tough [ __ ]. You I kind of I like that he handled that. I thought very, very he took it head on and\n\nwell John Ronson talked about that in his book, \"You've Been Publicly Shamed,\" you know, like if you're not ashamed, then it doesn't work, and that's the reality of it, and Glenn handled it perfectly. He's not ashamed.\n\nYeah. And or well, you can't let them see you're ashamed cuz I'm you know, I wake up just dipped in it.\n\nI [ __ ] it's the first thing I think of. Good morning, shame. But that's you're open about it though. I mean, that's the thing. It's like they can't really attack you for something that you're attacking yourself for.\n\nYes. And if you tell them like I did something like I, I it's so it's so I watched I my special premiered, and I went into YouTube, and I watched it with people as they were watching and just commenting and talking, and this horrible feeling of shame. Even when people are being nice, I can't get away from how embarrassed I am. Like it's almost like if people see you doing something, you're like, \"Oh, Jimmy's trying. Look at little Jimmy trying,\" and I was typing back and everything, but it was it's so anti what feels good for me to do. Even when people are being nice, I find it horrifying and humiliating. I don't know where that comes from, but I kind of wish I didn't have it.\n\nThis episode is brought to you by Visible. Now, you know, I tend to go down a lot of rabbit holes. I want to know everything about everything. And if you're like that, you need wireless that can keep up. Visible is wireless that lets you live in the no. It's the ultimate wireless hack. You get unlimited data and hotspot so you're connected on the go. Plus, Visible is powered by Verizon's 5G network, meaning fast speeds and great coverage. And with the new Visible Plus Pro plan, you get premium wireless without the premium cost. And the best part, it's all digital, no stores. You can switch to Visible right from your phone. It only takes about 15 minutes. And then you manage your plan in the app. Ready for wireless that lets you live in the no? Make the switch at visible.com/rogan. Plans start at $25 a month. For the best features, get the new Visible Plus Pro plan for $45 a month. Terms apply. See visible.com for plan features and network management details.\n\nWell, I think everybody hates watching themselves. First of all, because when I watch a comic, I want to watch a comic doing material either that I know and I want to see again, you know, like if I'm watching Shane and he's doing his bit on the Navy Seals, I want to I want to see it again, or I want I just want to see it, you know? I want to I want to just I've never seen it develop. I want to see the thing. But when you're doing it, you're aware of everything. You're aware of all the edits you've made. You're aware of all the different ways you've done it. your way of when you're trying to sell it a little too much, and you're not in the moment, you know? Like there's all the grossness that you see that other people aren't going to see, but you're like, \"Ew, it's [ __ ] I hate watching myself, dude. It was so hard. It was so hard not to just attack myself in the chat.\" Like, all I wanted to do was watch it and go, \"This [ __ ] blue sucks.\"\n\nBut I'm nice nice blinking 56y old.\n\nBut I didn't do it. I'm like, \"Don't be a [ __ ].\" I think it was Jay Okerson was doing something, and he did his special, and he shot it at Skankfest one year, and I think Lewis took him out, and they were looking at the stage before, and it was one of those guys like, you know, Jay is just like a he's a [ __ ] [ __ ] it. I think Lewis goes, \"You know, sometimes I know we're like that, but you just got to enjoy it.\" Like once, and I thought of that. I'm like, \"Sometimes just enjoy things are going okay.\" Yeah, you're\n\n\nHappy with what you did. I love the special. I love the material. Don't put yourself in a position where you're like you suck. Like it doesn't have to be that, just put it out there and walk away from it. Leave it alone. Let people decide what they decide. And if you don't like it, you just work on the next one and make sure that you don't make the same mistakes twice.\nYeah, that's it. That's all you can do. But I spent a lot of time, like I, I, I wouldn't, I, I don't think I've ever loved anything as I put it out. This I like more, but the older you get, the better you get. So, it's like a little easier now than it was. Yeah. The first Tonight Show I did uh was 2004 and I, I was out in LA and I there was my buddy Joey SA who worked for Evil Angel and would film a lot of the greatest porn. Joey was a guy, you'd recognize him if you saw him. He was in old movies. So I went to his house to watch my first Tonight Show with with another guy, this other guy Brandon Iron. Um, and I went into the basement while they watched up. I couldn't watch it in front of other people.\nOh, that's hilarious.\nIt was just And it's not to be because I think I'm an artist. It's just humiliating. It's It's embarrassing to cuz I feel like I'm like, \"Are you going to laugh?\" Like I just I don't want people to feel pressured to laugh, right? Because I'm around um It's weird. It's weird watching yourself.\nSome guys can do it though.\nYeah, they're psychos. They are psychopaths. They're probably not healthy.\nOh my god, dude. The Do you know what mental illness you need to sit someone down next to you when your special's playing? How about people that want you to watch their thing and they want to sit there with you like, \"Hey, watch this.\" and you're like, I don't, I don't want, I don't want to watch this.\nIt's it's it's it puts you in a weird if I if I do an acting role, I don't love acting. Um which is great because nobody loves when I do it. It works out nicely. But if I do something I like, I have to see it first and I have to watch it and go, \"Okay, I'm not embarrassed by this. I can go and watch it in in a premiere.\" Like, you know what I mean? Like I, I but I have to see it first to know if I'm going to feel humiliated.\nUh The Irishman I didn't see first. Obviously, he's going to say he's not going to send me a cut. And I didn't know I made it until like literally the the night before. But that was different because I'm like I don't care how whatever. It was just it was a standup performance. So\nRight. Right. Right.\nA little bit easier than\nOh yeah.\nacting.\nIt's humiliating.\nYeah. It's gross. I don't like any of it. I went, I've been in a couple movies. I've refused to go to the red carpet. I sneak in through the back. I'm like they were like I want you to walk the red carpet. I'm like nope.\nIs it because you don't like Cuz everyone would talk to you. I'm afraid no one's going to talk to me on the red carpet. Like it's it's do you know how embarrassing it is when you you hear that person who walks you through in the front and like you're you're standing there ready for your moment and you hear her going Jim Norton and then one you'll hear a second and then she goes Jim Norton, comic, and it's like oh, they have no idea who I am. It's just humiliating.\nSo I don't like doing it, man. I just don't like the attention. I don't like standing there while they take pictures, just standing there just looking around. Look at me, Joe. Look at me. Look at me. Look at me. Over here. Over here. Some people love it. Actresses love it. They pose. They like give you their good side.\nYeah. Yeah.\nGive you a little They practice in the mirror. But I almost understand I have more tolerance for actors who love it because even though they're as big of, you know, attention idiots as we are, they don't get the constant feedback. Like for them, it's their night of feedback.\nRight. Right. Whereas with us, we're like I mean every I've been on a run for like four nights. Before I came here actually at the seller, I had four like nights in a row, just all the material I'm doing now is new. So it's like I'm trying this and you know it just feels like you're Frankensteining it. It's not there yet.\nUh but I know I'm going to have another night and another night and and that comes and goes quickly. But actors, they have like one night to stand there and smile and then they just get attacked in the in the comments or in the reviews. So, I'm a little more tolerant of them than comedians who because comedians who love that it's like, \"How much attention do you need, dude?\"\nYeah. Yeah.\nYou constantly get feedback.\nYeah. You should be shying away from feedback. Too much feedback is bad for you. I really believe that.\n100%. And I stopped, I, I stopped reading Twitter comments. Occasionally, I'll do it now. And it wasn't just to say I wasn't reading them. It was because even positive feedback I caught. I'm like, \"You needy How much, you know, uh how many taps on the shoulder do you need? How many like good job Jim or you suck? Like how much interaction from people do you need? It's not normal. It's not healthy. I stopped reading almost everything, even stuff that's not me. And I stopped a couple weeks ago. I just stopped going on social media. I will occasionally if someone sends me something funny, I'll watch it, but then I get off my phone right away. Like I just And I think on my new phone number that I'm going to get, I'm not going to have any social media. I'm just going to keep my old phone number and only use that for social media. I just don't think it's good for you.\nIt's not. And although there's times like my algorith, I'm obsessed with, I think we talked about just Japanese hornets and a lot of MMA. Like my algorithm is healthier now than it would be. Um there's still a few things that will pop up um that you know show what I've been looking at. Like if my wife is an she'll see what I'm looking at. I'm like no, you know, you know how it is.\nYeah.\nYou go down a rabbit hole. You probably shouldn't go down. But it's not as unhealthy as it would have been at one point. Like a lot of it is just MMA stuff and and and animals and nice Yeah, I get a lot of that. A lot of is people getting knocked out.\nYou like the knocked out? I like watching jiu-jitsu tips because then I'll bring them in and ask ask the guy to show me like like how do you is it possible to do this? And he'll kind of show me and I'll just forget it. But it's it's fun.\nYeah, I've got a lot of that, too. But it's just I just think it's a giant waste of time. And it's also your brain needs time to just think and you need time to just be in your own head and think about your own thoughts and trying to formulate them properly, really like get an like why do I think this way? Why what is what is it about this that is that I've decided is correct, right? and roll it around and when you're constantly looking at other people's thoughts, I just don't think it gives you much time for that.\nThat's exactly it. Why do I think what I think? Like\nHitchens did a great speech. He was in Toronto about free speech and one of the things he was talking about is when somebody says something that you don't agree with. I think the example he gave was Holocaust denial. He goes, \"You have to protect that person's speech because if nothing else, it makes you examine, okay, well, how do I know what I know? How do I know other than someone told me?\" Like, you have to kind of examine how you come to your own conclusions. And I do that a lot. Like in the shower, I'll just kind of stand there. It's really like we all have a weird showering method. And I just kind of stand there with my hands like this. It's bizarre. It's like womblike. And I just stand there and I think or I go through arguments or I go through conversations or debates.\nUm and that's the one time I really get to to think during the day where I don't let anything else interfere.\nBut being off social media is probably a lot healthier. Just again it's other people's thoughts. Who? I don't care what people think. I don't know why I read it.\nWell, I care what people think, but I don't care enough to have that intervene and invade my thoughts all day long. I mean, I'm fascinated by people, but I like to talk to them for real. For real, like this.\nYeah.\nThis is like, you know, because I think that's also having a podcast and having what I think is the best way to communicate with people and to be able to be so lucky to be able to do it all the time. I think I get plenty of other people's input, right? And you get the the real opinions and you get to you sense in a room with a person. And again, it's it's it's harder to dislike or to or to caricature somebody when you've met them and when you've actually sat with them.\nIt's like, nah, I know this person. I kind of felt their energy. And it's like, yeah, they're just a regular person. It's easy when you look at somebody to hate their guts.\nUm, and I've bashed a few people. It was always so embarrassing. We would do Jocktober. And uh, you know, OA never went into other people's studios, but I would and I'd be on the road and it was the I was in Boston with Kenny one time. He's like, \"Uh, they're having you in, but you jocktobered them.\" And I was like, \"Oh, so I went in and uh you know, you you you just go they're like, \"Yeah, you really uh\" and I'm like, \"Yeah, man. It was just something we do.\" But you have you face it and you realize, \"Yeah, they're nice guys. It was just it's a dumb radio show. I had fun.\"\nAnd I've actually become friendly with a couple of guys who we used to attack. But you only get that through meeting somebody and actually talking to them one-on-one.\nThe mo the worst is when you meet someone and you have a conversation with them and you're cool. You think, \"Oh, we're good.\" And then they'll go and talk about you somewhere else and completely mischaracterize you.\nHave you had that?\nOh, yeah. Yeah, I've had that. Yeah, that's embarrassing. It's sad.\nIt feels bad.\nYeah. Well, it's just like, okay, well, I'll never talk to you again because I know that you do this now. It's crazy.\nYeah. And but it's also it's like, why are you doing that? Generally, it's when I had a conversation with them and it didn't go well for them, right? Right? So they'll then they just harbor that thing and then they just stew it in their head and then they just mischaracterize you and try to twist you around because they're trying to win this argument they already lost.\nYes.\nYou know it's like you know when you get in an argument you you didn't have anything to say and then you're in the shower like a I should have said this. I should have said that. They're just doing that and they're just going and doing that on another podcast.\nYes. Re relitigating what the jury has already come in. Yes. And it's human instinct to do. I also think sometimes people do it and they don't think you're going to see it. Like especially when you're you, you know, you have such a high level of like recognition that if somebody they're probably he'll never see this and I can just and then you see it and they're probably like I shouldn't have said that. But I've read things that hurt my feelings. I'm like why would you say that? Like yeah I was nice to you.\nI don't know. It's weird. It's like you know humans are so strange. We're so strange in our weird little quirks and the way we communicate with each other and what is truth? It's real. Who are you? You know, who are you? You're different every day. Yeah. You're different depending on how your day went. You know, your reaction to something is I remember one time this guy wasn't paying attention. Traffic was stopped and he rearended me and he didn't have a license. He's from Mexico, but I had been doing yoga like every day. And I was like, \"You okay?\" And he's like, \"Yeah, I'm okay.\" I'm like, \"All right, man.\" And I go, \"Why don't you have a license?\" He's like, \"I can't get a license.\" I I go, \"Well, so why are you driving?\" He's like, \"I got to work.\" All right, I get it. I wasn't mad at him, but it was cuz I was doing yoga like every day. We were doing this hot yoga challenge, Ari and Tom and Bert and I.\nI remember that.\nWe were doing it like I was doing yoga like every day. So, I was so calm. I was like, \"Okay, well, take care of yourself. I'm going to get out\n\n\n\"of here.\" Cuz his car was\nMy car was but it was it was drivable.\nYeah.\nIt was a Porsche.\nLike, it was a really nice car, and he had like this shitty Honda, and he but you know the way he broke, like when you break your your front end dives down, and so he kind of got under my car and lifted my car up a little bit and caved in my back bumper a little bit, but they just replaced the bar, and the engine wasn't and my exhaust was dented a little bit.\nHis car was.\nHe couldn't drive, so he got to be there when the cops came, and you know, he couldn't drive away.\nRight.\nAnd I was like, \"I don't know what to tell, I'm going to get out of here.\"\nOh, you just left.\nYeah.\nYeah.\nI was like, \"He doesn't have any money.\nLike, I'm I'm going to pay for this.\"\nYes.\nAnd I'm like, \"This is going to hurt me.\nI have the money to fix it.\nSo, all right.\nTake care, man.\nGlad you're okay.\"\nBeing Zen like that, like because it reminds me of I was leaving the Holland Tunnel with Karen Fihan.\nWe were doing a gig in Jersey.\nIt was bumper to bumper, and I came, you know, there was like that merge where you think you're never going to get out of it.\nAnd a guy stopped, and he goes, \"You hit my car.\"\nAnd I'm like, \"I know I didn't hit his car.\"\nBut he made us uh it was bumper to bumper.\nI'm like, \"Let's just talk on the other side of the tunnel.\nLike, let's get out of this fuck.\"\nCuz I was going to be late for the gig.\nAnd he goes, \"No, we're going to pull over and wait for the police.\"\nSo, I'm like, \"Oh, this piece of is trying to shake me down.\"\nYeah.\nSo, we wound up uh one of those awful traffic women was there.\nYou know, the the people that just they work for the city and they dress like cops, but they're not cops, but if you assault one of them, it's like a big deal.\nSo, we pulled over and and I said, \"Is it okay if we just trade licenses?\"\nAnd she went, \"Yeah, just trade licenses.\"\nWhich I think kind of shamed him into like letting us move on.\nOtherwise, he was going to have me held up there or or pay him on that.\nSo, you didn't hit his car at all.\nKaren said I didn't.\nIt was a merge, and if I did, it was a one m hour bump, but there was no mark on his car at all.\nI think the whole thing was a scam cuz we traded licenses and I never heard from the guy.\nYou ever seen that thing where people get in front of people's cars and slam on the brakes?\nIt's I've seen it.\nOh, and it I mean it's terrible.\nAnd the best is when you have a dash cam, and then you see them, they recognize the dash cam, and then they just scurry back into their cars.\nThis episode is brought to you by Zip Recruiter.\nSummer jobs can be extremely rewarding.\nYou can learn a lot about yourself and what you want.\nAnd there are some pretty unique jobs out there from lifeguards and camp counselors to construction, dog walking, mule packers, and more.\nThere's a lot of options if you have the skills.\nOn the flip side, if you're hiring this summer, it might be tough to find the right person with the right qualifications before your competitors, unless you use Zip Recruiter.\nTry it for free now at ziprecruiter.com/rogan.\nWhy should you use Zip Recruiter?\nIt's going to make hiring for the season astronomically more manageable and fast.\nIts powerful matching technology does a deep dive to find the right candidates for the role as soon as you post it.\nAnd when you find someone you like, the invite to apply feature helps you connect ASAP.\nGear up for summer with Zip Recruiter's high-speed hiring tool.\nSee why four out of five employers who post on Zip Recruiter get a quality candidate within the first day.\nJust go to this exclusive web address right now to try Zip Recruiter for free.\nziprecruiter.com/rogan.\nAgain, that's ziprecruiter.com/rogan.\nZiprecruiter, the smartest way to hire.\nThere was one recently, I think it was in New Jersey, where these people, they tried it and it didn't work.\nThen they threw it in reverse and backed up fast and slammed into this guy's car, but this or this lady's car, but she had a dash cam the entire time and she's on the phone.\nOh my god, these people just backed up into me.\nAnd then they got out of the car and they're like, \"What did you do?\nWhat did you do?\"\nAnd then they saw the dash cam like, \"Ah fuck.\"\nYeah, I've seen that.\nI think that's what I'm referring to where where they they scurry back into the car and take off.\nYep.\nYep.\nWhen I saw like I'm so cynical, like people in Philly, you got a lot of people in Philly, like if a bus hits something, there's like locals that will just run up and just lay next to the bus like they were in the accident, which is I get it.\nYou know what I mean?\nBut they forget that there's cameras everywhere and they can just see you walking up.\nBut this India Air India plane crash, I was my first thought was that this guy they said survived.\nI'm like, \"Oh, he's bullshitting.\nHe didn't, he's faking it.\"\nNo, he survived.\nBut he did survive it.\nYeah.\nCuz he said his brother was on the plane or something.\n11A.\nSeat 11A.\nAnd by the way, to all the people who are going to now look for 11A, stop.\nYeah.\nStop.\nIf if anything else, that's the last seat you should take.\nUsually it's the back where you're best off.\nYeah.\nI wonder if the plane broke open and he just got There's a woman who who was a I think she was a teenager when it happened.\nwas called the woman who the girl who fell from the sky, and she had apparently they were like 2 miles up and her the plane blew up whatever and it came apart and she fell 2 miles somehow survive the sole survival.\nbarn right, didn't she go through the roof of a barn or something?\nNo, she fell into the uh what do they call the uh the the Brazil rainforest uh oh the Amazon Brazil.\nShe fell into the Amazon was gone for 10 days.\nApparently again unless I was they said she found an old boat with gas and she had to pour one of her wounds to kill the maggots.\nUm, and then she finally did get out and get rescued.\nAnd uh, look at this.\n17-y old girl miraculously survived falling 10,000 ft from a plane then surviving 11 days.\nIsn't 10,000 ft?\nIsn't that 2 miles?\nNo.\nWhat's a mile?\nYeah, it's about two miles.\nTwo miles.\nYeah.\nJesus Christ.\nYou imagine falling two miles from a plane survived 11 days alone in the Peruvian Amazon rainforest.\nAfter the plane, she was on She was struck by lightning.\nJesus, I didn't read that part.\nThe plane was struck by lightning and disintegrated in the air, still strapped to her seat, fell from the sky, and survived.\nHoly\nWhat did she hit though?\nDid she hit like a mountain and slide?\nLike, how do you The impact?\nI don't know how you survived that impact.\nOh my god.\nShe had a broken collar bone, a torn knee ligament.\nThat's it.\nAfter the crash, she spent 11 days alone in the jungle before being rescued.\nShe found a lumberjack camp.\nWow.\nYeah, it's crazy.\nWow.\nShe became a respected scientist specializing mimology and focusing on bats.\nWouldn't it be funny if she was the lady who released CO because her memor is no good anymore after the plane crash.\nYeah.\nDrink this.\nShe She specialized on bats and she got a job in Wuhan.\nShe had no idea.\nShe had no idea.\nShe's like, \"Be free.\"\nBit some guy selling fish on the corner and he went somebody.\nBut there was another one, too.\nThere was a a flight attendant and again who I think was trapped the front of the plane fell and I think that she was almost from 30,000 ft and if I remember correctly it hit a mountain and like it was almost like she hit it on the right angle and slid it.\nYeah.\nHighest fall without a parachute in history.\n33,000 ft plunge after a plane explosion 72.\nShe was the only survivor crashed into the mountains of Czechoslovakia after a suspected bomb detonated.\nJeez.\nWhat about the lady who felt her parachute didn't open and she landed on a pile of ants?\nFire ants and the fire ants kept her alive.\nRight.\nRight.\nShocked her body into Yeah.\nSomehow or another the fire ants the the the shock of the sting of fire ants kept her alive.\nWhy did it slow her heart down or something or stop it from\nNo.\nWhat?\nImagine the odds of falling into a fire ant pile.\nIt's usually a bad thing to land an a mount of fire ants at 80 miles an hour, but not if you're Joan Murphy.\nOh, Joan Murray.\n14,000 ft right into a pile.\n50% chance of surviving a fall of 48 feet.\nYeah.\nWhich is a four-story building.\nMortality rate rushes all the way up to 90 when you f fall 84t a distance of a sevenstory building.\nSo if you're falling from a whopping four 14,500 ft, just over 2 and a half miles, safely bet you're almost definitely not going to get out alive.\nOne woman did.\nSo she fell.\nA backup parachute opened at 700 ft.\nQuickly deflated.\nShe continued to plummet towards the ground at 80 miles an hour.\nShe survived arrows.\nUm, she survived thanks to the fact that she landed directly on a mound of fire ants.\nDoctors believe the intense shock of being stung over 200 times by the ants, released a surge of adrenaline that kept her heart beating.\nWhoa.\nBy the way, does that prove to you how little I know about the human body?\nMy instinct said that, oh, your heart slows down.\nLike I thought like, oh maybe it would slow your heart down when they bit you and it does just the opposite.\nI I thought like maybe maybe it slows your beat down like being frozen.\nI bet that's just a wild guess as to why it kept her alive cuz if she was putty, you know, there's no way it would have kept her alive.\nYeah.\nMaybe it stopped her heart from stop.\nMaybe they got to her right after, too.\nYou know, who knows?\nYou watch that guy who lets things bite him in the woods.\nUh coyote something.\nYou know, we go.\nHe's a psychopath, but his stuff is very entertaining.\nBut I think he's the bullet ant.\nThe bullet ant or the Japanese hornet was was the the worst.\nThe bullet ant's supposed to be the worst.\nThe bullet ant's supposed to be like 24 hours of intense pain.\nYeah.\nMy friend Steve got bit by one of those on purpose or no?\nNo.\nHe was in uh the Amazon.\nHe got bit on his foot.\nAnd was it as bad as he said?\nHe said for hours it was just impossible.\nThe pain was just impossible, and then it's slowly dissipated to like kind of manageable.\nIs that the one what they put in the gloves?\nDid you see that one?\nThe the the tribe where they do that and their hands are like blackened by bites.\nDid Steo do that?\nDid he?\nYeah.\nYeah, he did that.\nYeah, he put the gloves on.\nHow long did he last?\nUh, well, once you get bit, it's a 24-hour experience.\nYeah, I'm very squeamish.\nInsects.\nIt's funny.\nI've never gotten over this insect.\nI think I saw a kid uh there was a brother and sister when I was a kid.\nWe were all the same age.\nI think she was a year older than me and him were.\nAnd they were such a such a bizarre little friendship because they used to pee their pants and I would ask them to sit on my face with their pants.\nIt was a really bizarre Yeah, I know.\nIt was a very a lovely childhood in good old Edison.\nGood old Edison, New Jersey.\nBut I saw him get stung by yellow jackets.\nWhat is that?\nThat's a That's the worst thing.\nExecutioner wasp.\nOh, what coyote Peterson said was worse than a bullet ant.\nOh my god.\nWatching a guy run with bees on his arms and screaming.\nI think that scarred me for the rest of my life with insect.\nWe used to break up bees nest and I'll never forget the sight of this kid running ah with just three yellow jackets on his arm and I just that stuck with me for I guess 49 years now 50 years.\nIt bothers me.\nI just can't they insects have a very weird effect on people like to be sokeeved out by something.\nIt's like rats instead of like small bunnies don't bother you but rats do.\nMaybe it's in the DNA or something where it's supposed to bother you.\nI think so for sure.\nI think that's what aidophobia and arachnophobia comes from.\nYou know, I I bet someone in your DNA, someone down the line was either killed by a spider or like really badly hurt by a spider and it's just in your DNA to be absolutely terrified when you see a spider.\nWhat's a what's a fidophobia?\nSnakes.\nOh, some people just they have it so bad.\nLike they see snakes and they just start panic and they go they have a panic attack and they just can't handle it.\nWhere other people like I I'm scared of snakes for sure, but but I can look at them, you know, they don't freak me out.\nCan you hold them?\nYeah.\nYeah, I can hold them, but I you know, obviously I don't want to be around them.\nThey're they're serpents.\nThey're literally in the Bible.\n\n\nYeah. The Bible does frown on the snake and a bad rap in the Bible. Satan comes in the form of a certain serpent. Yeah. I I can hold one if I know it's not going to. I got again, I have a healthy fear, like if it's if it's if if it's if I know it's a boa constrictor. Put that guy in the granite village who walks around with a giant yellow one. Which kind of creeps me because if it was to really attack someone, I mean, I guess you'd have to kill it. There's nothing you can do. Yeah, it's a large boa constrictor. There's not much you can do once it's around your neck. You need help, you know? They're very strong. I mean, they they crush deer and swallow them whole. They do. Yeah. I mean, you got to you got to be a real special kind of idiot to have one of those things as a pet because you just have a monster as a pet. And as long as you feed that monster, but if you leave a baby in a room with a python, you come back a half an hour later, you're going to have a fat python and no baby. Absolutely. And a nice quiet night's sleep. They don't give a damn. They're just like that's what they're there for. Nature has designed them to kill everything they can. I can't. Annie Letterman has a lot of snakes. Like she has them as pets and her her fiance has they have a room full of snakes and I don't get it. I'm like they're not warm. Yeah, they don't have any recognition of you. Interesting, I guess. I guess. But I have We have a puppy and I've never owned a dog before. And it's like it's nice to have. I don't like taking care of anything. I I don't have that instinct in me. I just don't like it. But this dog kind of uh I get why people like having a dog. I get it. Oh, I love dogs. If if it My wife only lets me have one. I have one dog. But if it was up to me, at one point in time I had five dogs. You did? Yeah. Does he pee in the house? No. Mine does a lot. I mean, he does if he eats things that are bad, he gets diarrhea. And he gets diarrhea at least a couple times a year. Oh, he does? Yeah. He's a dumbass. He's a golden retriever. He's not that smart. Like, he ate a turtle recently and he got horrible diarrhea all over the place. He got little pieces of shells stuck in his stomach. He had to go to the hospital. Oh, really? Oh, yeah. Yeah. Yeah. It was It was a nightmare. And he also ate gravel at one point. He ate 5 lbs of gravel cuz someone accidentally uh dropped some chicken food on the gravel and he just assumed that the gravel was food so he ate all the gravel. It is crazy how nothing registers halfway through the gravel pile. He's just a dumbass. Doesn't taste like chicken. He's a dumbass. But I love dogs, man. I I wish I I I could have I can't go to a pound. I I can't go if I bring them all home. I'll just like I'll take them all. If I had a giant piece of land, I would probably just have all every dog I could ever get. We went we went to uh Northshore Animal Rescue and uh actually Beth Stern helped me. I don't know her well. I met her through Whitney and I had met her and but she's like is huge there and like has great connections and helped us get a very nice little uh uh what is it? A Yorkie. We we were so stupid. We thought it was a uh I thought it was a cavapoo. I don't know what the fuck kind of dogoo. It's like a It's like one of those things where it's like a bread dog. It's It's a cavalier and a poodle, I think. But it's hypoallergenic. I can't have dog hair, right? Oh, look at that. I mean, come on. Is that not phenomenal? Come on. Look at little bow. That used to be a wolf. That's how creepy people are. They turned a wolf into that thing. That little adorable no shedding thing. Look at that little face. He's very cute. But that's what we thought we were getting. I didn't know cuz a Yorkie looks a lot like that when it's young. I mean, it was like this big when we took it home. But yeah, it's I I love it. My dog photographs like shit though. I never put up pictures of my dog. He's this sweetheart, but it looks like a fucking wig and a hamper. Just sucks. I can't humiliate an ugly dog I have in in pictures. But in person, he's great. But I just I never post pictures. It's just it's Put a filter on him. Nothing's going to help. He's just kind of sitting there. Looks like he's homeless. Like some homeless guy's dog. But I do uh I love having him, but the pissing in the house is very difficult. A yeah, I think that's when I first got him. A See, he looks a little like a Cavapoo. That's adorable dog. Then he was, but as he's gotten older and his hair's gotten longer, he's got shitty looking in person. No, but on and I he photographs terribly. Let me see a picture. Let me see a bad picture of your dog. Let me see if I have I put up on my Instagram. I think I put up a video recently and the screen grab. I tried to find the cutest screen grab and I just couldn't. So, let me see here. Maybe it's just you. Maybe if I saw him, I'd think he's adorable. I can guarantee you're going to go like he might be great in person. It's like when somebody But I wouldn't I would never uh I would never classify this as a cute doll. Hold on. I'm It's not opening because of uh But I'll find it. Oh, there's no cell phone signal in here. Is that on purpose? No, it's just the walls are thick. Do you guys have Wi-Fi or No. Yeah, I can't find it. Forget it. All right. It's okay. I get it. Oh, wait. Is that it? That's That's actually not that bad. Oh, that's cute. But there was one I put That's actually a very nice one. Look at the little blue bow. Yeah, we've Somebody in the house really mowed him up. That wasn't my fault. That's a cute little dog. Yeah, that's a nice picture. But typically photographs very poorly. But uh we can't he won't stop pissing in the house. Like I can't uh Well, you live in an apartment. Live in an apartment. That's part of the problem. We put him on the terrace and she'll go out there with him and and she walks him. I won't walk them. It's like it's your dog. I don't want to fuck I don't you know what I mean? Like I'm not again I don't have that instinct. I'm happy you have him and you love him, but um he just won't stop pissing in the house and I don't know what to do. I'm getting to a point where like I I like this is why I didn't want a dog. Yeah. I can't handle dog piss in my house. It's kind of gross. Yeah. Yeah. It's pretty gross. I heard that. Uh I I'm debating do I pay for a trainer? Do I pay for someone to come in and just They might not be able to. So, it might be one of them broken little tiny dogs. You just can't stop pissing in your house. I don't know though. I hope like one of those kind of dogs. Well, in New York it helps. Like you have a small little uh first of all, I'm not qualified to own a big one. I don't know how like people own like mastiffs and in New York. In New York City, that's crazy. You can't and you can't get insurance for them. That's what made me like if you have a Doberman or Rottweiler or Pit, you can't get insurance, homeowners insurance. So, if somebody gets bit, you're fucked. Oh, yeah. And that's what scared me about those dogs. German Shepherd. Yeah, especially German Shepherds. Well, also like those dogs need a lot of exercise. They need a lot of activity or they get anxious and they get kind of crazy because they're not supposed to be penned in like that. They're working dogs. They're supposed to be out there running around. And if you don't run them, if you don't exercise them every day, they they get like people do when they don't exercise every day. They get kooky. Yeah. I became a little obsessed with you see those Caucasian shepherds? Like I want to pet one of those things or those. Uh that's a big giant fucking thing. It comes up. It goes up like 200 lb. Yeah. It's fucking hairy. It's a disaster. Yeah. It's a werewolf. It's a monster. But something like that I would love to, you know, spend a moment with or go someplace and and play with it. But I just, you know, Yeah. Look at that thing. Jeez. Slobbering all over your sofa. 220 lbs. Jeez. Well, they use those things to keep wolves away from sheep. Yeah. Yeah. And Russian prisons. I think I've seen footage of Russian prisons like where they have them around the perimeter uh in there's a fence in between like freedom and the jail and they kind of keep them in there. I wonder what their temperament is like. They're aggressive. That's what I've heard. They're very aggressive. Bad with people. Strong, powerful, alert, quick, dominant, calm. What? Yeah, they just Somebody just threw adjectives up there. How do they throw calm in there? Steady, strong, independent, faithful, self- assured, calm. That's weird. Uh the do you ever see those do what are they called? Dogo are are I'm a Those are they look like giant and pit bulls. They're gorgeous dogs, but again they're hyper aggressive. They are aggressive, right? Oh yeah. Oh yeah. Great guard dogs. Hyper aggressive. They will fuck you up. And I think those were the dogs that Ving Rhames had when someone he he killed like someone working at his house. Yeah. When he was Ving Rams or before. Yeah. Ving. I'm pretty sure it was Ving Rhames. I think something happened and someone maybe they were there where they're not supposed to be there or something happened and someone I think it was someone working for him got killed by his dog. Was he is is it him or Charles Dutton who did time in jail for murder. I think it was murder. I don't want to get sued but I think it was Charles Dutton or him that actually before they were actors went to jail. I just don't remember if it was Ving Rhames or Charles Dutton. I don't know. I don't know. It was one of those guys that had like a really interesting backtory. I wonder if that happened. Let's go find out with Ving Rhames' dog first, then we'll Google did Charles Dutton murder somebody. I think I think it might have been Dutton. I think you're right. This is a funny thing to Google. Corner said that the he did not die from in the Ving Rhames case, he did not die from dog bites. They were waiting for a toxicology. Oh, did he maybe he had a stroke and then the dog bit him? Like sometimes that happens like if someone has like a seizure, dogs will bite them. Like dogs don't know what the fuck is going on. They freak out and they bite them. When animals attack humans or other animals, victims usually end up with bites around the head and neck. He had none. Uh, this leads us to believe he went down for some other medical reason. Oh, that makes sense. So, the bites were around his arms and his legs. So, yeah, the dog might have bull mastiffs. English bulldog and three bull mastiffs. 200 lb. Jeez. 200 lb. You wonder if they were trying to wake him up or trying to pull him somewhere or if they were attacking because you're right. If they don't bite the face, what's the purpose of what were they doing? I bet it wasn't. I I bet that's what it was. Sometimes that does happen when dogs will freak out if someone has a seizure. They don't know what the hell's going on. They like bite the person. Yeah. Like what's he doing? They're freaking out, you know? Probably not even bite him to try to hurt him, just try to stop whatever is happening freaking him out. Well, there was speculation after uh Sig Freed and Roy when when Roy got dragged off. I don't know what's true or not. Did Did the thing bite his head or was it actually trying to save him? Take him away. Yeah. Um, I don't know what. Yeah, there was like a lady that had a crazy hat or something like that and the tiger was kind of weirded out by this lady's hat. Is that what it was? That's what I remember. But I I just remember thinking, duh. Like the tiger just did what tigers do and just decided I don't like this anymore. Are they both dead? Bite you. I don't know. I know Roy Horn died. I think I just saw they're making a Netflix series about or Apple TV series about him. Eight episode series. Andrew Garfield and someone else are playing. Did you ever see the HBO uh thing on Liberace? Is is that where with uh Tom Opera? Well, it was Matt Damon and um what the\n\n\nWho played Scott Thorson? The guy, Greed is Good. You know that guy? Michael Douglas. Michael Douglas. Yeah. Michael Douglas played Liberace, I believe, right? Didn't he? Did he? Yeah. I didn't remember that. Yeah, it was Michael Douglas and Matt Damon. Oh, he played Scott Thorson. Matt Damon. Yes. He played the guy who got plastic surgery to look like Liberace. He's a classic. What a psycho. Boyfriend, get plastic surgery to look like him. I want to [ __ ] me. I know. That's the last person I would want to look like. I go to a surgeon and say anything but this. Isn't that that is such a psychotic thing to want to [ __ ] you. Oh my god, that's so crazy. I want you to look like me. Get your chin done and look like me. Is that a power thing or is it a [ __ ]? It's a very bizarre. Yeah, pure narcissism or just crazy. Yeah, all the above. Power for sure. Power over that guy, right? He probably had the ultimate power in that relationship cuz he's Liberace. He's this enormous superstar and this guy's his [ __ ], you know? Like, I want you to get a different chin. You're going to look like me. He got a crazy chin. Yeah, he did. He looks He looks very silly. It was a fun [ __ ] film, though. Yeah. Tom Papa had a part. Wow. It's a really [ __ ]. Joey Diaz used to have a great bit about it about the uh about the HBO thing. Yeah. I mean, Liberace was a [ __ ] weird case, right? Because he had to pretend that he was straight forever. Yeah. And it's so obvious. Like today, he wouldn't have to. No. Right. He could just be Liberace, but back then he had Do you ever see the song? There he is. Look at that. Super straight. Look at the rings. You do you ever see the song when Liberace winks at me? No. So, this is a song that played on television in like the 1950s when, you know, the world was innocent and a woman who was like swooning when Liberace would wink at her. And so, they played this. It's it's Liberace playing the piano and like looking at the girl and winking and then it made like a twinkle in his eye when it let's let's play it because it's it's so bad. Here it is. Here it is. Put your Put the headphones on. You got to see this. What is it? 53. Is that what it said? 55. So she's watching him on TV and she sings. Watch this. President [Music] divine. I found a brand new idol. He's charming as can be. I really can't. Wow. I start to shake. I start to shiver and fiber in my being. It's a feeling very close to ecstacy. [Music] Wow. [Laughter] First of all, it looks like Jim Florentine. It really creeps me out. I remember when he winks you hear the piano key like little tinkle clink clink. That's so weird. What a weird time it was back there, dude. There's a video of him too on Instagram where they it was in the 60s when he was trying to get with the uh he was trying to like, you know, be with the movement, man. Be cool, man. And it was like something about something groovy and it's just him on a piano with all of these like uh like, you know, 20 year olds just trying so hard to get the kids. Oh, really? Oh, it's so It's in the 60s. It's I think it's in the in it looks like it's like 1967 19 Yeah. Is that it? Oh, boy. Playing [Music] groovy. Look at these guys. Their pants. Hello. God, look at their pants. The piano's got flowers on it. God, people really lost their [ __ ] minds in the 60s, didn't they? Yeah. This is very drug inspired. Imagine putting those pants on. Where's he does come out? I'm not sure where he does. Oh, there he is. Ah, there he is. At least he's dressed for the occasion. Look at him. He's got the thumbs up. Look at his [ __ ] vest. [Music] Look at him. God, that's so weird. [Music] Liberace turning on. [Music] Liberace's turning on. Isn't that great? God, that's so weird. And look, the piano's moving and he had to hold two girls like, &quot;Yeah, I'm here to get some puss.&quot; He's turning on. Yeah, this is like the acid days. But it's so crazy that like this was actually probably not meant to be shitty and ironic, but it was meant to be like, hey, he's this cool guy getting with the scene. He's getting with the scene, man. And he's out there with his piano and all these weird people with flowers on their pants and the dancing the dance routine is is just not the straightest. Look at him go with the vest. The vest is hilarious. Yeah, it's like plastic. Yeah, it's like this [ __ ] raincoat that they turn into a vest and a long like orange like almost like Shakespeare sleeve type of shirt. So strange. God, people were so weird. But you got to think like in the 1960s, television had only been around for like 20 years. Yeah, that's what's weird. This was really weird if you really stop and think about it. It was so new. No one It's kind of like the internet, right? Like the internet was the internet is older today than television was then. Yeah. Yeah. You're right. It's 30 years old now. Yeah. Yeah. The internet basically came around. I got on the internet for the first time in '94. I got on America Online. You've got mail. Yes. And I remember this is crazy. I couldn't believe it. It hooked up to my phone. It was a 144 connection. Yeah. 14K. Slow as [ __ ]. Then I got 56K. I thought I was a boss like look at me 56k you know and I remember thinking this is crazy like this never existed before so that was 30 years ago 31 years ago this was just 20 years after TV really like when did TV really start happening in the I want to say in the '50s yeah I don't think it was in the 1940s I mean it was in the 50s what was the first television Hitler broadcast it I was but that must have been in the 40s there there was cuz in the movie Contact where they show you that Hitler broadcast I which they say was like one of the first you broadcast it on the radio or on television. No, it was a TV. I think they used to do a lot of World War II stuff in the movie theaters. You'd go to the movie theater and you get the news. The Allied front and they'd show you the news. They'd show you like propaganda footage of the news. Our troops are out there fighting for your freedom. Yes. And the Japanese they show you. They show you the brave American troops smiling. Yeah. Yeah. And then they'd have those propaganda movies. Uh 1953, 50% of American households had a TV set. By the end of 1960, almost nine out of 10 did. Wow. So, what was the first television? When did it first Oh, they had them. They started in the 20s and then they were expensive as [ __ ] and probably very big and there wasn't anything to watch. So, why would you have one? Oh. And then there was When was the first broadcast? The first television broadcast. Oh, well, it's Yeah, up until the 50s it was really just like public information, it says. Oh, so just like the news there wasn't I mean there wasn't a lot of shows being made like what was the first television show? Yeah. Let's see. Before Cav remember Gleason did Cavalcade. I think it was called Cavalcade was like when the Honeymooners uh debuted and he would do Reginal Van Gleason but I don't that's definitely not the first one. I Love Lucy was probably same time or before that. Right. And what year was that? Had to be the 53. 53 maybe 55 or might have been later I don't remember. So probably the television really became like when did it become a thing where people would watch the news? Probably like late 40s maybe. Yeah. Because 63 again the Kronhite broadcast I mean so by then it was like in in full effect. So you got to think that 63 with you know Liberace or the the 55 one with Liberace. That's so new. Yeah. That's crazy new. And then 12 years later you know when he's [ __ ] dancing with the flower pants on. There's a Wikipedia version. First national color broadcast. The 1954 Tournament of the Rose Parade US Kurd January 1st 1954. So the 1936 summer Olympics. Oh, they had the summer Olympics. They they broadcast world series it says was the first catalyst like big big buying. Wow. You must have been a boss if you had a [ __ ] television in 1936. Yeah. And then first like variety show was Milton Burl's show. So he became known as Mr. Television. What year was that? 48. 47 48. Wow. It took his radio show and made it a TV show. So by the time that Liberace Dancing with the Pants On, it's only 20 years old. Yeah. Which is really wild. Was that 68th? I'm I'm going to assume it was definitely late 60s. 68 Red Skeleton television hours. And And the fact that people just didn't know he was a flaming homosexual. Like the fact that How did you not know? How did you not I guess there wasn't enough uh gay people publicly so everyone didn't recogn like people knew like when you spoke a certain way that you could be, but it wasn't I guess that wasn't like the the the voice that everybody recognized. Well, everybody hid it too. You know, you had to hide it. You imagine being a gay guy trying to find other gay guys back then. Like, what did you do? What a risk. Oh, yeah. It's like being gay in North Korea. Like, how do those guys [ __ ]? What signal do you give where you know the other guy's not working for the state, right? You're in a rest area. Even if he is, he might throw you under the bus anyway. Like, they have a whole culture on throwing people under the bus. On tattling. Yeah. Their whole culture is based on tattling. And if you don't tattle on people, they they assumed you did something wrong. I'd still like to kind of go there. I wouldn't do it cuz I wouldn't I would Yeah. Just because they say there's all those fake storefronts and all of those or or or stores that are just for the tourists that come through that they have all those fake stores that people they get a lot of tourism. Oh yeah. I mean they they get enough like uh through China. They these companies that go through China and every country doesn't have the negative relationship that we do with them. So I would kind of like to go but I don't I wouldn't trust it after that auto uh war what was his name? Warren Waringer. Yeah. The kid that got sorry for for taking a propaganda poster. Yeah. Um, it would be very scary to go, but I I really kind of want to. They have that giant building, the uh it's like a thousand foot tall hotel or building that is just kind of half empty, like it's never was finished. They light it up at night so it looks like they have a big downtown. Oh. But the North Korea has like a thousand tall thousand foot tall building. A YouTube video of a guy that went his name's Mike. Okay. He went three or four months ago after they had not been open since co. Really? Yeah. and he went just to tour around North Korea. He's a British person, so he's not from America. Yeah. And you're not supposed to film a lot of this stuff. These guys take really really like clandestine footage. You're allowed to film in certain areas, but I think your phone you had to leave at the border when you come in. Wow. Yeah. He explains what he was do. I think he says he wasn't supposed to, but he just Is he eating food there? Yeah. He goes to a few little towns, talks to him. I remember watching some of this. It's like a random Coke or something somewhere or a Red Bull, I think. That's so [ __ ] risky. It is risky because you just the wrong thing you do, you insult them and next thing you know you're in jail for the rest of your life or you're beaten to death. Yeah. They said that like if there's a picture of Kim Jong-un or or Kim Jong- you have to be respectful and you stand in front of the pictures to take your photo. They're really and they just rat on each other. Well, uh Shane Smith went Shane from Vice back in the day like before things got too crazy over there. And he said that they set up a fake restaurant for him. Like they pretended that they had restaurants and so they had a fake restaurant and he went there and there was like only him there and people were serving them. Bizarre. Yeah, he said it was really weird. I guess when you're seen as a god and everybody just co-signs it, you don't know how bad of a liar you are. Like you don't know how badly you're presenting because everybody is just oh my god. Like right. So they have no idea. Kim Jong-un has no idea that people look at him and go like that's not real. Right. And then the people that are there they have no internet. like their their world is the North Korean internet. They don't they're not connected to the rest of the world. No, they would uh I guess people will like sneak in thumb drives and stuff like that of I know South Korean TV. They catch you. If they catch you, you're [ __ ]. But you know, you know, Assad Mseni uh he he's uh he's from Afghanistan and he ran uh I think it was called the Mob\n\n\nThey group in Afghanistan, but they would go next to the Iranian border and pipe in, uh, like American TV shows, and they would illegally send them over the border to try to get people like a little bit westernized or to at least see things a little bit differently. But it's an illegal feed. You're just shooting it over somehow, and you know, hoping they don't kill you.\n\nHoping they don't kill you. Yeah. Speaking of kill you, uh, what's that? Said speaking of kill you in Iran. What? Oh. Oh, what's going on there? Oh my god. Yeah. Oh my god. But no one's surprised. You know what I mean? Like, I bet the guys who got killed were surprised. They were supposed to meet with Trump to have a peace negotiation. Wasn't the time up? Didn't, didn't the, I thought the time lapsed. No. Did the Israelis jump the gun on the time?\n\nWell, the speculation, according to Grock, I sent Jamie this. Somebody said, were they killed, like, ask Grock, were they killed because they were negotiating for peace? You know that the Israelis wanted, they didn't want a negotiation. Oh, because they wanted to get those nuclear sites out of there. They, they didn't trust the Iranians, and they wanted to make sure that these guys were gone. Yeah. They, they essentially killed everybody that he was, uh, negotiating with. So this guy's response above it, it says, \"What evidence might there be to support this position?\" And the position was, \"Go above that.\" Yeah.\n\nIsrael did not attack Iran because Iran was about to attack Israel. Israel attacked Iran because there was about to be peace. And then this guy asked Grock, \"What evidence might there be to support this position?\" And then Grock says, \"Evidence suggesting Israel's June 13, 2025 attack in Iran aimed to disrupt US Iran peace talks includes its timing coinciding with the sixth round of nuclear negotiations scheduled around June 12th through 14th, 2025. International reactions like the UN and the Oman condemning the strikes as undermining diplomacy support this view. However, Israel justified the attack as a preemptive strike against Iran's nuclear program, citing its non-compliance with the IAEA. No direct evidence proves intent to stop peace and the focus on nuclear sites suggest security concerns drove the action. The issue remains debated with perspectives varying by geopolitical stance.\"\n\nThis now ask Grock. Grock is kind of Twitter's AI, right? How influenced is it by, like, I chat GPT, I've gone to, and I was kind of curious because my wife's obsessed with it. So I was like, I think this is probably still ideologically influenced for sure. So other people have done this, but I put in, write five jokes about Jesus, and it did five Jesus jokes, and then I put in, write five jokes about Muhammad, and it came back with, well, we like to keep things respectful and blah, blah, and I did the same thing with, write five jokes about white people, and then write five jokes about black people, and it did the same thing. It wrote the white person jokes, but the black people jokes it wouldn't write. So, I was like, \"Oh, okay. This is still somehow tied in. There's guard rails, and it's, it's ideologically slanted. It may not always be that way.\" So, I'm wondering if Grock is the same way. Like, is any answer it gives you almost like coming from either somebody at PBS or somebody from some place else?\n\nGrock is probably the best of them for that. But the worst was Gemini. Remember when they asked Gemini to make photographs of Nazi soldiers, and they had a diverse group of Nazi soldiers, including Asian women, Native American women? Yeah. Black people. Keep it, keep it fair, folks. Keep it fair. They just got locked up in this woke ideology thing to the point where the, the images they created of Nazis were woke. I don't know what happened where people become so afraid of, like, I know truth can be unpleasant sometimes, but like, where, where, where it goes to that level, like, we will write jokes about Jesus, but not about Muhammad. Like, I, like, who's programming that and thinks that's a good thing?\n\nWell, they're scared. They are. That's what it is. I'd almost respect them if they said they were scared. Like if they said, \"Look, we all understand what goes on. We don't want somebody running in with a bomb belt, like, you know, there's violent retribution.\" I would respect that. But they won't say that. No, they act like you're crazy for questioning. What? Yeah. Ah, that's not true. It's not. Yeah, it's weird. We're in a weird stage. We're in a weird stage. We have all the information, but it's still, it's still got guard rails on it.\n\nDo you feel, I feel better about myself, though, the older I get. The more like, yeah, I, I years ago said it and knew it was getting worse and worse, and like, I was never stupid enough to think it didn't exist. So, I kind of like, yeah, well, if nothing else, it validates what I kind of thought. You know what I mean? Like, I feel like, all right, I wasn't a [ __ ] idiot. I'm not taken off guard by it. I knew it was coming. Yeah. Not necessarily to this level, but you know, when you saw this happening and then that happening and then little weird things like Donald Sterling, that one always bothered me. Uh, his private communications being used against him. And it's like, does anybody, which one was that?\n\nHe was the owner of the Golden State Warriors. I don't remember. Oh, this was the guy that girlfriend, the Clippers. Yeah. Oh, sorry. I'm sorry. The Clippers. Yes. He was the guy had the girlfriend who was his little side piece, Vaviano. Yeah. And the girls, the girlfriend recorded him saying a bunch of things about black people, and it was almost like he was, like, it wasn't like I don't think he was a hateful old guy, but he was just like an old guy, like, you know, I mean, don't hang out with blacks. Well, he was saying don't do it publicly, right? Yeah, I feel like it embarrasses me something like that. His friends are probably calling him. Yeah, but he was, you know, he's talking to his side piece, and she's recording him. The whole thing was gross. The invasion of, even if he's a piece of [ __ ], I don't care about him. But it's the idea that people are comfortable, like, nobody sticks up for privacy. Like, everyone complains about, we went to Good, and it's like, hey, [ __ ], where were you when this guy, or stupid Hunter Biden's big dick is all over the internet? Where were you complaining about it? You just judge them on it. So, I wish people would stop doing that.\n\nYeah. The, the, the Hunter Biden stuff, the fun stuff was like him smoking crack and hookers and foot jobs. It was just fun. Did he foot chubs? Yeah, he did a lot of stuff. There's a lot of wild stuff going on in there. He's a wild boy. But I guess, you know, you're smoking crack. Sure. You know, had a tub unshaven. You got no guard rails. You're off the [ __ ] reservation. He's a naughty boy. But then the other stuff that was in there was really interesting, like the emails about 10% to the big guy and all that stuff. And there just be brutal, rampant, obvious corruption that they just look the other way because it's a Democrat. And it's just really strange. If Trump Jr. did anything that Hunter did, right, they would kill him, like, like they would, it would be the front page. It's all they would talk about. They certainly wouldn't have hid it from Twitter. They wouldn't have, uh, which was really crazy. It was a New York Post story, and then the FBI got involved, and the Twitter files, like, you know, when Shellenberger and Taibbi and all those guys went over the Twitter files, and it's so damning. It's so, it's, it's so crazy that that's not so illegal that there's like just massive trials on television and people are prosecuted for it.\n\nI guess with private companies, or even though the media operates like, but it's the government. The government is what I'm concerned with because it's absolutely election interference. 100%. 100% because there was a lot of people that were on the fence, you know, they, they didn't know whether they're going to vote for Trump or whether they're going to vote for Biden, or they didn't know what they're going to do, and then they saw that, and they were like, \"Fuck this.\" And guys like Jack from, uh, from Twitter have come out and said, like, \"Yeah, we shouldn't have censored that story, but it's like too late now.\" It's like, you did it, and people were telling you when you did it, you shouldn't do it. Zuckerberg talked about it on this podcast. He talked about the FBI getting involved on the podcast, censoring COVID information, censoring the laptop information, and that this weird feeling that he got from the government all of a sudden telling them what they, and some of the stuff that they were telling them they had to take down was actually true, factual information. And they were like, \"Oh boy.\" And so they diminished its reach, and they did a lot of weird [ __ ]. And the penalty for not taking it down would have been like, what are they threatening them with, like, uh, section 230 is a big one that all the big companies are scared of, like, if they change that, uh, because they said that, like, the internet freedom comes from section 230, where a company can't be held legally liable for what's posted on their site, which is how, like, you can post anything about people, and the sites themselves can't get sued because they're like, yeah, we're just like a phone company. It's a public square. A public square. Um, although it's not anymore. It's much more ideologically based, and it's much more of a publisher in my opinion than a public square. But maybe they threaten you with that, or maybe that's where they start to go, like, we'll see to it at the 230. I mean, I'm guessing, but what else could they threaten them with?\n\nYeah, it's a good question. I mean, just the fear of being on the wrong side of the government. I mean, that's the thing, because then they could go after you, like, you know, for someone like Zuckerberg, who had already sat in front of those congressional hearings, and they, you know, they had already asked him about a bunch of different things that the company had done, and you remember those weird, those weird hearings that he had to sit through, where he sip water, very strange, and people said he's a [ __ ] robot. He's probably so nervous. Of course he is. Yes, senator. No, senator. Thank you for asking, Senator. Like all those weird moments, like, you got to be terrified of those people because they could change laws, or they could just decide to prosecute you for thing. I mean, look what's happening to the guy Durov from Telegram.\n\nI don't know that story. You don't know that story? No. He is essentially, uh, he's under house arrest in France. He has not been tried with anything. He has not been charged with anything. But what they're saying is, essentially, they want a backdoor to Telegram. Telegram is an encrypted app, and a lot of people use it for illegal things, just like a lot of people use Twitter for illegal things. A lot of people use DMs for illegal things. They, they, I'm sure they use Signal for illegal things and WhatsApp for illegal things. And they wanted, Telegram was especially popular amongst criminals, and they wanted to be able to get in there. But then the question is, like, well, what do you determine as a criminal? Is it a political dissident? Like, is it, you know, what is it? What does it mean? Is it, is, are you looking for underage people being photographed, or are you looking at just people who, like, they can always expand what they consider to be illegal? Um, I mean, they took back page down, so they can get certain company, like, if you don't do what they want you to do, there is a way for them to get you by saying you're too complicit in certain activities. So you want, that's a silk road. That's, that's what happened with that Russ Alrech. Yeah. Yeah. And now he's luckily, uh, Trump freed him. Did he, did he pardon him? I, oh, he did. Trump pardoned him. Yeah. Yeah. We tried to get him on, but he's just not ready to talk, which is totally understandable. I said, \"If you ever do, if you want to talk, I'd be happy to hear your story.\"\n\nWell, cuz you're probably afraid that they're going to come with something else. Like, it's almost like, you don't want to put it in their face. Now, I'm out. [ __ ] those people. What they did to me was wrong. Oh, new charges. That's right. That's why whenever somebody's exonerated after 30 years of being in jail, they're like, I, I'm not even angry. I just want, cuz you're afraid you're going to say the wrong thing, and then you go, \"All right, we're going to come back.\" Well, that was the really scary thing about the Trump stuff, like when they were trying to get him for 34 felony counts. None of those were a felony. All of them were past the statute of limitations. It was just bookkeeping errors or bookkeeping, you know, they, they wrote down the wrong things, and they tried to hide the fact that he was making hush money payments. But the, the reality of that legal system being used against you, lawfare being, you know, they target you, like the, the real estate one when they, they tried to say that he overvalued Mara Lago, and it was really only worth $18 million, and so they charged him like hundreds of millions of dollars, which is [ __ ] insane because Mara Lago is an enormous piece of property that is on the most expensive place in the country, like that area. He's got, I think he's got, is it more than 20 acres there? I mean, it's a huge piece of property there. And the next door neighbor had a place that was like 5 acres, and it sold for $50 million, just the property. Yeah. So, they [ __ ] him. They [ __ ] him. And it's obvious that they were [ __ ] him. They were, they were doing it because they were trying to,\n\n\nmake him a felon when he was running for president. Yeah. Leticia James went after him really badly in New York. And turns out she had done some little bank, uh, little bank stuff going on. Yeah. She did some little mortgage questions. Yeah, she did some inappropriate things. But he's a, whether people like him or not, I like, I don't always agree with him at all, but he's an amazing person. Like, to, to have withstood that, the pressure of that, again, just as a, to, to continue with, with the pressure that they were putting on him and the way they were coming after him and to still run again and wait. I mean, it's the craziest thing you're ever going to see in your life. And they shot him. And they shot him, and they were, the guy was going to do it again, uh, or tried to, and another, and a, uh, oh, yeah, that the guy with the hole in the, in the fence where his golf course was, kooky. It's kooky. But it's like, and somebody pointed out to me, it's like, I mean, I'm surprised he doesn't expect this. It's like, he went after them, like, he, he went after the CIA and the FBI, and it's like, they're going to make it their life's work. I know to come after you now. It's also crazy when it gets real transparent like that, though, you know. But when someone like Zuckerberg or any of these other people that run afoul of the federal government or the intelligence agencies, when they see stuff like that, I understand why they comply. Yeah. They're probably terrified. It is a little or very scary when they, when you're on their, like, you never want them to dig in and be focused on, on you. Eye of Sauron. Yeah. Yeah. We're coming for you. And because, again, they don't pay, they don't pay legal fees. They can do it all day. They can do it through the next administration. Um, because Leticia J, she went after, uh, uh, what I didn't like about her, uh, was a lot. Uh, but I didn't like the fact that they went after Cuomo for his book money. Like, they went after Andrew Cuomo for his book money. I think they wanted him to get back. Yeah. For what reason? I don't know what her reasoning was. I mean, obviously she just wanted to stick it to him and him, but I, I think it was that he, it was seen as some form of a government payment, or I don't remember the technicality, but I remember being very annoyed that she was trying to go after, I think it was a $5 million advance. Lawfare is terrifying. It's terrifying when they do that to people when everybody could see it. Like, that's the real problem with the Trump one. And my problem wasn't, my, my real problem was like, don't these people understand? Doesn't the general public, with their lack of outrage, because, you know, he's on the right and they're on the left. Don't those people understand that now they've set a precedent, and then they could use that on you now. Yeah. Or anybody else. And if a Republican president gets in, like, there's in now, it could be easily used on his opponents because they've set a precedent. That's scary man. It's really scary. And nobody, again, it's like, whether it's with Donald Sterling and privacy, nobody sticks up for each other on principle. And the conservatives don't do it, like, the, they've got, like, the free speech thing in their corner now, much more than progressives do. But it's like, I don't hear them sticking up for progressives who are annoying. It's like, you have to stick up for people you don't like. Yes. And that you think are It's not just, you're not a big free speech warrior if you only raise a flag for people who agree with you. And I find them falling into that trap. It's like, don't fall into that trap. Stick up for progressives who suck and who are saying stupid things. Defend their right to say it without getting in trouble. Don't look at them getting fired is, oh, good, good case of your own medicine. Like, we get it. But then that's how they justify you getting fired 100%. So, it drives me crazy that people don't defend other people's right to privacy or right to say what they want. And everyone in the country thinks they're a free speech absolutist, but they're not. They're not. Yeah. Elon's as close as I've seen. Like, he doesn't seem to be shutting anybody up, like, regardless of what they say on his platform. People are talking about him every day. I saw one person was, was alluding to, uh, bad things happening to him, uh, you know, like, wanting that, or I wouldn't say encouraging it, but close to encouraging it. And I'm like, if he's leaving that up, nobody has any room to complain. Yeah. Like, if he leaves up horrible about himself, then, and, but he also left up the Kanye song. The Hitler song. Oh, yes. Is that where he blew his cousin, or is that a different one? That's a different one. Oh, wow. All the hits. Yeah. The, I mean, these, the song is, \"Hy Hitler.\" He's singing \"Hyle Hitler\" like in a catchy song. It's like, wow. I, this is crazy. It is crazy. And I don't know Kanye West at all. I've never particularly loved him. I, I, I find a lot of it is just like, he'll just say the most troll. Like, something tells me he's going to come back down to earth one day and go, \"Look, I was off my medication. I didn't mean any of that that I said. I feel bad about it.\" I think he's going to stay off his medication. I think when he puts on his medication, he can't be creative. I think part of his thing, whatever his, the way his mind works. Yeah. You know, I mean, it's this mania. There's Yeah. I was going to say, I understand that in a way, because I've, I've always liked, you know, you go through your pressure, whatever. I'm like, do I want to go on something? But I've always been scared that it would up my probably will creativity. Yeah, it probably will. I mean, I think, I mean, I don't know what's going on in Kanye's mind or anybody's mind other than my own, but I would imagine that, you mean, a guy like Kanye, who's so prolific. I mean, he's put out so many albums, and he's a complete workaholic, and just has, like, when you talk to him, like, I had him on the podcast, and it's almost like when you're talking, he's upset. Like, he doesn't want, he wants to talk. He wants to just constantly talk. Yeah. Like, his brain's like a tornado, just, it's all just going, all these different thoughts, and, but that's also why he can make so many great songs. It's like, it's all just pouring out of him. But, you know, it also gets out of hand, and then, you know, you wind up in the situation where he's in now. It also, he's the only person, he went into him and Trump were, he was in Trump's office one time, and he's the only person I've ever seen Trump just kind of sit there and go, \"All right, well, whenever he's finished, I'll jump in.\" I've never seen anyone do that to Trump. Well, Trump was happy that any celebrity was on his side, because at that point he was Hitler, you know, there was a lot of people that were calling him Hitler, and to have a guy like Kanye West, who was such a contrarian. Also, there was the thing because Obama said he was a jackass. Yes. And so he was like, \"Oh, really? Well, you.\" That's right. It was about the Taylor Swift thing. Oh, yeah. That's right. That's right. Yeah. That guy's a jackass. Well, it wasn't even that harsh of an in. He said it privately, and I think somebody heard it, or it was picked up on a mic. I don't think he said it to be public. I thought, I thought he said it privately, and then somebody got the audio or whatever. Is that, it was really the Taylor Swift thing. I believe it was. Yeah. Oh, here it is. Here. Yeah, it wasn't. Young lady seems like a perfectly nice person. She's getting her award. What's he doing? Why would he do that? He's a jackass. No, no. This all this stuff. Cut this out. Look, I'm assuming all this stuff. Where's the pool? Come on, guys. Cut the president some slack. See, it wasn't even that, and he wanted that cut out. Yeah, that was private talk. Yeah. And it wasn't even said with real malice, real ranker. Yeah. It was just like, he's a jackass. People laugh. I guess that would annoy me if I was him. I mean, if I was him. Yeah. If it was me, I'd be like, \"Yeah, he's right.\" I guess so. Yeah. Like, yeah, I was being a jackass. But at what point do you, cuz, you know, everyone has a Joe Rogan opinion. Everyone weighs in on you. It's crazy. Like, I see on the Daily Mail all the time. At what point are you able to go like, I just don't give a what, I don't read any of it. You don't care? Nope. I don't read any of it. No. I guess. Does it bother you? Has it ever bothered you? You can't do anything about it. Why would it bother you? What are you going to do? You going to change their mind? You know, you can't. And a lot of it is disingenuous. A lot of it, they don't know you. They don't listen to what you say. You know, if they far right, whenever they say far right podcast, I'm like, \"Okay.\" Yeah. I've had comics say that, like, they just don't know, and I'm like, you don't really, you really never paid attention. I mean, he stuck up for gay marriage. He loves Bernie. Like, it's crazy when you hear, I, I was very jealous that you and I talked to Hinchcliffe about this when you interviewed Magnus, uh, Magnus Carlson. Yeah. There's very few people I really want to meet that I haven't met. But he's somebody, you see him, like, bang the chess board. That was like big news in chess. Yeah. Yeah. Cuz he lo, he made a fumble. He up. He was ahead of the game. He was winning. Yeah. Made a blunder. It was, it, and it was, and but here's the genius of the people, like, they actually call it, like, uh, sport, and the, the, the people watching it knew he up, which means they're all geniuses. Right. Right. Magnus blundered. Magnus blundered. They couldn't believe he had made that. It was, I think it was a rook move. But he's somebody I would like to, uh, I don't know what I'd talk to him about. Oh, he is fascinating. Fascinating. Well, any high achiever or really high-level person like that, world champion in something that's insanely difficult, they're fascinating people. I feel that way about MMA fighters, any kind of pro athlete, anybody who's like Aaron Rogers, like, any, any high-level performer, those are very, very unusual people. Do you give them slack? Like, and I mean, just in, in your brain as a person, like, if they're a little whatever. If they're rude, they're rude. But if, if somebody's a little quirky or weird, if, if you're that good at something, that might just be the price you pay. Oh, for sure. Like Bobby Fischer, I love. He's one of my favorite people ever. Even though he completely went berserk, but I just, I have such an affection for Bobby Fischer, and I'm like, well, it's just, he's such a genius that sometimes it just, there's a price. It gets away from you. 100%. I think it absolutely does and can. And I think that when you, you're dealing with a high-level performer in, in any discipline, whatever drives them to be that much better than anybody else probably makes them insane. I mean, I just don't think, I don't think real true excellence comes without a price. I don't, I don't think there's any way to get there without just not being balanced in a bunch of other areas of your life, because you're focusing almost all of your attention on one very specific thing. Whether it's moving chess pieces around or throwing a football, whatever the it is, like, you're, there's no way you can be balanced in every aspect of your life if you want to be 5% better than anybody who's ever done it. Yeah. And it is weird, too, like, because to be better than everybody at something, Yeah. It, it's, I mean, whether, like, if you ever talk to somebody at a party, just what our life is doing standup, and they're talking about their job, a lot of times I'm like, \"Oh, shut the I don't care, give a \" I know. Um, so to be that on such a level better than everyone on earth at something has got to, it's got to be hard not to live in that place where you can't relate. Very few things are interesting, uh, very few things are, are moving. Right. Like Buzz Aldrin, uh, snapped at me when we interviewed him. He's a bit of a cranky, uh, guy. Let's not dillydally. I've got to get to CNN. you. That's what he said. Yes. I asked, I, I asked him a question, a good question about his book on Mars. I asked him about space travel, and I said about, uh, what type of psychological testing would you maybe need to go on a three-year space trip? And, uh, good question. Thank you. Uh, John, I felt it was too, Buzz did not. He snapped at me. So, I, but, but again, like, Rean had a bit about him walking on the moon, and it's like, when you've gone there, it's almost like anything else. And I took it, by the way, because it was Buzz. I wasn't gonna yell at him. It's like, he's Buzz Aldrin. Whatever. I'm an annoying blinking idiot asking a question that\n\n\nI think sounds smart and he just shut me up. But like, how do you find other people interesting when you're that guy, right? When you've done that, maybe my question was just banal and stupid. Well, there's a lot of people like that that are the best at the whatever the [ __ ] they do that they can't relate to anybody else other than other people that do their thing, and they're usually like very competitive with those people. So they've alienated them from their friend group as well, which is really kind of crazy. Well, the worst is people who think they're that guy and who are just and they're mediocre. They're just like average comics. Oh, that's the wor the comics are the worst with that. The the narcissist comics that believe they're better than everybody else when they're just mediocre. It's crazy. And then they just like [ __ ] on all the other comics. It's like, do you ever watch your own act? Like do you don't hate your act? Like that's crazy. It it is. And and you think you're doing Shakespeare and like every comic like we all have a narcissistic quality like you need that to be in front of people look at me like that's a narcissistic quality, but there's a difference between that and being like a legit narcissist and the way comics are [ __ ] very petty about guys like they attack Matt Refe. I'm like he's harmless, he's just out there doing his act in front of [ __ ] 20,000 people. They hate him because he's successful, but if he was nobody they wouldn't hate him. That's all it is, man. There's so many you very rarely see these comics attacking someone who's not doing as well as them. It's always a guy who is doing better, who they feel I'm entitled, doesn't deserve it. Yeah. Yeah. My comic is so much more cerebral, so much more interesting. Like, oh, is it really? I that's one thing I'll say for myself and this I have a lot of faults, but I've always put the blame squarely where it belongs on me. I never think it's the world. Everybody loves you. It's it I mean that's a very good quality to have, you know, like maybe self-deprecating to a fault. Like you're a little bit self-deprecating to a fault. Like I don't care. I don't know how many times I've had to tell you, \"No, Jim, you're [ __ ] great. Stop.\" You know, like you and I have had a lot of those conversations. And but I don't do it for It's better than me saying, \"Jim, you're not great.\" Yeah, Jim, you're okay. Jesus [ __ ] Christ. Leave everybody else alone and look at yourself. But I don't I don't do that because I want people to compliment me either. Like I I'm never out there going, \"Gee, guys, am I fat?\" That's repulsive, but but it's the guys who think like I I I went and watched and I don't know, Matt. I just I went and watched some of his clips. I'm like, he's funny. He's just doing crowd work. Like, what's the problem? And he's good at it. He's good at it. It's a reason why the arena's full. First of all, very handsome, good-looking guy, cute, adorable, lovable, really nice guy in real life. I knew him before he was ever famous. I met him when he was 20 years old. He was coming around the store. He was a nice [ __ ] guy. I've been friends with him for a long time. I don't understand that hate. But I, you know, I was coming from a different position. You know, I was coming from a position where I was already famous and I wasn't looking to be more. I wasn't, you know, there some people that like always feel like they haven't gotten enough. They haven't gotten enough credit, haven't got enough respect. You know, that these other people are stealing from them. Yeah. It's a famine mentality. It's a terrible mentality to carry around with you because you never heal from it. If you go through life with this famine mindset and everybody else is doing better than you, like you you have the worst attitude ever for getting good at things because you're always going to be focusing too much of your attention on other people. Yes. You're really sabotaging yourself whether you believe it or not. What they're getting, what they're doing. It's the feeling of entitlement. Like if I was if I was bitter about every person that used to open for me that passed me, I mean I'd be on a comedy club roof with an AR-15. I'm just I couldn't handle it. I mean, you have to learn to live with it and go like, \"Yeah, you know what? I recognized people that were funny.\" Like, I like funny people and I was right about certain people. Like, they're really good comics. So, yeah, it's that sense of entitlement that guys get that drives me [ __ ] crazy. But I see them attacking certain people doing well and I'm like, I don't. They always did it to Kerattop even though he's actually funny. He's a funny comic. It's a funny show. I've been to a show in Vegas. It's [ __ ] great. And he's a really nice guy. He's not a mean guy. It's doesn't deserve anyone's hate. He's a sweetheart. Yeah. You know, when I had him on the podcast, he was so happy and so thankful that like someone wasn't [ __ ] on him and then he said like, \"Dude, I got great crowds now. My crowds are packed.\" Like, it's a great show. If you're in Vegas, go check him out. It's fun. And he's a really nice guy. And I watched him uh uh like on Kill Tony, there's a clip of him and they pulling out these things and like gay mouse. It was a disco ball over a mouse trap. And it was so stupid, but it's like it's it was really is funny stuff and silly. Comedians think all props are bad or all and me and Colin talked about that one time and he goes, \"Why should the hacks own McDonald's?\" Like meaning like if you have something that's original and funny to say about a subject, who cares if hacks have touched it? If your thought is original, oh [ __ ] [ __ ] them. Exactly. Um and it's this weird thing where comics think they sound smarter if they go after certain things. Yeah. It's stupid. It's a dumb perspect. It should be here's the world through my eyes and everything is in the world. Traffic is in the world. If you have a traffic joke and it's actually legitimate. Like maybe you have a perspective on traffic that I've never heard before. Maybe your airline travel bit will be the airline travel bit that I really love. Cuz you know there's that's the problem with comics too is that when you're on the road too much, your experiences are very limited because all you're doing is performing in front of people, hanging out in the green room, going to dinner, flying in a airplane, staying in a hotel. So, how many comics have jokes about hotel rooms and you know they knock on the door even when the do not disturb is on, you're jerking off. Like, how many guys have done those jokes? Yes. But it's just cuz you you have a very limited experience to draw from. I actually I I started taking days off. Um and my wife and I will go on vacation somewhere. We'll do because it becomes where you're feeding on yourself. Like you you're only doing ABC D ABC and there's no life. And I'm like, what am I going to [ __ ] talk about? We get it. You were at New York airport. and it sucks. Yeah. So, I I I just wanted to do more life things. A cuz it's fun to do, but B, it's like just I allowed myself to cuz I'm like you could at least talk about it on stage. It's not you can't just talk about being a comic or your right I'm I'm almost too much talk about myself. Like I want to start talking about other things. I just feel like the only thing I'm really qualified to discuss in my own life, but I kind of want to talk about other [ __ ] too cuz like life is kind of stable now and it's I don't know what to do with that. I don't know how to handle, you know what I mean? And like not being out and being crazy and [ __ ] riding around for four hours a night with a piss cup in my car. I mean, it was just it was an ugly it was a [ __ ] ugly scene show. That's what I did when OA were kicked off the I would ride around and just [ __ ] just ride around for for for hours a night. Listen, I couldn't listen to any comedy. I couldn't because I was so in such a [ __ ] depression. I would put on sports radio 660. Uh Joe Beningo overnight. I don't know. Do you know who he is? No. He was a guy on 660 240 on the fan and he was a Jet fan and he was a [ __ ] maniac. But I would listen to him complain about the Jets and or Art Bell. I I fell in love with Art Bell. There he is right there. Ah, I didn't even notice that. Yeah, he's on the wall now. That's how I heard about Miokaku was from him. Um, and I tell you he lived in my building in New York. Yeah. So, I uh would listen to Art Bell and I would listen to Joe Baningo and just look at Hookers all night and uh I piss in a cup and I would [ __ ] ride around and it was just my my way of and go to bed, wake up maybe eight hours later and go do Tough Crowd when I was on. It was a very crazy [ __ ] time. Yeah. So, now when OA got pulled, that was a that was an interesting moment of censorship, right? Like that homeless guy came on and said terrible things about Condisa Rice and the Queen of No, that's the difference. We got fired was for Sex for Sam. That was uh 20 That was when someone had sex in a uh church. Yeah. You got points. That's right. That's right. That's right. But the company had signed off on the bit. Like I got why they were mad, but they had signed off. It was a sponsored bit. The company knew what was going on. So ONA could have survived that if the company didn't uh throw them under the bus, panic. And in fair, it's so much, it's so funny, like regular radio is what saved the career because when XM suspended the show for a month, we were on KRock at that time, right? And they kept us on for the month. So then eventually we came back to satellite a month later, but I think they would have one of those days. Yeah. Yeah. It's I'm I'm not doing radio now. It's the first time in 20 years. It's very strange. Wow. To uh to not have to be up. Um, I get up at like 9:00 now and just go to the gym, so I have some kind of schedule. But it's very weird after 20 years to be gone from that. Yeah, you've been on radio forever. It's been more than 20 years, hasn't it? Well, it was 20 on this run and like But well, the when did the O and start? OA I did in like 2001 2002. Okay. We got fired. Came back on October of04 and my contract expired the end of December Jan of 24. So it was about 22 years total. Every comic owes OA a debt of gratitude. All of us do. Without them, I don't think there would be podcasts. I think that was the real podcast because that was the first time we realized cuz O and A did the show with no structure. Whereas like I did Howard a bunch of times, but when you did Howard, you were a guest. They wanted stuff that you were going to talk about. They had questions for you. They had setups. You know, they were ready. And then a couple times I did Howard where you would write jokes for him. So you would sit there and there was an overhead projector. It was the Jackie chair when Jackie left, right? So they brought a bunch of us in and then Arty wound up doing it uh all the time. I couldn't do it. I just like it was too early in the morning. It was like I didn't want to live in New York, but I did it a bunch of times. But it was structured, you know, and Howard was always in control of it. And he's actually running the keys, you know, he's he's running the board, the soundboard. And you know, it was a very structured show. And you know that's how he did it forever. I get it. But the way O and A did it was so different. There was no structure. You'd go in there and you sit and just have fun. Yeah. And it was be Patrice and you and me and [ __ ] you know everybody would come in Voss and Bobby and all these different people would come in. Burr and you know I mean and it was some of the wildest moments ever like the baby bird that it's I'll never see anything crazier than that in my life. Never. Yeah. Yeah. He died recently, huh? Pat from Monaki. Yeah. Pataki. Pat Filman, I think his name was. Rest in peace, Pat from Munaki. That one thing that you did that one day was one of the most shocking things I've ever seen in my [ __ ] life. Yeah. It was uh Ari was there with me. Burr was there. And I remember it was my idea. I think it was right. Because, you know, I was doing Fear Factor at the time. I was used to people doing horrible [ __ ] And I was like, \"How about you lean your head over the garbage can and he throws up in your mouth.\" Yeah. And [ __ ] Pat Duffy was such a psycho. He was like, \"Okay, he would do anything. He brushed his teeth with cat shit.\" I I thought it was dog [ __ ] but you might be right. But I'm going to Pat D\n\n\nDuffy was a [ __ ] psycho. He was like a marine if interns had that. He was a seal. He was a seal. Fearless. He was funny. He didn't give a [ __ ]. He got it. He was great. He was great. He was the best like radio employee of all time. He really was. And that moment was the [ __ ] craziest thing I'd ever seen in my life. I couldn't believe it was happening. And the amount of vomit that was coming out of Pat's mouth when he was thrown into Pat Duffy's face and Pat was lying there with his mouth open letting, I mean, people at home listening to this, you know, come on. There's cell phone footage of this. Yes. From like a 2002 cell. There it is. 2007. Yeah. Was it 2007? Yeah. And because we're in KRock, that's the Krock studio right there. Look at. He throws up in his mouth. His mouth is wide open. It was so disgusting. And it kept coming. Yeah. Because Pat drank like some [ __ ] like 70s something things of eggnog. Like two gallons of eggnog. It was [ __ ] insane. And he had D. Oh, there it goes. There it goes. And it would just keep coming like you're like, \"No, it's over.\" And if you hear us in the studio, we're all screaming.\n[Applause]\nAnd he just keeps throwing up. You think it's over? You think it's over? Nope. He's got more. And at the end, I mean, it's cartoonish. It's like that scene in Stand by Me with the blueberry eating contest. Yes. Or in Monty Python. It keeps going. It keeps going. It doesn't end. He thinks it's over. Oh, it was [ __ ] absolutely completely insane. Do you ever see the meaning of life, Monty Python, when the guy want a waffer thin mint massure and he starts vomiting? Get me a bucket. I'm going to throw up. This what he reminds me of because he's not moving. He's standing there and his mouth opens and the vomit just shoot. Dude, usually you wretch and you move, but he just opened his mouth and it was like a button got pushed and a [ __ ]. It's the craziest [ __ ] thing I've ever seen in my life. Yeah. And if it wasn't There it is. Exactly. It's just like. But it's not. That's not even as extreme. No. Look how fat that guy is. I mean, it was just great. Insane. A wuffer thin mint. And you know that show having that kind of a format let us all realize how fun it is to just get comics together and just talk [ __ ]. Yeah. You know, and then when Anthony started doing Live from the Compound, when he did his own show, that was re and and then of course Tom Green show cuz Tom Green had his own show in his living room and I I was a guest on that too and I was like that really lit the light bulb in my head. Yeah. But when Anthony started doing his own show from his basement, I was like, why don't I do something like that, you know? I could see. And he had a professional setup. He had he had [ __ ] beer kegs and he had beer on tap and he was doing karaoke with a machine gun. Machine gun. I mean, just a psychopath singing, you light up my life with a [ __ ] AR-15. But he was having a good time. And I remember there the radio station was trying to get him to stop doing it. XM or Sirius or whoever it was was trying to get him to stop doing it. And he was like, \"But why? It's not radio.\" If anything, he's getting more people to watch the radio show. He would do it on weekends. It didn't interfere with the show. It was like he would just go and [ __ ] around. And that was back when we were on Pal Talk, too. Remember? Oh, god. Yeah. Yeah. The video would be on POW Talk cuz most people would only be watching or listening on radio, right? But then they would broadcast live on Pal cuz it was like so unheard of. Like nobody was doing that. That was how the Anthony Weiner dick photo got out really. That was from Opie and Anthony. That was we had Vincent Tenafhrio in studio and we had um Andrew Breitbart and uh cuz I had met Breartart doing Redeye on Fox. So they both came in and we were talking and the pal talk window was open and apparently I didn't like Andrew had the picture of Anthony Weiner's dick. So he showed us in studio. We just looked at it on the phone. I didn't, but apparently Anthony held it up to the pal talk window and showed them and somebody grabbed it. Oh, wow. And that was how that photo got out. Wow. Sirius XM and sticky situation. I want an investigation from Sirius into what the hell happened there. Breitbart says after he shows an X-rated picture to shock jocks Opie and Anthony who then share it on Twitter. Maybe one of the guys tweeted it too, but I it was one of the, but Breitbart got mad at me and he's like I was friends with Jim Norton and he told this to Elliot Spitzer on his show and he goes and he betrayed me. But I really didn't. It wasn't me. I was doing Tom Papa's [ __ ] podcast. So he thought you did it. He thought I set him up, but I really didn't. No. Um and I saw him years later in LA and we I explained it to him and he was very cool. I was happy cuz right before he died. So I always liked him. I was happy that we at least I got to tell him, \"Dude, that wasn't me at all.\" Did they whack him? Did they whack Andrew Breart? No, cuz they would have crashed the site. I mean, he was doing coke, right? Wasn't it an overdose or something? I think he had a heart attack. Oh, it was a heart attack. I thought it was I'm just starting rumors. He was doing coke, right? No, I don't remember. I mean, maybe he was doing coke, but I think it was a heart attack. I think there was a lot of suspicion that he might have got whacked really because Yeah, he was one of those guys that was, you know, exposing a lot of [ __ ]. Yeah, but they didn't, they didn't crash the site. Did the site change after he was gone? Wearing headphones. God damn it. It's just so. You just put them on. No wonder I was enjoying myself so much. Yeah, we did. When Liberace winks at me, Liberace got you to wear headphones. He sure did. I just noticed that you were wearing them. Yeah, I didn't notice either, but when Liberace wings, you have to hear it in both ears. Yeah, there was some, there was some speculation that he got whacked. But whenever anybody dies, there's speculation they got whacked. Yeah, I didn't, I didn't know that. Um, but I felt bad about that. Collapsed on the street near his home. Collapsed on the street near his home. Hypertrophic cardio myopathy. Focal coronary arthuroscllerosis. Died from congest congestive heart failure which had been diagnosed the year before. Oh, so he had a heart attack. Okay. Yeah. Well, I mean, when you're running a site like that, I mean, imagine the stress. It's constant. Yeah. And then, you know, you're also like your your business is exposing people politically and opening up yourself to potential assassination. Well, who do you think put up the Opian Anthony homeless Charlie audio? Oh, he did. It was Andrew Breart. It was before I knew him, but that that's where it went up on Breitbart and the headline was, \"Will this crash? Will this stop the merger between Sirius and XM?\" Wow. So that was why they reacted because they were afraid. I think people in regular radio wanted to stop that merger. Oh, 100%. So they uh radio was terrified of SiriusXM. They were terrified of it. And I think so I think they pushed that story hoping that it would [ __ ] tank the merger, which of course it did not. Do you remember those days when you first went over there? It was so crazy because we could talk like we could talk in the green room. Yeah. We could swear. We'd call someone a [ __ ]. You could say anything you want. It was crazy. They never, I'll tell you one thing that's seriously, even though I didn't like the way the contra way my time there ended. I I wish that was handled a little bit better. But I guess everybody who leaves a gig wishes things were handled differently. They never once [ __ ] with me about content. I'll say that for them. They never came to me and goes, \"Hey man, we that thing you talked about, could you not, could you back off?\" Even long into where everybody was getting canceled and in trouble, Sirius never came and and asked me not to say something. Um, uh, Jim Mccclure, who ran the channel, never broke my balls about jokes we did or a stance we would take. Like, they kind of let that go. Well, they had a crazy situation where they, you knew that one person was getting insane amounts of money. Yes. Howard Stern and everybody else was getting very little. It was real weird. It was, you know, because it was very open that Howard was getting all that money, which obviously he was the reason why everybody went over there in the first place. Yeah. He, he get, it was, it was serious and we were at XM and he was at serious and that was the giant get was Howard going over. Also, there's also the thing that if he leaves, the stock collapses, especially now, yeah, you know, I mean, if if you don't have Howard Stern anymore, what do you got? What do you have that's not available for free? Yeah, I sold my serious stock, so whatever happens, I, I did, I was happy it spiked up to like seven and I [ __ ] dumped. Were you allowed to sell while you were working there or did you have to wait till you weren't working there? Nobody car, nobody asked, they didn't. Did you use stock or you bought? No, I bought, I bought it, I bought it years before when I thought they're going to go bankrupt. Um, we, we bought a little bit, but I was, that's what I told about the lawsuits when I was getting sued, so I didn't buy as much cuz I was paying for [ __ ] lawyers. Um, but yeah, they tried to cut me like an unreasonable amount and so we were still negotiating and then they just go, \"Oh yeah, we're not going to renew.\" They waited till Christmas break and they we're not going to renew. So I was like, \"All right, I guess I get why they did that.\" But, but it's got to be weird when you're over there and you know that Stern is getting hundreds of millions of dollars and everybody else is like, you know, they're just pinching pennies with people. I never minded that and really didn't care because I only cared about what I was getting. And when I saw what they gave certain podcasters that went over there, I'm like, \"Okay, they do have the money. So if they're choosing not to give it to me, Yeah. I have to just accept that.\" Like, you know what I mean? Like, I never knew what Opie and Anthony made. I still to this day don't know what their salary was. I never asked. Great. I begrudg those guys. I never gave a [ __ ] like, you know, they were the brand Opie Anthony. It was like they took me in. So I never care what they got. I never felt entitled to their money and I never asked what they made. Even when me and Opie did a show, I never said what's he making? Like they gave me a raise, but I didn't, I don't look at money like that, like where I have to know what you're because it's like that's not my. That's good. That's a healthy way to look at it. Yeah. So, whatever Howard made, I'm sure some of it was inflated, but like, oh, he made a lot of [ __ ] money. He did, man. He made a lot of [ __ ] money. But, but again, if he's not there, how are you selling it? If he's not there, what are you, what are you selling that's not available for free everywhere? That's why I was like bummed about the way it happened. I'm like, cuz we did a talk show. Maybe they were just like, ah, we can put more money into the rest of the channel if Jim go, whatever. I'm glad I'm doing a podcast. Like, I haven't noticed any change in my life, which is great. Uh, cuz I'm on the road. We're making, you know, I'm making money on the road, but it's weird not having it. It's weird. It's weird not knowing that it's there. Right. Right. Right. Like, it hasn't affected anything, but the knowledge that that income was going to be there is gone. So, it's a kind of a weird naked feeling. Does it make you more motivated to do stuff though to like to get your own thing going on in the, I'm on the road more now. Like, I'm doing extra road work. And the special was one of those things where I wanted to do one anyway, but it mo, like I shot it in November and before we even came back from break, I had my channel set up. I had already started doing episodes. Um, I was like, \"Fuck this. I'm not sitting and waiting. It's not going to take me a year. I'm just going to get up and if it takes me a year to get moving, fine. But I'm going to start now.\" What is Sam doing these days? He's doing the show. They gave him the show. Oh, so he still has the show and they got rid of you? Yes. Whoa. Well, I mean, I kind of saw that coming. I used to Yeah. I mean, I, I almost because they had\n\n\nCut me the year before a little bit, but again, I'm not unreasonable. I'm not an idiot. People take cuts.\nOh, they cut your money.\nYes. By 10%. But I'm like, you know what? It's still good money. My wife had just come to the States. I'm like, I want to make sure I have money for lawyers, whatever. And then I told my manager, they're going to cut me by this much guaranteed. And they almost to the dollar offered me what I predicted. So we pushed back and tried to negotiate, and they acted like they were negotiating. Then the day of Christmas break, like we were off the air for two weeks, I got the call like, \"Yeah, we're not going to.\" So they were just kind of, I think, keeping it going until that. But I don't, I don't have any bad. I truly don't. Like they bought me two apartments. I had a great life there. I broadcasted for 20 years. Like it's time to move on anyway.\nYeah. And I was telling you a long time ago that you could be doing better on the internet anyway by your own. I think you, I remember, I remember you talking to me, I mean, 2017, around even before then about podcast. I wasn't allowed to podcast because of my, uh, my contract. They wouldn't allow it, and I think that was one of the sticking points with this one. I was like, I have to be able to do my own podcast, especially if I'm taking a cut.\nUm, and I'll just eat shit for a while until it gets where I want it to go.\nYeah, you have to be able to be your own boss in this day and age. It's just, it's not, it's, and also the, the, as big as Sirius XM was, it's just not that anymore, you know? It's just not what it used to be. Like if, if I didn't have a podcast and during the Opie and Anthony days when it was in its height, if they offered me a show, I've been like, whoa, okay, that would have made sense. But now I'd be like, \"What am I, what that, unless I wanted to do kind of what Howard's done, just make a ton of money and kind of like slip away, which is really what I kind of tried to do with with Spotify. I was hoping that Spotify was going to make me like 10% less famous.\" That was like the idea behind it. Yeah. I was like, \"Give me money. Give me money. I want to be more famous. I don't need that.\"\nJust give me the money. But, you know, if\nBut nowadays, it's like there's just not enough people listening. And I know they own Pandora now, too. So, they've made a bunch of deals with podcasters because I think they're going to try to get people to listen to Pandora and do it that way. But\nyou're Stitcher. I think they do, too.\nStitcher. Yep. I used, we used to be on Stitcher, too. But that's the thing. It's like the internet is just too, there's so many more people that are listening to all these other platforms. Spotify, YouTube. There's just, it's just too enormous. It's too big to ignore.\nIt is. It is. is, and it's like I think that they kind of, they handled podcasting in a way that terrestrial radio handled satellite, which was, ah, you know, it's not a big deal and then get involved with it or somehow embrace it, but a little bit later in the in the game, too late.\nYeah. But I mean, they have some big podcasts. I mean, like, again, I don't think\nthey have Call Her Daddy now.\nThey do. And when I knew, realized the money they gave her, again, I don't begrudge her at all. Like whatever you make, you make, and it's got nothing to do with my salary, but I realized they do have the money. So, if they're choosing not to, I have to just accept that.\nBut you got to wonder if that's a good idea for her.\nBut she's still on Spotify, though.\nI don't know. Is she? I don't know.\nYeah. Isn't she? She is, right? Yeah. I think she's still everywhere else, too.\nYeah.\nWhich is makes it a good idea. The thing is, if they limit your distribution, that's what makes it a bad idea. Like one of the new things that we did with this new deal with Spotify, and they were actually into it, was put it everywhere.\nYou know, not just beyond Spotify, but also go back on YouTube, back on Apple, back everywhere, which was made me very happy. Like it should be everywhere.\nYes.\nYou know, because you want people to know, just to stumble on it or to go, I heard this thing about about this thing today. I want to go look at it right now.\nThey don't have to sign up for something, enter the fucking email.\nExactly.\nGive your credit card. Um, yeah. It's kind of silly.\nAnd some people just get accustomed to using certain platforms. Like for me, forever all I listen to is Apple podcasts.\nYou know, the podcast app on Apple. It's simple. I'd like download whatever the fucking shows I wanted to listen to and I would get it that way. I don't want to have to change. I don't want to have to look around, you know? It's just one of those things people get accustomed to getting things in a certain way.\nIt's right. It's there.\nYeah. Yeah. It's great to see, too, like, like, uh, I don't know if Schultz, I'm sure he does get the credit, but like Dane Cook deserves a lot of credit because of the, the social media. Oh yeah.\nUm, and I think Dane Cook history has kind of forgotten about what, like he did a lot to change the way we promote.\n100%.\nAnd then Schultz, that that fucking thing of just turn your phone this way now, like holy fuck, like it revolutionized the way comedians put out clips, and it's like, I mean,\nwell, what he did was do, he, he capitalized on co in the best possible way. He came up with a, a different sty. He's so smart. He thought of a different style of com because there was a lot of people during co that were doing like late night talk show monologues, uh, on the internet, and they were terrible. Terrible\nbecause there was no audience audience. But what Schultz did was he made up for the fact there wasn't any audience with visuals and rapid fire punchlines. That's right.\nAnd he did it differently than he does his standup. Like his standup, he'll say something really funny and let it sit. So it's even funnier, like it builds, you know, and he'll look at you like what, you know, it'll hold the laugh. Yes. Whereas in this Netflix or in the, the, you know, it was on Netflix as well, but when he was doing the sideways thing,\nit was just rapid fire and it, he's more than a this and a that and a that and a this and a photograph of the thing, and you'd watch and you go, hilarious.\nDifferent than standup.\nYes. And everybody was sharing it. It was a genius approach to a genre instead of trying to apply standup style comedy and monologues to, you know, your Instagram. He did a whole new thing.\nYeah. And his standup is funny. He did something on on jokes that only work in Hawaii, and I was, it's in an arena and he's murdering the way you murder in a club. But it's like they're all new jokes just for, and it was like, god damn. It's really funny.\nHe does that everywhere he goes. He did that in Abu Dhabi\nor Dubai. Yeah, in Dubai. He had jokes only about Dubai, about, you know, about on hookers. It was like,\n\"Oh, that's so awesome. It's my life.\"\nBut I was happy to see somebody doing something really, uh, creative as opposed to blinking their way through Chip Chipper on a TBS show.\nWe do what we have to to survive.\nDon't fuck on Chip.\nI love Chip.\nI love Chip, too.\nI, I love the fact that that's your, your closet character when you put the wig on and the glasses. You understand it's the bane of my ex. I can't do anything without being called a sock cucka peek a kissa in the in the live chat today. It's all Chip. Hey, when's Chip coming back? Chip is better. It's all, people love and hate Chip.\nI love Chip. I love Chip. Yeah, it's uh, Stamp is such a weird thing. It is. It really is.\nI might do it again. I miss doing it. Like when Anthony would come on, it was the like the best. We did a few live, did three live shows with it, and it was amazing. There were theater shows and the crowds loved it.\nIt's sold better than I do, which is absolutely humiliating. I sold tickets faster as Chip than Jim Norton. Jim Norton, there's still a giant curtain. Chip sold out. Uh, but I do miss doing it, but I don't miss getting guests. Like, I Now I have one podcast to do. I love doing it, but I still hate saying, \"Hey, could you film?\" Like, I hate\nDid you do it all yourself? Is that what you, the way you did it? Reach out to people.\nYeah, I had a, my co-host, uh, my, my the co-host I was using most recently was Zia, and she was great. And she would do like a lot of the behind the-scenes work for me, and she would, you know, uh, help reach out to people and coordinate, but I ultimately had to ask. It was like one of those things if I wanted a comedian on one time, uh, Nick Depollo came on and he was sitting across, and this was what Chip would gave us all sailor hats and we're all wearing sailor hats, and I remember call him Chip.\nI have to, I can't say me. I, I can't, I can't face it. It's like Ted Bundy would talk about himself in the third person. Why? Cuz he's not proud of it. So I, I would, we, we had on these sailor hats, and I remember Nick was talking to me and we were having fun, but it was the way he was like looking, like he was looking at Jim as he was talking, and he didn't see, he played along, but I was like, ah, that's like, yeah, I just had Nick stare at me and I knew he was seeing his friend Jim\nwith a wig on in a wig and glasses, but I do miss it made me laugh um to do it, but people would just be too annoying about, like, get this gu, get that guy. They would complain. It's like, oh, I made zero money doing it.\nAnd here's why. I made it on YouTube because I didn't realize that I shouldn't have had the word in the theme song.\nI'm so Jamie Jaster from hate sang the theme song. And it was Chip has a but like literally that automatically you for monetization, right?\nAnd I had no idea. So all of my episodes had in the first 5 seconds. I never made any money doing, a few hundred bucks on a read here and there, but it was, it was a labor of love. It was one of those things that you\nYou could bring it back with a new theme song.\nI could, or I did change it at one point. I, I changed it.\nUm, I took out.\nChange it. People love Chip.\nPut gosh darn. It was like some obvious uh, that's even better.\nSome awful edit that went in.\nBut it's like when am I going to do it? Where am I going to do, once mine gets up and like mine's been up for a few months. I love doing it. We do callers, which I like the live interaction. It's like when you do radio, it's hard to not feel like anybody is listening\nin the moment, you know?\nUm, and it takes you in weird directions. Like people will call up with legit everyone, like some comics, like ah, but then as soon as somebody goes, what do you think about this, and they're talking about wanting to commit suicide or they're talking about, it becomes interesting because people, like everyone wants to give advice.\nRight. Right. Right. Yeah.\nSo I like, I like knowing that something alive will take you into a different direction than we would have gone in.\nYeah. Oh yeah. For sure. Yeah. There's something to that. Yeah, there's definitely something to that, but there's that, you know, there's also something. It's like it becomes very chaotic because people are calling in just to with you. And I've surprisingly had very little of that. We, I mean, again, I'm always with coming from OA, like nothing is too much at this point because you become so used to right\ncraziness and people and death threats and the. I still use a fake name at the seller because I would get death threats like that. There was a couple of them that actually concerned me because people were using their real names. I'm like, if a guy is threatening to kill you with his real name attached to it, like, he's he's a problem.\nWhat was it over?\nWhat? There was one time Anthony had said something and the guy thought I said it. Um, and the guy said something about, \"I'm going to kill you.\" I don't remember what it was, but it was, it was the tone he said it. I'm like, \"That feels different than anything anyone's ever said to me.\" Plus, again, last time we talked about the lawyer um, who hadn't committed a murder at that point, but I still knew he was crazy. And I would get, I have a hate mail file and I used to argue with them.\nOh boy.\nBack and forth like a dummy. Uh, but people would tell me, \"Watch your back. I know where you live. I'm going to shoot you.\" And then I would see a real name signed to it.\nAnd I'm like, \"Yeah, that guy's mentally ill.\"\nA lot of those out there.\nYeah, there are a lot.\nSo I started doing the, I at the comedy seller, I would always use\n\n\nNames from the JFK assassination, like David Ferry, was appearing. It was never Oswald Kennedy. I wasn't that on the nose, but it was him. Was it, was you know, uh, Clay Shaw? It was just all these weird people from the, from the uh, Kennedy assassination.\n\nAli Wong used to have to do that at the comedy store. Um, because he was famous, right? Was she a stalker? Yeah, she'd get stalkers. There was this one crazy guy that kept showing up. But, you know, I guess stalkers for a woman are even more creepy. Much more terrifying for a woman. And it's like, there's got to be a way, like in Black Mirror, there's one thing you, they had a thing where you could block people from seeing you. And again, it's a futuristic thing, but the, the, the penalty for stalking should be so severe because the, the way they allow someone to ruin someone else's life.\n\nYeah. Uh, it's crazy that they haven't figured out something where when you're convicted of stalking, you should be forced to have something in your phone or some type of a monitor bracelet that alerts the other person. It drives me crazy. There's nothing I hate more than some creep stalker, but I guess I've dealt with it. So, again, it's very creepy for women. Way more creepy for women, you know, and they get a lot more of them. They get a lot, a lot of guys get obsessed.\n\nYeah, because I don't get stalked. No women, I'm not interesting to stalk because I you. You want to stalk me, just show up and have a nice tit. I mean, you got me. But I, I did one stalker, which was great. Turned out to be, oh, no. Yeah, it was a bad move. Uh, and I, and I was bad in bed. I couldn't keep it up. I was just, it was, it was during, during the lawsuit. It was a really bad time for me and I, I kind of felt badly. She thought I didn't like her, but I was just, but anyway, for two years it was phone stalking, and it was not scary like it would be for a woman, just annoying, but it becomes a part of your life, like you become, like this is with the old iPhones. So I would always get these, I would leave LA on a red eye, and I would land and my, my iPhone would be filled with voice messages. Oh boy. About, you know, what Jim and just, you know, what a piece of I was and a bad guy. So, like she used to think I was talking to her on the radio, like, oh, she was schizophrenic.\n\nI don't know. Um, we would talk dirty a lot and I, and I, and, and you know, and credit where it's due. Um, did good dirty talk. Oh, you have no idea. The crazy ones are the best. They anticipate exactly what you need right before you get there. Oh, psychotic and erotic. They're real close. It really is because there's something about the inhibitions, um, being lowered and you know, the cuck talk, I always like that, not as much now because again, I'm married, but I always enjoyed good cuck talk would always make me very happy and I get why guys wouldn't like that, but it would make me crazy.\n\nIt's so weird what people like, like the on the chest thing, like influencers get paid to go to Dubai a lot of money and those guys will on them. Wait, they on the influencer? The influence shits on them. They on the influencer. Real? I can see that. Yeah. Yeah. Like hot girls, hot girls go over there and they can make half a million dollars and a guy can on for a weekend. That's so, that's crazy. Yeah. Like just, I guess that feels, probably more than that. I mean, if you're thinking about people that have insane amounts of money, you know, you're dealing with like oil money. These guys, like, you know, we talk about the richest people in the world. Like Elon Musk is the richest man in the world. Well, he's the richest public man in the world. I mean, I'm not saying he's not insanely rich. He's worth 200 something billion dollars, but that's nothing compared to these royal families, right? These oil families, they probably have trillions. They probably have trillions of dollars, but it's not public. They don't have to disclose how much money they have. Whereas in America, like wealthy people that are like on the, on the legit and the up and up, you, you know, everybody knows what your net worth is. Everybody knows how much you have, but to pay somebody. See, I thought you meant to get on, but to on an influencer, I've seen a few Tik Toks where I'm like, I'd give her a thousand if she let me take a dump on her. She was annoying. She was annoying. I think that's what they do. That's great. I mean, this is, people have talked about it openly. Girls have talked on some of those weird podcasts. Girls have talked about how they go over there and, you know, they make hundreds of thousands of dollars and, you know, it's only like 20 minutes of their time. They just lay there. Some guy shits on them. Everybody cheers. That's, oh, there's a group of people watching. Bunch of guys. Your boys are there and you on her. An influencer cuz you, she probably said something you didn't like. Or you just want to on a hot girl's tits. That, I mean, that would do nothing for me and I'm a pervert. But I think it's like a humiliation thing. They want to humiliate people and they want to know that they have so much money that they can get you to submit to this willingly.\n\nDude, I've seen the humiliation look every time I someone. I know what that look is. It is a weird desire to want to on somebody. It, it is because it's so not sexual. Like it's weirdly punishing or like the, like, and again, being dirty is, I'm not saying having the fetish is wrong cuz I'm pissed on, like, whatever. I mean, a lot. I've done a lot. I've tried it and I don't even know what I liked about it. I, I don't know what I liked about it. Was it because it's naughty. It was intimate and naughty. It was private. Intimate and private. Intimate and naughty. Yeah. And I think, well, that's you're getting pissed on. Whereas like if you're having someone lay there while you on them, that is like just an ultimate expression of the, the power of money.\n\nI suppose it is. I just don't understand the desire. There's like, there's so many things I would love to do if people would let me do them for money, but not on them. Like that would just be so, like my shits are horrendous. Like I'd be embarrassed. And I know, and you want to make sure you get at the proper time cuz you can't really time your shits. No, but again, if you have enough money to bring her over and on her, you have enough money to keep her on hold. Like, you know, she's not going to tell you I'm busy. I'm drinking coffee. I'm having a cold, bro. I'll be like, I'm smoking cigarettes, drinking coffee, brewing up a good one for you.\n\nI have not heard that. I have, I know that people get sent over there and they. I actually want to go to Dubai. Like, it's the one of the few places. Beautiful. Have you been to the Burge? No, I, I haven't been to that, but I've been to Dubai. I, I was in Dubai once because they had the weigh-ins there for the UFC and it's like everywhere you look, it's like Rolls-Royce, Ferrari, Lamborghini, like there, the amount of money there was preposterous and this was quite a long time ago. This was like 2007, I believe. That's probably before the Burge was built. Was it, was the Burge? I don't think, no, I don't think it was there. So, what I had seen is just like what was there then and just the obscene amount of wealth. I mean, it's really like shocking. Yeah. I want to go just to go out because I'm afraid of heights. So like I want to go into that, uh, that, that, that observation deck on top. The one that Tom floors, is it? I want to say it's like 120 or something. It's, it's crazy. Uh, it's 3,000 ft. The uh, the tower, I think it's the tallest structure in the world. And there's a few people who have sat in that, like there's, you see that picture of Tom Cruise, who is batshit crazy. Like he actually jumped out the window of that thing for real.\n\nDo you ever see footage of him training for that Mission Impossible? He jumped out the window. He jumped out the window strapped in. And I've seen footage of him like taken by people on the observation deck of Tom Cruise hanging out on the outside of the Burge tower and there's a picture of him sitting on the very, very top. It's 3,000 ft and his feet are just hanging off in a helicopter is circling. He was the first guy. Harnessed or anything? He's probably harnessed on his back somehow. What is this for a Mission Impossible? One of the Mission Impossibles. But yeah, that's, oh my god, like he's in space. Um, oh my god, look how tall that is. He's running. It's the craziest thing I've ever seen. He's a maniac. The fact that he's still doing these stunts and he's 62 years old. Do you see what he did at the last Mission Impossible? He jumped in a flaming parachute, ripped the parachute off, and then opened up the second parachute. And you know, I mean, there's no backup parachute for the second parachute. He's doing this for a movie. If I met, I've never met Tom Cruise. If I ever imagine, all I want to ask him is how do you get insurance companies to agree to let you do this? Like I can't imagine him. He was running down the, the face of the T. And some of it was shot in CGI, but that's legit. Like that was real. Yeah. Here it is. Look at this. So he's, he jumps out in a flaming parachute. And this is all planned out. I mean, they douse the parachute with gasoline. Jumps. They light it on fire. Look at that. He did 16 times. 16 times. Oh my god. So he has to cut it loose and then he has to open up his secondary parachute. Is there, you wonder, is there a kill switch that if, like, like if you're pushing a clamp and you can't get the clamp off? No, he's. Like if he can't cut loose, he's. And if his second parachute doesn't work, he's double. Yeah, I heard him say sort of like he figures out something crazy he hasn't done and then just goes through all the processes of like, how do you learn how to do this? Yeah, he learned how to fly helicopters for one of the stunts. So like one of the stunts where they're, they're bombing through the canyons. He was actually flying the helicopter. He wanted to make it really obvious that it was him flying that helicopter and he, and the side of the, I've seen him talk about like being on the side of the plane that took off when he was hanging off the plane. But you wonder like, what, what is it in you that, like, what kind of a rush when you're not working? What do you do to, you know, like, Cowboy Serani will fly a plane and then cut the engine and fall because he needs that, he's crazy and he's dopamine. What do you do to match this in your real life? This is the new one. The new plane thing. He's done a couple of different plane ones. This is just one of them. Oh. Oh, you see the string there. Yeah. Yeah. But they edit all that in the movie, right? What if the string breaks? Yeah. What if the string breaks? That's right. You can only have so much faith, right? In. Also, what if he gets hit by a bird right here and gets KO'ed? Ah, or falls back and bangs his head on the side of the. Well, this is a thing that's only for these Mission Impossible movies. But, by the way, he's been doing these Mission Impossible movies forever. I was listening to an EPMD song the other day and in the thing it's like Mission Impossible, not Tom Cruise. Like, they were joking around about Tom Cruise being in Mission Impossible in an EPMD song from like what year was that? Oh, EPM, you know, EPMD the rappers. 97. 97. Do I not know that? That was his first Mission Impossible movie. I mean, that's when the Lyric came out. That's the song's called The Joint. That's the where it's in, I guess. What, what year was the first Tom Cruise Mission Impossible movie at the same time? Maybe even 96, 95 if they were writing about. Wow. That's wild. That is wild. So, he's been basically doing Mission Impossible for 30 years. He's 62 now. Yeah. Crazy. But he doesn't do that in the other movies he does. Well, some of them. Does he, does he do crazy stunts in all of his movies? What about that? You mean the one, the live, die, repeat? That's. Yeah. Was he doing stunts in those? Not, I mean, I don't know exactly how many of them he did, but he did the, uh, the thing I was trying to think of too. Yeah. And he also broke his ankle. He was jumping from one building to another and destroyed his ankle. He destroyed, but he actually limped and tried to finish the shot. Like what a. Finished the shot. Yeah. It's, it's insane. You see his ankle collapse when he hits the wall. Yeah. He's a.\n\n\nNut, man. Like a real nut. It's like when you look. You ever watch old Buster Keaton footage? Oh yeah, the crazy [__] that he would do. The train or the building. How many Mission Impossible movies are there? I think there's 11. Is there 11? I thought it was like seven or eight. Seven. Yeah, seven. Yeah. So, and it all started in '96. Is that what you said? Mhm. Jesus Christ. That guy's been in some [__] banger movies. Scientology works for some people. It's It's It's interesting that he wants to do all of his own stuff. The firm I just rewatched. It's funny. I hated the music in the firm so much it took me out of it. But that's a pretty that's a great film. Gene Hackman was great in that. Oh yeah. Yeah. What a shame he died, man. I He's one guy I never met that I wanted to meet. Gene. Yeah, I would have liked to have met him, too. Oh, is he [__] He died bad, though. He did, but he died kind of the way you want to die, just alone and home. And well, died. His wife died first, they'd think. Yes. And he he had dementia, I think. Yeah. So, I don't even know if he knew she was dead. They say he might have just been wandering. Maybe he just wandered around hungry. Oh boy. I know. Doesn't matter who you are. O. Yeah. When when your body stops working, it doesn't matter how many [__] people love you. It's over. Brando was like that. Like I I I I love because he was just so difficult. Like you got to love a guy who's so good at something that people tolerated. He was such a nut. He bought an island and moved there. I just he would never acknowledge being a good actor. Like you I always interview with Connie Chung and she's like, \"You're a great actor.\" And his dog is there. He goes, \"He's a better actor. He acts like he loves me cuz he wants food. I'm like, what a what a great [__] what a great what a But he meant it. Like you knew he wasn't like some [__] douchy poser. Like he was really this guy. Well, that's why he was so good. But he was also good before anybody was good. He was the first actor that was like acting like a real person. Yes. In movies. Whereas like every other actor was like, \"Hey, stay away from my girl.\" See, I can't watch old stuff. And look, I'll acknowledge I stink. I know I stink. So, I can't judge other people's. I'm not going to judge James Cagney or [__] Humphrey. Cagney is a good example. But you watch them and you're like, they were so like Victor Mature. Tommy, why don't you cut it out, Tommy? Yeah. And then you see Brando, I can't watch the old stuff. It's just it's theater acting or something, right? He was the first guy that figured out how to be real in a film. And James Dean did it as well. And then a bunch of other people. Now, you know, there's a lot of people that do it, but nobody had figured it out. But again, it goes back to that thing where this was a completely new medium, right? Like it didn't really exist before him. You know, he was like one of the very first movie stars that figured out how to do it correctly, but there weren't a lot of wasn't a long history of movie stars. It was a fairly new thing. Yes. And I've seen footage of his uh his screen test for Streetcar Named Desire and like you Stanley walks into the kitchen and he's just talking and he's talking to Stella. Not it might have been Stella and he's just moving and grabbing stuff and you're watching him and you're like I would never have the confidence in to to just touch and Oh, I want to see that behave. Can you find that screen test from Street Car Named Desire? Is that it right there? Hey, let's listen. Oh, we got headphones again, Jim. Yes. Will you do that for me? And this is even different than what I was think. The one I think it was in the kitchen. Maybe it's part of the same one. Here he's just putting a cigarette out in a [__] bottle. No, hold on. Go back to that. Yeah. Action. Watch out. The plaster crack. All right, you cut out the cat in there. Well, you can't hear us. Well, you can hear me. I told you to hush up. Cut it. Print it. That's all. Oh, so this is actually real footage though. Yeah. And this is different than the one. But it's it's interesting to see. These are out takes action. You can hear the camera. Yeah. But even the way she's looking at him looks old school compared to what he's doing. Right. She's looking at him in a very strange way that doesn't feel like Right. It doesn't feel real. It feels like she knows she's in a movie. Yeah. You're a good-looking guy back then, too. Oh, he was a [__] what a [__] machine. He [__] them all, too. And then he just he didn't like the fact that he's good-looking, so he became a blimp. Just ate ice cream. How do you not love that guy? He got so big during Apocalypse Now, they had a film in the shadows. And he wouldn't acknowledge that cuz they were trying to make it like Curts had gotten fat and like was living the life of and he wouldn't do it. Yeah. Just sat there in the shadows. Yeah. What a [__] nut. But, you know, again, it's just there wasn't a lot of people like that. I mean I mean how do you not go crazy? He's the only guy and I can't watch Shakespeare. I mean I know he is the greatest. I just can't watch him. And I watched him doing I think he played Mark Anthony or Julius Caesar and watching him do Shakespeare it like you felt like he's really saying these like you know what I mean? It always feels so British you know what the window break. It just doesn't feel connected to the person. And I watched him I'm like this is like a real guy actually saying this. Yeah. So, he's the only person I've ever been to watch do Shakespeare. Yeah. There's an art. There's a real art to acting when it's just done badly so often that we hate most actors. Yeah. And it's hard to do. And I I again I I there's very few things I give my credit self credit for, but I do give myself credit for recognizing my limitations. Yeah. In that area. Um it's been easy to recognize and people have pointed it out, but I understand it. It's also not an area that you really concentrated on, nor were you drawn to it. You're right. So, when you're doing it, you're like, \"How am I doing this?\" It's like if you get Tom Hanks to do standup and when he did Punchline, it was [__] terrible. Why? Because he wasn't really doing standup. You know, he's an actor, but if you wanted to be an actor, if that was your thing, you'd probably be great at it. Do you know who was I saw they were shooting some of the uh Will Arnett? I think Bradley Cooper just directed a movie at the comedy seller. Is that him doing Shakespeare? 29 years old here. 29. He's 29. 53. The noble Brutus hath told you Caesar was ambitious. If it was so, it was a grievous fault. And grievously have Caesar answered it. Here on the leave of Brutus and the rest, for Brutus is an honorable man. So are they all all honorable men. Come I to speak in Caesar's funeral. He was my friend, faithful and just to me. But Brutus says he was ambitious, and Brutus is an honorable man. He hath brought many captives home to Rome, whose ransoms did the general coppers spill. Did this and Caesar seem ambitious? When did the poor have cried? Caesar hath wept. Ambition should be made of sterner stuff. Yet Brutus says he was ambitious. And Brutus is an honorable man. You all did see that on the loop cali thrice presented him a kingly crown which he did thrice refuse. Was this ambition? Yet Brutus says he was ambitious and sure he is an honorable man. I still don't know what the [__] he's talking about. Yeah, I don't know either, but I believe in him. It's powerful. He's locked in. He's locked in, man. And he's he's really He understands what he's saying. Yeah. He understands the words. He's He's living the words. It's in his head. He believes it when he's saying it. And that's the that's like the Daniel D. Lewis thing. Like when he's playing that crazy guy and There Will Be Blood. Oh, he believes it. I drank your milk. Like it's real. Well, when he's in, he's locked in. Craziest part of that movie is when he's sitting there with the kid and he's petting the boy's head at one point. Supposed to be his son. Yeah. And I'm like, as an actor to touch a kid, like even though you're acting, he was petting this boy like the way you would pet your son. like like it was like he's so comfortable and so in this that you really believe this is his son. It was that was that stuck out for me like the level of comfort you need on a set to do that cuz I've been on a set with a kid there everybody's like make sure you don't curse make and this guy didn't give a [__] He just picks the kid up and starts petting his head. Well, he's got to be that guy. And you know he would be he's a method guy so he'd be that guy for months. Have you met him? No. No, I haven't either. Gary man I like a lot. I which is not exactly a stretch. Gary Oldman, I think, is one of the most uh versatile. Have you seen Slow Horses? No. It's an Apple show. It's really good. It's a spy show. He plays a spy. Oldman or Daniel? Oldman. It's a new show. Oh, no. It's really good. I haven't watched anything on Apple. Like I I I tried to watch the morning show, but I didn't love it. Did you see Severance? Severance is great. Season one I loved. Yeah, season two got a little weird. It got it almost got a little weird like the way Lost did where they were doing things to serve the kind of show that they were but I didn't I'm like what does this mean? Like this is just crazy and weird but they're just doing it like to be again I I watched it and I probably will watch season 3. Uh but season one I liked more. Yeah, season one was better. I think there's some shows like that where they the concept is so out there it really has like a finite amount of time where you're allowed to like maintain that. Yes. And then it just becomes we have to get to season again. Like I said, Lost, Lost. Yeah, Lost is the best example because first season it was [__] great. It was. And the backstory telling like I I look at the writing of that and again it was TV. They only had a certain amount of uh leeway they could do. I their backstory stuff was great. The writing on you know John Lock and on on Kate and all these people these the way they would tie in their backstories I thought was brilliant but then the way they ended I was like [__] You know everyone complained about it but I'm like they missed what they should have. You know what's a great [__] story or a great show rather? Mobland. Have you seen Mob Land on Paramount? Who is re somebody? It was either Colin or Bobby was recommending Mob Land. It's [__] great. Is it? It's [__] great. It's a Guy Richie show. It's [__] great. Tom Hardy. Ah, Pierce Pice Bronson plays the old mobster. He's [__] amazing in it. You know, you think of Piers Broen, you think like a kind of a campy James Bond. Not in this [__] movie. Really? He plays a maniac. Like a stone cold maniac. And it's great. Did you see footage of Tom Hardy? I just saw footage of him like uh submitting someone. Oh yeah, he's good. Black belt, right? No, no, no, he's not a black belt. I think he might be a purple belt. Is he a purple belt or is he a blue belt? He competes though. I know. I just saw footage of him. But he's all [__] up now. His neck's [__] up. His knees are [__] up. Purple belt. Purple belt. He's legit, man. Yeah, he's legit. I've I've watched him compete. Yeah. I was like, \"Okay.\" And like Zuckerberg, Zuckerberg's legit. He's real. He gets in tournaments. He He's very competitive guy. For a guy who's worth $200 billion, it's kind of crazy to enter into a local jiu-jitsu match and, you know, risk getting spiked on your head by a plumber. You know, some [__] some plumber who's also a blue belt [__] you know, suplexes you on your skull and he recognizes you and his [__] account just got banned. Yeah. Yeah. Yeah. Yeah. Yeah. He's been posting queueing on memes and then he sees you and he think it's destiny and by the way he wear a he wore a mask up until the time he's about to compete so they don't know they're going to compete with Zuckerberg until he's in there with them which is really a mind it's kind of a huge disadvantage to the opponent you like\n\n\nWhat, especially if you've never been around a famous person before, and now all of a sudden you have, and you're also an amateur, cuz he's an amateur, yeah. So you're all like, \"What?\" You're probably like blown away, maybe the first time you've ever competed, too, and you're competing against Zuckerberg.\n\nIt, it's a... but he's... he's, I think he's a blue belt, too, right?\n\nI believe so.\n\nLet's... What belt is Zuckerberg?\n\nZuckerberg brings in legit people, though. Like, he trains with very, very legit people. Vulcanowski, I know, is training with him. I know he's around Alexender. Yeah, Pereira. Um, yeah, he brings in like Dave Camaro, who's a top-level Brazilian jiu-jitsu black belt. He brings him.\n\nUh, belt. Yeah.\n\nYeah.\n\nHe's legit, man.\n\nHe blew his knee.\n\nYep.\n\nTore his ACL. He, uh, wind up getting... I tried to talk him out of the type of surgery that he got. He got the difficult surgery, which is a patella tendon graft. I've had both my ACL's reconstructed, and my left one was a patella tendon graft. My right one was a cadaver, and the cadaver was so much easier to recover from. And I told him, \"I'm like, dude, get the cadaver, trust me.\" And his doctor wanted to do the patella tendon. He wound up doing that. It's a long rehab with the patella tendon. Um, but you know, the fact that he blew his knee apart and still kept training is pretty impressive as well.\n\nYeah. And I'm in that place, too, like where I have inflam... I'm just trying to get healthy. Like, uh, I've been seeing some guy. I don't know if I need surgery, but I'm getting MRIs, getting insurance to approve MRIs. It's a [ __ ] nightmare. But I want to get my... my ankle, my hip, my knee. I'm all [ __ ] up.\n\nWhat's wrong?\n\nI've been [ __ ] up for years. I've had, like, my leg goes numb. My right leg was going numb in my thigh. Um, did you ever get your back looked at?\n\nI did. I have to get again. I'm trying to get approval for the MRI for that, but they... I twisted my ankle very badly a few times.\n\nUhhuh.\n\nUm, how long are you in town for?\n\nI'm supposed to call them tomorrow.\n\nOkay. What time tomorrow? When's your flight?\n\nFirst thing. First flight.\n\nOh.\n\nUm, I might be able to get you into Ways to Well this afternoon. Ways to Well is the local stem cell clinic. They'll... they'll shoot you... shoot you up with stem cells. That'll [ __ ] help everything, man.\n\nDoes it help?\n\nOh, tremendously. Tremendously.\n\nWhere do they shoot them?\n\nTremendously, right into the injury. Yeah, I got back. I got... I'm a [ __ ]. But I... but I feel better now. I've been doing these stretches, like the... the guy that my... my physical therapist recommended, and, uh, I'm... I'm going to someone who's... he gave me some anti-inflammatory pills for a week, and I feel a tremendous difference.\n\nBe careful with those.\n\nWhat do they do?\n\nWell, it depends on what you're taking. If you're taking a non-steroidal anti-inflammatory, they're terrible for your gut... your gut biome. It destroys your gut biome. It's... it could be really bad. It can actually make inflammation. Like my friend Cam Haynes, he was taking 800 milligrams of ibuprofen every day. And I talked to him about it. I go, \"What you doing? What?\" And then I sent him some stuff that Rhonda Patrick had put out about it. I'm like, \"Dude, get off of that.\" He got off of it. All of his pain went away. The inflammation was being caused by the fact that he was taking so much ibuprofen. It was ruining his gut biome. So, it was creating inflammation. So, to combat that inflammation, he was taking ibuprofen. And he thought the only way he was going to be able to run the miles that he was running was to constantly chew on ibuprofen. So he got off of it entirely. All the pain went away. Totally counterintuitive.\n\nYeah. I've only been on these. He said one week is all. He goes, \"I... I only want you to take them for...\" I don't remember. But he goes, \"I just want to see if it...\" He's trying to see, like, how severe the injuries. I want to see if this does help at all. But he goes, \"Take them for...\" He gave them to me for a month. He goes, \"Don't take them for more than a week.\" So I like the fact that he's showing restraint. He's like, \"Well, the thing is, doctors have a limited amount of tools. If you want to prescribe medication to somebody, you know, whatever the... you know what... whatever the common practice is, is what that doctor has to adhere to. They can't step out of line.\" And the reality is a lot of that stuff has side effects, but there's natural ways that you could deal with inflammation, like curcumin, turmeric, there's a lot of different, you know, that stuff that helps a lot. That's legit, and it's not bad for you. But a lot of inflammation comes from diet. A lot of it. A big factor. Like I remember I talked to this lady who was a physical therapist, and I had a neck issue. And she was like, \"You'd kind of be amazed if you cut out all the inflammatory foods of your diet how much it would affect it.\" I'm like, \"Really?\" She's like, \"Yeah, I mean, you probably do have a neck injury, but I guarantee it's exacerbated by the foods you're eating.\" She said, \"Cut out bread, cut out sugar, and and see... see if it has an effect.\"\n\nYou know, I've tried to, cuz I fattened up, and I know it. Like I... I put weight on, and the... again, for me, it was a dopamine thing. I'm not doing the things I used to do, right? So you need something to do that, just like, \"Give me a sandwich... something.\" You know, what am I going to do on the road? I'll have a pretzel, right?\n\nThat's my bane of my existence. A [ __ ] pretzel. Like, it really is. It's not like I'm eating pizza. I'm not eating cake.\n\nAll that [ __ ] is terrible.\n\nSourdough pretzels. I...\n\nAll that [ __ ]. Our bread is [ __ ]. And our bread is so [ __ ]. If you go... and I'm... I'm sure you've been overseas. You go... go eat bread in Italy. You don't feel bad at all.\n\nNo, you're not. It's not as bad.\n\nWe're [ __ ] poison. I'll... I'll play this thing because, uh, Brian Simpson sent me this, and it's very good. Hold on. Let me think here. Let me see. Show you right here. Um, but it's all about bread. Brian Simpson sent me this, and he's like, \"I think I'm done with bread.\" And I was like, \"Oh my god.\" Like, this is kind of crazy. Um, do I need my glasses?\n\nNo, no, no. I'll put it up on the screen. I'm going to find it, though, because he sent it to me. Here it is. Uh, copy to Jamie. Here it is.\n\nIt won't matter if there's World War II, but if there's not World War II, probably stay away from bread. American bread. You mean eat sourdough bread? Sourdough bread is [ __ ] great for you. But play this from the beginning so we could...\n\nThis guy's going to explain what's wrong with American bread. Explain to me why I can eat bread in Spain and in... I can in Greece, Italy, no problem. Why I was gluten... gluten-free in 15 years. I've been gluten-free in, uh, Canada, America can't eat it.\n\nThat's because in America, what we call bread can't even be considered food in parts of Europe. See, here in America, it's not so much the gluten as what we've done to the grain. About 200 years ago, we started stripping the brain and germ or the fiber and nutrients to make flour shelf stable, also nutritionally dead. Because the nutrients were gone, we enriched it with folic acid, which a large majority of the population can't even metabolize. Therefore, many people experience fatigue, anxiety, hyperactivity, and inflammation. But then the bread wasn't white enough, so they bleached it with chlorine gas, and the bread didn't rise enough. So, they added a carcinogen called potassium bromate, which is banned in several countries like Europe, the UK, and even China. Then, we wanted to ramp up production. And so he started using glyphosate to dry out the wheat before harvest, causing endocrine disruption and damaging your gut. So now you're bloated, brain fog, tired, and blamed gluten. But gluten is just the scapegoat. The real issue is ultrarocessed, chemically altered, bleached, bromated, fake vitamin filled weed soaked in glyphosate. This isn't bread. This is...\n\nWho is that dude? What's his name? Danny Dur.\n\nUh, click on... click on his so we could give that guy some props. Dennis, uh, Echelberger. Echo. Echelar. Danny... Denny, uh, d-n-n-y, d-u-r-e on, uh, Twitter and Instagram. Do you know, I will never... as I'm watching him do that, I will never be able to do anything into camera as well as he just described how shitty bread is. Like, I was watching him doing, like, he's getting all the words proper, and he's [ __ ], he's giving the information, he's not blinking, he's not twitching, he's just... he's not annoying.\n\nHe's not annoying, yeah.\n\nHe's just giving it to you. Perfect delivery. But that should be something that everybody should see. When I know that when I cut that stuff out of my diet, it makes a giant difference. Also, I should say Joe D'Rosa, who has this amazing sub shop in New York, and he's going to open up one out here in Austin.\n\nOh, nice.\n\nUh, Joey Roses. Fantastic sub shop.\n\nTheir wheat is all flown from Italy. It's all, like, natural wheat.\n\nYeah. And so their bread doesn't [ __ ] with you, and they... they make it fresh every day, and they throw it out at the end of the day. You never have day-old bread. It's always fresh, and they bake it there. So it's like when he's getting bread for his sandwiches, it's the kind of bread that you get in Europe. Do you know? I think I... I have to think you're right because there was one time we had D'Rosa on the show. It was in the morning show, and he didn't bring us any sandwiches. I'm like, \"Wait, where's the [ __ ] sandwiches, Joe? How about a sandwich?\"\n\nHe couldn't... he... that's what he said, and I was like, \"Fuck him.\" Cuz then he did chip, and he brought in sandwiches, but we taped in the afternoon, and I'm like, he was telling the truth... was telling the truth about his bread.\n\nYeah. When they... they had a popup out here at South by Southwest, and he brought over sandwiches. They were fantastic. They're very good.\n\nUnbelievably good. I... that is my number one... my... if I have a vice, it is Italian food. My... my... my big vice is Italian sandwiches, Italian subs, pasta, lasagna. That... that stuff gets me. I [ __ ] love it. But you... you have to get it from a place that's using, like, heirloom wheat. And you can find places... there's a lot of great restaurants in New York. There's great restaurants in LA that use heirloom wheat. And you'll eat their pasta, and you don't feel bad. Most of the bread that you're getting in America is like what that guy described, and that's why you feel like [ __ ] when you eat it.\n\nYeah, I feel like [ __ ] most... most of the time when I'm... especially, like, just always tired.\n\nI finally got... I... whatever, it's the apnea. It's a [ __ ], you know, an old man complaining. I just... I just... I can't breathe when I sleep. It sucks.\n\nHave you tried a carnivore diet? You ever tried that?\n\nNo. And again, I know that my fear of eating too much meat is probably unfounded. Um, but I...\n\nNo, I've... I've done Whole 30, which actually I [ __ ].\n\nWhat's your fear?\n\nWhat's the fear?\n\nJust like because... No, I...\n\nDoes cancer feed on meat?\n\nNo.\n\nLike... like that's what I was always afraid of.\n\nNo, cancer feeds on sugar.\n\nOkay.\n\nYeah. That's the really... the... the number one thing that cancer... do oncologists will tell you, um, when they... if they're trying to adjust your diet. Some don't, and it's very infuriating. I've had family members that have cancer, and their doctor tells them, \"You're going to go through chemotherapy, eat whatever you want.\" I'm like, \"Oh my god, don't eat whatever you want.\" Like, part of what is wrong with you is your diet. It's a giant part of your overall metabolic health, but a lot of oncologists now will try to get people on a ketogenic diet because it gets your body to burn fat instead of burning sugar, and then it starves the cancer. They're also... they'll try to get you to do, um, some... some fasting, like intermittent fasting, like have a... a window of feeding where you fast for 16 hours and then eat for eight, or you can only eat during eight. The keto diet, I never did it, but this is what a delusional idiot I am. When I was in Montreal during the pandemic, I... I joined Costco, and I would go and eat keto chocolates, and I somehow convinced myself that I was like, \"Oh, it's keto,\" but I wasn't doing the rest of the [ __ ] diet. But they have some actually good [ __ ] you can eat if you're on the keto diet. I guess you're doing it right. But I would go there and buy all these delicious, like, keto chocolate clusters. So yeah, that one... I heard it gives you bad breath, keto.\n\nThat was what I... I've heard. Again, I just... I don't remember where I heard it, but they were like, \"There's something about ketosis [ __ ] your breath up.\"\n\nI bet it does. Yeah, I bet it does. But just brush your [ __ ].\n\n\nTeeth and have a mint. Well, is it coming from the gut though?\nYeah, it probably is. It's probably ketones. Ketones smell terrible. Have you ever taken exogenous ketones?\nI've never even I've heard of ketones. What's an exogenous ketone?\nYou can take exogenous ketones. It's ketones that you drink and it puts your body into an instant state of ketosis where your body instantly starts to burn fat. It actually is really good mentally. Um, I like I take exogenous ketones sometimes when I have to perform, where I have to do something. So I've taken them before UFC's too. UFC's are like the big mind for me because it's six hours of thinking. Yes. And I have to think about previous fights. I have to like predict techniques. I have to see what's going on. And then like we're going to when it goes to the ground, it's kind of like my job is to explain particular submissions when it goes to the ground. Especially in the early days before I did it with DC cuz I was, you know, the only like when it was me and Goldberg. Goldberg's not really a martial artist. So it was just me. So, I would have to go like explain why someone's in trouble and what's going to happen to someone who's doesn't understand like a a triangle or something like that when someone goes to the ground and you need brain fuel and so uh ketones help a lot. Another thing is like I eat these gum these are gummies now alpha brain gummies but I always take some type of neutropic neurogum or there's neurogum has mints too. I'll take these mints like if you see me at the UFC I'll have those. I take these little uh nicotine um pouches.\nWhat are they called? Uh anything pins? Are they What's What are they called? Uh there's a word for those. Little nicotine.\nI don't know.\nPouches.\nZen. That's what I'm thinking of.\nYeah, these are different. These are from a company called Lucy. These are called breakers.\nAre those Do those have THC in them?\nNo.\nNo, no, no. It's just nicotine. This is all just nicotine.\nI mean those the uh\nNo, these are nicotine. No, no. The gummies are just neutropics. Neutropics are um like theanine. Um there's like a little bit of caffeine in these and they like one of the things we did with On It, we we made uh this thing called Alphabrain, which was there's a bunch of different neutropics out there and a bunch of like um um acetylcholine, a bunch of different things that have shown to have an effect on your memory. And so we put together a a group of these that would all work synergistically. And then we did two double blind placeboc controlled trials at Boston Center for Memory and it showed efficacy. It showed that it it helped incre increase verbal memory which is like your ability to form sentences and recall the word the correct words to use reaction time uh alpha state and so it's like it does work and it's not just on it because I'm connected to it like I have no connection at all to neurogum or neuromints but but it works and I tell people about it. There's another company called True Brain that's really good. There's another company called Neuro1. That was the first one that I ever tried. That's a That's Bill Romanowski, the football player. Oh, yeah. He developed that because he was have memory problems after getting hit in the head for all those years playing football. Didn't uh I as far as I've ever gone. What was that pill you It's not echynatia. There was one pill you were taking that was supposed to be good for memory. It was like one of those things you get on the shelf in the vitamin store. Um and I don't remember what it was, but I used to take that, but I didn't see an E.\nH.\nI was taking it or\nno me I do it to collective you people would take\nI don't know but there's a bunch of those things they're real like neutropics it's a real thing and a lot of people call it snake oil and I understand I understand that you'd be very suspicious but there's a the reality and this is one of the reasons why you know like I have a connection obviously to on it we founded the company together but I don't have any connection to neurobrain or neuro1 take them they work there's real legitimate solutions that help your brain function and they don't seem to carry any side effects. Some people if they take high doses of some of them get headaches. Uh I think that's probably just like some people react very badly to caffeine. Some people re you know it's like everybody has their own different biological stuff. But try it. And the gum is a great one. Neurog gum is great because it's a delicious gum. It tastes good and it really works, man. I take it all the time.\nIt helps your brain a little bit.\nOh yeah. I take it before I go on stage. I chew neurogum before I go on stage. It's very legit.\nDo you know what I wanted to take? Cuz Jamie's got a big bag of it right there. And again, we're not connected to them. This is just this is just stuff that works.\nI wanted to take because flying became such a again a fear for me again like in this phase of my life, I don't need that. So I talked to Whitney and she had talked about beta blockers. I didn't take them, but I got I like Do they help at all to like But I have a low heartbeat anyway, so I don't know if it's gonna me up to take a beta blocker, but beta blockers stop you from getting anxious. They stop adrenaline. They still they a lot of people they get busted using them and like archery competitions allow they they ban them. Sure.\nBecause, you know, like you're like in the Olympics and you're just trying to hit that bullseye every time. Like any kind of nerves or jitters is going to with you. Um, but you know, the problem is it's going to be something that you get you get addicted to or you maybe not even physically addicted, but you you know, you become dependent upon.\nThat's what I don't want. And I think I've asked they said they weren't, but I I for flying it's it's something I like I literally have to fight to do.\nUm, yeah, I'm getting a little bit better, but like I have anxiety, dude. I'm a I'm a grown-up. I have to sit by the window and look at the wing and I I'm really hatable on a plane. 6:00 in the morning. Everybody's trying to sleep and I get my fat face pressed up against the window staring like I'm eight.\nSo I I'm trying to get out of there.\nWell, there's there there are things. You know what's another thing that's really good for your cognitive function that a lot of people aren't aware of is creatine. And creatine is really good particularly if you are sleepd deprived. Like there's a study that they did that showed that if you take I think it's 20 milligrams of creatine, it has a a really positive effect on your ability to maintain normal cognitive function while you're sleep deprived.\nReally?\nYeah. It's also very good for women. Creatine is especially good supplement for women to take for some strange reason. But it's um you know it's a muscle building supplement. It's like really good for helping you um gain muscle mass and and strength if you were weight training. That was what it was initially used for, but now they're realizing there's a lot of cognitive benefits creatine as well.\nYeah, I don't take any of that stuff and I probably should at this point.\nI take creatine every day.\nI take nothing other than just my like my the little thing for my heart and you know,\nyou don't take vitamins?\nNo.\nOh god.\nI know. I probably should.\nI take everything.\nI take B. I do take B and I take one other one.\nYou should take D for sure. or you live in New York City, you know, you're probably not getting enough sun.\nNo, definitely.\nYeah. D is huge because D is a hormone. D is actually a hormone. Uh and it's a hormone that your body produces when you get into the sun. The best way to get vitamin D for sure is to be in the sun. But if you're not in the sun enough, um, one of one of my friends who's a doctor was in New York City when he was doing his his uh, residency and he said they would do tests on people in New York City and they found that they had undetectable levels of vitamin D in the winter. And he was like, you know, this is has a huge effect on your immune system. It's the reason why people get like everyone's, oh, it's flu season. No, it's lack of vitamin D season is what it is. The flu doesn't thrive in the winter. The flu exists in the winter because people have a low immune system in the winter and then they start catching it and giving it to other people. But it's really a function of your immune system not working properly. So you need D and you should take D with K2 uh vitamin K2 and magnesium. They all work synergistically together.\nI'll remember like hard I will text you and ask you the same question like what are those things? Because\ntext me I'll I'll tell you. But you should take that but you should also take B. You should take B12. You should take C. C is huge. Uh you can't take enough of it or you can't take too much of it. C is great. I could take liposomaal C. It's really good for you.\nYeah. You know, because you know how it is. You get older, man, you start thinking like, h these things are starting to affect me now a little bit. Not terrible. I'm still in pretty good health, but you start to panic and start to think,\nhow old are you now?\n56.\nI'm 57. I'm almost 58. Um and my body works great. And it's really because of that. It's just has a huge effect. I don't skip days and when I do I feel it, you know, but I try not to and I have a whole cabinet filled with supplements that I take. I, you know, I take a lot of vitamins.\nMy buddies never work great, though. So, it's not like I don't see any real drop off.\nWell, that's the problem. You know, if you're working out and you're doing all these different things and you want your body to function better, just force yourself to do it. Get your wife to like make you little packets. It's real simple. You know, just lay all all the stuff. I need two of these, three of these, one of those. We put it all in a package. This is methyl folate. Put that in there. This is and all that stuff has a giant effect on your health. It is you want to you want your body to function optimally. And when I noticed the difference is when I eat poorly, when I don't get enough sleep, and when I don't take supplements. I get that. I quit drinking like three months ago. Little more than little more than three months ago now.\nNothing. You're not drinking at all.\nI haven't drank anything in three months. I feel great.\nWas it hard?\nNo, it was super easy. It was really easy.\nYou were ready? Yeah, it was like I just there was too many days where it's kind of hard when you own a club and you're there a lot and you know you're having drinks with friends and you want a drink. Yeah, I'll have a drink.\nAnd then the next day I'd be at the gym. I'm like feel like And I'd be drinking all this water and taking all these electrolytes and getting a sauna and the cold plunge just trying to get back to normal. Yes. I'm like, why am I doing that? Well, in the three months of no drinking, I have not had one bad day. I have not had one day where I felt like And it just confirmed what I thought. I was poisoning myself.\nPoisoning myself with fun. I was having a good time. Yeah. I was, you know, it wasn't terrible. I wasn't an alcoholic. I wasn't drinking and driving or anything stupid, but it was a couple of drinks, a few nights a week. Maybe I'd go out with my wife on date night, have a couple glasses of wine. It was just at the end of the week, it's like you're drinking eight drinks. And that's just not good. It's just not good for you.\nI can't imagine drinking and doing comedy. Like I again I quit before I started and I see guys who are like I can't cuz I was not a fun drunk at all. I was a crier. I was the worst. No one liked me. You piece of\nSo I I would\nBut you were like 19.\n18. I was 18. Yeah.\nYou're not even supposed to be drinking back then.\nI know. And people are like it's oh he was too young. He's thinking but it's like I knew it again now. shimmy.\nUh people would love but they wouldn't like me. I was a cutter. I mean, who the wants to a 56-year-old cutter?\nI mean, how awful is that?\nThat's awful.\nSo, I was It's the best thing I did because I I was I was not a fun guy to be around. Some guys are fun. Like some like when Anthony drinks, he's uh you know, at times I wish his Twitter fingers were broken. Uh but I wish he would lock his phone, but he is a funny like he's not an uh usually an angry drunk, right? It's functional.\nHe's a functional guy. I was never functional. I was vomit. I was the phone. I should call the FBI. I\nyou know, I used to call bomb threats in my high school. I was crazy, man.\nOh boy.\nI called uh I can say it now. I mean, I called, let's say, a threat into the White House, but I was I was 13. I was 13.\n13. So crazy. What a crazy thing to do.\n\n\nKulux Clan. I called the\n[ __ ]\ncuz I was like little lib Jimmy\nand I read that there was a clan book I\nread and the guy was like a preacher for\nthe Kulux Clan. So I called him. I\nlooked his number up on 411 back then.\nIt was in the early 80s.\nWow.\nAnd uh I\ngot his name and I called him. I was you\n[ __ ] racist. And he actually talked\nto me and he was like, \"No, I got out of\nthe clan. I'm not in that anymore.\" And\nwe actually had a conver He actually\nengaged me\num for about 20 minutes. I\nhad a a conversation with with some\nclan.\nYou were a kid.\nI was 14 years\nold, 15 years old.\nWow.\nMid again.\nThat's I remember calling for\ninformation. I forget.\nGood for him for\ndoing that.\nYeah. For getting out.\nYeah.\ngot getting out and talking to you about\nthat on the phone. Like he didn't have\nto talk to you about that. He could have\njust hung up.\nI'm surprised he because\nmany people did. Uh many I I was a I was\na Fix the World on the phone. Thank god\nI didn't [ __ ]\nDo you know who Daryl\nDavis is?\nNo.\nDaryl Davis is a guy who's\nbeen on the podcast a couple times and\nhe's a uh blues musician.\nIs he black?\nYes. Okay. And he's the guy that would\nconvert the clan members.\nI know who he\nis. Yeah.\nAnd he gets their costumes.\nThey give him their wizard costumes at\nthe end. He's just because he's probably\na guy who's not and I I have seen stuff\nby him. He probably is just a good guy\nand and it's hard to dismiss him because\nhe's not force-feeding you.\nExactly.\nUm\nit's hard to dismiss anybody when you're\njust when you're not No one wants to be\nmessaged at.\nRight. Right. Right. Right.\nI don't I I can't in stand up. I can't\neven do it. Like my job is not to\nconvert people. I want you to know what\nmy life is. I hope you have some respect\nfor it. Like I'm just living the way I\nwant to live. And I'm not out to tell\nother people they have to feel this way,\nright?\nBecause no one wants to be\nmessaged at.\nNobody. It doesn't work.\nIt's not effective.\nIt's If it was\neffective, I'd probably\nWhat's effective\nis what Daryl does. He just shows you\nlike this is a good man. I must be wrong\nif I think that all black people are\nevil. This guy's like become a good\nfriend. You have him over for dinner.\nAnd then the guy's like, \"I'm telling\nyou right now, I'm getting out of the\nclan because of you.\" and he did it to\nlike 200 different people on a\none-on-one basis\nwhere he gets to know\nthem and getting beyond it's like we\ntalked about before like anytime\nsomebody is an [ __ ] publicly but when\nyou meet them and you realize oh there's\na person here like\nit's the way people\nare supposed to communicate and this is\nwhat I think is so terrible about social\nmedia is that too many people are just\nbecome so accustomed to barking at\npeople just barking out into the abyss.\nYeah. I have to stop myself from doing\nit. There's been times people have\ntweeted something and I want to make\nlike a [ __ ] remark and I'm like shut up\ndummy. They're not talking to you.\nExactly.\nMind your [ __ ] business. I\nreally do say that to myself. Mind your\nbusiness, you [ __ ] hen. You know,\nwhen I see people do it, I think that\nguy's mentally ill. Like, you're\nengaging with these people. You're\nyelling at these people on TW. You're\nmentally ill.\nYeah. Like, I don't care\nwhat other people Like, I care people\nthink about me in the sense that I want\nthem to think I'm funny and I want them\nto to of course we all want to be liked,\nbut I don't care what people's opinions\non the Middle East are. I don't give a\n[ __ ] Like,\nyou're not going to change\ntheir opinions\nand I don't need them to\nagree with mine. Like I have enough\nconfidence in my own brain that I am not\nalways right, but I'm always comfortable\nin my opinions and I'm not afraid of\nsomebody. I'm okay being wrong, too,\nright?\nLike I don't need uh I don't I\ndon't need the power of agreement from\nsomebody. It's just\nGood for you.\nBut\nit's only because I've tried it in my\nlife and it hasn't worked. It doesn't\nmake you happy when you get it.\nNo.\nUm\nit only makes you angry.\nIt doesn't\nwork. It's not It's a terrible way to\ncommunicate.\nYeah, it is.\nJimmy, I love\nyou to death.\nI love you too, Joe. Thank\nyou, buddy.\nAlways great to see you.\nYes, sir. And can I uh tell everybody?\nYeah.\nYes. Uh the special is called uh\nUnconceivable. I kept forgetting the\nname and it's not a misspelling.\nUnconceivable is actually a word in\nEnglish language and it does kind of\nfit. And uh the podcast is Jim Norton\nCan't Save You. Both are on @JimNortonComedy at YouTube. Um and I'm really\nhappy with this special. Like nice. I I\nwould say that anyway. I'm not going to\ncome up here and [ __ ] on my own special.\nI'm not that self-destructive. But I\nactually really was happy with this one.\nBeautiful. So I hope you like it.\nAll\nright. Thanks, pal.\nBye, everybody.\n[Applause]\n[Music]\n",
  "metadata": {
    "summary": "In this episode of the Joe Rogan Experience, comedian Jim Norton engages in a wide-ranging conversation with Joe Rogan. They delve into Norton's career in comedy, radio, and podcasting, touching on his new special and various projects. The discussion also covers personal anecdotes, such as experiences with social media, health, and relationships. Additionally, they explore broader themes, including the impact of technology, political views, and observations on societal trends. The conversation is peppered with humorous stories and insightful commentary, reflecting on the challenges and absurdities of modern life.",
    "topClaims": [
      {
        "text": "George Santos told me Jerry Nadler had the worst body odor in Congress.",
        "rating": 7.8,
        "chunkId": "ck-nZrt8odCj5s-14"
      },
      {
        "text": "A 17-year-old girl miraculously survived falling 10,000 feet from a plane and then surviving 11 days.",
        "rating": 8.2,
        "chunkId": "ck-nZrt8odCj5s-36"
      },
      {
        "text": "I survived a fall from a great height because I landed on a mound of fire ants, which kept me alive.",
        "rating": 8.5,
        "chunkId": "ck-nZrt8odCj5s-40"
      },
      {
        "text": "I believe the government's actions, including censorship, constitute election interference, influencing voters' decisions.",
        "rating": 9.1,
        "chunkId": "ck-nZrt8odCj5s-64"
      },
      {
        "text": "In America, the grain has been stripped of its fiber and nutrients to make flour shelf stable and nutritionally dead.",
        "rating": 9.3,
        "chunkId": "ck-nZrt8odCj5s-133"
      }
    ],
    "topQuotes": [
      {
        "text": "I think it's funny because when you said that I was like, who gave that to you? Is that a seven-year-old?",
        "chunkId": "ck-nZrt8odCj5s-1",
        "chunkNum": 1,
        "relevance": 8.5,
        "interesting": 8.1
      },
      {
        "text": "I hate my own voice and hearing it come back, it's like I'm doing radio for 20 years and I still don't like to listen to my own voice.",
        "chunkId": "ck-nZrt8odCj5s-2",
        "chunkNum": 2,
        "relevance": 7.8,
        "interesting": 7.9
      },
      {
        "text": "I feel lost and not in the room when I have both ears covered, and I can't hear.",
        "chunkId": "ck-nZrt8odCj5s-4",
        "chunkNum": 4,
        "relevance": 8.2,
        "interesting": 8.3
      },
      {
        "text": "I accidentally sent a text to the wrong person, a member of the defense department, which was a terrible mistake.",
        "chunkId": "ck-nZrt8odCj5s-10",
        "chunkNum": 10,
        "relevance": 8.9,
        "interesting": 8.7
      },
      {
        "text": "I stopped reading Twitter comments because even positive feedback felt like I needed too much attention.",
        "chunkId": "ck-nZrt8odCj5s-24",
        "chunkNum": 24,
        "relevance": 9.1,
        "interesting": 9.2
      },
      {
        "text": "I believe the government's actions, including censorship, constitute election interference, influencing voters' decisions.",
        "chunkId": "ck-nZrt8odCj5s-64",
        "chunkNum": 64,
        "relevance": 9.3,
        "interesting": 9.5
      },
      {
        "text": "I will never be able to do anything into camera as well as he just described how shitty bread is.",
        "chunkId": "ck-nZrt8odCj5s-135",
        "chunkNum": 135,
        "relevance": 9.6,
        "interesting": 9.7
      }
    ],
    "topTopics": [
      {
        "name": "modern life",
        "count": 4,
        "description": "The challenges and absurdities of modern life."
      },
      {
        "name": "social media",
        "count": 3,
        "description": "The impact of social media on society."
      },
      {
        "name": "free speech",
        "count": 3,
        "description": "The importance of free speech and censorship."
      },
      {
        "name": "diet nutrition",
        "count": 3,
        "description": "The effects of diet and nutrition on health."
      },
      {
        "name": "comedians life",
        "count": 2,
        "description": "The experiences and challenges of comedians."
      }
    ],
    "videoInfo": {
      "id": "nZrt8odCj5s",
      "etag": "bQutvgJ8pyxHQi_weXgnPe4kSQY",
      "kind": "youtube#video",
      "snippet": {
        "tags": [
          "Joe Rogan Experience",
          "JRE",
          "Joe",
          "Rogan",
          "podcast",
          "MMA",
          "comedy",
          "stand",
          "up",
          "funny",
          "Freak",
          "Party"
        ],
        "title": "Joe Rogan Experience #2342 - Jim Norton",
        "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
        "localized": {
          "title": "Joe Rogan Experience #2342 - Jim Norton",
          "description": "Jim Norton is a comic, actor, broadcast personality, and host of the podcast “Jim Norton Can’t Save You.” He also co-hosts “Sword Fight with Nikki and Jim Norton,\" and \"UFC Unfiltered.\"  Watch his new special, “Unconceivable,” on YouTube.\n@JimNortonComedy ⁠\n⁠https://www.jimnorton.com⁠\n\nThis episode is brought to you by Visible. Join now at ⁠https://visible.com/rogan⁠\n\nTry ZipRecruiter FOR FREE at ⁠https://ziprecruiter.com/rogan"
        },
        "categoryId": "22",
        "thumbnails": {
          "high": {
            "url": "https://i.ytimg.com/vi/nZrt8odCj5s/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/nZrt8odCj5s/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/nZrt8odCj5s/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "default": {
            "url": "https://i.ytimg.com/vi/nZrt8odCj5s/default.jpg",
            "width": 120,
            "height": 90
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/nZrt8odCj5s/sddefault.jpg",
            "width": 640,
            "height": 480
          }
        },
        "description": "Jim Norton is a comic, actor, broadcast personality, and host of the podcast “Jim Norton Can’t Save You.” He also co-hosts “Sword Fight with Nikki and Jim Norton,\" and \"UFC Unfiltered.\"  Watch his new special, “Unconceivable,” on YouTube.\n@JimNortonComedy ⁠\n⁠https://www.jimnorton.com⁠\n\nThis episode is brought to you by Visible. Join now at ⁠https://visible.com/rogan⁠\n\nTry ZipRecruiter FOR FREE at ⁠https://ziprecruiter.com/rogan",
        "publishedAt": "2025-06-25T17:00:59Z",
        "channelTitle": "PowerfulJRE",
        "defaultLanguage": "en",
        "defaultAudioLanguage": "en-US",
        "liveBroadcastContent": "none"
      },
      "statistics": {
        "likeCount": "12708",
        "viewCount": "859406",
        "commentCount": "2951",
        "favoriteCount": "0"
      },
      "contentDetails": {
        "caption": "false",
        "duration": "PT2H55M11S",
        "dimension": "2d",
        "definition": "hd",
        "projection": "rectangular",
        "contentRating": {},
        "licensedContent": false
      }
    },
    "checkCount": 27,
    "nodeCounts": [
      {
        "node": "podcast",
        "count": 11
      },
      {
        "node": "zuckerberg",
        "count": 5
      },
      {
        "node": "jim-norton",
        "count": 4
      },
      {
        "node": "liberace",
        "count": 4
      },
      {
        "node": "mri",
        "count": 3
      },
      {
        "node": "actors",
        "count": 3
      },
      {
        "node": "instagram",
        "count": 3
      },
      {
        "node": "fbi",
        "count": 3
      },
      {
        "node": "standup",
        "count": 3
      },
      {
        "node": "andrew-breitbart",
        "count": 3
      },
      {
        "node": "sirius-xm",
        "count": 3
      },
      {
        "node": "opie-and-anthony",
        "count": 3
      },
      {
        "node": "youtube",
        "count": 3
      },
      {
        "node": "headphones",
        "count": 2
      },
      {
        "node": "claustrophobic",
        "count": 2
      },
      {
        "node": "ex-publicist",
        "count": 2
      },
      {
        "node": "conservatives",
        "count": 2
      },
      {
        "node": "public-shaming",
        "count": 2
      },
      {
        "node": "mma",
        "count": 2
      },
      {
        "node": "jiu-jitsu",
        "count": 2
      },
      {
        "node": "embarrassment",
        "count": 2
      },
      {
        "node": "zip-recruiter",
        "count": 2
      },
      {
        "node": "hiring",
        "count": 2
      },
      {
        "node": "cavapoo",
        "count": 2
      },
      {
        "node": "hbo-thing",
        "count": 2
      },
      {
        "node": "matt-damon",
        "count": 2
      },
      {
        "node": "1960s",
        "count": 2
      },
      {
        "node": "hitler",
        "count": 2
      },
      {
        "node": "world-war-ii",
        "count": 2
      },
      {
        "node": "hunter-biden",
        "count": 2
      },
      {
        "node": "section-230",
        "count": 2
      },
      {
        "node": "lawfare",
        "count": 2
      },
      {
        "node": "kanye-west",
        "count": 2
      },
      {
        "node": "jackass",
        "count": 2
      },
      {
        "node": "breitbart",
        "count": 2
      },
      {
        "node": "schultz",
        "count": 2
      },
      {
        "node": "dubai",
        "count": 2
      },
      {
        "node": "brutus",
        "count": 2
      },
      {
        "node": "creatine",
        "count": 2
      },
      {
        "node": "vitamins",
        "count": 2
      },
      {
        "node": "supplements",
        "count": 2
      },
      {
        "node": "joe-rogan-podcast",
        "count": 1
      },
      {
        "node": "joe-rogan-experience",
        "count": 1
      },
      {
        "node": "harlon-williams",
        "count": 1
      },
      {
        "node": "dimmitri",
        "count": 1
      },
      {
        "node": "mr-har-williams",
        "count": 1
      },
      {
        "node": "funniest-movies",
        "count": 1
      },
      {
        "node": "farley-brothers",
        "count": 1
      },
      {
        "node": "kingpin",
        "count": 1
      },
      {
        "node": "rich-voss",
        "count": 1
      },
      {
        "node": "awareness",
        "count": 1
      },
      {
        "node": "fumbling",
        "count": 1
      },
      {
        "node": "lumps",
        "count": 1
      },
      {
        "node": "underwater",
        "count": 1
      },
      {
        "node": "blocking-out",
        "count": 1
      },
      {
        "node": "freaked-out",
        "count": 1
      },
      {
        "node": "ray-kurzweil",
        "count": 1
      },
      {
        "node": "2045",
        "count": 1
      },
      {
        "node": "joe-de-roa",
        "count": 1
      },
      {
        "node": "badmouthing",
        "count": 1
      },
      {
        "node": "norton",
        "count": 1
      },
      {
        "node": "non-complimentary-comment",
        "count": 1
      },
      {
        "node": "youtube-ads",
        "count": 1
      },
      {
        "node": "podcast-ads",
        "count": 1
      },
      {
        "node": "george-santos",
        "count": 1
      },
      {
        "node": "funny-podcast",
        "count": 1
      },
      {
        "node": "jerry-nadler",
        "count": 1
      },
      {
        "node": "lauren-bobart",
        "count": 1
      },
      {
        "node": "self-deprecating-humor",
        "count": 1
      },
      {
        "node": "targeting",
        "count": 1
      },
      {
        "node": "gutfeld",
        "count": 1
      },
      {
        "node": "dylan-mulvaney",
        "count": 1
      },
      {
        "node": "glenn-greenwald",
        "count": 1
      },
      {
        "node": "privacy-invasions",
        "count": 1
      },
      {
        "node": "feeling-humiliated",
        "count": 1
      },
      {
        "node": "psychopaths",
        "count": 1
      },
      {
        "node": "premiere",
        "count": 1
      },
      {
        "node": "standup-performance",
        "count": 1
      },
      {
        "node": "frankensteining",
        "count": 1
      },
      {
        "node": "posing",
        "count": 1
      },
      {
        "node": "comedians",
        "count": 1
      },
      {
        "node": "feedback",
        "count": 1
      },
      {
        "node": "reviews",
        "count": 1
      },
      {
        "node": "japanese-hornets",
        "count": 1
      },
      {
        "node": "algorithm",
        "count": 1
      },
      {
        "node": "hitchens",
        "count": 1
      },
      {
        "node": "conclusions",
        "count": 1
      },
      {
        "node": "showering-method",
        "count": 1
      },
      {
        "node": "conversations",
        "count": 1
      },
      {
        "node": "input",
        "count": 1
      },
      {
        "node": "jocktober",
        "count": 1
      },
      {
        "node": "studios",
        "count": 1
      },
      {
        "node": "mischaracterization",
        "count": 1
      },
      {
        "node": "relitigating",
        "count": 1
      },
      {
        "node": "porsche",
        "count": 1
      },
      {
        "node": "honda",
        "count": 1
      },
      {
        "node": "brake-slamming",
        "count": 1
      },
      {
        "node": "lifeguards",
        "count": 1
      },
      {
        "node": "camp-counselors",
        "count": 1
      },
      {
        "node": "mule-packers",
        "count": 1
      },
      {
        "node": "matching-technology",
        "count": 1
      },
      {
        "node": "ziprecruiter-com-rogan",
        "count": 1
      },
      {
        "node": "philly",
        "count": 1
      },
      {
        "node": "bullshitting",
        "count": 1
      },
      {
        "node": "bus-hits-something",
        "count": 1
      },
      {
        "node": "faking-it",
        "count": 1
      },
      {
        "node": "11a",
        "count": 1
      },
      {
        "node": "17-year-old-girl",
        "count": 1
      },
      {
        "node": "11-days-survival",
        "count": 1
      },
      {
        "node": "10000-ft-fall",
        "count": 1
      },
      {
        "node": "brazil-rainforest",
        "count": 1
      },
      {
        "node": "peruvian-amazon",
        "count": 1
      },
      {
        "node": "mimology",
        "count": 1
      },
      {
        "node": "wuhan",
        "count": 1
      },
      {
        "node": "joan-murray",
        "count": 1
      },
      {
        "node": "fire-ants",
        "count": 1
      },
      {
        "node": "czechoslovakia",
        "count": 1
      },
      {
        "node": "48-feet-fall",
        "count": 1
      },
      {
        "node": "14500-ft-fall",
        "count": 1
      },
      {
        "node": "backup-parachute",
        "count": 1
      },
      {
        "node": "80-mph-fall",
        "count": 1
      },
      {
        "node": "fire-ants-survival",
        "count": 1
      },
      {
        "node": "adrenaline-surge",
        "count": 1
      },
      {
        "node": "yorkie",
        "count": 1
      },
      {
        "node": "hypoallergenic",
        "count": 1
      },
      {
        "node": "shedding",
        "count": 1
      },
      {
        "node": "pissing-in-the-house",
        "count": 1
      },
      {
        "node": "dog-s-aging",
        "count": 1
      },
      {
        "node": "cuteness",
        "count": 1
      },
      {
        "node": "dog-pissing",
        "count": 1
      },
      {
        "node": "mowing-dog",
        "count": 1
      },
      {
        "node": "mastiffs",
        "count": 1
      },
      {
        "node": "homeowners-insurance",
        "count": 1
      },
      {
        "node": "doberman",
        "count": 1
      },
      {
        "node": "rottweiler",
        "count": 1
      },
      {
        "node": "german-shepherd",
        "count": 1
      },
      {
        "node": "slobbering-dogs",
        "count": 1
      },
      {
        "node": "russian-prisons",
        "count": 1
      },
      {
        "node": "dogo-argentino",
        "count": 1
      },
      {
        "node": "ving-rhames",
        "count": 1
      },
      {
        "node": "charles-dutton",
        "count": 1
      },
      {
        "node": "ving-rhames--dog",
        "count": 1
      },
      {
        "node": "google",
        "count": 1
      },
      {
        "node": "ving-rhames-case",
        "count": 1
      },
      {
        "node": "toxicology",
        "count": 1
      },
      {
        "node": "dog-bites",
        "count": 1
      },
      {
        "node": "bull-mastiffs",
        "count": 1
      },
      {
        "node": "netflix-series",
        "count": 1
      },
      {
        "node": "scott-thorson",
        "count": 1
      },
      {
        "node": "liberace-song",
        "count": 1
      },
      {
        "node": "liberace-video",
        "count": 1
      },
      {
        "node": "shitty-ironic",
        "count": 1
      },
      {
        "node": "14k-connection",
        "count": 1
      },
      {
        "node": "56k",
        "count": 1
      },
      {
        "node": "you-ve-got-mail",
        "count": 1
      },
      {
        "node": "propaganda-footage",
        "count": 1
      },
      {
        "node": "american-households",
        "count": 1
      },
      {
        "node": "movie-theaters",
        "count": 1
      },
      {
        "node": "honeymooners-debut",
        "count": 1
      },
      {
        "node": "reginal-van-gleason",
        "count": 1
      },
      {
        "node": "kronhite-broadcast",
        "count": 1
      },
      {
        "node": "mr-television",
        "count": 1
      },
      {
        "node": "liberace-dancing",
        "count": 1
      },
      {
        "node": "tattling-culture",
        "count": 1
      },
      {
        "node": "fake-storefronts",
        "count": 1
      },
      {
        "node": "warren-waringer",
        "count": 1
      },
      {
        "node": "youtube-video",
        "count": 1
      },
      {
        "node": "clandestine-footage",
        "count": 1
      },
      {
        "node": "kim-jong-un",
        "count": 1
      },
      {
        "node": "assad-mseni",
        "count": 1
      },
      {
        "node": "american-tv-shows",
        "count": 1
      },
      {
        "node": "peace-negotiation",
        "count": 1
      },
      {
        "node": "grock",
        "count": 1
      },
      {
        "node": "guard-rails",
        "count": 1
      },
      {
        "node": "validation",
        "count": 1
      },
      {
        "node": "clippers",
        "count": 1
      },
      {
        "node": "girlfriend",
        "count": 1
      },
      {
        "node": "recording",
        "count": 1
      },
      {
        "node": "10--to-the-big-guy",
        "count": 1
      },
      {
        "node": "hookers",
        "count": 1
      },
      {
        "node": "biden",
        "count": 1
      },
      {
        "node": "covid-information",
        "count": 1
      },
      {
        "node": "hearings",
        "count": 1
      },
      {
        "node": "durov",
        "count": 1
      },
      {
        "node": "meta",
        "count": 1
      },
      {
        "node": "robot",
        "count": 1
      },
      {
        "node": "whatsapp",
        "count": 1
      },
      {
        "node": "underage-people",
        "count": 1
      },
      {
        "node": "backdoor",
        "count": 1
      },
      {
        "node": "backpage",
        "count": 1
      },
      {
        "node": "russ-alrech",
        "count": 1
      },
      {
        "node": "exoneration",
        "count": 1
      },
      {
        "node": "statute-of-limitations",
        "count": 1
      },
      {
        "node": "mara-lago",
        "count": 1
      },
      {
        "node": "neighbor-s-place",
        "count": 1
      },
      {
        "node": "legal-targeting",
        "count": 1
      },
      {
        "node": "leticia-james",
        "count": 1
      },
      {
        "node": "kooky-guy",
        "count": 1
      },
      {
        "node": "intelligence-agencies",
        "count": 1
      },
      {
        "node": "eye-of-sauron",
        "count": 1
      },
      {
        "node": "leticia-j",
        "count": 1
      },
      {
        "node": "andrew-cuomo",
        "count": 1
      },
      {
        "node": "elon",
        "count": 1
      },
      {
        "node": "creativity",
        "count": 1
      },
      {
        "node": "medication",
        "count": 1
      },
      {
        "node": "troll",
        "count": 1
      },
      {
        "node": "kanye",
        "count": 1
      },
      {
        "node": "albums",
        "count": 1
      },
      {
        "node": "workaholic",
        "count": 1
      },
      {
        "node": "obama",
        "count": 1
      },
      {
        "node": "trump-s-office",
        "count": 1
      },
      {
        "node": "contrarian",
        "count": 1
      },
      {
        "node": "joe-rogan",
        "count": 1
      },
      {
        "node": "disingenuous",
        "count": 1
      },
      {
        "node": "bernie",
        "count": 1
      },
      {
        "node": "magnus-carlsen",
        "count": 1
      },
      {
        "node": "high-achievers",
        "count": 1
      },
      {
        "node": "mma-fighters",
        "count": 1
      },
      {
        "node": "bobby-fischer",
        "count": 1
      },
      {
        "node": "5--better",
        "count": 1
      },
      {
        "node": "buzz-aldrin",
        "count": 1
      },
      {
        "node": "cnn",
        "count": 1
      },
      {
        "node": "kerattop",
        "count": 1
      },
      {
        "node": "vegas-show",
        "count": 1
      },
      {
        "node": "entitlement",
        "count": 1
      },
      {
        "node": "vegas",
        "count": 1
      },
      {
        "node": "smarter",
        "count": 1
      },
      {
        "node": "jerking-off",
        "count": 1
      },
      {
        "node": "new-york-airport",
        "count": 1
      },
      {
        "node": "joe-beningo",
        "count": 1
      },
      {
        "node": "660",
        "count": 1
      },
      {
        "node": "the-jets",
        "count": 1
      },
      {
        "node": "miokaku",
        "count": 1
      },
      {
        "node": "condisa-rice",
        "count": 1
      },
      {
        "node": "krock",
        "count": 1
      },
      {
        "node": "arty",
        "count": 1
      },
      {
        "node": "soundboard",
        "count": 1
      },
      {
        "node": "patrice",
        "count": 1
      },
      {
        "node": "voss",
        "count": 1
      },
      {
        "node": "burr",
        "count": 1
      },
      {
        "node": "ari",
        "count": 1
      },
      {
        "node": "pat-from-monaki",
        "count": 1
      },
      {
        "node": "krock-studio",
        "count": 1
      },
      {
        "node": "pat-duffy",
        "count": 1
      },
      {
        "node": "elliot-spitzer",
        "count": 1
      },
      {
        "node": "tom-papa-podcast",
        "count": 1
      },
      {
        "node": "cardio-myopathy",
        "count": 1
      },
      {
        "node": "arthuroscllerosis",
        "count": 1
      },
      {
        "node": "website-stress",
        "count": 1
      },
      {
        "node": "opian-anthony",
        "count": 1
      },
      {
        "node": "sirius-xm-merger",
        "count": 1
      },
      {
        "node": "siriusxm",
        "count": 1
      },
      {
        "node": "jim-mccclure",
        "count": 1
      },
      {
        "node": "lawsuits",
        "count": 1
      },
      {
        "node": "negotiating",
        "count": 1
      },
      {
        "node": "non-renewal",
        "count": 1
      },
      {
        "node": "pinching-pennies",
        "count": 1
      },
      {
        "node": "podcasters",
        "count": 1
      },
      {
        "node": "motivation",
        "count": 1
      },
      {
        "node": "episodes",
        "count": 1
      },
      {
        "node": "negotiation",
        "count": 1
      },
      {
        "node": "two-apartments",
        "count": 1
      },
      {
        "node": "broadcasting",
        "count": 1
      },
      {
        "node": "spotify",
        "count": 1
      },
      {
        "node": "stitcher",
        "count": 1
      },
      {
        "node": "pandora",
        "count": 1
      },
      {
        "node": "apple-podcasts",
        "count": 1
      },
      {
        "node": "podcast-app",
        "count": 1
      },
      {
        "node": "sideways-thing",
        "count": 1
      },
      {
        "node": "capitalized-on-co",
        "count": 1
      },
      {
        "node": "netflix",
        "count": 1
      },
      {
        "node": "standup-style-comedy",
        "count": 1
      },
      {
        "node": "chip-chipper",
        "count": 1
      },
      {
        "node": "dubai-jokes",
        "count": 1
      },
      {
        "node": "tbs-show",
        "count": 1
      },
      {
        "node": "abu-dhabi",
        "count": 1
      },
      {
        "node": "sock-cucka",
        "count": 1
      },
      {
        "node": "peek-a-kissa",
        "count": 1
      },
      {
        "node": "zia",
        "count": 1
      },
      {
        "node": "nick-depollo",
        "count": 1
      },
      {
        "node": "ted-bundy",
        "count": 1
      },
      {
        "node": "jamie-jaster",
        "count": 1
      },
      {
        "node": "monetization",
        "count": 1
      },
      {
        "node": "youtube-episodes",
        "count": 1
      },
      {
        "node": "callers",
        "count": 1
      },
      {
        "node": "jfk-assassination",
        "count": 1
      },
      {
        "node": "oswald-kennedy",
        "count": 1
      },
      {
        "node": "ali-wong",
        "count": 1
      },
      {
        "node": "stalkers",
        "count": 1
      },
      {
        "node": "ruin-someone-s-life",
        "count": 1
      },
      {
        "node": "schizophrenic",
        "count": 1
      },
      {
        "node": "cuck-talk",
        "count": 1
      },
      {
        "node": "influencer-shitting",
        "count": 1
      },
      {
        "node": "dubai-influencers",
        "count": 1
      },
      {
        "node": "elon-musk",
        "count": 1
      },
      {
        "node": "oil-families",
        "count": 1
      },
      {
        "node": "wealthy-americans",
        "count": 1
      },
      {
        "node": "dubai-girls",
        "count": 1
      },
      {
        "node": "timing-shits",
        "count": 1
      },
      {
        "node": "smoking-cigarettes",
        "count": 1
      },
      {
        "node": "brewing",
        "count": 1
      },
      {
        "node": "burge",
        "count": 1
      },
      {
        "node": "ufc",
        "count": 1
      },
      {
        "node": "rolls-royce",
        "count": 1
      },
      {
        "node": "ferrari",
        "count": 1
      },
      {
        "node": "lamborghini",
        "count": 1
      },
      {
        "node": "2007",
        "count": 1
      },
      {
        "node": "3000-ft",
        "count": 1
      },
      {
        "node": "burge-tower",
        "count": 1
      },
      {
        "node": "helicopter-stunt",
        "count": 1
      },
      {
        "node": "epmd-song",
        "count": 1
      },
      {
        "node": "cgi-stunts",
        "count": 1
      },
      {
        "node": "buster-keaton",
        "count": 1
      },
      {
        "node": "gene-hackman",
        "count": 1
      },
      {
        "node": "brando",
        "count": 1
      },
      {
        "node": "connie-chung",
        "count": 1
      },
      {
        "node": "james-cagney",
        "count": 1
      },
      {
        "node": "humphrey",
        "count": 1
      },
      {
        "node": "streetcar-named-desire",
        "count": 1
      },
      {
        "node": "disconnection",
        "count": 1
      },
      {
        "node": "limitations",
        "count": 1
      },
      {
        "node": "tom-hanks",
        "count": 1
      },
      {
        "node": "punchline",
        "count": 1
      },
      {
        "node": "will-arnett",
        "count": 1
      },
      {
        "node": "bradley-cooper",
        "count": 1
      },
      {
        "node": "caesar-s-funeral",
        "count": 1
      },
      {
        "node": "captives",
        "count": 1
      },
      {
        "node": "coppers",
        "count": 1
      },
      {
        "node": "it-s-real",
        "count": 1
      },
      {
        "node": "gary-oldman",
        "count": 1
      },
      {
        "node": "severance",
        "count": 1
      },
      {
        "node": "pierce-brosnan",
        "count": 1
      },
      {
        "node": "facebook",
        "count": 1
      },
      {
        "node": "purple-belt",
        "count": 1
      },
      {
        "node": "vulcanowski",
        "count": 1
      },
      {
        "node": "pereira",
        "count": 1
      },
      {
        "node": "dave-camaro",
        "count": 1
      },
      {
        "node": "patella-tendon-graft",
        "count": 1
      },
      {
        "node": "acl",
        "count": 1
      },
      {
        "node": "blue-belt",
        "count": 1
      },
      {
        "node": "cadaver",
        "count": 1
      },
      {
        "node": "ibuprofen",
        "count": 1
      },
      {
        "node": "rhonda-patrick",
        "count": 1
      },
      {
        "node": "cam-haynes",
        "count": 1
      },
      {
        "node": "gut-biome",
        "count": 1
      },
      {
        "node": "anti-inflammatory-pills",
        "count": 1
      },
      {
        "node": "inflammatory-foods",
        "count": 1
      },
      {
        "node": "turmeric",
        "count": 1
      },
      {
        "node": "sourdough-pretzels",
        "count": 1
      },
      {
        "node": "dopamine",
        "count": 1
      },
      {
        "node": "jamie",
        "count": 1
      },
      {
        "node": "sourdough-bread",
        "count": 1
      },
      {
        "node": "nutritionally-dead",
        "count": 1
      },
      {
        "node": "folic-acid",
        "count": 1
      },
      {
        "node": "metabolize",
        "count": 1
      },
      {
        "node": "potassium-bromate",
        "count": 1
      },
      {
        "node": "glyphosate",
        "count": 1
      },
      {
        "node": "endocrine-disruption",
        "count": 1
      },
      {
        "node": "gluten-scapegoat",
        "count": 1
      },
      {
        "node": "ultrarocessed-food",
        "count": 1
      },
      {
        "node": "danny-dur",
        "count": 1
      },
      {
        "node": "dennis-echelberger",
        "count": 1
      },
      {
        "node": "shitty-bread",
        "count": 1
      },
      {
        "node": "sandwiches",
        "count": 1
      },
      {
        "node": "italian-sandwiches",
        "count": 1
      },
      {
        "node": "pasta-lasagna",
        "count": 1
      },
      {
        "node": "tiredness",
        "count": 1
      },
      {
        "node": "apnea",
        "count": 1
      },
      {
        "node": "whole-30",
        "count": 1
      },
      {
        "node": "breathing-difficulty",
        "count": 1
      },
      {
        "node": "ketogenic-diet",
        "count": 1
      },
      {
        "node": "oncologists",
        "count": 1
      },
      {
        "node": "costco",
        "count": 1
      },
      {
        "node": "keto-chocolates",
        "count": 1
      },
      {
        "node": "delusional",
        "count": 1
      },
      {
        "node": "exogenous-ketones",
        "count": 1
      },
      {
        "node": "neutropics",
        "count": 1
      },
      {
        "node": "neurogum",
        "count": 1
      },
      {
        "node": "neuro1",
        "count": 1
      },
      {
        "node": "beta-blockers",
        "count": 1
      },
      {
        "node": "ketosis",
        "count": 1
      },
      {
        "node": "cognitive-benefits",
        "count": 1
      },
      {
        "node": "hormone",
        "count": 1
      },
      {
        "node": "vitamin-k2",
        "count": 1
      },
      {
        "node": "synergistically",
        "count": 1
      },
      {
        "node": "b12",
        "count": 1
      },
      {
        "node": "liposomal-c",
        "count": 1
      },
      {
        "node": "aging",
        "count": 1
      },
      {
        "node": "methyl-folate",
        "count": 1
      },
      {
        "node": "electrolytes",
        "count": 1
      },
      {
        "node": "gym",
        "count": 1
      },
      {
        "node": "kulux-clan",
        "count": 1
      },
      {
        "node": "early-80s",
        "count": 1
      },
      {
        "node": "racist",
        "count": 1
      },
      {
        "node": "daryl-davis",
        "count": 1
      },
      {
        "node": "converting",
        "count": 1
      },
      {
        "node": "unconceivable",
        "count": 1
      },
      {
        "node": "-jimnortoncomedy",
        "count": 1
      }
    ],
    "topicGroups": {
      "groups": [
        {
          "topics": [
            "jim-norton",
            "standup",
            "opie-and-anthony",
            "jackass",
            "harlon-williams",
            "mr-har-williams",
            "funniest-movies",
            "farley-brothers",
            "kingpin",
            "funny-podcast",
            "self-deprecating-humor",
            "comedians",
            "standup-performance"
          ],
          "category": {
            "name": "Comedy",
            "description": "Comedy and Entertainment"
          }
        },
        {
          "topics": [
            "podcast",
            "sirius-xm",
            "youtube",
            "joe-rogan-podcast",
            "joe-rogan-experience",
            "podcast-ads",
            "youtube-ads"
          ],
          "category": {
            "name": "Podcasts",
            "description": "Podcasts and Media"
          }
        },
        {
          "topics": [
            "zuckerberg",
            "instagram",
            "section-230",
            "algorithm",
            "privacy-invasions"
          ],
          "category": {
            "name": "Technology",
            "description": "Social Media and Technology"
          }
        },
        {
          "topics": [
            "andrew-breitbart",
            "conservatives",
            "breitbart",
            "hunter-biden",
            "kanye-west",
            "george-santos",
            "jerry-nadler",
            "lauren-bobart",
            "gutfeld",
            "glenn-greenwald"
          ],
          "category": {
            "name": "Politics",
            "description": "Politics and Current Events"
          }
        },
        {
          "topics": [
            "mri",
            "creatine",
            "vitamins",
            "supplements",
            "lumps",
            "japanese-hornets"
          ],
          "category": {
            "name": "Health",
            "description": "Health and Wellness"
          }
        },
        {
          "topics": [
            "embarrassment",
            "feeling-humiliated",
            "awareness",
            "fumbling",
            "blocking-out",
            "freaked-out",
            "badmouthing",
            "non-complimentary-comment"
          ],
          "category": {
            "name": "Personal",
            "description": "Personal Experiences and Feelings"
          }
        },
        {
          "topics": [
            "liberace",
            "1960s",
            "hitler",
            "world-war-ii",
            "brutus"
          ],
          "category": {
            "name": "History",
            "description": "History and Culture"
          }
        },
        {
          "topics": [
            "zip-recruiter",
            "hiring",
            "ex-publicist",
            "schultz"
          ],
          "category": {
            "name": "Business",
            "description": "Business and Employment"
          }
        },
        {
          "topics": [
            "actors",
            "matt-damon",
            "joe-de-roa",
            "norton",
            "psychopaths",
            "dylan-mulvaney"
          ],
          "category": {
            "name": "People",
            "description": "People and Relationships"
          }
        },
        {
          "topics": [
            "mma",
            "jiu-jitsu",
            "jocktober",
            "lifeguards",
            "camp-counselors",
            "mule-packers"
          ],
          "category": {
            "name": "Sports",
            "description": "Sports and Recreation"
          }
        },
        {
          "topics": [
            "fbi",
            "headphones",
            "claustrophobic",
            "cavapoo",
            "hbo-thing",
            "dubai",
            "lawfare",
            "hitchens",
            "2045",
            "ray-kurzweil",
            "underwater",
            "posing",
            "feedback",
            "reviews",
            "conclusions",
            "showering-method",
            "conversations",
            "input",
            "studios",
            "mischaracterization",
            "relitigating",
            "porsche",
            "honda",
            "brake-slamming",
            "premiere",
            "targeting",
            "frankensteining"
          ],
          "category": {
            "name": "Miscellaneous",
            "description": "Miscellaneous Topics"
          }
        }
      ]
    },
    "shortSummary": "Jim Norton joins the Joe Rogan Experience to discuss a variety of topics, including his career, personal experiences, and observations on current events.",
    "lastStoryCheck": "2025-07-14T19:26:09.716Z",
    "storyCheckResults": {
      "missingChunks": [],
      "missingStories": [],
      "totalCategories": 11,
      "totalChunksChecked": 150
    }
  }
}