{
  "id": "qb644F-iE_s",
  "title": "China's Road to High Tech Supremacy  — Arthur Kroeber",
  "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
  "publishedAt": "2025-06-19T16:25:39.000Z",
  "cleanText": "Today I'm interviewing Arthur Kroeber, the founder of Gavekal Dragonomics, a research consultancy focused on China, and the author of China’s Economy: What Everyone Needs to Know. A friend recommended it to me while I was in China. It’s been the most valuable and useful resource I've found on how China works. Arthur, thanks for coming on the podcast and taking the time to chat with me.\n\nIt's great to be here, thanks.\n\nFirst question. What really is the problem if China becomes as wealthy as America, or if its economy grows as big, or even bigger than America’s? I know it may not be your perspective to be a China hawk, but I’ve never really understood why this is a problem in the first place.\n\nIt's a very good question. There's a lot of criticism of China from the standpoint of, okay, you're trying to get rich, that's fine. But you're basically trying to get rich on the backs of everyone else in the world by running this gigantic manufacturing export machine, where it seems like the Chinese ambition is to produce all the manufactured goods in the world, for everyone, run an enormous trade surplus, which means they are depending on the rest of the world’s buying power to support them. People say this model is not fair, not sustainable, and not a stable way to participate in the global economy. The real question isn’t just if China gets rich, but how it gets rich. Does it get rich by operating under the same rules as everyone else and having a market other people can participate in? Or does it get rich by making it impossible for anyone else in the world to have the kind of production structure that they want to have, and relying entirely on these ever-growing trade surpluses?\n\nIn principle, from a welfare standpoint, I think it would be great if China became as rich as America. But that’s likely to have difficult and destabilizing political consequences, because the Chinese political system is vastly different from that of the US and other major industrialized countries.\n\nOn the trade surplus point, to the extent that it is made possible by the government involvement in industry… It’s actually not even clear to me that that's the case. If you have high savings and not enough investment domestically, the accounting identities are such that you will have a trade surplus. But suppose that's even the case. On paper, it just seems like what is happening is that the Chinese taxpayer, the Chinese saver, is subsidizing foreign importers. On paper, it just seems like we're getting a good deal. I'm sure some people are upset about this, specifically people who manufacture outside of China. But it's certainly not something obviously insidious.\n\nSo it seems like if it wasn't for this, there'd be some other reason that China can't grow as wealthy as us. I am playing a little bit of a devil's advocate here. But I don't really understand why this is such a big issue that there needs to be very powerful competition about it.\n\nThere are a couple of things beneath that. One is the systemic political difference is really important. The US self identity is that it is the leader of democracies around the world. We are very invested, at least for now in our democratic system. We'll see how that evolves over the next two or three years. There's some question marks around that, but historically that's been a really huge part of the US identity. Basically the morality play of World War II and the Cold War—which have really been the crucible in which US foreign policy has been formed—is that you had an alliance of democracies that fought back first against fascism, then against communism. They won. The result was that you created a world where most major countries were democratic. They operated on market economic systems. We were heading towards a world of convergence of systems where everyone essentially playing by the same rules. China really gets in the way of that narrative because it's this incredibly successful authoritarian system where the authority still calls itself communist. US elites have never, to this day, really gotten comfortable with the idea that the Chinese political system is legitimate. As long as you have that underlying problem, it's going to be very difficult to erase these difficulties.\n\nOn the economic side, I think it is a problem, the way that China has chosen to organize its economy. In a strictly financial sense, the rest of the world comes out ahead in the sense that China is willing to subsidize a lot of low cost production. The rest of the world gets a lot of cheap goods and the overall welfare of the world improves a lot. I think that's clearly true. But if you look at what has happened to the US politically over the last 20 years, there are a lot of flies in that ointment. The fly is that it is important for large countries to be able to maintain a diversified production structure and maintain social cohesion. If you lose the capacity to run a manufacturing economy that employs large numbers of people, there's a lot of disruptions that come as a result of that. The purely financialized economy that we had growing up in the United States in the early 2000s as a result of this bargain with China wound up being pretty bad for the social compact. So there is a legitimate question about how you integrate China's growing power, wealth, industrial might, into the world in a way that societies around the world can tolerate. It's a legitimately difficult problem.\n\nI think a lot of the problems have to do not with China but with US domestic policy. A lot of what's going on right now is scapegoating of China as a way of diverting attention from decisions that need to be made domestically about income redistribution and macroeconomic policy and so forth. But there is also a legitimate question to be made about how China now accounts for 20% of the global economy, probably larger in the future, and a third of the global manufacturing economy. There has to be an agreed set of rules about how it interacts with the rest of the world so that everyone feels that they are benefiting, not just in financial terms. We don't really have that agreement now.\n\nTwo points. On the political system, I wonder if we've learned a bad example from World War II and the Cold War, which is that great power conflict culminates in the other party totally collapsing. I think that was actually necessary, obviously, for Hitler and even for the Soviet Union. I think they were evil regimes. I think China today is an evil regime in a way, but it's just not in the same tier as Stalin or Hitler. So the end state for any great power competition for America… History is long, there will be more than just these next few decades. It cannot be that if there's a different political system that it has to collapse the way that the Soviet Union collapsed or that Hitler collapsed.\n\nThe first thing to note here is that this could be true of any country. I think people conflate these two arguments. Whereas it's worth noticing that if Australia was producing everything the world consumed and had an economy the size of America's, these arguments should apply to them as well. I don't think people have the sense of if Australia were producing a bunch of stuff for us, we would need to form a coalition against them and have this adversarial attitude. But suppose we did. There's a question of, “How could you prevent this dislocation and is it Australia's fault?” The analogy is breaking down.\n\nLet me just go back to China. So there's low value-added manufacturing where labor cost is a big fraction of cost. That kind of stuff was shipped off to China. But if it wasn't for China, there's many other countries in the world that have much lower labor costs than the US. If it wasn't for China, it'd be like Vietnam or Bangladesh or something. Then there's high tech manufacturing. There I haven't crunched the numbers, but if I were to guess, I don't think with TSMC's leading-edge 5 nanometer wafer, I doubt very little of what it costs to make that is the process engineers themselves. That is just a question of, “Can your country produce it?”\n\nThere's a few different questions in there, so let me break that down. The first thing that you alluded to there. Essentially, is a Cold War the right framing for whatever this conflict is with China? My answer to that is absolutely not. You can address that question both empirically and conceptually. Empirically, if you just look at patterns of trade and investment during the Cold War, the Soviet Union never accounted for more than about 1% of US trade and investment flows were basically non-existent. China at its peak about 10 years ago accounted for 17% of US trade, about the same amount as Japan did in the late 80s and early 90s. That number has come down a little bit on the surface. But when you take account of stuff from China coming in through third countries and so forth, basically that remains the same. If you talk about investment flows, there's $600 billion or more of US corporate investment in China. That generates huge amounts of sales, much larger than US exports to China. The integration of the two economies is just extraordinary. There's basically no precedent for it at any point in economic history. It is just a completely different order of magnitude to what was going on during the Cold War. So one question would be, “Okay, if you really want a Cold War, does that mean that what you want to do is you want to reduce those trade and investment flows back down to essentially zero? If so, how do you do that?” That's a very difficult problem.\n\nYou got at the more core conceptual issue, which is, how does this end? This does not end by China going away or turning into something completely different. It's too big. It is too successful. The economic model is successful on its own terms. It has a lot of problems, but it's fundamentally successful. It is deeply integrated with the entire global economy in ways that are beneficial for China and beneficial for most of the other countries in the world. Everyone has some sort of a stake in China continuing to succeed. This is just not going to go away.\n\nThere’s another sense in which it's not going to go away. Let's say you could wave a magic wand and make the CCP disappear tomorrow and replace it with something else. What would that something else look like? If that something else were to be successful at governing China, it would almost certainly share many of the characteristics of the Chinese Communist Party. It would have a strong determination for China to be an independent geopolitical actor, taking care of its own security with a very strong military so that it could defend itself against all of its real and perceived security threats. It would be committed—as every Chinese government since the mid 19th century has been—to maximizing the rate of technological progress and making sure that as much as possible of China's core technology needs were met by domestic production rather than imports. It would be very, very similar to what we have today. It's a fantasy to think that we have a problem here with just this particular regime, that we can just get them to change their minds. No, the Chinese approach on this is very deeply rooted in both the institutional, cultural history of China itself and its geographical and geopolitical position in the world. So it's going to have interests that create a lot of friction and conflict with the perceived interests of the United States under any government. It's probably going to be quite successful at managing this economy because they've been very successful for many, many decades.\n\nWhen I was in China, I asked somebody I met what would happen if there was an election in China tomorrow. His answer was that it's possible that the median voter in China is much more reactionary than the government. In fact, this might be much more liberal than the regime you would get out of a democratic election.\n\nYes. We don't know for sure because there really is a lot of public polling. But a lot of people say that and my perception is that could well be true. All you have to do is look at the Chinese Internet, the blogosphere. They don't have Twitter but they have local equivalents. There is a lot of unfettered nationalist, highly militaristic thinking there that the government spends most of its time keeping in check. Every so often they unleash it because they're in a spat with Japan or whoever and they need to get the popular opinion. Mostly they try to tamp that down. A Chinese system that was fully representative of actual popular views… We don't know exactly what that might be, but it could be very, very difficult to deal with.\n\nLet’s go back to this discussion about what should be the grand bargain between the rest of the world and China. I live in Silicon Valley and as you know, a big topic of conversation is AI. In particular the race between China and the US on AI. One idea I've heard is that what we should do is give them free rein on solar, electric vehicles, batteries—all this other real world heavy manufacturing that they seem to have greater proclivity for anyways. They consider it more real. On AI and semiconductors, we’ll dominate that. Everything else we'll import. Is this a plausible deal worth making? Because if you take AI very seriously, this might be an amazing bargain. You can say what you want in your ideal state of things, but how do you get there? There are a lot of people in China who'd say, “No, we want it all and we can. So why should we make that deal with you?”\n\nIf I basically take this down to the level on which the United States and China are now starting to negotiate, my personal view on this is that it would make a lot of sense for the US to be much more open to direct investment by Chinese companies in manufacturing in the United States. I'm thinking particularly of things like electric vehicles and that whole supply chain, green energy, industrial automation, all of those things. Why do I think that? First of all, if the US is serious about revitalizing its industrial base—and I think there's a good case for trying to do that selectively—it is not going to happen unless you invite in the world's leading players and have them compete. That is how China industrialized. 45 years ago, they were an industrial basket case. They said, “We want to get industrially strong. How do you do that? Get all the leading companies in the world to invest here and we'll learn from them.” That's how you do it. If we're serious about that, we should be serious about figuring out ways that we can bring Chinese industrial investment into the United States. That to me would be a win-win, because Chinese companies at an individual level would love that. They see the US is a huge market. They can't get into it right now. They would love the opportunity to tap into it more. We could learn from them. And if you did that, basically you would be saying that whatever we're in with China, it's not a cold war, because we are willing to have high levels of direct investment by both sides. You might want to put protections around that, all kinds\n\n\nOf rules of the road.\nBut in an ideal world, we would have a lot more of that.\nThe first question is, why is that so difficult?\nWhy do you essentially have a consensus in Washington that not only do we have to prevent the export of US technology goods to China, but we also have to prevent Chinese companies from investing in the US?\nThis is basically agreed on in Washington.\nThe reason is data.\nFundamentally, there is a view that any manufacturing process today is also a data creation machine.\nWhere does that data go and who benefits from that data?\nThe other thing is that, back 30 or 40 years ago, you used to be able to divide the world into technologies which were essentially for civilian use, a few technologies that were military, and then a very small proportion of dual-use technologies that could go either way.\nIt was those dual-use technologies that had to be controlled very carefully.\nNow basically everything is dual use.\nAny technology that you can imagine can be put to some kind of military use.\nSo it becomes much more risky to have these patterns of investment, particularly when you don't know where the data is flowing and how that will feed into someone else's defense production base.\nThat is a legitimate concern.\nIn my ideal world, you would have a lot more Chinese investment in the United States, but it would be very carefully regulated in the same way that China very carefully regulates the direct investments by foreign companies in its economy.\nThey have rules about data localization, etc.\nI think that could be achieved.\nI think it will be very difficult in the current political environment.\nIn terms of the grand bargain that you suggest, China is very interested in not being pigeonholed.\nThey didn't want to be pigeonholed in low value-added manufacturing.\nThey wanted to do the high tech stuff, now they're doing that.\nThey don't want to be pigeonholed in manufacturing.\nThey want all of technology, including AI.\nI don't think that any strategy premised on the idea that China should accept arbitrary limits on what it can do is viable.\nWould we accept that?\nAbsolutely not.\nSo why should we expect them to accept something that we would consider an absurd and completely unreasonable infringement on our sovereignty?\nIt just doesn't work that way.\nIt's funny because one of the main arguments that China hawks will make, or one of the big parts of the worldview, is that China really cheated us.\nOur companies would invest in China, build up factories in China, and technology would get transferred there.\nThis was a huge arbitrage that China was able to pull.\nSo if you actually believe that, it should just make the reverse of that incredibly compelling.\nBecause you get a chance to do that again.\nDo you want to tell the story of BYD and Tesla in 2018 and 2019?\nBecause I think this really illustrates the point of what could be done in reverse very well.\nIf you go back to the early 1990s, China recognized that pretty much every other country that had gotten rich had done so in large part by building up an automotive industry that then served as the mechanism for creating innovations in other sectors.\nLook at the US, Germany, Japan, even Korea which is very successful.\nThey said, “We have to have a big auto industry.\nThis is one of the key industries that we have to support.”\nSo starting in the early 1990s, they had this strategy of bringing in foreign companies and making them do joint ventures on a 50/50 basis with Chinese auto companies.\nThe theory was that eventually the Chinese companies would learn.\nYou would be able to develop your own national champion auto companies and kick the foreigners out.\nBasically this failed.\nIt failed massively.\nOver the next 25 years, foreign companies came in.\nGeneral Motors, VW, Toyota, Honda and so forth.\nThey did very, very well.\nThe joint venture partners in China basically just sat around and clipped coupons from the dividends that these joint ventures were producing.\nAll of the technological inputs continuously came from the foreign partners, all of the design ideas.\nThe local partners were never able to succeed.\nIn volume terms, you had a lot of smaller scale, locally sponsored vehicle companies in China building low-end vehicles.\nSo a lot of the cars that wound up getting made in China were made by local firms.\nBut if you look at the share of profits and total value in the system, it was dominated by these joint ventures, which were in turn dominated by the foreign partners.\nSo China, circa 2010-2015, had been doing this for 25 years.\nThey were basically no closer to having globally competitive conventional car makers than they had been 25 years before.\nSo in the late 2000s, 2005-2010, they started thinking, \"Well, this and other related industrial policies are not working very well.\nWe are not generating the national champions that we thought would be.\nSo what do we do about this?\"\nTheir answer was to leapfrog.\n“Let's try and figure out what is the next stage of technological development that people really aren't working on yet.\nLet's work on that and then maybe we can get in on the ground floor.”\nWhat they came up with in large measure was renewable energy and specifically electric vehicles.\nThey started having a pretty comprehensive set of subsidies and other kinds of industrial support for companies like BYD to produce electric vehicles.\nBYD is basically a private company.\nThis worked okay for 10 or 12 years.\nBYD got pretty good.\nParticularly what they started to figure out was the supply chain.\nThey got very good at making the batteries.\nBut by 2018-2019, BYD was still not that exciting a company.\nMost people in China really didn't want to buy electric vehicles.\nThey seemed really inconvenient.\nThe sexy cars were the big SUVs that the joint ventures were putting out and so forth.\nThen in 2018, the Chinese government made the decision to allow Tesla to come in and build a wholly-owned Gigafactory in Shanghai.\nThey had never approved a wholly-owned automotive company before.\nThey started cranking out cars in 2019, which became immensely popular.\nIt seems like one of the things that happened was that the Chinese companies by 2019 had gotten pretty good at the underlying technology of electric cars, specifically the batteries and the software systems that govern the cars.\nBut they were terrible at consumer design.\nThey had not figured out how to make appealing products that people would want to buy.\nTesla did have appealing products that people wanted to buy.\nThey were big status symbols.\nSo BYD and its competitors said, “Okay, this is the part we have to figure out.\nHow do we achieve this?”\nBasically, they recognized that they had to up their design game.\nAmong other things, they went to Germany and loaded up on a lot of German car designers that were able to transform their technology base into much more appealing packages.\nThen by 2022 or so, they were able to compete with Tesla both on price and on quality.\nWhat that shows you is that, number one, the Chinese government made a pretty good bet on this leapfrogging idea.\n“There are technologies in the future.\nWe need to get in early, subsidize the heck out of them.”\nSome of the estimates that have been made about the level of subsidies given to the EV industry and its supply chains range from $200-300 billion.\nIt was a huge, huge amount of money that did not generate that much of a financial return for a really long time but they stuck at it.\nThen the thing that finally flipped the switch was this catalytic foreign investment that showed the Chinese companies what they needed to do to actually compete in the consumer market.\nThen they got very good at that very quickly.\nHow much was the $200-300 billion actually relevant given the fact that BYD, as you mentioned, is a private company?\nHow much of that was actually necessary or counterfactually important to creating this outcome?\nIt's like the old slogan about advertising.\nHalf of it works, but you don't know which half.\nDid China need to spend that much in subsidies?\nProbably not.\nBut had they spent less, would they have had the same effect?\nMaybe, maybe not.\nThey tried various different types of subsidies.\nInitially there were producer subsidies to just get companies to produce more.\nThen they had a lot of buyer subsidies at the individual level, but also the city government level to promote things like electric buses.\nI think all of that played a role.\nWhat was important was that the government set a very clear direction and they said, “We want this to happen, we really want it.\nWe don't know how long it's going to take.\nWe're just going to keep trying different things until it works.\nBecause the goal of creating this electric vehicle sector and the whole supply chain for it, that's what we want at the end.”\nWhy are they able to identify these kinds of sectors in advance?\nCentral planning isn't supposed to work.\nThere's been many cases of countries which have tried to do this.\nGermany, Japan, and many other countries missed out on the Internet because there was a centrally directed effort towards these heavy industries or manufacturing, which actually turned out not to be relevant in the 21st century.\nNo, it's definitely perilous.\nChina has a list of key industries.\nIt's called the strategic emerging industries.\nThey came up with it basically in 2010.\nIt built on previous iterations of industrial policy.\nMost of it is not really an effort to predict with a high degree of specificity what comes next.\nThey're mostly pretty obvious things like semiconductors, industrial automation, new materials.\nIt’s all this kind of stuff that would be on anyone's list if you were running a VC fund and saying, “What are the sectors that we think are—”\nBut most VC funds are losing money.\nActually, maybe only a couple of firms in the world were able to make this prediction correctly.\nSo it's like a couple of firms in the world plus the Ministry of Information Technology in China are the only people who can predict the future?\nNo, I think basically the analogy with the VC fund is a pretty good one.\nI’ve made it many, many times.\nThink of China as a giant VC fund that is just willing to lose huge amounts of money for a really long time on the assumption that a few of the bets will pan out.\nChina as a state, as a government, is uniquely able to throw a lot of money at things for a really long time and not care about what returns are.\nThey say, “We're going to identify this universe of potential winners.\nWe're going to promote all of them, basically.\nSome of them may work and some of them may not, and the successes will pay for the failures.\nI guess I'm still confused on why this works.\nMany other countries have tried similar things.\nMITI was a Japanese version of this, right?\nYeah.\nLook at their economy now and their high tech sector.\nThere’s a couple of things.\nFirst of all, even if you go back to like 2005-2006, when we started thinking about this, everyone was saying that green energy was going to be an important industry in the future.\nYou had the Kleiner Perkins guy.\nJohn Doerr was the big VC who said circa 2007, “I'm going to put all of my bets on green energy because this is the future.”\nHe turned out to be wrong from the standpoint of his investment returns.\nBut he turned out to be totally correct in terms of this being a really big thing.\nIt was just not that wild a bet to say that green energy was going to be really important and that we should place a lot of bets on that.\nWhy does this work and why is this different from a central planning thing?\nThat's a really important point.\nFirst of all, the Chinese system, like the systems that preceded it in East Asia—Japan, Korea, Taiwan, and so forth—has always put a lot of emphasis on being good at exporting.\nThere are a lot of pressures within the system to create industries that can export.\nThe reason this is important is if you have a totally closed system—which frankly is what I think Donald Trump is trying to create in the United States—and people are just producing essentially for domestic consumption, there's no incentive to keep up with global technology developments.\nIf you have this constant export focus, essentially what everyone is trying to do… If you have a closed domestic market, you can rig the domestic market and buy off your connections in the government to make sure that you, as a company, have your market share.\nThere are a lot of ways to win that do not involve technological upgrading.\nThat is what dooms all import substitution regimes.\nIf you're an export-driven economy, you can't rig the global economy.\nUltimately you have to compete.\nYou can't compete just on price, you have to compete on raising your game.\nJapan did this successfully, Taiwan did this successfully, Korea did this successfully.\nChina's done that successfully.\nSo that's answer one.\nYou had this underlying system which was heavily incentivized towards technological upgrading across the board.\nThat's what you were sitting on top of.\nIt was completely different from the old central planning regime, which was autarkic and inward-looking.\nSecond, you had this domestic competition environment which was really cutthroat and involved a lot of international companies.\nThis is a little bit of a difference from Japan, which always kept the foreign companies out of its domestic market.\nTheir companies operated globally very, very well, but the domestic market was very protected.\nChina's domestic market was not that protected.\nThey were always willing to bring in companies that they thought would be able to spark some technological change.\nSo what this did is it created a field in which whether the government has the right ideas, or whether they don't, you have a crucible in which their ideas can be tested.\nYou have a very competitive domestic market where you have a lot of the big international players doing their own thing as well.\nSo the things that work get some validation and you can keep building on those successes.\nThat's really important.\nThen just the sheer scale at which they were able and willing to support what appeared to be losing bets for a long time does matter.\nYou could contrast their view, for example, in solar energy.\nThey said, “Look, we want to be big in solar energy.”\nAgain, they started thinking about this in 2005.\n“What do we need to do?”\nSo they identified the whole supply chain, from the raw silicon inputs to all of the modules in the finished panels.\nThey said, “We want to be in every stage of that.”\nSo they had a pretty deliberate strategy of trying to create people at every point in the supply chain.\nAnd they were willing to go through cycles of people not making any money.\nThe obvious comparison in the United States is that the US government gives one loan to one company, Solyndra.\nIt goes bad and everyone says this is proof that industrial policy does not work.\nChina actually has the right answer to that question.\nWe had the wrong answer to that question.\nYou have to be willing to accept some failures and some loss of government money along the way if you want to get to the end.\nBut I really stress the ecosystem because a lot of this would not have worked just by the government saying\n\n\n“Oh, we want to do solar.” It would not have worked unless you had this broader ecosystem of export-driven manufacturing, high competition, and international participation across many, many sectors of the economy. They all converged to create success for themselves.\n\nI want to put some of these bureaucrats in a Factorio speedrun and see how they do so.\n\nI just interviewed Ken Rogoff, so Japan's top of mind for me. It's really interesting that even though Japan had this export discipline, maybe the reason that the growth didn't continue after the 80s is because you had this convoy system where banks were incentivized to lend to people they knew in these conglomerates. These conglomerates have been around for decades, even before World War II.\n\nI have a question now about China. You have these companies which have become national champions and are conglomerates, the same companies producing a phone and a car and everything in between. Given the intrinsic nature of authoritarian systems, or systems with financial repression, will we go to a system that is closer to what Japan had in the 80s? They’re going to give money to Huawei because Huawei or BYD are the right people. Or will it remain dynamic, especially in the sectors which are coming up over the next few decades?\n\nIt's a good question. I would start by emphasizing the ways in which China is very, very different from Japan. The central thing that is really different and lies at the root of a lot of this, is that China is an independent geopolitical actor. Japan was not. Japan, at the end of the day, could rely on the US for security. They were demilitarized. China basically is on its own. They're in a very dangerous neighborhood. They have 14 land neighbors they share borders with. They have names like North Korea, Russia, Pakistan, Afghanistan, a lot of dangerous actors. Several of them have nuclear weapons: North Korea, Russia, Pakistan, and India. So China, just in a very narrow sense, lives in a very dangerous neighborhood. They quite legitimately have some pretty significant national security needs. They also have aspirations to be a great power, and they want to do it on their own. The incentive to get things right is much more existential in China than it was in Japan. Japan essentially could take the choice to sort of say, “Oh, we're going to have a stagnant economy and that's bad and whatever, but actually we'll be fine.” For China, it's not fine. So underlying it, there's a spur that increases the chances that the Chinese leaders will do the things that they need to do to keep the system more dynamic. It's not a guarantee, but it's a pretty strong incentive.\n\nThen, if you look at some of the specifics, the big difference between the way that China and Japan are economically organized is essentially the relationship between the financial and the corporate sector. Japan had a system where banks owned equity in these giant industrial companies and trading companies, and vice versa. There were these cross shareholdings, which meant that essentially the entire economy of Japan, the entire corporate and financial sector, had one big balance sheet. All of that balance sheet rested, by the late 1980s, on land values that had just gotten completely detached from any form of reality. There was an investment thesis among investors who were playing the Japanese stock market in the late 80s, that you did not look at the earnings of Japanese companies. Those were irrelevant. What you looked at was the value of the land they controlled. You looked at essentially a capital ratio where you assumed that the value of their underlying land capital was a permanent contribution to their wealth and prosperity. The valuations of these stocks, which again got crazy, you couldn't justify them by earnings. They said, it doesn't matter because the land they're sitting on is so valuable. Then the land values collapsed by 80%. The stock values had to collapse by a similar amount, 80%. Everyone was holding shares of one another. So the banks’ capital got eroded because a lot of their capital was tied up in the land and in the stocks which were collateralized by land. So they were unable to lend. They just had to deleverage as fast as possible. The companies had to deleverage as fast as possible. The entire economy got engulfed by this phenomenon of debt deflation, which basically means in the act of paying down the debt—because you're doing fire sales of assets—you're reducing the prices of those assets and introducing deflation. So the real value of your debt continues to grow even as you are supposedly reducing it, because of the deflationary effect. It's very, very difficult to get out.\n\nChina does not have this problem at all. They looked at the problems that Japan got into, they looked at similar problems that Korea had in the late 1990s, and they said, “We will never allow this kind of cross shareholding between financial companies and corporations. This is way too dangerous.” They have kept the two quarantined. It is illegal for industrial companies to own a bank. The bigger ones are allowed to have internal financing subsidiaries, but they can only sort of manage finance inflows within the group. It is also illegal for banks to load up on shares of industrial companies. So you have a distinct financial system and industrial system. That means that the particular type of macro problem that Japan got into is very, very unlikely to occur in China.\n\nYou do have huge debt problems. The property developers are very over leveraged, it’s a huge problem. We've had a massive property crash in China over the last five years. That is a big, big problem. You have local governments that borrowed a lot of money, invested in infrastructure which is now delivering very little returns. They have a big debt problem. You have very substantial debt problems in China that have significant negative macro consequences. But they're all isolated and they can be dealt with sort of one by one. If you look at the industrial sector, it's not very highly leveraged. Debt levels in fact are not high. Most private companies in China have learned for many years that they couldn't get access to bank credit. The banks only wanted to lend to state-owned enterprises which were secure, had physical collateral, and had a state guarantee. Private companies for years have learned to make do by basically financing their investment out of retained earnings. Their leverage ratios are not that high. They're creeping up now over the last few years because of the big industrial policy push. But fundamentally they're in a very different position from the Japanese companies.\n\nInteresting. This is just stuff from your book that I'm citing back to you. You talk about these local government financing vehicles which are backed. The local government takes out a lot of loans in order to build this infrastructure. That is backed by the presumed appreciation of the land, which should go up as this infrastructure goes up. That sounds actually very similar to the problem you were describing with Japan. You say, “Look, this is debt that's on the local government's balance sheets. But fundamentally it's like one country.” You have this system where the government can just hand the debt to somebody. So how immune is the private economy really? Will it just take down the local government and then nobody will make a fuss? These other companies will just never have to hear about it again?\n\nI guess my view on this is that the local government land based financing model was actually a pretty smart thing to do initially. For a decade or so it worked quite well. Local governments were sitting on a lot of these land assets. The land assets originally were undervalued quite substantially. So it made sense for the local governments essentially to try and capitalize some of the future value of these things and use them to finance infrastructure development. This was not a rogue policy that local governments came up with on their own. It was actually sponsored by the central government and the China Development Bank back in the early 2000s. They were grappling with the problem that China at that point had a severe shortage of housing and infrastructure of all kinds, including urban infrastructure. The question was, “We need a lot more of this stuff. How do we build it? How do we finance it?” They realized, “Actually as we build this stuff out, the values of the land are going to skyrocket. So let's essentially take some financing against that future land price appreciation and use that to build the infrastructure that makes everything possible.” If you look at the first two cases of where this was done in the early 2000s, they had these estimates of what the land would ultimately be worth that seemed ridiculous and astronomical at the time. They were in fact way too low. They were way, way conservative on what the actual land price appreciation would be. So you had a period of about eight or nine years where essentially the state-run development banks were doing this in a fairly controlled way, very successfully. What happened was that after the 2008 financial crisis, the government said, “Oh, we just have to spend a lot of money to gin-up growth because there's been this global economic catastrophe.” They did a massive cash infusion into the banks and to the state-owned enterprises. They said, “Spend, spend, spend, and basically all infrastructure is good infrastructure or just build whatever you want.” What happened at that point was that all of the commercial banks got into this business of lending money to local governments for these infrastructure projects. Their underwriting standards were much less robust than the China Development Bank’s had been. For the local governments, it was just free money to them. They just took all the money and they ran with it. That created this kind of Frankenstein's monster. Even so, you had quite a lot of that money in the first two years that probably generated a pretty good return because China was still underbuilt relative to what it needed to be. But after that had run for three or four years, it became clear that a lot of this was going into wasteful projects that didn't deliver a good return. Now they've been struggling for the last decade to unwind that. But it's important to understand that the underlying model was actually an okay model. It just wound up being done in a way that was completely uncoordinated and excessive. You didn't have incentive structures that enabled local governments to rein it in when they needed to. So I still think that that is fundamentally a local government fiscal problem, which ultimately is a central government fiscal problem.\n\nIf you look at the consolidated balance sheet of the central and local governments, put all together, China's government debt is still probably less as a share of GDP than US federal government debt. The US is over 100%, China is probably under 100%.\n\nSo my previous guest, Victor Shih, estimated that the local government debt alone is somewhere between 100-150% of GDP. If you add it to the central government debt, I think he estimated that government debt in China is 200% of GDP.\n\nI would respectfully disagree with Victor on that. It's impossible to know for sure. You have the problem of formal debt, which is debt issued by government entities, and then you have contingent debt, which is debt issued by corporations that may or may not essentially be fronts or windows for local governments. There is also a very significant problem of double counting, which is hard to resolve. Debt gets counted at different levels in the system. It's one piece of debt, but depending on how long the chain is, it gets counted in various different places. I've long had the view that many of these much larger estimates of debt don't fully account for the double counting problem. It's quite possible that the true debt level is higher than what we think it is. It's unlikely, in my opinion, to be as high as Victor says it is. It also matters what the debt goes to and who is actually formally responsible for paying it. Are there project flows or income flows that can be used to pay for it? The structure of the servicing of the debt matters.\n\nAt the end of the day, we do have a pretty good sense from the macro data of how much total debt there is in the economy. It's on the order of 300% of GDP. So if you want to say that government debt is 200% of GDP, then unless you're double counting, you're basically saying that everything else is a lot less than you think it is.\n\nDo we know what the total debt, private and public, is in the US?\n\nI don't have it off the top of my head. The federal government debt I think is around 110% GDP, something like that. Total gross debt of all sectors, government, corporations, households, I think would be on the order of around 300% of GDP. Japan is substantially higher.\n\nYou can get into an endless debate on these things where it becomes kind of a numbers game. But I have a pretty high conviction that China has a significant macro leverage issue. If you take my numbers, say gross debt to GDP—which by the way are the official numbers of the Chinese government and largely accepted with some structural modifications by the IMF, so forth—it’s 300% of GDP. That is in the ballpark for highly developed economies. It is extremely high for middle-income economies. So if you look at China as a country that has average per capita income that's kind of like Brazil, China is way more leveraged than any other country of its level of income. That is potentially a problem. So I don't want to make light of the problem because I think it is quite serious. It's an important constraint on policy and it is an important constraint on growth, at the moment. I don't think that it leads to a financial collapse situation because the system is contained and all the debt is denominated in local currencies. But it does impose a tax on growth and it is one of the things that makes China's growth more sluggish now than it probably could be.\n\nWhy is it the case that middle-income countries are especially in a bad position with having a high debt to GDP ratio? You would think naively that they're in a position to have higher growth over coming years, so it may make sense for them to take on more debt so they can use that to finance the greater growth that will come—theoretically assuming they use it to invest in high return things—as opposed to the US or Japan where you're just going to be stuck with this debt load for a long time.\n\nOne of the things that you could say about debt historically in China was that it tended in general to finance productive assets, whether it was industrial production or infrastructure. For many years China was a very infrastructure short country relative to its needs. So you could justify quite substantial debt-financed infrastructure investments on the basis of these would deliver good economic returns for many decades. The case for that is a lot weaker now than it was before. The problem is how you essentially retire this enormous stock of very low-productivity, infrastructure investments, debt-financed. How do you sort of move on and have a more productive return on capital in future?\n\nThere are ways for solving that problem. To me the fundamental issue is they have too much of a supply-side strategy,\n\n\nNot enough of a demand-side strategy.\nIt's really a macroeconomic issue.\nIf they had stronger domestic demand, that would generate more profits for companies.\nThey would be able to have more pricing power for companies.\nYou would get a little bit of inflation.\nSo you would have more cash flows within the economies that would enable people, and local governments, to pay down debt.\nA little bit of inflation would erode the real value of the debt.\nThat's essentially how they got out of their last debt problem in the late 1990s.\nThey had gigantic bad debts in the banking system, essentially representing legacy loans to state-owned enterprises.\nThey had no way of paying them back.\nThey had a very, very growth friendly program that generated a lot of growth, a lot of inflation.\nThat basically strengthened their debt problem.\nWhat they need now is a kind of a revamped, updated version of that strategy.\nThey do a lot more to promote domestic demand, to get more profits, more cash flows, and a little bit more inflation into the system.\nThat would probably solve the debt problem over a decade or two.\n",
  "metadata": {
    "summary": "Arthur Kroeber discusses China's high-tech advancements, attributing them to the government's strategic investments and subsidies. The conversation delves into the complexities of the China-US relationship, advocating for a mutually beneficial approach. The episode covers China's manufacturing dominance, potential economic challenges, and the future of AI, emphasizing the need for international cooperation and understanding in navigating China's growing influence.",
    "topClaims": [
      {
        "text": "China's ambition is to produce all the manufactured goods in the world.",
        "rating": 8.5,
        "chunkId": "ck-qb644F-iE_s-1"
      },
      {
        "text": "US elites have never, to this day, really gotten comfortable with the idea that the Chinese political system is legitimate.",
        "rating": 7.8,
        "chunkId": "ck-qb644F-iE_s-3"
      },
      {
        "text": "China is an evil regime, but not in the same tier as Stalin or Hitler.",
        "rating": 8,
        "chunkId": "ck-qb644F-iE_s-5"
      },
      {
        "text": "We should be serious about figuring out ways that we can bring Chinese industrial investment into the United States.",
        "rating": 7.5,
        "chunkId": "ck-qb644F-iE_s-11"
      }
    ],
    "topQuotes": [
      {
        "text": "What really is the problem if China becomes as wealthy as America, or if its economy grows as big, or even bigger than America’s?",
        "chunkId": "ck-qb644F-iE_s-0",
        "chunkNum": 0,
        "relevance": 9.5,
        "interesting": 9.2
      },
      {
        "text": "I think China today is an evil regime in a way, but it's just not in the same tier as Stalin or Hitler.",
        "chunkId": "ck-qb644F-iE_s-5",
        "chunkNum": 5,
        "relevance": 8.9,
        "interesting": 8.8
      },
      {
        "text": "The integration of the two economies is just extraordinary.",
        "chunkId": "ck-qb644F-iE_s-7",
        "chunkNum": 7,
        "relevance": 8.1,
        "interesting": 7.9
      },
      {
        "text": "China as a state, as a government, is uniquely able to throw a lot of money at things for a really long time and not care about what returns are.",
        "chunkId": "ck-qb644F-iE_s-20",
        "chunkNum": 20,
        "relevance": 8.5,
        "interesting": 8.3
      }
    ],
    "topTopics": [
      {
        "name": "china tech",
        "count": 7,
        "description": "China's high-tech manufacturing dominance"
      },
      {
        "name": "us china",
        "count": 5,
        "description": "The US-China relationship and future"
      },
      {
        "name": "china economy",
        "count": 4,
        "description": "China's economic system and growth"
      },
      {
        "name": "china ai",
        "count": 3,
        "description": "China's approach to AI development"
      },
      {
        "name": "china investment",
        "count": 3,
        "description": "China's industrial investment in US"
      }
    ],
    "videoInfo": {
      "id": "qb644F-iE_s",
      "etag": "bxrdk9lln6xxOSeL-__SxmArHeY",
      "kind": "youtube#video",
      "snippet": {
        "title": "China's Road to High Tech Supremacy  — Arthur Kroeber",
        "channelId": "UCXl4i9dYBrFOabk0xGmbkRA",
        "localized": {
          "title": "China's Road to High Tech Supremacy  — Arthur Kroeber",
          "description": "Arthur Kroeber is a leading researcher on Chinese tech and macro, a founding partner at Gavekal Dragonomics, and author of \"China's Economy: What Everyone Needs to Know\". It's the most useful, detailed resource I've found of how China actually works.\n\nOn this episode, we discuss how China achieved high-tech manufacturing dominance, and where they'll go from here. By Arthur’s account, the Chinese government is like a giant VC fund: they decide on key priorities and then spend hundreds of billions of dollars subsidizing ruthless competition at the local level. They are willing to lose huge amounts of money for a few of their bets to pay off: at China’s scale, effectiveness matters more than efficiency.\n\nThere's also a growing bipartisan consensus that we need to combat China's rise. This doesn’t make much sense to me. China is a big, powerful country at the frontier in many fields, and its economy is intricately tied in with our own. Being instinctively adversarial is both unsustainable and risky. Arthur and I discuss how we can create a productive, mutually beneficial version of this relationship.\n\nRead the transcript: https://www.dwarkesh.com/p/arthur-kroeber\nApple Podcasts: https://podcasts.apple.com/us/podcast/dwarkesh-podcast/id1516093381?i=1000713627073\nSpotify: https://open.spotify.com/episode/2EXad7ZEt0oXezigqd7WLe?si=45d9402e6fce4095\nGet Arthur's book: https://www.amazon.com/Chinas-Economy-Everyone-Needs-Know%C2%AE/dp/0190239034\n\n----------------------------------------\n\nSPONSORS\n\n* Scale is building the infrastructure for smarter, safer AI. In addition to their Data Foundry, they just released Scale Evaluation, a tool that diagnoses model limitations. Learn how Scale can help you push the frontier at https://scale.com/dwarkesh\n\n* WorkOS Radar ensures your product’s free trials go to actual users. Radar uses 80+ signals to distinguish malicious bots from real people, eliminating costly free-tier abuse. See why companies like Cursor, Perplexity, and OpenAI use Radar by visiting https://workos.com/radar\n\n* Lighthouse is THE fastest immigration solution for the technology industry. They help you understand your options and navigate applications for expert visas like the O-1A and EB-1A. Explore which visa is right for you at https://www.lighthousehq.com/ref/Dwarkesh.\n\nTo sponsor a future episode, visit https://dwarkesh.com/advertise\n\n----------------------------------------\n\nTIMESTAMPS\n(00:00:00) – We should reconcile with China\n(00:21:21) – BYD, Tesla, & Chinese EV industry\n(00:36:05) – Will China have a Japan-style financial crisis?\n(00:44:39) – Local debt situation is manageable\n(00:57:28) – If CCP is so competent, why isn’t China richer?\n(01:05:08) – How China keeps tech under control\n(01:33:45) – Does China win AI?\n(01:43:34) – Communication with China key for AI safety\n(02:10:08) – What foreigners get wrong about China\n(02:17:32) – China-US relationship future"
        },
        "categoryId": "28",
        "thumbnails": {
          "high": {
            "url": "https://i.ytimg.com/vi/qb644F-iE_s/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/qb644F-iE_s/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/qb644F-iE_s/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "default": {
            "url": "https://i.ytimg.com/vi/qb644F-iE_s/default.jpg",
            "width": 120,
            "height": 90
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/qb644F-iE_s/sddefault.jpg",
            "width": 640,
            "height": 480
          }
        },
        "description": "Arthur Kroeber is a leading researcher on Chinese tech and macro, a founding partner at Gavekal Dragonomics, and author of \"China's Economy: What Everyone Needs to Know\". It's the most useful, detailed resource I've found of how China actually works.\n\nOn this episode, we discuss how China achieved high-tech manufacturing dominance, and where they'll go from here. By Arthur’s account, the Chinese government is like a giant VC fund: they decide on key priorities and then spend hundreds of billions of dollars subsidizing ruthless competition at the local level. They are willing to lose huge amounts of money for a few of their bets to pay off: at China’s scale, effectiveness matters more than efficiency.\n\nThere's also a growing bipartisan consensus that we need to combat China's rise. This doesn’t make much sense to me. China is a big, powerful country at the frontier in many fields, and its economy is intricately tied in with our own. Being instinctively adversarial is both unsustainable and risky. Arthur and I discuss how we can create a productive, mutually beneficial version of this relationship.\n\nRead the transcript: https://www.dwarkesh.com/p/arthur-kroeber\nApple Podcasts: https://podcasts.apple.com/us/podcast/dwarkesh-podcast/id1516093381?i=1000713627073\nSpotify: https://open.spotify.com/episode/2EXad7ZEt0oXezigqd7WLe?si=45d9402e6fce4095\nGet Arthur's book: https://www.amazon.com/Chinas-Economy-Everyone-Needs-Know%C2%AE/dp/0190239034\n\n----------------------------------------\n\nSPONSORS\n\n* Scale is building the infrastructure for smarter, safer AI. In addition to their Data Foundry, they just released Scale Evaluation, a tool that diagnoses model limitations. Learn how Scale can help you push the frontier at https://scale.com/dwarkesh\n\n* WorkOS Radar ensures your product’s free trials go to actual users. Radar uses 80+ signals to distinguish malicious bots from real people, eliminating costly free-tier abuse. See why companies like Cursor, Perplexity, and OpenAI use Radar by visiting https://workos.com/radar\n\n* Lighthouse is THE fastest immigration solution for the technology industry. They help you understand your options and navigate applications for expert visas like the O-1A and EB-1A. Explore which visa is right for you at https://www.lighthousehq.com/ref/Dwarkesh.\n\nTo sponsor a future episode, visit https://dwarkesh.com/advertise\n\n----------------------------------------\n\nTIMESTAMPS\n(00:00:00) – We should reconcile with China\n(00:21:21) – BYD, Tesla, & Chinese EV industry\n(00:36:05) – Will China have a Japan-style financial crisis?\n(00:44:39) – Local debt situation is manageable\n(00:57:28) – If CCP is so competent, why isn’t China richer?\n(01:05:08) – How China keeps tech under control\n(01:33:45) – Does China win AI?\n(01:43:34) – Communication with China key for AI safety\n(02:10:08) – What foreigners get wrong about China\n(02:17:32) – China-US relationship future",
        "publishedAt": "2025-06-19T16:25:39Z",
        "channelTitle": "Dwarkesh Patel",
        "defaultAudioLanguage": "en",
        "liveBroadcastContent": "none"
      },
      "statistics": {
        "likeCount": "1196",
        "viewCount": "41907",
        "commentCount": "380",
        "favoriteCount": "0"
      },
      "contentDetails": {
        "caption": "true",
        "duration": "PT2H27M30S",
        "dimension": "2d",
        "definition": "hd",
        "projection": "rectangular",
        "contentRating": {},
        "licensedContent": true
      }
    },
    "checkCount": 26,
    "nodeCounts": [
      {
        "node": "China",
        "count": 9
      },
      {
        "node": "Japan",
        "count": 5
      },
      {
        "node": "electric vehicles",
        "count": 3
      },
      {
        "node": "Chinese companies",
        "count": 3
      },
      {
        "node": "supply chain",
        "count": 3
      },
      {
        "node": "BYD",
        "count": 3
      },
      {
        "node": "America",
        "count": 2
      },
      {
        "node": "Chinese political system",
        "count": 2
      },
      {
        "node": "manufacturing",
        "count": 2
      },
      {
        "node": "United States",
        "count": 2
      },
      {
        "node": "direct investment",
        "count": 2
      },
      {
        "node": "Joint ventures",
        "count": 2
      },
      {
        "node": "Foreign companies",
        "count": 2
      },
      {
        "node": "national champions",
        "count": 2
      },
      {
        "node": "banks",
        "count": 2
      },
      {
        "node": "conglomerates",
        "count": 2
      },
      {
        "node": "Infrastructure investments",
        "count": 2
      },
      {
        "node": "Arthur Kroeber",
        "count": 1
      },
      {
        "node": "Gavekal Dragonomics",
        "count": 1
      },
      {
        "node": "China’s Economy: What Everyone Needs to Know",
        "count": 1
      },
      {
        "node": "China hawk",
        "count": 1
      },
      {
        "node": "China's economic model",
        "count": 1
      },
      {
        "node": "Manufacturing export machine",
        "count": 1
      },
      {
        "node": "Trade surplus",
        "count": 1
      },
      {
        "node": "Global economy",
        "count": 1
      },
      {
        "node": "How China gets rich",
        "count": 1
      },
      {
        "node": "Production structure",
        "count": 1
      },
      {
        "node": "Ever-growing trade surpluses",
        "count": 1
      },
      {
        "node": "Fairness",
        "count": 1
      },
      {
        "node": "Sustainability",
        "count": 1
      },
      {
        "node": "Stability",
        "count": 1
      },
      {
        "node": "political consequences",
        "count": 1
      },
      {
        "node": "trade surplus",
        "count": 1
      },
      {
        "node": "government involvement",
        "count": 1
      },
      {
        "node": "high savings",
        "count": 1
      },
      {
        "node": "Chinese taxpayer",
        "count": 1
      },
      {
        "node": "foreign importers",
        "count": 1
      },
      {
        "node": "good deal",
        "count": 1
      },
      {
        "node": "China's growth",
        "count": 1
      },
      {
        "node": "systemic political difference",
        "count": 1
      },
      {
        "node": "leader of democracies",
        "count": 1
      },
      {
        "node": "democratic system",
        "count": 1
      },
      {
        "node": "World War II and the Cold War",
        "count": 1
      },
      {
        "node": "alliance of democracies",
        "count": 1
      },
      {
        "node": "convergence of systems",
        "count": 1
      },
      {
        "node": "authoritarian system",
        "count": 1
      },
      {
        "node": "difficulties",
        "count": 1
      },
      {
        "node": "China's economy",
        "count": 1
      },
      {
        "node": "low cost production",
        "count": 1
      },
      {
        "node": "US politics",
        "count": 1
      },
      {
        "node": "diversified production structure",
        "count": 1
      },
      {
        "node": "manufacturing economy",
        "count": 1
      },
      {
        "node": "financialized economy",
        "count": 1
      },
      {
        "node": "social compact",
        "count": 1
      },
      {
        "node": "China's growing power",
        "count": 1
      },
      {
        "node": "societies around the world",
        "count": 1
      },
      {
        "node": "difficult problem",
        "count": 1
      },
      {
        "node": "US domestic policy",
        "count": 1
      },
      {
        "node": "Scapegoating China",
        "count": 1
      },
      {
        "node": "Income redistribution",
        "count": 1
      },
      {
        "node": "Macroeconomic policy",
        "count": 1
      },
      {
        "node": "global manufacturing economy",
        "count": 1
      },
      {
        "node": "agreed set of rules",
        "count": 1
      },
      {
        "node": "great power conflict",
        "count": 1
      },
      {
        "node": "Soviet Union collapse",
        "count": 1
      },
      {
        "node": "Hitler",
        "count": 1
      },
      {
        "node": "arguments",
        "count": 1
      },
      {
        "node": "Australia",
        "count": 1
      },
      {
        "node": "dislocation",
        "count": 1
      },
      {
        "node": "high tech manufacturing",
        "count": 1
      },
      {
        "node": "TSMC",
        "count": 1
      },
      {
        "node": "Vietnam",
        "count": 1
      },
      {
        "node": "Bangladesh",
        "count": 1
      },
      {
        "node": "process engineers",
        "count": 1
      },
      {
        "node": "conflict",
        "count": 1
      },
      {
        "node": "trade and investment",
        "count": 1
      },
      {
        "node": "Cold War",
        "count": 1
      },
      {
        "node": "US trade",
        "count": 1
      },
      {
        "node": "Soviet Union",
        "count": 1
      },
      {
        "node": "economic history",
        "count": 1
      },
      {
        "node": "corporate investment",
        "count": 1
      },
      {
        "node": "third countries",
        "count": 1
      },
      {
        "node": "trade and investment flows",
        "count": 1
      },
      {
        "node": "economic model",
        "count": 1
      },
      {
        "node": "global economy",
        "count": 1
      },
      {
        "node": "CCP",
        "count": 1
      },
      {
        "node": "geopolitical actor",
        "count": 1
      },
      {
        "node": "military",
        "count": 1
      },
      {
        "node": "technological progress",
        "count": 1
      },
      {
        "node": "cultural history",
        "count": 1
      },
      {
        "node": "geopolitical position",
        "count": 1
      },
      {
        "node": "friction and conflict",
        "count": 1
      },
      {
        "node": "median voter",
        "count": 1
      },
      {
        "node": "democratic election",
        "count": 1
      },
      {
        "node": "Chinese Internet",
        "count": 1
      },
      {
        "node": "nationalist thinking",
        "count": 1
      },
      {
        "node": "popular views",
        "count": 1
      },
      {
        "node": "grand bargain",
        "count": 1
      },
      {
        "node": "Silicon Valley",
        "count": 1
      },
      {
        "node": "AI race",
        "count": 1
      },
      {
        "node": "semiconductors",
        "count": 1
      },
      {
        "node": "United States and China",
        "count": 1
      },
      {
        "node": "green energy",
        "count": 1
      },
      {
        "node": "industrial base",
        "count": 1
      },
      {
        "node": "industrial automation",
        "count": 1
      },
      {
        "node": "industrialization",
        "count": 1
      },
      {
        "node": "industrial strength",
        "count": 1
      },
      {
        "node": "Chinese industrial investment",
        "count": 1
      },
      {
        "node": "cold war",
        "count": 1
      },
      {
        "node": "protections",
        "count": 1
      },
      {
        "node": "industrial basket case",
        "count": 1
      },
      {
        "node": "win-win",
        "count": 1
      },
      {
        "node": "Rules of the road",
        "count": 1
      },
      {
        "node": "export of US technology goods to China",
        "count": 1
      },
      {
        "node": "Chinese companies investing in the US",
        "count": 1
      },
      {
        "node": "data creation machine",
        "count": 1
      },
      {
        "node": "dual-use technologies",
        "count": 1
      },
      {
        "node": "civilian use technologies",
        "count": 1
      },
      {
        "node": "military technologies",
        "count": 1
      },
      {
        "node": "consensus in Washington",
        "count": 1
      },
      {
        "node": "manufacturing process",
        "count": 1
      },
      {
        "node": "US technology goods",
        "count": 1
      },
      {
        "node": "military use",
        "count": 1
      },
      {
        "node": "investment patterns",
        "count": 1
      },
      {
        "node": "data flow",
        "count": 1
      },
      {
        "node": "Chinese investment",
        "count": 1
      },
      {
        "node": "foreign investment regulation",
        "count": 1
      },
      {
        "node": "data localization",
        "count": 1
      },
      {
        "node": "political environment",
        "count": 1
      },
      {
        "node": "China's interests",
        "count": 1
      },
      {
        "node": "low value-added manufacturing",
        "count": 1
      },
      {
        "node": "high tech",
        "count": 1
      },
      {
        "node": "AI",
        "count": 1
      },
      {
        "node": "arbitrary limits",
        "count": 1
      },
      {
        "node": "infringement on our sovereignty",
        "count": 1
      },
      {
        "node": "China hawks",
        "count": 1
      },
      {
        "node": "technology",
        "count": 1
      },
      {
        "node": "factories in China",
        "count": 1
      },
      {
        "node": "arbitrage",
        "count": 1
      },
      {
        "node": "reverse of that",
        "count": 1
      },
      {
        "node": "BYD and Tesla in 2018 and 2019",
        "count": 1
      },
      {
        "node": "China's automotive industry strategy",
        "count": 1
      },
      {
        "node": "Mechanism for innovation",
        "count": 1
      },
      {
        "node": "Early 1990s China",
        "count": 1
      },
      {
        "node": "National champion auto companies",
        "count": 1
      },
      {
        "node": "Automotive industry",
        "count": 1
      },
      {
        "node": "China's economic recognition",
        "count": 1
      },
      {
        "node": "Failed venture",
        "count": 1
      },
      {
        "node": "General Motors",
        "count": 1
      },
      {
        "node": "VW",
        "count": 1
      },
      {
        "node": "Toyota",
        "count": 1
      },
      {
        "node": "Honda",
        "count": 1
      },
      {
        "node": "Joint venture partners",
        "count": 1
      },
      {
        "node": "Technological inputs",
        "count": 1
      },
      {
        "node": "Local firms",
        "count": 1
      },
      {
        "node": "China circa 2010-2015",
        "count": 1
      },
      {
        "node": "industrial policies",
        "count": 1
      },
      {
        "node": "leapfrog",
        "count": 1
      },
      {
        "node": "technological development",
        "count": 1
      },
      {
        "node": "renewable energy",
        "count": 1
      },
      {
        "node": "batteries",
        "count": 1
      },
      {
        "node": "2018-2019",
        "count": 1
      },
      {
        "node": "Electric vehicles",
        "count": 1
      },
      {
        "node": "Chinese government decision",
        "count": 1
      },
      {
        "node": "Tesla Gigafactory Shanghai",
        "count": 1
      },
      {
        "node": "2019",
        "count": 1
      },
      {
        "node": "EV technology advancements",
        "count": 1
      },
      {
        "node": "Consumer design",
        "count": 1
      },
      {
        "node": "Status symbols",
        "count": 1
      },
      {
        "node": "Batteries and software systems",
        "count": 1
      },
      {
        "node": "design game",
        "count": 1
      },
      {
        "node": "German car designers",
        "count": 1
      },
      {
        "node": "technology base",
        "count": 1
      },
      {
        "node": "Tesla",
        "count": 1
      },
      {
        "node": "Chinese government",
        "count": 1
      },
      {
        "node": "leapfrogging idea",
        "count": 1
      },
      {
        "node": "EV industry",
        "count": 1
      },
      {
        "node": "foreign investment",
        "count": 1
      },
      {
        "node": "consumer market",
        "count": 1
      },
      {
        "node": "electric vehicle sector",
        "count": 1
      },
      {
        "node": "strategic emerging industries",
        "count": 1
      },
      {
        "node": "giant VC fund",
        "count": 1
      },
      {
        "node": "MITI",
        "count": 1
      },
      {
        "node": "John Doerr",
        "count": 1
      },
      {
        "node": "East Asia",
        "count": 1
      },
      {
        "node": "central planning regime",
        "count": 1
      },
      {
        "node": "export-driven economy",
        "count": 1
      },
      {
        "node": "domestic market",
        "count": 1
      },
      {
        "node": "international companies",
        "count": 1
      },
      {
        "node": "solar energy",
        "count": 1
      },
      {
        "node": "raw silicon inputs",
        "count": 1
      },
      {
        "node": "modules",
        "count": 1
      },
      {
        "node": "finished panels",
        "count": 1
      },
      {
        "node": "deliberate strategy",
        "count": 1
      },
      {
        "node": "Solyndra",
        "count": 1
      },
      {
        "node": "industrial policy",
        "count": 1
      },
      {
        "node": "failures",
        "count": 1
      },
      {
        "node": "ecosystem",
        "count": 1
      },
      {
        "node": "US government",
        "count": 1
      },
      {
        "node": "solar",
        "count": 1
      },
      {
        "node": "export-driven manufacturing",
        "count": 1
      },
      {
        "node": "high competition",
        "count": 1
      },
      {
        "node": "international participation",
        "count": 1
      },
      {
        "node": "sectors of the economy",
        "count": 1
      },
      {
        "node": "bureaucrats",
        "count": 1
      },
      {
        "node": "Factorio speedrun",
        "count": 1
      },
      {
        "node": "Ken Rogoff",
        "count": 1
      },
      {
        "node": "export discipline",
        "count": 1
      },
      {
        "node": "convoy system",
        "count": 1
      },
      {
        "node": "World War II",
        "count": 1
      },
      {
        "node": "growth",
        "count": 1
      },
      {
        "node": "Huawei",
        "count": 1
      },
      {
        "node": "authoritarian systems",
        "count": 1
      },
      {
        "node": "financial repression",
        "count": 1
      },
      {
        "node": "dynamic sectors",
        "count": 1
      },
      {
        "node": "North Korea",
        "count": 1
      },
      {
        "node": "Russia",
        "count": 1
      },
      {
        "node": "Pakistan",
        "count": 1
      },
      {
        "node": "Afghanistan",
        "count": 1
      },
      {
        "node": "India",
        "count": 1
      },
      {
        "node": "national security",
        "count": 1
      },
      {
        "node": "great power",
        "count": 1
      },
      {
        "node": "stagnant economy",
        "count": 1
      },
      {
        "node": "financial and corporate sector",
        "count": 1
      },
      {
        "node": "cross shareholdings",
        "count": 1
      },
      {
        "node": "land values",
        "count": 1
      },
      {
        "node": "investment thesis",
        "count": 1
      },
      {
        "node": "capital ratio",
        "count": 1
      },
      {
        "node": "land values collapse",
        "count": 1
      },
      {
        "node": "banks’ capital erosion",
        "count": 1
      },
      {
        "node": "debt deflation",
        "count": 1
      },
      {
        "node": "fire sales of assets",
        "count": 1
      },
      {
        "node": "deflationary effect",
        "count": 1
      },
      {
        "node": "Korea",
        "count": 1
      },
      {
        "node": "cross shareholding",
        "count": 1
      },
      {
        "node": "industrial companies",
        "count": 1
      },
      {
        "node": "financing subsidiaries",
        "count": 1
      },
      {
        "node": "financial system",
        "count": 1
      },
      {
        "node": "macro problem",
        "count": 1
      },
      {
        "node": "Debt problems",
        "count": 1
      },
      {
        "node": "Property developers",
        "count": 1
      },
      {
        "node": "Property crash",
        "count": 1
      },
      {
        "node": "Local governments",
        "count": 1
      },
      {
        "node": "Industrial sector",
        "count": 1
      },
      {
        "node": "State-owned enterprises",
        "count": 1
      },
      {
        "node": "Private companies",
        "count": 1
      },
      {
        "node": "Industrial policy",
        "count": 1
      },
      {
        "node": "Japanese companies",
        "count": 1
      },
      {
        "node": "local government financing vehicles",
        "count": 1
      },
      {
        "node": "land appreciation",
        "count": 1
      },
      {
        "node": "local government debt",
        "count": 1
      },
      {
        "node": "China Development Bank",
        "count": 1
      },
      {
        "node": "2008 financial crisis",
        "count": 1
      },
      {
        "node": "wasteful projects",
        "count": 1
      },
      {
        "node": "government debt",
        "count": 1
      },
      {
        "node": "Victor Shih",
        "count": 1
      },
      {
        "node": "contingent debt",
        "count": 1
      },
      {
        "node": "macro leverage issue",
        "count": 1
      },
      {
        "node": "Debt to GDP ratio",
        "count": 1
      },
      {
        "node": "Economic growth",
        "count": 1
      },
      {
        "node": "Middle-income countries",
        "count": 1
      },
      {
        "node": "Local currencies",
        "count": 1
      },
      {
        "node": "Financial collapse",
        "count": 1
      },
      {
        "node": "Industrial production",
        "count": 1
      },
      {
        "node": "Productive assets",
        "count": 1
      },
      {
        "node": "High return investments",
        "count": 1
      },
      {
        "node": "Policy constraints",
        "count": 1
      },
      {
        "node": "supply-side strategy",
        "count": 1
      },
      {
        "node": "demand-side strategy",
        "count": 1
      },
      {
        "node": "macroeconomic issue",
        "count": 1
      },
      {
        "node": "domestic demand",
        "count": 1
      },
      {
        "node": "pricing power",
        "count": 1
      },
      {
        "node": "cash flows",
        "count": 1
      },
      {
        "node": "inflation",
        "count": 1
      },
      {
        "node": "debt problem",
        "count": 1
      },
      {
        "node": "state-owned enterprises",
        "count": 1
      },
      {
        "node": "growth friendly program",
        "count": 1
      }
    ],
    "topicGroups": {
      "groups": [
        {
          "topics": [
            "China",
            "China’s Economy: What Everyone Needs to Know",
            "China's economic model",
            "China's growth",
            "China's economy",
            "Chinese companies",
            "Chinese political system",
            "Manufacturing export machine",
            "Trade surplus",
            "Ever-growing trade surpluses",
            "How China gets rich",
            "Production structure",
            "high savings",
            "China's growing power",
            "CCP",
            "Chinese Internet",
            "nationalist thinking"
          ],
          "category": {
            "name": "China's Economy",
            "description": "China's economy and its impact on the world."
          }
        },
        {
          "topics": [
            "supply chain",
            "direct investment",
            "Joint ventures",
            "Foreign companies",
            "Manufacturing",
            "Infrastructure investments",
            "Trade surplus",
            "global manufacturing economy",
            "trade and investment",
            "trade and investment flows",
            "US trade",
            "corporate investment",
            "third countries",
            "low cost production",
            "diversified production structure",
            "high tech manufacturing",
            "TSMC",
            "manufacturing economy",
            "global economy",
            "foreign importers",
            "BYD"
          ],
          "category": {
            "name": "Trade and Investment",
            "description": "International trade, investment, and supply chains."
          }
        },
        {
          "topics": [
            "America",
            "United States",
            "Global economy",
            "China hawk",
            "political consequences",
            "leader of democracies",
            "World War II and the Cold War",
            "alliance of democracies",
            "Soviet Union collapse",
            "Soviet Union",
            "geopolitical actor",
            "military",
            "geopolitical position",
            "friction and conflict",
            "great power conflict",
            "conflict",
            "Japan",
            "Australia",
            "Vietnam",
            "Bangladesh",
            "US politics",
            "Scapegoating China",
            "democratic system",
            "authoritarian system",
            "difficulties",
            "US domestic policy",
            "China's growing power",
            "societies around the world",
            "difficult problem",
            "Cold War",
            "Hitler"
          ],
          "category": {
            "name": "Geopolitics",
            "description": "Geopolitics, international relations, and conflicts."
          }
        },
        {
          "topics": [
            "economic model",
            "government involvement",
            "banks",
            "conglomerates",
            "financialized economy",
            "Income redistribution",
            "Macroeconomic policy",
            "social compact",
            "process engineers",
            "economic history",
            "median voter",
            "democratic election",
            "arguments",
            "Fairness",
            "Sustainability",
            "Stability",
            "good deal",
            "agreed set of rules",
            "dislocation",
            "Chinese taxpayer"
          ],
          "category": {
            "name": "Economic Models and Policies",
            "description": "Economic models, policies, and structures."
          }
        },
        {
          "topics": [
            "electric vehicles",
            "technological progress",
            "Silicon Valley",
            "AI race"
          ],
          "category": {
            "name": "Technology and Innovation",
            "description": "Technology, innovation, and the digital world."
          }
        },
        {
          "topics": [
            "cultural history",
            "popular views",
            "convergence of systems",
            "systemic political difference",
            "arguments",
            "nationalist thinking",
            "difficulties",
            "China's growing power",
            "societies around the world",
            "difficult problem"
          ],
          "category": {
            "name": "Social and Cultural Aspects",
            "description": "Social and cultural aspects of the topics."
          }
        },
        {
          "topics": [
            "Arthur Kroeber",
            "Gavekal Dragonomics"
          ],
          "category": {
            "name": "People and Organizations",
            "description": "Individuals and organizations related to China."
          }
        }
      ]
    },
    "shortSummary": "This episode with Arthur Kroeber explores China's path to high-tech dominance, examining its government's role as a strategic investor and the implications of its economic rise.",
    "lastStoryCheck": "2025-07-14T21:54:39.577Z",
    "storyCheckResults": {
      "missingChunks": [],
      "missingStories": [],
      "totalCategories": 6,
      "totalChunksChecked": 33
    }
  }
}