{
  "id": "89IEFOiW-Z0",
  "title": "Joe Rogan Experience #2349 - Danny Jones",
  "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
  "publishedAt": "2025-07-15T17:00:09.000Z",
  "cleanText": "Joe Rogan podcast. Check it out.\nThe Joe Rogan Experience.\nTrain by day. Joe Rogan podcast by night. All day.\nIt's so [ __ ] weird to be sitting here, bro.\nIs it so strange? I feel like I've I've been like a video game observer and now I'm like in the video game.\nAre we on?\nYeah.\nYou kind of are. I mean, it's weird.\nIt's weird for me, you know.\nYeah, bro. Well, thanks for thank you for being like the number one uh promoter of my YouTube channel over the past couple weeks, bro.\nMy pleasure. It's great stuff, man. I watch it all the time. You're really good. You got great shows, man.\nI appreciate that.\nAnd I get good guests from your show. Like, there's a couple people that have been on your show that I've had on my show.\nYeah. Yeah. Chris Dunn was the first dude, I think. And then, uh, you recently had Mary Bowden and a few others.\nYeah. Yeah. Christopher Dunn, man, that was a wild one. And now that they found these structures underneath the pyramid, it's kind of validating a lot of the things these people are saying.\nYou know, there's a lot of controversy about what those structures are and what it means and and how accurate the readings are, but they do know that those satellite images were able to show very accurately this one tomb that was 50 ft underground. And they it showed the dimensions of this one tomb. So, I don't know what the capabilities are if it really can decipher what's under two kilometers of, you know, whatever is underneath Giza, but there's something going on for sure.\nYeah. I had a dude on my show a couple weeks ago who was explaining how that was a part of some YouTube channel that put something together in Italy, I think it was. And um the people that were involved with it were promoting some sort of technology that had something to do with penetrating the ground. Some like different kind of lidar or something like this.\nIt's what is it called? Something tomography, right?\nYeah. Yeah. Yeah.\nJamie, see what it's called? But these guys just did another uh explanation of it like another deep dive where they did like this presentation and showed it.\nIt's very convincing. Like there's a lot of people that are 100% on board. I mean it remains to be seen. It has to be vetted. But according to uh you know some people that I trust that really understand the technology that said there's absolutely something there. M you know whether or not the the problem is they made those 3D detailed images of what it looked like sort of an artist rendition and you looked at those and it's got like the coils and the spirals. You're like yeah it looks a little too much.\nI don't know what that you could see there are coils around those columns but what are they? Are they stairs? Is it a like a coil that generates like an energy coil? Like something that conducts electricity or carries electricity? Like what is it?\nIt's a solid state electron harvester.\nIs that what they say?\nThat's what Chris Dunn says. I don't know. I don't know.\nWe talked to him about what's underneath.\nYeah. He thinks that it was uh he thinks that the whole thing, his new book, which is called the Tesla connection, basically explains that it's a uh he thinks that there was like a a device in the subterranean chamber, like a hammer that hammered the earth. And then the plane, the Giza plateau, is like is active seis seismically active area. And when it hammers the earth, it creates many earthquakes. You're familiar with this, right? Right. And it and it vibrates all the limestone.\nAll the limestone. And it's got like this hammer this effect like do and it creates some sort of a vibration in the granite and the limestone.\nYeah.\nOkay. Uh to overcome this uh author has analyzed micro movements within the pyramid typically induced by background seismic waves to achieve high resolution full 3D tomographic images of its interior imaging of its interior and subsurface. The approach rendered the pyramid transparent, allowing for the reconstruction of internal objects and the discovery of previously unseen structures.\nSo if it's got an act if if it works and shows the actual internal structure of the pyramid accurately and it can accurately depict that one u the one was it a temple or what was it that was I feel was it I feel like it was a temple that was 50 ft underground. It had the exact interior dimensions of it.\nYeah, I mean there's probably something to it and we're going to find out eventually hopefully.\nYou think?\nI don't know, man. These guys like like guys like Zawi Has and these these gatekeepers of this information, they do not want any groundbreaking new discovery to come out. They really don't.\nEspecially something like that. If you really find out there's there's giant columns underneath the pyramid and that there's these structures that go down 2 kilometers into the ground, like all bets are off then. Like try explaining that away for people that live 2,500 BC. Like that's kind of kooky.\nYeah. I mean, you know, the the mystery of the pyramids and, you know, moving those blocks and building that [ __ ] thing that long ago is crazy on one hand, but then on the other hand, those [ __ ] granite vases.\nOh, yeah.\nThat are so precise within like the deviation of a human hair.\nYeah. This is a 3D uh print of one of them that Christopher Dunn gave me.\nYeah. It's insane. It's insane. They measured these on light scanners at like a huge aerospace corporation somewhere and they found out like it's so symmetrical you couldn't make this unless you had a CNC machine.\nRight. And then how would you make the handles?\nRight. Exactly. Cuz it's a part of it.\nRight. It's not like you can even turn it on a lathe, right?\nAnd it's accurate.\nHow many thousandth of a human hair?\nYeah. I think it's like Yeah, I think it's like 1,000th of a human hair. Like completely undetectable.\nBananas. And then there's also some of those uh sculptures that they made that look like they're 3D printed. I mean, they're incredible. Perfectly symmetrical on the left side, the right side, and we don't really understand it. And we don't know what technology they were using, what kind of tools they were using.\nIt's and it's hard to know, man. It's it's it's hard to know like without, you know, when they burned the Library of Alexandria and they destroyed all the records, like there's so much missing from the history of of Egypt and how they did what they did. Mhm.\nJust moving the stuff. How did you move it? How did you move those [ __ ] enormous stones? Like, what did you do?\nHave you heard of uh this dude named Jeffrey Drum? He has a channel called The Land of Chem. He live he lives in Egypt. He lives uh like I think right across the street from the Pyramids and he's basically got this very interesting theory that it was all chemical manufacturing and the pyramids were chemical manufacturing plants. And I am going to like butcher this description, but I'm going to do my best. Basically, what he found was that in a bunch of the other pyramids, like the Red Pyramid and some of the other pyramids, he's been in there and gone through them all. And he's basically what they describe when they go in there is this smell, which some people equate to being like batshit. But what he thinks is going on is it's creating some sort of like a chemical reaction in those chambers to create fertilizer. because there's a subterranean chamber below those where they have like all kinds of they were putting [ __ ] in there, like animal [ __ ] down there. And then there's also these like ravines, these like cutout channels that come out of the bottom of the pyramid and there's these bowls that were supposed to collect like chemicals. So he has this really elaborate theory on how which I when I heard him tell me this, it made so much sense. But the problem was like it makes sense. It seems super reasonable, but like why build these massive structures that are so precise just to make chemicals? And you know, he was explaining like the agriculture and like why they needed to create fertilizer and um why they need the massive stone structure to fertilizer.\nRight. Exactly.\nIsn't it possible that things also had one they they like they built them and then someone used them later on for different purposes?\nIsn't that possible as well?\nI think so.\nLike instead of it being built for that, like maybe they just used it for that eventually.\nThat's possible. Yeah. But it seems like the way he was describing the interior though of that of the red pyramid was like he it was reverse engineered to actually create the chemical that they they would have needed to enhance the agriculture of the area.\nLike they showed it they actually created it in a in a lab with like using the chemical process. I think there was like some Nazi scientists involved in this. Of course.\nOf course. The recreation of it. Yeah.\nWell, Christopher Dunn stuff was all about them creating hydrogen, right?\nMhm.\nYeah.\nThat was that's what he felt like the whole thing like was generating hydrogen and that's what he thought. the whole uh those columns that went down, those passages that went down and then there was the porest limestone that was at the end that seeped through and he believed that this was all like some sort of a a chemical reaction that they had to doing this what is here Jamie\noh the red pyramid was okay built as a power plant to produce ammonia from methane and nitrogen that's what it was Fritz Hobber won the Nobel Prize about a century ago yeah the hobber process Fritz Hobers is a crazy story. Do you know that story?\nNo.\nOkay. Fritz Hobber, he devised a method of extracting nitrogen from the atmosphere. Um, and he for that he was winning a Nobel Prize at the same time in which he was being wanted for war crimes because he also created cyclon gas.\nSo he created the gas that they were using to spray on the allies. So they would get this this gas and spray it with fans. This was the first time they'd ever done something like this before. Use gas in warfare.\nAnd they used and he was a Jew. And they used uh he created Cyclon A, which was then converted to Cyclon B. So Cyclon A had a very disgusting smell to it, so you knew it was coming. And then Cyclon B they used during the Holocaust to gas the Jews.\nAnd it had no smell. So they they Yeah.\nSo I think it was initially made as a pesticide. I think that was the initial here. See what it says there.\nOh, this is different. We're not talking.\nThis is about the how the Egypt thing would have been the same.\nOkay, we'll get to that. But the Fritz Hobert thing, um you know, he was eventually exiled from um from Nazi Germany because he was Jewish. like they allowed him to stay initially in the beginning because he was so valuable because he had done so much and because he did create this gas that they were using to gas the allies and then you know but imagine guys up for a Nobel Prize at the same time where he's wanted for war crimes.\nYeah.\nYeah.\nAnd because he was doing all this, his wife commits suicide. She shoots herself uh in the chest. Uh he leaves her and his uh 13-year-old son to go to the front line while she's struggling for her life. Like she's still alive. She eventually dies. He leaves her. Yeah. It was the whole thing's horrific. And then he dies on the run.\nSo he dies. Uh I think he had a heart complication, which duh, how much stress was that guy under? Right. And then he leaves Nazi Germany when you know the [ __ ] is going down. He's on the run and he winds up dying on the run. I think he was dying on his way to try to seek medical care.\nYeah, bro. That uh I mean the story of what those [ __ ] Nazis were doing is bananas.\nYou had Annie on here and she talked about uh what was going on when she tried to interview some of those guys that were still in Germany. I think she tried to interview like the grandson of one of the dudes that she wrote about. Uh I can't remember his name right now. A dude with like a huge dueling scar on his face. And this guy like wanted nothing to do with his with his father or whatever. And uh you know she had these documents that she found when she went to Germany and she was like she I guess she found a bunch of notes or whatever that he wrote to his son when he came when after he went to America with paperclip and his grand or this was his grandson I think. Operation Paperclip for people listening is they they shipped over a bunch of the best Nazi scientists and brought him into NASA and some other departments at the end of the war and the grandson wanted nothing to do with his father. He like detested him his father with every fiber of his being. And she was showing him the notes and like showing him like the humanity of the guy. The guy was torn between like being this scientist contracted to do all this crazy [ __ ] for America, but he still loved his wife and son on the other hand. And he was like, he was so just torn apart by the fact that he had to leave them behind. And then she showed the dude the documents. And then Annie Jacobson freaking hightailed out of there with all that secret Nazi [ __ ] Like didn't get caught, which is incredible.\nWell, it's just wild the stuff they were working on. Like, how were they so advanced?\nAnd why were they so obsessed with the occult?\nYeah.\nYou know, it's like all that Indiana Jones stuff that was kind of legit. Like they were really interested in the occult. M interdimensional aliens. What's Alex think about?\nDimensional child molesters.\nI haven't talked to him about that. We we we have talked about Operation Paperclip, but only in regards to like Warner von Braun and you know they were in like deep denial about that. But the Simon Whisinthal Center said that if Warner von Braonn was alive today, he would be prosecuted.\nHe'd be prosecuted for crimes against humanity.\nYeah. He would when he was running his rocket factory in Berlin, he would take the five slowest Jews and hang them.\nYeah. from the front of the the the factory so that as you're walking in like this is what happens if you move slowly and that was the head of NASA who supposedly got us to the moon.\nMhm.\n\n\nSpeaking of the moon.\nHave you seen that documentary called *Room 237*?\nYes.\nI just watched it last night.\nYeah.\nYeah.\n[ __ ] bananas.\nYeah, that's bananas. The connections between Kubrick's *The Shining* and the moon landing and all the hidden stuff that he did, all the Easter eggs, including the little boy with the NASA shirt on, the Apollo shirt, Apollo 11 shirt on, and then the key to the room 237 said room instead of N O237. It just said room in 237. So, you could, bro, I mean, I am like, what does that mean? So, like if you take the letters R O O M and then N, you can recombobulate them to say moon.\nOh god.\nRight.\nLike there's so much dot connecting in that [ __ ] in that documentary.\nIt's absurd.\nThere's an absurd level of dot connecting that just is is uh unreasonable.\nBut the stuff about the moon though, like the kid wearing the Apollo 11 shirt, right?\nThe number of the door is the distance from the Earth to the moon in miles.\nYeah.\nThousands of miles.\nYeah.\nI think it's like a thousand miles short.\nYeah.\nAnd then like also the psychological uh trauma the the the scenes with Jack and his wife saying like don't you know what a contract is where he's like living his double life and he's like arguing with his wife and talking about contracts and secrecy and all this stuff and then uh and then you know there's that we there's so many weird things and like the ball rolls up to Danny on the carpet and then it cuts and then it cuts back to him while he picks up the ball and the carpet shape is different.\nThere's so many like strange Easter eggs in there.\nWhat's that supposed to signify?\nI have no idea.\nIt's just like another It's just It either that movie has like an insane level of like uh continuity errors or he was doing something.\nOh, he was probably doing it on purpose.\nYou know, Cubrick in his spare time would do complex mathematics in his spare time.\nYeah, he was like a legitimate genius.\nAnd it's amazing that he pulled off the greatest science fiction movie of all time.\nYeah.\nEspecially at the time during the exact same time period where the moon landings were filmed and the stuff from 2001 is more sophisticated.\nIt looks better than the stuff from the moon landings.\nSo like the idea that you couldn't fake it, it's like that guy could fake it 100% he could fake it, right?\nAnd if they hired him to fake it, if they brought him aboard, the idea that he wouldn't be able to keep secret, like, of course he could, right?\nYeah.\nPeople keep secrets.\nThis idea that people can't keep secrets because some people can't keep secrets.\nLike, listen, high level military guys keep secrets all the [ __ ] time.\nThey go to the grave with those secrets, right?\nYeah.\nThey swear to secrecy.\nThey swear to an oath, you know?\nThey have top secret clearance and above and whatever it is.\nAnd they don't say [ __ ] forever.\nTheir whole f [ __ ] family doesn't know what they're doing.\nYeah.\nYeah.\nThe uh the thing about the like if you if you think the moon landing was fake, you're a [ __ ].\nBut it's it's like the thing about it is if they even if you want to say they did to go to the moon, wouldn't it be uh reasonable to suggest that they would have had a backup plan in case they couldn't get there?\nLike like have some sort of a video footage that they they shot or whatever.\nWell, not only that, they filmed a lot of training footage and they they definitely tried to pass some of that training footage off as legit.\nThat's proven like the Michael Collins from Gemini.\nI forget what mission it was.\nIt was a spacewalk.\nSo there's an image of him uh that was in training and you know he's got the suit on and the wires and he's you know working with uh the space suit that you use when you're actually in you know outside of the the capsule or whatever the [ __ ] they call it.\nAnd what they did was from the training mission they just blacked out the exterior of the same photo and reversed it.\nSo they switched the photo the other way blacked it's the exact same photo the exact same photo.\nAnd they tried to pass it off as Michael Collins on the spacewalk because you got to think like how are they taking pictures?\nWho's who's going to take the picture of him out there?\nThis is part of the problem with um I think it was Apollo 12 or 13, whichever one it was where they got the footage of the the lunar module leaving the the moon and going back towards the orbiter.\nAnd it looks so fake.\nIt looks so fake.\nIt looks so ridiculous.\nThere's no plumes of of fire.\nIt like how does it have the power?\nWhere's the engine?\nThey usually car batteries right on that thing.\nAllegedly, that's what Bart Sabrell says.\nIt's still 16th the Earth's gravity.\nIt's still a significant amount of gravity.\nIt's not the same gravity as Earth, but how does that thing like shoot off into space?\nLike that's nonsense.\nIt looks It looks like it's being pulled by strings.\nYeah.\nAnd the camera, which is operated, you know, remotely pans perfectly to catch it.\nLike, shut the [ __ ] up.\nBut how are you getting that footage?\nLike, what are you doing?\nThis is 1969.\nYou're on the phone with Richard Nixon from the moon.\nAre you out of your [ __ ] mind?\nIs this supposed to be real?\nYep.\nYep.\nThis episode is brought to you by the farmer's dog.\nI think we can all agree that eating highly processed food for every meal isn't optimal.\nSo, why is processed food the status quo for dog food?\nBecause that's what kibble is, an ultrarocessed food.\nBut a healthy alternative exists, the farmer's dog.\nThey make fresh food for dogs.\nAnd what does it look like?\nReal meat and vegetables that are gently cooked to retain vital nutrients and help avoid any of the bad stuff that comes with ultrarocessing.\nAnd it's not just random ingredients thrown together.\nTheir food is formulated by onstaff boardcertified vet nutritionists.\nThese people are experts on dog nutrition and they're all in on fresh food.\nThe farmer's dog also does something unique.\nThey portion out the food to your dog's nutritional needs.\nThis ensures that you don't overfeed them, making weight management easy.\nResearch shows that dogs kept at a healthy weight can live up to two and a half years longer.\nHead to the thefarmersdog.com/rogan to get 50% off your first box, plus free shipping.\nThis offer is for new customers only.\nRight in the middle of Operation Paperclip, MK Ultra, the Cold War, all the [ __ ] deception that was going on, all the secrets.\nThey lied about everything.\nThat was the time in history where they probably had the most [ __ ] lies.\nVietnam war.\nThey lied about everything.\nSo the the idea that they didn't lie about this one thing, the moonlanding was all 100% legit.\nMeanwhile, you've got intersecting shadows.\nYou've got all sorts of problems.\nYou've got the weirdest one is Neil Armstrong's 25th anniversary speech that he gave at the White House.\nThat was so crazy.\nWe have here among us America's bre best and brightest.\nYou will achieve great things.\nGreat.\nOnce you reveal some of truth's hidden layers.\nOnce the hidden layers are uncovered, what?\nHow about just say I went to the moon 25 years ago?\nLike what is all this cryptic talk?\nThat was the only time you ever did a public talk.\nI think about it.\nWell, the other thing is the post-flight press conference.\nThe post-flight press conference looks like these guys have a gun to their head.\nIt looks like a hostage video.\nIt looks so weird.\nYeah.\nAnd people say, \"Oh, they were nervous.\nThey just got back from the moon.\"\nBro, look at Katy Perry.\nShe She went basically a little bit higher than an airplane and it was like a life-changing experience.\nShe's holding up a daisy.\nIt was amazing.\nI feel so connected to Mother Earth.\nYou know, like these guys would have been ecstatic.\nThe idea that they would been nervous as if they've been forced to lie.\nThey're behaving like behavior experts have looked at that footage and said, \"These guys are being deceptive.\"\nYes.\nParticularly Michael Collins.\nMhm.\nThere's also inconsistent things with what he said during the post-flight press press conference right after flying in comparison to his 1994 book.\nChange the story, right?\nChanges the story about being able to see the stars.\nThey what were the stars like?\nAnd he's like, I don't remember Carl Steing stars.\nAnd then in the 1994 book, he talks about how amazing they were and incredible.\nThe footage that Sabrrell acquired that shows that it appears that they covered up the windows to make this deceptive film that looks like they're far into space.\nThat's a weird one, man, because I can't find any rational explanation that's like I tried to look at it like as objectively as possible because I've gone back and forth on the moon thing.\nLike at one point in time I thought I'm I'm just being really stupid.\nLike of course they went to the moon.\nEverybody would know about this.\nAnd then over time, like I joked about it in my comedy special, like after CO, I'm like, I don't think we went to the moon.\nBut that's kind of true.\nLike once I saw the level of deception that was willfully pushed forth during CO and how many people were cooperating with this and like how many organizations, government organizations were cooperating, knowing that they lied, knowing that these were lies.\nI'm like, yeah, they can they can lie about all kinds of things.\nAnd this is today with the internet, you know, like look, where's the Epstein files?\nOh, can't find them.\nDon't exist.\nLike, they can get away with [ __ ] man.\nAnd the idea that they couldn't in 1969, shut the [ __ ] up.\nShut the [ __ ] up.\nThey could fake that.\nIt'd be easier to go to the moon than it would be to fake it.\nShut the [ __ ] up.\nNo, it wouldn't.\nNot if you physically can't get a human being through the Van Allen radiation belts without them dying.\nThey never even flew a chicken through those [ __ ] things and had it come back alive.\nRussia threw flew a dog and it came back and died two days later.\nI think they but they didn't even go to deep space.\nNo, they just threw the I think they just went into the belt and then did a U-turn.\nBro, no one's even been close.\nHave you seen the the I'm sure you've seen this.\nThe photo of Jolly West hanging out on the set of *2001 Space Odyssey*?\nNo.\nYou haven't seen it?\nOh.\nOh, that's amazing.\nShould I send it on?\n[ __ ] yeah.\nSend it to Jamie.\nOh my god.\nDo you have his number?\nUh, no.\nUm, here.\nBut you could probably Google it.\nIt's probably not that.\nSee if you could find it if you Google it.\nYeah, just Jolly West uh Stanley Kubrick 2001 Space Odyssey.\nIt's a It's a photo of them walking between the soundstages and it's a wide shot of a bunch of dudes.\nListen, man.\nOf course they There's That's not it.\nThat's not it.\nOf course they would contact Cubric if they wanted to go to the moon and fake it.\nYeah.\nAnd of course if Cubri was if you're in the middle of the Cold War, which they were, which is very terrifying.\nRight.\nRight.\nWhen I was a kid, when I was in high school, we were terrified of Russia bombing America.\nYes.\nEveryone was like really concerned and Russia was the great enemy.\nYou know, the the video of Crush yelling, \"We will bury you.\"\nLike that was like burned into every American child's mind.\nAnd if you were a patriot and you wanted to defeat Russia, we have a strategy to defeat Russia.\nAnd this is what we're going to do.\nWe're going to, first of all, we're going to bankrupt them by just making them spend to keep up with us.\nThey don't they don't have a capitalist society.\nSo they don't they don't really have a GDP like well they have a GDP but they don't have like the same sort of corporate structure that we have in America where they're like striving and innovating and developing new things and the companies are getting bigger and there's more growth and no they're a communist.\nThey were a communist country.\nSo everything was like food lines and they didn't have the the kind of money that we have.\nIt was it wasn't even close.\nSo Reagan essentially bankrupted them and then you know during the time and you know all the other people before him as well.\nBut during the time where they were developing these these rocket ships the Russians were way more advanced than us and basically every single thing they got to space first put the first man in space put the first satellite in space and they couldn't even come close to putting a a guy on the moon.\nYeah.\nIt's amazing.\nIt's it's uh it's incredible also that uh there was never another nuke that was sent to anybody after the after fat man and little boy.\nYeah, that's incredible.\nIt's really it is really insane to think about sometimes.\nYeah, that's one of the great achievements of human beings.\nWe did it once and we said let's not do that again.\nAnnie's book about nuclear war scared the living [ __ ] out of me, bro.\nOh my god.\nYeah, it's a good one.\nHow she said that we have 11 interceptor missiles in the US.\nThat's it.\nA total I think it's I think it's 11 or maybe 22 or no it's 44.\nRussia has 5,000 missiles.\nYeah.\nYeah.\nAnd the problem with it is like if a rogue nuke got launched from North Korea from one of their submarines, it would have to fly over the North Pole right towards us and as soon as they launch it with all of our satellite systems that we can detect the thing the uh rocket burner like going into orbit, we'll know within five minutes of them launching it probably before.\nAnd then we literally have to I guess like the way she described it was our policy is once that nuke is launched, we have to empty our silos, our ICBM silos because they're stationary.\nThey can't if they're hit, they're going to they're going to try to take us out at those ICBM sites.\nThat's going to be like one of their first targets.\nSo use or lose, you have to launch all\n\n\nThose ICBM nukes, and then we have to fly those over the North Pole, over Russia, to hit North Korea. And it takes like 11 minutes. So, like, you got to get Putin on the phone in 10 minutes saying, \"Yo, these nukes aren't coming for you, bro. They're going for Kim Jong-un. Oh my god.\" And then by that time, it's like, if you don't have like perfect communication amongst all these world leaders, everyone's going to be launching nukes.\n\nWell, you know the story about that one Russian military guy that was the reason why Russia didn't launch a retaliatory strike because there was an error. Yeah. There was an error, and they thought the United States had launched a missile towards Russia, and they were ready to respond.\n\nWow, that's Jolly West in the background.\n\nBro, it's unconfirmed if it was him. I don't know if anyone confirmed it. That's... If you can find a young... zoom on him. Zoom in on him.\n\nYes, I did. Let's zoom in on him right here. I saw the video where someone's talking about it. And that's...\n\nOh, that's him, bro.\n\nI don't know.\n\nWhat are you talking about? You don't know.\n\nI haven't.\n\nJamie works for the government, by the way. Jamie Se.\n\nLook at that. That's 100% him. Look at that picture. Now, go to the other picture you just showed. That's him. That's Jolly West.\n\nYeah, that's him, dude. I mean, nothing to see here.\n\nYeah, that is 100% him. That's exact same face.\n\nWow.\n\nShut the [ __ ] up, J. Find another one. Corroborate it.\n\nThat's... I'm just... I don't... I don't think out of all the people that, uh, I wish were alive that I could talk to, Kubrick is number one on that list.\n\nReally?\n\nYeah, I think so. Yeah. First of all, he made some of the most impactful... Well, I would like to talk to Jolly West, too, if he'd be willing. [ __ ] Be a few people.\n\nI don't feel like they look the same.\n\nDude was everywhere.\n\nYeah, that looks like him. Jamie, it looks similar.\n\nYeah, it looks like...\n\nIt doesn't look like that guy. Look at that guy. Look at the far left photo. I mean... I mean, it seems... it seems pretty close.\n\nJamie, that's him. Shut the [ __ ] up. Hairline's identical. Look at the hairline.\n\nJamie's a party pooper.\n\nJamie is a total party poop.\n\nI like the... I want good evidence. There's a little heart right here on that guy's head, and that guy's got...\n\nOh my god, he combed his hair different. Crazy. I mean, I hate when facts don't line up with my... part in the second one is exactly the same. That one right there is exactly the same. It is.\n\nHe started losing his hair, and he started doing a little bit of a comb over.\n\nMhm.\n\nYeah. Um, look, man, that guy was one of the biggest pieces of [ __ ] in the history of the United States government. What he did was nuts. Just just the [ __ ] Manson stuff was nuts. The MK Ultra stuff was unbel... And imagine you could do all this stuff. No one's investigating you. No one even knows. It's all completely top secret. Congress has no idea you even exist in this realm. And they were running around doing like...\n\nYeah. I was talking to Hamilton about... I'm like, \"Dude, isn't that crazy all the stuff they were doing with MK Ultra?\" Hamilton's like, \"Uh, no. Of course those guys were doing that shit.\"\n\nHamilton.\n\nHamilton Morris.\n\nOh, Hamilton.\n\nYeah. Yeah. Yeah. That guy. Of course. Like, of course doing that, bro.\n\nYeah. Well, I mean, look, if you have some unique compound like LSD, and, you know, gets, you know, Hoffman discovers it, and then they start experimenting, like, what can we do with this stuff? And then you... you find it has profound effects on the human mind. Of course, you're going to try to use it for mind control. They had already experimented with all sorts of techniques in regards to, um, doing it with prisoners, like taking prisoners and trying to figure out like what kind of sleep deprivation, what kind of what psychological techniques can you use to extract information from them. So, if you had something like LSD, of course they're going to try that.\n\nMakes sense.\n\nYeah. They were doing it way back in the 50s in the UK with those British soldiers. I'm sure you've seen that video.\n\nNo, I have not.\n\nYou never seen that? No. They dosed up these soldiers with acid and then had them go out into the field and do these training routines, training exercises. And they couldn't do it. They could... you can find the video. It's hilarious. They... they were just laughing so hard they couldn't perform. Like some of them were able to do their duties, and other ones just fell to the ground. They were just laughing and rolling around the ground. Like this is them.\n\nThis is 64.\n\nThese guys are high on acid. Is that what it says, Jamie?\n\nDid you just set make it smaller again so you can see it?\n\nUh, yeah. 64 Royal Marines. So, look at these poor guys. The men begin to relax and giggle.\n\nWhat the [ __ ] are we doing here, bro?\n\nThey probably didn't even tell them. And this guy freaked out. He had to be removed. He's holding that lady's hand. I love you. I think you're amazing. We're all connected. God is real. There is no death. And [ __ ] He's aiming the missile. He's like, he's aiming this [ __ ] this cannon. Look at these people. Not the bunch of indecision as they enter a wood. Almost immediately, the section section commander tried to use a map. He couldn't read the map. They're just tripping balls. Oh my god. It's so funny that they try. Look at their smile on their face. These guys... guy's got his hand over his head like, \"What is going on, man?\" And they're supposed to be doing these exercises.\n\nradio communication. Difficult if not impossible. He's like, \"Fuck this.\"\n\nUnfucking real.\n\nLook at this guy's just laying down laughing, having so much fun.\n\nHe tried to chop a a tree down using only a spade. No, sense of responsibility in spite of physical illnesses. But one hour in...\n\nimagine what they're doing now.\n\nThose guys are dead. There's, uh, yeah, the DARPA, um, that DARPA grant that went to University of North Carolina to figure out how to take the psychedelic trip out of, uh, LSD, I think it was.\n\nYeah.\n\nThey're trying to make super soldiers, right? They're trying to make them so they can... This is what I've heard is that they are trying to make them more effective on the battlefield, right, with things like edge detection, right? And also coming back, like, get back out there, like, like take him through the... take him through the process, let him recoup and get right back out on the battlefield to where, uh, you know, if you could... if you could get all the benefits of a psychedelic without the trip, right? Would you get those benefits and would it be useful for soldiers in combat? You know, it's interesting idea.\n\nWell, the Vikings took mushrooms and the berserkers. They would take mushrooms before combat.\n\nYeah, I mean, it... it does make sense. It really does. It doesn't make sense to us because we think of mushrooms as like, you know, \"Hey man, I'm going to go connect with God, and it's going to be peaceful. I'm going to lay in a field. It's going to be amazing. I'm going to reset and come back and tell everybody I love them.\" You know, that's what mushrooms are to us. But if you live in an insanely warlike culture and you believe it's right to go to battle and you're supposed to go to battle and Odin is on your side, and you take these mushrooms to summon the strength of the gods and to prepare yourself for battle, and there's... I know a lot of guys who fight on mushrooms.\n\nReally?\n\nYeah. Yeah. Like Joe Schilling talked about on the podcast, he... he fought... he took like a small dose and was sparring and, um, then fought a few kickboxing bouts that way. He said he could see what guys were doing before they were doing it. It's almost like he could... and Joe Schilling is a world champion, like an elite kickboxer, like one of the best ever. And so for a guy like that to say that it had a profound effect on him. He knows... he knows his body, like he's battle hardened. He knows the difference between regular fighting and fighting on mushrooms. He said he could see... he could almost like know what they were going to do before they did it.\n\nThat was wild.\n\nYeah. They are, um, there's this dude who's like... I heard about Dana Beal who's flying Ibagane to the troops in Ukraine, to the Ukrainian troops, trying to get those guys on Ibagane. And meanwhile, the Russians are on, uh, what's that meth drug? There's like a new age meth that they're on.\n\nThere's a new age meth.\n\nYeah, there's a new version of it.\n\nThe new version of what the Nazis...\n\nIt's not pervat. It's like a new version of it. It's like a little bit... It's a little bit tamer at all, I guess. Maybe.\n\nThis episode is brought to you by Visible. I want to let you in on something. Your current wireless carrier does not want you to know about Visible because Visible is the ultimate wireless hack. No confusing plans with surprise fees, no nonsense, just fast speeds, great coverage without the premium cost. With Visible, you get one line wireless with unlimited data powered by Verizon's network for $25 a month. Taxes and fees included. Seriously, $25 a month flat. What you see is what you pay. No hidden fees on top of that. Ready to see? Join now and unlock unlimited data for just $25 a month on the Visible plan. Don't think wireless can be so transparent, so visible? Well, now you know. Switch today at visible.com/rogan. Terms apply. See visible.com for planned features and network management details.\n\nMaybe like super Aderall, but, uh, million prescriptions of Aderall given in this country every year.\n\nGavin McInness told me before I came here, I was like, \"You got any advice for Joe Rogan?\" He's like... he said, \"Slam three beers and eat an Adderall.\" I was like, \"No, bro.\"\n\nThat sounds like what he would do.\n\nYeah. Yeah, he came... Do you ever see the time he came in dressed like Michael Douglas? Walking down...\n\nOf course.\n\nWalking. What is it? What was the movie?\n\nUh, I forget the name of the movie, but yeah. No.\n\nFreaked out. Michael Douglas like had enough.\n\nMhm.\n\nYeah. No, he, uh, he slams beers 24/7. He's constantly drinking Budweiser. I've never seen him without a Budweiser in his hand.\n\nIt works.\n\nYeah, he's great.\n\nOh, he's a smart guy.\n\nYeah, he's a funny guy, too. He just the Proud Boys thing was just... if he had never done that, he would be like a well... a famous commentator today. Like you think about like... like Steve Bannon, all these other guys, like he's way funnier than any of those guys. Oh yeah. He's very insightful. Like he's right about a lot of things. He like picks up on trends and culture and sees where people are going, and and he was aware of like the dangers of Marxism and a lot of this [ __ ] ridiculous leftist ideology that they were pushing in universities like way before anybody else was.\n\nYeah. Um, there was this documentary that just came out all about him from one of the guys, Thomas, that used to work for Vice. He was like one of the original, um, reporters for Vice. He did all like of the early stuff. And, uh, he made this documentary all about Gavin. And it's like focuses on the transformation from like early punk rock like liberal Gavin in the UK with like the mobs and the rockers to like the current Gavin, which is like, you know, he frames him as like this super right-wing racist dude, and, uh, you know, I was asking Gavin about it. He came on the podcast recently, and, uh, he's like, \"I've always been the same.\" He's like, he was explaining that his views never changed. He was saying that like Vice all of a sudden was getting infused with millions of corporate dollars, and I wasn't a good look for that. They didn't want me in there. But meanwhile, he was like the whole soul of Vice. Like if there was no Gavin, there was no Vice. Like all the controversial dos and don'ts [ __ ] and like all those controversial articles about like trans... trans [ __ ] early in like the early 2000s that he was doing was funny. And like culture didn't look at it the way it looks at it today, you know? Well, he was being attacked for things that are like openly discussed today, like the dangers of trans ideology and that these are just men, and a lot of these men are doing it because they're perverts, and so they're... they're autogophelics, and you know, autogophilia is a real thing. It's men who get sexually aroused. They're pretending that they're women, and they want to go into women's spaces and be sexually aroused, you know. Um, now people are saying that openly, right? Like, um, was it... what was the university that, uh, Leah Thomas was swimming in?\n\nPen... Okay. So, they have to take away all of air quotes her gold medals. It's a guy, like, has a penis, has sex with women, supposedly, according to Tony Hinchcliffe. That's my number one source of news. Um, but he actually has a bit about it. It's really funny. But the... the university now has to apologize to all the women that were forced to compete with him and, you know, say they [ __ ] up and never do it again and not allow biological men to compete with women, which is like... it should be that... that should be a left-wing perspective. Not that you shouldn't be able to be trans. Of course, you should be able to do whatever you want. You know, I'm... I'm for you doing whatever you want if you don't hurt other people, right? If you really believe you're a woman, and look, if you can get fake tits, and you can get fake lips, and you can get a dick enlargement, and like, do whatever you want to do. I don't care. Do whatever you want to do. I'm covered with tattoos. I've made stupid decisions. Like, do whatever you...\n\n\nI want to do. But, uh, when you're competing with women, you are essentially victimizing these women. You're forcing these women to compete with men who've been through puberty and, in this case, still have a functional penis, which is bananas. That's a man. Just because you think you're a woman, you physically, we know there's a difference.\nYeah.\nI didn't know it was a giant problem until there was that fighter, Fallon Fox, who had competed twice against women without letting them know that this person was a biological male for 30 years, fathered a child, the whole deal. I'm like, this is crazy. And that his response was, \"It's a medical condition, so I don't have to disclose this.\" You know, it's medical information, which is just horseshit. Yeah. It's crazy. And when I was saying that, I got attacked over and over and over again. I go, \"Whoa, this is from the left.\" Like, the left has no problem with a mentally ill man beating the out of women.\nFalsely claiming that they're what? Not even allowing these women to know. These women think they're going to go compete in a low-level MMA fight. Like, a lot of them didn't look good. They didn't look like they're well trained, and they're competing against a biological man without having any idea. One of them got a fractured skull.\nYou know, it's like that's when I would realize like, oh, this is just a cult. This isn't the left that I grew up with. You know, I grew up with parents that were hippies, and so like my whole life I was leftwing. I felt like that was the only way to be. But when you see the left allowing this bizarre loophole where perverts can pretend to be women, right? Compete with women, fight with women, beat them up, be in their locker rooms, walk around naked with their dick hanging out, no one can say anything. Like, how did they switch? How did they flip it on its head that like at any other time in history, if a man had a penis, was walking through a young girl's locker room, you'd be in real trouble. Rightly so, because that's not a thing that you should want to do.\nThat's a weird thing to want to rock, walk around naked with your dick hanging out in front of a bunch of women. That's a creepy sexual thing. Period.\nYeah. Yeah. Unless you're like Nero, you're not doing that, you know?\nYeah.\nEven Nero.\nSick. But like another thing Gavin was pointing out to, he showed me this New York Time or not New York Times, this Time magazine cover from like a couple months ago. Uh, and it was all about how boys are going extinct.\nMhm.\nYou've seen that?\nYeah. Yeah.\nIt's incredible.\nYeah. Because they're turning them all over.\nThey're cutting their tits off and turning them into boys.\nCutting their tits off and and then giving them fake dicks. I was watching this operation today. You watched an operation.\nI, I watched. Excuse me. I should say this. I was watching a video in the posttop. I saw images of the operation. That was enough. But it was this poor person who, uh, decided they wanted a pee standing up. That was all they wanted from this fake dick. So they have these enormous scars on their leg where they take a giant chunk of flesh out of your thigh and roll it up and make a penis out of it. And they had to do it to both legs for some reason. Maybe one of them didn't work real well. But how old was this person?\nUh, they sounded young. They didn't show their face.\nYou know, it's insane because a lot of these people unfortunately are autistic and, um, and then the there's this other factor when you give them testosterone, it does alleviate anxiety because all of a sudden, you know, you have this new hormone in abundance in your system.\nYeah.\nAnd you feel different. You feel better. You feel more confident, which is like the same way men feel when they have more testosterone. It's like then all a sudden you're like, \"Oh, this is who I was all along.\" Like, no, no, no. You're taking a compound that's forcing your body to change. Like this is not who you were. You're not affirming your identity. You're doing something that's altering your hormonal structure and turning you into a man. Like it might feel good, but this is not like your true self. This is crazy. Like I'm not saying you shouldn't be able to do it. If you want to do, if you're a woman and you want to take testosterone and be a man or be more manly,\nI don't, I feel like, I don't know if it's the best decision for you, but I'm not you. And I'm, I believe in freedom. I believe in 100% human freedom as long as you're not hurting other people.\nYeah.\nMy, my, my beef with it is like it translated into them invading women's spaces. And you know that's crazy.\nThat's crazy because you, you leave the loophole for perverts. There could be a lot of them that legitimately trans people that feel like they are in the wrong body and they want to live their life as a woman. And when they live their life as a woman, they feel healthier, they feel better, they're happier and also crazy people. And if you don't have a way of determining who is just a pervert who just wants to hang out in the women's locker room and show everybody his dick. Yeah. And who is a legit, a legitimate person with gender dysphoria. And another, that's the other thing that like Tucker had a really good point about this. Said if someone has anorexia, you don't tell them, \"Yeah, you're fat. Yeah, you're fat. You're right. You're correct. Even though you look like a skeleton, you need to lose weight.\" No, you tell them you are, you're mentally ill. This is incorrect. You're not overweight. In fact, you have body dysmorphia. You can't see what you really look like, which we know is a real condition. Like, it's a real condition with anorexia. It's even a real condition with bodybuilders. It's a real condition. A real condition when people get plastic surgery where they get crazy lips and crazy cheeks and they can't see it. They can't see it. They can't see themselves. It's insane.\nIt's nuts.\nThey turn themselves into like all these girls looking like Jaw Jarbanks walking around.\nThey look like monsters. They look like monsters. And it doesn't look good. And they keep tweaking and with it. They can't see it because it's a mental illness. It's the same kind of thing. Like the human mind is incredibly fragile. That's why Jolly West was fascinated with trying all these MK Ultra techniques and different compounds on people's brains because human people can be manipulated like very easily, shockingly easily. Not all of us, right? Like you and me are probably pretty skeptical. There's a lot of skeptical people out there. But there's a bunch of people that are not skeptical at all. They're super gullible. And when an ideology forms, they step in line and they, they follow that ideology verbatim to the line. They'll repeat the things that they're supposed to say to the line because they think that's what they're supposed to do in order to be in the good graces of this community that they find themselves in. It's a cult.\nYeah.\nAnd there's a ton of cults. It's not just the mooneyies. It's not just, you know, whatever, fill in the blank. It's all sorts of political ideologies. It's MAGA. It's, it's, uh, the far left. It's the people that are cheering for this guy in New York City that's a communist.\nDidn't he just, uh, promise a bunch of money for, uh, transition surgeries?\nHooray.\nYeah, it's nuts.\nGovernment run grocery stores and all that stuff, but he didn't win yet. He's just, he won the primary.\nHe's going to win, dude. He has 100%. Because the other guy is the guardian angels guy. The other guy is Curtis Lee, the guy wears the goofy beret.\nOh, really?\nYeah. That's the guy who won the Republican side. Nobody wants to be a Republican mayor of New York City because they know they can't win.\nSo they're not like, this guy's to the left of Bill Delasio.\nOh, he's way to the left. Yeah. And he's young and he's energetic and he's saying all the right things for all these kids that are in the streets that are protesting, you know, that think they want to make the world a better place, which hey, I would have been doing it with you if I was 20.\nMhm.\nIt's all the same thing, man. It's all the same thing. You can get indoctrinated into a particular way of thinking without being objective about what's actually going on. You know, all these, these people that are like just running through the street now, uh, saying free Iran, like, yeah, free Iran from a dictatorship. Absolutely. But if you're saying like wear scarfs over your head and being forced to do what the Iranian government wants you to do and live like they live over there. No, they don't live free, right?\nLike they, they assassinated the Olympic gold medalist in Russia in wrestling rather be in Iran because he was protesting against the government. Like they'll take national heroes and kill them openly. Like it's not a good place to live, right?\nYou know, and I'm not saying we should bomb them, but like being in support of Iran, the Iranian people. Yeah, for sure. But that government is nuts, man. It's like, you know, trans people for Hamas. You know what I mean? Like there's, there's people that are just, they're not seeing what you're talking. They're not seeing the big picture.\nYeah. There's so many contradictions out there, man. It's really hard to follow it all. It's because it's a cult and there are, and I think a huge amount of the Iranian population supports Israel too. And it's like you would never know that unless you like talk to them or listen some of these interviews of these people.\nA ton of Persian Jews that moved to Los Angeles, you know, that was like at the fall, I guess it was in the 70s when, uh, so this is the story for people that don't know about Iran. So there was a gentleman who was democratically elected. I forget his name. Mog, what is his name?\nI'm going to it up. So he decided that he was going to nationalize oil in Iran and they got him out like that. They installed the sha and turned it into an Islamic dictatorship, but they had access to the oil. So the CIA and the British government and everybody conspired to get rid of this democratically elected guy because Iran at the time was like you women were wearing shorts or skirts rather walking down the street. It looked cool. Here it is.\nUh, Muhammad Mosedc.\nMosedc.\nMosedc. Okay. So, let's, let's zoom in on the story here. It says, um, Iranian Prime Minister Muhammad Mosedc was removed from power in a coup organized and financed by British and US governments. The shock quickly returned to take power and signed off over 40% of Iran's oil fields to US companies. It's crazy, man. It's like it's so transparent. They didn't even wait a couple years. They didn't even, well, the Sha's in power now. We'll see how things go. No, they immediately came in and signed everything off. 1953, the CIA and British intelligence orchestrated a coup d'etat that toppled the democratically elected government of Iran. The government of Muhammad Mosedc, uh, the aftershocks of the coup are still being felt. 51 Prime Minister Mosedc roused Britain, Britain's eye when he nationalized the oil industry. So the oil, they weren't making money off the oil. Well, they were making money, but not as much money as, uh, the British were.\nH\nyeah, it had been exclusively controlled by the Anglo Iranian Oil Company. The company later became known as the British Petroleum.\nThis time is different though.\nBP, they're the same people that dumped all the oil in the Gulf.\nYeah. Yeah. Exactly.\nThat's BP. After considering military action, Britain opted for a coup deta. President Harry Truman rejected the idea. But when Dwight Eisenhower took over the White House, he ordered the CIA to embark on one of its first covert operations against a foreign government and Iran's been ever since.\nMhm.\nI mean, we've been doing stuff like that. Not we, not you and I, not me and Danny Jones. We're innocent. But the United States government, especially the intelligence agencies in the days, uh, you know, before they assassinated Kennedy, you know, they were, they were doing all kinds of wild.\nOh, yeah.\nAnd\nwe're done now. We don't do that any.\nThey don't do that anymore.\nThey definitely don't. No, no, they would never. They don't give a about the oil over there.\nNo, this government's America first now.\nWe're legit.\nAmerica first.\nIt's, it's a crazy history. And when you don't know the history, you like, why are we mad at the Iranians?\nWell, why are they mad at us? Okay, like what did we do to them? Like, why, how did, how did this, these Islamic jihadists come to power?\nLike, where did it all start? Well, go back to the mujahaden. We literally changed their definition of jihad. Like we, we wanted them to become suicide bombers. We wanted them to to do things and martyr themselves. So we, it was the original definition of jihad. Look this up, but I'm pretty sure it was a war against your own vices.\nThis is really. Yep. Yeah. There the idea was you were trying to be a good Muslim, a pure Muslim. You were trying to avoid impure thoughts, no alcohol, all these different things.\nAnd they twisted that around with jihadists and through the CIA and Osama bin Laden and the Mujahadin to fight off the Soviet Union when the Soviet Union occupied Afghanistan. Like\nOsama bin Laden was our guy, right?\nHe was working for us and he's like, \"These people suck.\"\nYeah. There was a story how his like pancreas\nstruggle against the enemies of Islam, a spirit\n\n\nA dual struggle within oneself against sin.\nGreatest jihad.\nYeah, it sounds great.\nIsn't that interesting?\nA spiritual struggle within oneself against sin.\nYeah.\nI mean, yeah, just reading it sounds like...\nSo, it seems like it's more than one definition.\nThere's probably so many.\nBions declared a jihad against the in...\nScroll back down again.\nStruggle or fight against the enemy or enemies of Islam.\nSo, it's two things, but they made it, you know.\nYeah.\nThey, they, they did a lot of mind [ __ ] to those people and they put them on a war that they couldn't win again to try to do the same thing that they were doing with the rocket program with everything else.\nThey were trying to outspend the Soviets.\nThey were trying to bankrupt them.\nYeah, that part of the world is just like how much of it has to do with the fact that we've been occupying that area, that that part of the world for so long and like going out there killing all the bad guys and then the kids seeing their families being slaughtered and then like, okay, we're going to eliminate terrorism.\nLet's take out these bad guys, but then the kids grow up and you realize it's just the hydra.\nYou cut the head off and three grow back.\nWell, if you want to be even more cynical, we pay them and we arm them.\nYes.\nAnd we left behind billions of dollars of [ __ ] in Afghanistan that they use for parades now.\nThey drive down the street with our tanks.\nThey have our Blackhawks flying overhead.\nThat's all the [ __ ] we left.\nBillions of dollars.\nMhm.\nLike you couldn't have got that out.\nWell, do you think they leave it there so that these people are always formidable and they always leave open the door to go back in?\nYeah.\nI think so.\nI think that's... I don't think that's the primary reason why they did it, but I've got to assume that that would be on the table if it's been on the table in the past.\nArming people in the past has always been a thing that we do.\nI mean, it's a Bill Hicks joke about Iraq.\nYou know, it's like they have the most deadly weapons.\nHow do you know?\nWell, we looked at the receipts.\nI butchered the joke, but...\nYeah.\nYeah.\nBut, you know, we've always been doing that.\nWe've done that forever.\nYeah.\nWhat's the Bill... what's the...\nMy favorite Bill Hicks joke, at least that...\nI don't... I'm not like a historian on Bill Hicks, but the one where he's talking about, uh, the sock puppets, he's like, \"Yeah, I like this guy on the right.\nHe seems like he fits my, my ideas.\"\nHe's like, \"I... I seem to fancy the guy on the left.\"\nHe's like, \"What the [ __ ]?\nThe same guy's holding both the puppets.\"\nYeah.\nExactly.\nYeah.\nI mean, that's perfect.\nPerfectly illustrates the way the way it is, you know?\nYeah.\nAnd again, this was before we really knew things.\nThis was Bill Hicks was saying this in the 1990s where we just had books.\nSo, you know, it was... it was really hard to get these ideas across.\nHe would have been a great podcast guest.\nOh, hell yeah.\nYou know, because he was like saying these things when no one even knew what he was saying, you know, and he was putting it into comedy, you know, like people then were not nearly as aware of the manipulation of money in power.\nThey really thought, a lot of people thought that the will of the people, you know, the president, we got to get a good president in there that's looking out for us, and they didn't really understand that it's all being bought and paid by special interest groups, large corporations, huge donors, and that when the guy gets in there, he's just representing the same thing no matter what.\nYeah.\nThe amount of reading and insight and learning that that guy was... a lot of those dudes were able to do back then pre-internet...\nYeah.\nis astonishing.\nYeah, and to be able to like internalize and process those ideas and rework them with draft after draft and refine it into like the most perfect way to communicate it to people to where it lands.\nYou know, it's just... it's [ __ ] crazy.\nAnd in today's day and age, it's almost like you would think it would be easier with all of the access to information, but it seems like it might even be harder because there's just too much information.\nLike last night, listening to you talk was [ __ ] incredible, dude.\nLike listening to how you were at the end doing this like the the Q&A with the crowd.\nYou're like, \"Ah, I ran out of jokes.\nWho wants to ask me questions?\"\nAnd like you were just on another gear, dude.\nIt's like you're so high octane and you're so like up to speed with everything that's happening around the world at all times.\nIt's... it's mind-blowing to me how you're able to do this stuff, how you're able to stay up and do comedy late, do podcasts every day, and be like up to speed with all the news and like have like thought out, like thought through a lot of these things that just happened yesterday.\nI'm just fascinated by that, dude.\nWell, that's all I do, you know, when you do... when you only pay attention to fascinating things, like things that are interesting to you and they're also interesting to the audience.\nBut I mean, I don't have a regular job, right?\nSo, this is my job.\nSo, it's my job to kind of pay attention to stuff, you know, and have opinions on things.\nAnd then the tricky thing is taking those opinions and trying to make them funny, you know, trying to like put it in a way that's going to be hilarious on stage.\nWhat do you think about the, uh, that this Diddy thing that just happened this morning where...\nkind of crazy, you know?\nI'll tell you what, Kurt Mezer called this from the beginning, and especially when he found out that Comey's daughter was going to be the, uh, the judge.\nDid you know that?\nNo, I did not know.\nYeah.\nYeah.\nYeah.\nWasn't she the same judge on the Ghislaine Maxwell case?\nSo, yeah.\nOh yes, I did hear that.\nYeah, bro.\nWhere's the videos?\nThey were telling us the videos are going to come out.\nIncredibly high-profile people doing horrendous things, evil things.\nPeople are going to go to jail.\nPeople are going to be shocked.\nYeah.\nWhere?\nRight.\nNothing.\nWell, like zero.\nMy thing about the Diddy thing is like I don't really give a [ __ ].\nThese people are all... they're of age.\nThey're over... they're like 18 years old.\nAnd is it shitty what he's doing, trying to like use people and leverage them and to do these weird sexual things and like sick [ __ ]?\nJust the most sick [ __ ] you could possibly think of.\nBut like the way I... I look at it is these people are using this Diddy stuff.\nIt all it does is like take away from the real child trafficking that's going on with like underage kids, right?\nThere's like what, 300,000 something like missing kids.\nLike talking about Diddy and his oil parties with these 18-year-olds.\nLike, do I think it's good?\nNo.\nI... I want to beat up their dad, but other than that, I don't really give a [ __ ] if there's like 18 to 19 year olds that are doing this stuff, as long as they're not being like actually like physically raped.\nBut I mean it seems like what's going on is just like this weird cultish thing where they... they slowly get you... get creep toward creep closer and closer and closer to this thing, like, oh, I'm here now, all these famous people are here.\nThey're doing this like elaborate parties, lots of money, everything you want, the golden carrot at the end of the stick.\nSee, the thing is, he's not even being charged for any of the things you just brought up.\nHe's not being charged for blackmail, right?\nWhich is kind of crazy because like what did they do if...\nwhy did they tell us that there was all these videos of all these high-profile people and then silence and then it never comes up once during the trial?\nThere's none of that stuff in the trial.\nIn the trial, it was his ex-girlfriend Cassie.\nThey were talking about...\nSo like he's... he's up for these two charges left and it's like prostitution, something, it's like nothing stuff.\nIt's like stuff that he's going to go to jail for like five years if at all and probably won't, right?\nAnd he's already been in jail for so... what is time served now?\nIt's over a year, right?\nYeah.\nNo, I think he's going to walk, dude.\nI mean, I think... I don't think he's going to spend any time.\nAnd this is what Kurt Mezer called a long time ago.\nAs soon as he saw that it was, uh, Comey's daughter, he was like, \"Oh, he's going to walk.\nTrust me, he's going to walk.\nThere's a bunch of high-profile people that are connected to this.\nYeah, they're covering it all up.\nIf he goes down, they go down.\nSo, he's not going to go down, right?\"\nSo that's the thing, like, if... if he really... if he really did have like really wealthy high-profile people at his parties, which we know he did, you know, did he...\nprosecutors abandon multiple allegations against rapper days before trials end?\nHey, he says, \"Hey, remember I called it?\"\nThis is Kurt Mezer on Twitter because James Comey's daughter is the prosecutor.\nRemember how well she slept up, swept up on the Ghislaine trail?\nYep.\nHey, who else called it?\nI can't be the only one.\nYeah, he called it.\nYep.\nHe called it in the [ __ ].\nHe called it in the [ __ ] green room of the mother ship right when he found out.\nHe goes, \"He's gonna walk.\"\nI'm like, \"What are you talking about?\nHave you heard these... these charges?\nHe's going to go to jail.\"\nYeah.\nNo, Mezer was right.\nMhm.\nYep.\nAnd then we, uh... I don't know what happened with these.\nYou don't think they could fake the moon landing?\nShut the [ __ ] up.\nShut the [ __ ] up.\nThey... they've got videotape and all a sudden they don't.\nYou know, you had the director of the FBI on this show saying there's no... if there was no... nothing you're looking for is on those tapes.\nLike what?\nWhy' they say there was thousands of hours of tapes of people doing horrible [ __ ]?\nWhy' they say that?\nRight.\nDidn't Pam Bondi say that?\nWhat are you talking about?\nEpste...\nYeah.\nEpste...\nEP.\nYeah.\nShe said it literally, I think a week before you had the FBI director sitting here talk telling you there was nothing.\nRight.\nShe said something about that there was like thousands of hours of tapes of people doing horrible crimes.\nThere is.\nAnd didn't the FBI dude say that there was nothing?\nCash Patel said there's nothing you're looking for.\nOh, okay.\nOkay.\nI mean, what am I gonna do?\nI'm gonna push back.\nObviously, he's saying what he has to say, right?\nMystery surrounds the Jeffrey Epstein files after Bondi claims tens of thousands of videos.\nTens of thousands.\nJesus Christ.\nI tell you what, chill.\nOh my god.\nWas reviewing tens of thousands of videos, the wealthy financial financier with children or child porn.\nThe comment made to reporters of the White House days after a similar remark to a stranger with a hidden camera raised the stakes with President Donald Trump's administration to prove it has in its possession previously unseen compelling documents or just bomb Iran and everybody forgets about.\nJust bomb Iran.\nYeah, everybody forgets about it.\nYeah, it seems crazy that we're just like it... like you would... I would think just Trump's demeanor, his emmo towards other countries, like if we're the ones funding them, giving them all this money and they're trying to fight a war, like typically he would be putting their boot... his boot on their neck, like, listen, you [ __ ].\nLike he's talking [ __ ], right?\nLike you have to do what I want you to do.\nAnd it... it just seems like... and now I think it just came out a couple days ago that, um, they're trying to prosecute Netanyahu, right?\nAnd then Trump... Trump's helping with it.\nI think trying to help him Netany and Yahoo in that in that whole rigomearroll.\nWell, they're trying to try him while he's...\nYeah.\nYeah.\nWhile he's in office, right?\nAnd I think... he's trying to delay it because he's like, \"Look, we're at war.\"\nAnd they decide to go through with it.\nYeah.\nYeah.\nYeah.\nAnd I think something came out... I think a couple days ago.\nI could be wrong, but I was listening to, uh, I was listening to Dave Smith talk about how Trump was actually like helping him through this.\nI don't know.\nI could be wrong.\nOkay, here says.\nDuring a Fox News Channel interview in February, Bondi suggested an alleged Epstein client list was sitting on her desk.\nYeah.\nWell, the list is one thing, right?\nI mean, there's so many people on the list that are probably innocent, but I...\nRight.\nThey just went to the island for a party.\nNo, there's got to be a [ __ ] hard drive.\nSitting in Tel Aviv right now.\nYeah, that's...\nListen, the other part of this too, uh, they asked Kain Maxwell's lawyers what their [ __ ]... where was it disappear?\nHe had like a hundred cameras in that penny in every single house.\nDo you know his house is for sale in New York?\nThat's amazing.\nYeah.\nAnd...\ngot a podcast studio.\nNo, my wife found it on, uh, Trullia or whatever it is, one of the maps.\nAnd she's like, \"Look at this beautiful.\"\nCuz we were in a townhouse.\nYeah.\nLike it's not a townhouse.\nIt's a... it's a house.\nIt's like... it's a big ass house.\nIt's like multiple stories.\nThe one right across the street from Central Park.\nUhhuh.\nYeah.\nYeah.\nThat one.\nIt's for sale right now.\nHow much?\nI think it was like 60 or 70 million, something like that, which is what it's worth.\nBut who wants to live in the Epstein house?\nFirst of all, if... if I bought that house, I'd want the Clinton painting.\nCan you get me that painting?\nClinton in the blue dress.\nCome with all that [ __ ].\nI have to have that.\nI want George Bush with with the Jenga towers and the paper airplanes.\nI want...\n\n\nAll of it.\nAnd then the lady just died, too.\nThe lady got hit by a car, one of the witnesses.\nYeah.\nOne of the Jeffrey Epstein witnesses.\nAnd apparently she had like a husband who was abusing her.\nAnd uh, you know, people like to, it's just like people like to use this stuff as as like a a political football to like argue for whatever they believe in.\nAnd also when you get rich, powerful people, so here's the thing that happens with rich, powerful people.\nThey can't go anywhere, right?\nIf you're like, say a Jeff Bezos type or someone who's like an Elon Musk type, let's just, and I'm not accusing them of anything.\nI'm not saying, I'm just saying at that caliber of celebrity and that caliber of prominence, you can't go anywhere.\nIf you're Bill Clinton back in the 80s or the 90s, whatever it was, you can't go party, you know?\nEverybody knows who you are.\nYou got to be protected, right?\nBut you want these experiences.\nAnd so you have these guys like a Jeffrey Epstein type guy who works with the elite of the elite clientele.\nIt's all movie stars, big-time politicians, world leaders, scientists, Nobel Prize winners, and they all meet together and have fascinating conversations and cocktails, and there's beautiful girls everywhere.\nOf course, what a great idea.\nAnd if you're naive and you don't understand honeypots, here's the quote from Maria Farmer, who was one of the accusers from what was inside the house in New York.\nOkay.\nShe said, uh, there were monitors inside this cabinet.\nI looked on the cameras and I saw toilet, toilet, bed, bed, toilet.\nShe said, visibly spooked, like, I'm never going to use the restroom here and I'm never going to sleep here.\nYou know what I mean?\nIt was very obvious that they were like monitoring private moments.\nYeah, of course.\nMaria Farmer was the one who worked at Epstein's office in New York, I think.\nAnd this was the house, Jamie.\nYeah, I was looking up stuff on the house.\nThat was like what they found.\nWhat if the house still has [ __ ] cameras in it somewhere that they haven't found yet?\nThey definitely, oh, don't know.\nYeah, you'd have to scan the [ __ ] out of that house.\nYou'd have to take the walls apart.\nThere's probably listening devices inside the walls.\nLike, who knows if this was like really an intelligence operation.\nYeah, they probably had that house fully wired.\nMaria Farmer, I think she was the chick who was working the front desk at his office in Manhattan.\nAnd this is like a a funny example of like what I like to do.\nMy mom is super leftwing.\nShe's a has her degree in fine arts and boy and uh, she still is like an art professor, and my dad is a ex post office worker, and he only watches Fox.\nSo my, my dad only watches Fox.\nThey're divorced.\nMy mom only watches CNN.\nJesus, why didn't they stay together?\nHow weird?\nWho, who knows?\nAnd uh, they, I, I like to like take things that are happening in the controversial things, like for Epstein example, and I like to just like call my mom and argue with her, like argue my dad, argue the right-wing side against my mom's point of view on Epstein, and then I'll call my dad and I'll make the same argument toward the opposite argument towards him.\nIt's like a [ __ ] thought experiment or like a a critical thinking exercise.\nUse your parents with mom.\nMy mom, you know, she'll be like, \"Of course, like Trump, there's the mo, there's more footage of Trump with Epstein than anybody.\nAre you kidding me?\nHe's partying with him here?\nLike, of course he's compromised.\"\nAnd then my dad's like, \"It's [ __ ] Clinton, bro.\"\nIt's like, \"It's only Bill Clinton.\nLook, he's, he's the only one on the Epstein files.\nOf course, we know he's a pervert.\"\nAll this stuff.\nBut like, and then you have, so the funny thing is, both sides will use their little batch of evidence to support their idea and ignore the opposite.\nRight?\nSo like, uh, the lady, the girl we were just talking about, uh, Virginia, she was literally on video saying that uh, all this [ __ ] about Bill Clinton on the jet going to the island, hanging out with Trump and all this stuff.\nAnd the right-wing people, like, like people I know, my parents and like older folks I know in Florida, um, will say, you know, she came out, thank you for exposing Bill Clinton, for being a pedo and doing all this stuff.\nAnd uh, Virginia Guay, after this happened, she's like, \"You guys didn't listen to the whole [ __ ] tape.\"\nShe's like, \"I was telling you that Trump was at the penthouse three days a week and visit visiting him, but you guys don't want to hear that.\"\nAnd it's like, you know, it's just this weird thing, like if you do the math, there's, there's got to be, it's got to be so many high-level, powerful people that are somehow compromised.\nAnd do I think, do I think like Clinton and these guys are pedos?\nNo, I don't think that at all.\nBut if you were Jeffrey Epstein, you would, I think it's super plausible to assume that he would try to trick them with like a girl who looks old, right?\nWho is possibly like on the borderline of being 18 and you say, \"Oh yeah, this girl, she's 18, 19, 20, whatever.\"\nMeanwhile, she's like 17 and they had no idea.\nAnd they have video footage and in like a court of law, if I'm the judge, I'm going to let him, like, of course, they [ __ ] lied to him.\nAnd this is not like some young girl, obviously, but but they lied.\nBut like in, in like the court of public opinion, you're never going to win in that case, right?\nLike if that comes out, you're [ __ ].\nYou're [ __ ].\nI mean, you're [ __ ] if you just go into the island to bang hookers.\nLike it's like they're of age.\nIt's still like whatever he was doing.\nYou, you prayed on people's desire for experiences and vice.\nYes.\nAnd all these powerful people who, again, they can't just go call a hooker and the hooker goes, \"Oh my god, I just blew Bill Gates.\nThis is nuts.\"\nYou know what I mean?\nLike you can't trust them.\nSo you have to trust someone who really has a locked down organization.\nAnd they felt like he did.\nAnd that's why they all can, they all hung out with him even after he got arrested.\nThis is what's crazy.\nA lot of Bill Gates meetings with him were after he was prosecuted and he got this little slap on the wrist and he got essentially home detainment and I think he had to do like weekends at the jail.\nLike it was, it was a cra for underage sex for, you know, what's supposed to be a felony.\nThe whole thing was crazy.\nAnd then when there's one reporter that really chased it down, I forget her name, but she really, like, really looked into it, and that's when they opened up the second case, the second trial.\nVicky Ward.\nVicky Ward.\nWas she from what paper?\nVanity Fair.\nVanity Fair.\nSo she was responsible for, like, because she was like, \"This is insane.\"\nLike how, what's going on here?\nAnd then there was the sheriff that had arrested him said that I was told he was intelligence.\nAnd I mean, you got to think, man, if a guy like that is running these kind of parties with all these rich and powerful people, how many different worldwide decisions can be manipulated because of these people and the compromises you have on them, right?\nIt's really a brilliant thing to do.\nYeah.\nFor from a intelligence perspective.\nYeah, it really is, man.\nAnd like this, the way that the world is shaping out now and this like rise of Jew hate online is, and I think a lot of it's bots, you know.\nI think, I think it's coming from every angle, you know.\nI think it's probably a lot of, a lot of propaganda and bots coming from Iran, coming from Israel, Saudi, who knows where it's all coming from.\nIt's just such a confusing croc of [ __ ] on the internet.\nBut like, you know, on one hand, they were able to pull off some incredible [ __ ] operations.\nAnd you know, on the other hand, we get mad now, now that it gets exposed, we get get mad that they have their hooks in us and the people that are in power, whatever the politicians are, the puppets, just like bend the knee to whatever they're doing.\nAnd it gets exposed when people like Tucker did that interview with Ted Cruz.\nMhm.\nAnd he had him on his heels the whole time.\nThat was that was incredible.\nThat was a [ __ ] a biblical [ __ ] uh interview with Ted Cruz.\nAnd that really like pulled the mask off because like if that guy's, if that guy is explaining his, his position on Israel being in Congress and that's his number one thing that made him want to be a congressman, it's like what are all these other people doing then?\nLike if there's all these, all this money and you can see the receipts how much money they're being given, right, by these lobbies, but like how, how mad can you get because they, we let them do it.\nThey're legally allowed to do it.\nYeah, you could be mad, but you really should be mad at the politicians.\nYeah.\nThe corrupt politicians and how many of them there are, like look, look at the mayoral race where they all were saying, my first trip I'm going to go to Israel.\nOh yeah.\nExcept for the dude, except for what's his name?\nHe said he's going to stay in New York.\nThe communist.\nYeah.\nHe's like, \"I'm going to take care of the Jews in New York.\"\nBoom.\nCheckmate.\nThat was it.\nThat literally won it for him because everybody else was like, \"What are you guys talking about?\"\nLike, New York is [ __ ].\nTake care of this goddamn city.\nWhy?\nWhat?\nWhat's this loyalty and allegiance to Israel from the New York City mayors?\nThe people that are candidates for mayor, like your, your number one concern is Israel.\nThat seems odd.\nSeems unless you're getting a ton of money.\nMhm.\nYou know, unless they have some video footage.\nYeah.\nYeah.\nThe more I think about, the more I think about politics and just look at the news cycle every day, I just feel like I get dumber.\nIt's a dumb business.\nIt's a dumb, dirty business.\nIt really is, dude.\nJust like sometimes I'm just like not motivated to read the daily news, you know?\nLike I was, I was telling this to Gavin, too.\nI was like, I was like, like to focus on the culture wars 24/7, 365 and and [ __ ] talk about it all day is draining, dude.\nYeah.\nYou can't.\nIt's bad.\nIt's bad for you.\nYeah.\nThat's why people that are on social media all day, they're poisoned.\nThere was some study recently, um, I think it was Columbia.\nI, I forget what university, but they paid people to stay off social media for uh, a certain amount of time and they, they said that the results were superior to therapy.\nSee if you can find that.\nM.\nSo they, I think a large percentage of the mental illness that we have in this country is greatly accentuated by social media.\nI think people that are on it all day, I think it's extremely addictive.\nI think the conflict raises your, the the whole anxiety that you have about conflict in society.\nStanford paid 35,000 people to find out if quitting Instagram made you happier.\nYeah.\nThis is it.\nAnd so what was the results?\nLandmark study on digital well-being.\nYeah.\nRan two parallel experiments with Facebook and Instagram as a perspective focal pattern platform rather.\nFor each uh focal platform, Meta grew a stratified random sample of users who were in the US who were aged 18 or older, had logged in at least once a month or at least once in the past month from August 31st to September 12th.\nMetapplay survey invitations at the top of these users focal uh platform news feeds study explains on Facebook a total of 10.6 million users were invited to the study, 673,388 clicked the invitation and 43,249 were willing to deactivate, consented to participate and completed the enrollment survey.\nOf these 19,857 completed the baseline survey, could be linked to the platform data, and had at least 15 minutes of baseline use per day.\nSo, what was the results?\nModest but meaningful emotional gains.\nFings were statistically significant, although modest in scale.\nFacebook deactivation led, well, Facebook is like a bunch of old people complaining about their neighborhood.\nYeah.\nLed to a 0.060 standard deviation improvement.\nThat's not much.\nUm, while Instagram deactivation yielded a 0.041 improvement, these gains represent approximately 15 to 22% of the benefits typically seen with established psychological interventions such as cognitive behavior therapy or mindfulness-based interventions.\nSo, that's not much.\nThat's 22% of the benefits.\nSo, it's a mild improvement.\nLook at this though.\nThe, the uh, improvements weren't equally distributed.\nAdults over 35 saw the most substantial benefit from leaving Facebook, whereas young women under 25 experienced the most emotional uplift from an Instagram break.\nYeah, women are getting [ __ ] by that because they're constantly comparing themselves to girls that are digitally altered and using filters and [ __ ] with your self-esteem and yeah, it's I just think overall it's not good for us.\nAnd there's a large percentage of our society is addicted to it.\nAnd it's new.\nIt's the dope, it hijacks your dopamine reward system, you know, like say like they call them dopamine, like the your phone and the iPad and all this stuff is like they're dopamine slot machines and like the, you know, the way they [ __ ] up your circadian rhythm, like when you're, when you're laying in bed at night scrolling and how that blue light in the phone just like pumps your brain full of energy and you can't put it down.\nYou're just addicted.\nLike every scroll is like another hit of the crackpipe.\nYou know, that baby hit too.\nIt's not even like, ooh, feels so good, right?\nIt's like you got to keep doing it.\nMost nothing hit ever.\nIt's like a just a little uh, uh, what's that?\nUh, oh.\nOh, how weird.\nYeah.\nAnd it like turns off a part of your brain too.\nLike it turns off the thinking part.\nMhm.\nYou know, where like you just keep doing that thing and you're waiting for something good to hit, something more to like charge your and it never comes.\nIt never comes.\nRight.\nYou keep looking until you [ __ ] look at the clock.\n\n\nand\nit's like 3:00 a.m. and you're like,\n\"What the [ __ ] am I?\"\nYou're a [ __ ] gold miner in a barren creek.\nYeah.\nYou're just constantly gold mining.\nOne day, one day gold.\nOne day I'm going to find gold.\nI'm going to find enlightenment on my Instagram.\nNope.\nYou know, you're not.\nYou're going to [ __ ] your head up.\nYeah.\nNo, I think it's uh I think it's definitely atrophying the human brain.\n100%.\nAnd uh that's why I like these like these new tech technical computers and these different apps that are coming out that are like trying to be anti-technology, you know?\nThey're like trying to make healthier computers and healthier phones that like\nOh, like that simple phone.\nIs that what it's called?\nThere's a simple phone.\nThere's like uh the the the daylight computer thing, which is like an iPad with no blue light in it.\nAnd it has all this.\nIt's like kind of like a Kindle on steroids where there's no blue light.\nOh, so it looks like paper.\nYeah.\nLook, it's like this is one of them right here.\nAnd it has like\nOh, you have one?\nYeah.\nYeah.\nI put I like make my notes on it and then you It also has like the key.\nCan I see it?\nYeah.\nYeah.\nWhat is that called?\nThis is called the uh daylight computer.\nLook at it.\nOh.\nSo, I put all my books old iPad.\nYeah, it looks like an old iPad.\nThis is like version one of what they're doing.\nIt's [ __ ] sick, dude.\nYeah.\nIt's like it's you I don't know if you've ever used a Kindle, but like they have like a note-taking thing and it's super slow when you draw on it.\nThis thing is super fast.\nYou can zoom in and out of [ __ ] super fast.\nLike PDFs\nand uh when I sit when I sit in bed at Reed, if I use like a\nThis looks good.\nLike when you're looking at it, doesn't [ __ ] with your eyes at all.\nIt looks like a piece of paper.\nYeah.\nWow.\nAnd look, check this out.\nIf you do uh if you do this,\nwhen did you decide to do this to go switch over to this stuff?\nThis is like in the last year.\nOh, yeah.\nSo, look at that.\nSo, it's all it's like amber light.\nSo, if I lay in bed at night and I'm reading like a PDF or a Kindle or something like this, I'm asleep in like 45 minutes.\nI the blue\nWhat's going on with his uh microphone?\nDid you uh disconnect it?\nSure.\nDid\nYeah.\nWeird.\nDid I break it?\nCheck.\nCheck.\nHere we go.\nWe're back.\nSo, yes.\nSo, amber light.\nYeah.\nYeah.\nAmber light.\nAnd then like if So, if I sit on my phone and read something, I can stay up all night.\nOr if I sit on my computer and read something, I stay up forever.\nThis thing I fall asleep.\nI literally It doesn't keep me up cuz it I don't think I think because it doesn't have the that blue light that's baked into it.\nSo, you use that as your primary computer?\nNo, no, no.\nI just use this for reading and like note-taking and [ __ ] I like I'll like on every podcast I do, I'm just like taking notes on it because it stores all my notes and then I just read Kindles on it and PDFs and stuff.\nAnd you write the notes by hand?\nYep.\nOkay.\nSo, it has like\nYeah, it's like a little sketchy thing and it's like super quick.\nIt's like It's like It's [ __ ] amazing.\nYou don't type your notes.\nDoes it have a keyboard?\nCan you type on it?\nYou can uh It has It's like a It's like basically like an iPad.\nIt's like a Android like a Bluetooth keyboard.\nBluetooth keyboard.\nYou can type on it and [ __ ] It's super quick, super responsive.\nAnd so, what was the the thought process about switching to something like this?\nbecause uh like so I got introduced to the those guys when I started learning about like all this circadian rhythm stuff and how like all these devices hijack your dopamine system and all this stuff and there's like hey there's these guys that uh they're working on this new technology that's like anti- big tech mind control all the apps and everything like that with all the colors and all the you know everything that just like [ __ ] with your your brain and your eyes and I was That's interesting.\nThey're going in the opposite direction of normal tech and like Apple and all these things.\nSo, uh, I hit him up and they sent me one and I was just like [ __ ] blown away.\nI thought it was super cool.\nI could sit outside cuz I like to I like to go outside like first thing in the morning when the sun's rising and spend at least like two or three hours like during the beginning of the day because I feel it just like charges me up for the day.\nI feel better when I'm outside.\nEspecially in Florida, the sun's really good.\nAnd uh so I I'll go out there and I'll read on this thing.\nI can't read on anything else.\nMy phone or like a a computer screen.\nThere's so much glare.\nThis thing thrives in the outdoor sunlight.\nSo it's like it's like perfect.\nIt's like reading like a a piece of paper.\nWouldn't you think like it would be best if phones were like that?\nSo you could read text messages.\nIt would definitely be healthier.\nIt would definitely be healthier for us, but it wouldn't\nYou wouldn't be able to look at pictures and videos the same way though, right?\nIt doesn't have color, right?\nYeah.\nYeah.\nThis thing's all black and white.\nAnd with that amber backlight that you can throw on at night if you're if you're like uh inside or something like that.\nAnd so how much of a change has it had in like your routine because of this thing?\nIt's great because I if I'm reading [ __ ] which I typically do in the morning and at night, I I don't stay up all night.\nIt it it encourages me to go outside more because like typically when I'm trying to like absorb stuff or like listen to podcasts or like make notes or read read books, I can do it on that and it works better outside.\nHuh.\nSo, it just makes me want to go outside more, which I feel better when I'm outside more.\nWow, that's interesting, man.\nYeah.\nWhat's it called again?\nDaylight computer.\nDaylight computer.\nYeah.\nIt's beautiful, man.\nI might check that out.\nYeah, it's cool.\nI don't want to carry around another [ __ ] thing, though.\nYeah, you got you got all your phones and\nYeah.\nAll the [ __ ] I have to carry around.\nThat's big.\nYeah, that's an iPad.\nIt is big.\nIt fits in that little that little Patagonia bag.\nI just like carry it.\nI carry it like home to home and like to the studio.\nHow come it has those big stupid bezels?\nI don't know.\nIt's It's version one, so like you know,\nbecause it looks like they got some leftover iPad technology or Kindle technology.\nVery interesting.\nNo, it it definitely uh you know, I think they're going to eventually try to improve that.\nLike I said, that's like the version one.\nThat's like iPhone one for their thing.\nAnd they're trying to like\nSo, this is new.\nVery new.\nYeah.\nThey're trying to come up with like phones eventually and but uh apparently it's a lot of work to have a computer company and to\nJames Macccan, one of the comics from last night, he had a uh a new phone.\nI was like, \"What is this?\"\nHe's like, \"It's uh it keeps you from being distracted.\nIt only has like Spotify, a few other things on it.\nOne shitty little camera and a black and white screen.\"\nI'm like, \"Really?\"\nIt's like he's just trying to get off of his phone addiction.\nYeah.\nSo, he has a much more limited phone.\nIt runs on Android.\nMhm.\nThere's a lot of people that are kind of leaning in that sort of direction.\nYeah.\nlike the anti-tech direction.\nUhhuh.\nWell, just realizing like something's going on.\nLike I'm not happier.\nI'm less happy.\nI'm kind of tweaking thinking about where's my phone?\nWhere's my phone?\nI don't think the techn I don't think um the innovation of of all this new technology and now that it's like exponentially taking off with AI is going to lead us to a good place.\nMan, I think that uh\nyou know, I've had philosophers and people explain to me how like the advancement of like the technological human mind and the analytical mind has equally equated with the atrophy of like the psychic mind.\nMhm.\nAnd like when you listen to people like to Paul Rosalie talking about spending a lot of time in the Amazon and like going through the jungle, how it like awakens these deeper senses that you have in inside of us.\nMhm.\nAnd like it makes me wonder like 5,000 years ago before we had the ability to offload our memories onto phones and computers and before we even had the [ __ ] written word and were able to make notes and stuff, we probably had like way better memory.\nMhm.\nWe h we possibly likely had like a telepathic way of communicating back then like way way long ago before we h like before we started letting technology take over for what we do like even for our like mundane tasks now which is reached the pinnacle of LLM like telling us telling us like how to [ __ ] write an email you know\nright well we for sure don't remember phone numbers anymore and when I was a kid I kept like 15 phone numbers in my head now I have zero I like maybe one or two phone numbers I can remember.\nEverybody just relies on their phone.\nThere's so many people that can't even make their way around town without their navigation system.\nCompletely forgot how the streets connect.\nMhm.\nYou know, there's a lot of digital atrophy or human atrophy that's being caused by the interface with the digital world.\nMhm.\nAnd it's only going to get worse.\nI mean, there's a there was a study recently on chatg users and how less there how But see if you can find it.\nIt was a study on young people and ubiquitous use of chat GPT.\nLike how many of them are using it and how much effect it has on their ability to form their own thoughts and and see through things.\nThey're just relying on this thing to answer the questions for them without pondering the question themselves and actually learning things.\nThey're just getting data.\nYes.\nAnd a lot of that data doesn't even get absorbed.\nYeah.\nMy wife and all of her friends are using chat GBT.\nHere it is.\nChat GBT may be eroding critical thinking skills according to a new MIT study.\nThat's odd.\nTotally makes sense.\nStudy divided 54 subjects 18 to 39 year olds from the Boston area into three groups and asked them to write several SAT essays using open AI's chat GPT Google circuit Google search engine and nothing at all respectively.\nResearchers used an EEG to record the writer's brain activity across 32 regions and found that of the three groups, chat GPT users had the lowest brain engagement and consistently underperformed at neural linguistic and behavioral levels.\nOver the course of several months, ChatGpt users got lazier with with each subsequent essay, often resorting to copy and paste by the end of the study.\nWow.\nYeah.\nWe're we're gonna just end up being a residue of a species overwritten by our own creation.\nVery bizarre.\n[ __ ] scary, dude.\nVery bizarre.\nVery bizarre because we're just all running towards the cliff.\nAnd we're all like, \"Yeah, well, we got to do it cuz if we don't do it, China's going to do it.\"\nYeah.\nYeah.\nYeah, man.\nI think I think we're going to integrate.\nThat's what I think.\nWe're We're going to realize that the only way for us to survive is to integrate with artificial intelligence.\nI think people are going to choose.\nThey're gonna find God either in artificial intelligence or in nature.\nPeople that run the other way are going to realize\nlike there's definitely going to be people that worship artificial intelligence as a new God.\nYeah, that's already been speculated.\nThat's for sure going to be a thing.\nAnd it might actually be that might be that's what God is.\nLike that's how we make him.\nWe make our we make God forms himself through us.\nLike the way God creates us, he instills us with this insatiable need for technological innovation till ultimately if they don't blow themselves up, they achieve artificial intelligence which then becomes sensient which then makes better and better versions of itself.\nAnd as you scale out, what's the ultimate version of that?\nThe ultimate version of that is God.\nYeah.\nAnd then what what what are we?\nWe're the chicken and the egg.\nChicken and the egg.\nWell, there's some new thing, man.\nHave you seen this thing about the James Webb telescope channel?\nYes, dude.\nI was talking to Jesse Michaels about this yesterday.\nYeah, me and Jesse were talking about it yesterday, too.\nSo, Jesse's his phone was getting lit up.\nUm, I'm going to send you this, Jamie.\nSo, I guess really interesting.\nThe story is like this background microwave radiation is not what we think it was.\nThere's these mature universes that are out there that we just discovered with the James Web.\nThis is uh here, I'll send you the um uh the Twitter thing.\nJamie, did you find it already?\nOkay, I don't know.\nWeb telescope uncover secrets of dark matter.\nYeah, that's one of them.\nBut um I'll I'll show you what this is because what this is is essentially that just the galaxies that they've shown um it it makes up for the background micro or whatever the microwave radiation is that they associated with the big bang.\nSo now so according to\nSo the big bang is fake.\nYeah.\nThat that makes a lot of sense.\nYeah.\nYeah.\nNo, I saw the Twitter post and there's people you know, going after each other like rabid cats and dogs about it, whether it was real or whether it was fake.\nYeah.\nWell, of course, people are going back and forth about it, but essentially what they're saying is this kind of it cancels out the idea of the big bang and Penrose believed that it was a consistent cycle.\nPenrose believes it goes, you know, big bang to expansion of the universe to compression to big bang with this\n\n\nConstant cycle, never ending. It's not that the universe was formed at one period of time. It's like this constant state of happening, which is that any more crazy than the universe happening at one time out of nothing? No. I mean, it's kind of, it's all crazy.\nJust the idea that it's 13 billion light years old or 13.7.\nYeah.\nOr 22. Is 22 even more crazier?\nYeah.\nOkay.\nYeah. This is nuts, dude.\nA new paper shows that the cosmic microwave background radiation can be explained entirely by the energy of recently discovered early mature galaxies. Mass massive galaxies the James Webb Space Telescope discovered while crushing or excuse me, discovered which crushed the existing models of galaxy formation because they formed much earlier than astrophysicists thought possible. But now these EMGs turn out to account for the entire energy density of the cosmic microwave background radiation, which was believed to be a snapshot of the first light emitted after the Big Bang when the universe was 379,000 years old. The variations in the CMBB were believed to be relics of quantum fluctuations in the dense plasma of the Big Bang. If these new findings are accepted, and there's no reason not to accept them, then all the following flagship findings of cosmology are thrown into question. Big bang theory foundational cosmological model undermined. Cosmic inflation losses observation loses rather observational justification. Uh ACDM model, I don't know what that is, key parameters become. So all this stuff, dark energy inferred from the CMB may be mischaracterized. Dark matter density, current estimates may be invalid. Age of the universe must be miscalc uh must be recalculated.\nWild.\nYes, it's insane.\nWild [ __ ]. And I'm sure the people that have been preaching or uh that have been rather um talking and teaching people about the Big Bang and writing books, they're going to fight back tooth and nail, of course. They don't want to be wrong. Mhm.\nBut this James Webb telescope at the very least has shown us mature galaxies that shouldn't have been able to be formed.\nThe fact checkers got it. Reader context.\nThis post claims CMB can be explained entirely by EMGs. Uh implying ability, not probability. The EMGs turn out to account for the entire energy the CMBB radiation. But the paper says EMGs may account for anywhere between 1.4% and 100%. So they might account for 100%. But they do account for. That seems like you're nitpicking. Yes, it might account for 100%. Okay.\nRight.\nEither way, they're learning things, and they still have a very limited ability to observe. Right. So the James Webb telescope is so much better than the Hubble, so much better than anything else they've launched before. So they're finding new things out, but it's still limited in its capacity to see the universe. It can't see everything yet. So they'll probably have an even better one that they'll launch, and that will show us even more that we didn't know. And we're we're operating on a limited amount of data, and we're operating with this conviction that they're 100% correct. Yes. About these timelines.\nYes.\nAnd just that just these mature galaxies that existed where they shouldn't exist is enough to know that we don't know everything. And then this whole dark matter, dark energy thing, it's like what is it? You can't even what you don't even know what it is.\nWhat then we Well, we figured out that uh that dark matter actually is mass, right? And has gravitational effects. Like they were they were um I forget who it was, but they they were observing galaxies, and they were looking at the spin rate of the galaxies, and they found out that the center of the galaxy, it should be spinning faster than the outer rim of it, right? But they found out that the spin rate is identical, which means that what they what they theorized is that dark matter, the mass of the dark matter around the galaxy, has lots of mass, and it's flattening the spin rate of the galaxies, which is interesting because like there's this, have you ever heard of this dude named Ralph Landau?\nNo.\nHe has this theory um that if you weighed a hard drive after you put data on it, it would weigh more than when it was empty. Right? So, and his theory was that like every single hard drive server farm around the world right now, and if if you weighed it, if we had measuring uh equipment that was sensitive enough, and you could find the difference, he thinks that all the data stored would be like a kilogram or less right now. But the rate of data increase that we accumulate each year right now is like 25%. Not equating for exponential growth, the technological singularity and how that's going to ramp up. So somebody did the math there and said um it was uh no, it was Jason Giiani who did the math on this, and he he said if you just keep the rate flat at 25% per year of data increase across the across the globe, in 340 years, we are going to have the mass of the moon on the surface of the earth in data stored on hard drives.\nWhat?\nYeah. Yeah. So like and the way he the way he like lays this all out, I'll try to do my best, is that the if you look at the laws of thermodynamics, like the two laws, one that energy can never be created or destroyed, and the other one like uh entropy always increases over time, entropy meaning disorder, it never goes down over time, like hence the heat death of the universe will eventually happen, and so E= MC² energy and mass are interconvertible, and Then there was this other dude Claude Shannon who came up with the theory that uh data transmission with binary bits, ones and zeros, right? So so if computers are bound by, tell me if you're if I'm losing you, no, if if computers are bound by the laws of entropy, and hard drives are bound by the laws of entropy, that means when a computer is blank, it's very low entropy because it's all ones or it's all zeros. When you add data, when you add a podcast to it, it goes 1 0 1 0 1 0, it's chaotic just from From a pure physical uh perspective, it's high entropy.\nSo what happens when you erase that hard drive? You have to the energy has to go has to leave. If if it's mass on the hard drive, theoretically, if this guy's right, if Ralph Landar is right, that data on the hard drive is mass. When you erase that, it has to go to energy outside of the hard drive. Right? So he says if you but but if you crack open a hard drive, you can't see that mass, right? It's invisible. It's electromagnetically indetectable.\nSo he says, \"What other kind of mass do we know of that's electromagnetically indetectable?\" He said, \"It's dark matter.\"\nSo if if mass is the same thing as information stored on a hard drive, that would mean not only is mass and energy interchangeable, but mass, energy, and information are interchangeable, right? So if if dark matter is mass, you could then say that dark matter is a computational cloud of ones and zeros, and our our uh consciousness is an interface to that that gives it meaning. The same way a computer screen gives meaning to all the ones and zeros on the hard drive.\nAh.\nLike you watch the video, it g it has meaning to. So this is the concept that consciousness engages with matter, and that is how matter exists, that it exists because you're observing it.\nYeah. The only reason yeah, consciousness is fundamental to an information processing system. So instead of building up to like, but what physicists, what people try to do is build up to consciousness from dead atoms, protons and neutrons, right? You how do you get to consciousness from that? But if you think of this as like a computational cloud of ones and zeros and mass does equal information, well that just means that our conscious our consciousness is a way to interface and give this simulation meaning. And funny enough that that theory really reconciles well with [ __ ] like parasychology and like um Rupert Sheldrake's morphic resonance, like when you solve one problem in one one part of the world, and then like somebody breaks a world record in this country, and then five, you know, a year later, five other people hit that same world record. It's like uh conserving energy, the processing system conserving energy. There's a guy, there's a scientist that he found computational code.\nUh what did he you know, you remember this guy Jamie, that he he believes that he found computational code that proves that like the universe is a simulation.\nBut this guy uh I tried to get him to come on the podcast, but he said I was anti-science because the COVID vaccine stuff. This is a few few years back though. Maybe he's kind of woken up and changed his tune. I doubt it, though.\nA lot of people got indoctrinated.\nThat's anti-science. Like actual data is anti-science.\nWhat is Whose data? Whose data are you going by? We could have a conversation about that if you like. I'll show you some things.\nYou can have a great conversation. I think you've said everything.\nHave a seat. Have a seat. Let's go over some studies.\nIs this the dude?\nYeah, that's the guy. Um, so what was his uh So, this guy won't come on my show because he says I'm anti-science.\nSymmetry, super gravity.\nYes.\nTheory. And but what is is this discovery that he\nwas from Tampa? Born in Tampa.\nHe found\nsee\nwhat was the um supposed discovery about the computational code.\nWhat did it say?\nAre we living in a computer simulation?\nYeah, this is it. James Gates, theoretical physicist, the University of Maryland. Autocorrecting codes. Click click on that, Jamie. Scientific American article. Oh, I can just write it right from there, I guess. Explored mathematical structure of string theory specifically in the context of super symmetry and has found what he describes as error correcting codes embedded within the equations. These codes are mathematical objects similar to those used in computer science for error detection and correction, such as in data transmission. While these findings are intriguing, it's important to note that they are not literal computer code, but rather mathematical structures that share similarities with coding theory.\nH yeah, it's important to learn that.\nBut that's [ __ ] crazy.\nYeah, it is [ __ ].\nAll of it is crazy.\nMhm.\nBut James Gates as of I think 2 years ago wasn't willing to come on the podcast and talk about it.\nYeah. If I had a dollar for every person who said they wouldn't come on my podcast cuz it's too pseudoscientific, I would have like $5.\nWhy not? Why not come on and illuminate people?\nYeah. I had this this there's I don't want to say who she is, but like this lady who had this amazing book on like uh the uh Greek weapons and poisons that they used to use for war. Like they used to like drop scorpions over Amazing book. Like they used to light pigs on fire and like send them towards elephants to try to get the elephants to run away and like throw bags of scorpions on people and I'm like this [ __ ] book is amazing. I need to get this lady. She's\nwe're not we're not we're not uh academic enough, I guess. But I'm trying to get there.\nYeah, but what does that mean?\nWhat does it mean? We're just human beings having a conversation. You're the academic.\nCome in and tell me what you know.\nYeah.\nWhat's the big deal?\nYeah. You do a great job of like having both sides in, which I think is really cool. Like you have like the the crazy fringe people who are like educated, self-educated, but are very smart in a certain way, and then other people who like have the the academic credentials to sort of like be a sounding board for that and to see like who's really full of [ __ ].\nYeah, you have to have all because there are some people that are they're self-taught. They've essentially just read [ __ ] tons of books, and they're brilliant people. And just because they're not classically educated, it doesn't mean they're incorrect. And there's only one way to find that out.\nGuys like Randall Carlson, he's a builder. Okay? But the knowledge that he has about the impact theory, the younger dus impact theory and what probably ended the ice age and and shaped a a great part of North America and how you could see it from space and you could see when they look at the satellite imagery and you it literally looks like things have been washed away. It looks like massive water erosion. Like you can see the ripples on the ground that are akin to what it looks like when the tide pulls back on the sand on a beach.\nYeah,\nit's it all makes sense. And he knows so much about the actual science behind it. And he was talking about this a long time ago. I met him in Georgia in Atlanta. That's where he's from. I met him in like 200 three or something like that. 2002, 200. He was telling me about it back then. But back then they didn't have the core samples that showed that there was significant impact uh evidence that was around I think it was 11,800 years ago and then again somewhere around 10,000 plus years ago.\nSo we I think we've been hit multiple times, and I think he's 100% right about that. And I think Graham Hancock is 100% on to something with these all this ancient apocalypse stuff, and the push back against him is insane. They throw every terrible phrase at him. they possibly can. Every pjorative, racist, white supremacist, all these crazy things with\nYeah, I had Flynn Dibble on my podcast. We talked about it.\nFascinating.\nYeah, he's great. He's I actually liked him.\nHe's a nice guy when he's not calling you a racist.\nWhen he's not in front of a keyboard, right? Yeah. Well, he he you know he's an anxietyfilled academic who is you know fighting very hard to push his very specific view of things, and he tries to silence other people that have oppos opposing views, and the way he did it with Graham was really not cool. It was no it was shitty. It was very shitty.\nYeah. No, I think he was uh I think he had a lot of like interesting legitimate things to say about like ancient Greeks and stuff like that, but like when we got to this stuff\nMhm. It was just like, \"Where did that [ __ ] dude I was talking to 30 minutes ago?\" He was just like, he was looking at this, and then all reason just flew out the window.\nYeah.\nHe was like, he was like, \"What do you mean they couldn't do this? They stick a stone in there. They spin it around like this, and then you can get this. It's really easily. How dare you say that the that the dynastic Egyptians weren't able to create these vases?\" And I'm\n\n\nLike, and I, you know, I was like proposing other theories that, like, you know, uh, Chris Dunn's Jeffrey Drums theories and wanted absolutely nothing to do with it. And like, we don't know. This is the thing. That's the thing. Exactly. If, if, if Christopher Dunn had been teaching this in the 1800s and people had followed those theories and built upon them, and this was academic, you like, in, in universities, this was accepted, and this was what they were teaching, and they were studying this, then he would be saying that they would all be saying that there's ample evidence that he's got a good point, that Christopher Dunn, the model that he uses when he's describing how he thinks that a, that the Great Pyramid of Giza was a power plant, is fascinating, that the number, when, when he's talking about the ratios that you would need for the width of the walls, the surfaces, what the way the things are made, they would all work. Yep. He's an engineer. Like, he, he's not a [ __ ]. He knows what he's talking about. If this guy was teaching this stuff a long time ago and it was accepted by universities, that would be what we're talking about today. We'd be speculating how they did it and what they were doing and what they were doing it for. And if we had known in the 1800s that we regularly travel into a comet storm and that it happens, I think it's every June and November we pass through the, you know, and we see it in the sky. We see meteor showers, you know, you see, oh, look at the sky. Look at all the shooting stars. We're, we're in a [ __ ] shooting gallery, and occasionally one of those slams into the earth. Yeah. And when that stuff happens, we're [ __ ]. And it's super likely that that happened multiple times during human history. And it's super likely that that's why there's all these structures that nobody could explain that are somehow or another predate modern civilization, like Gobekli Tepe. That [ __ ] them all up because before Golcite, they had this 6,000-year model. Yeah. Mesopotamia, Sumer, that's where it all started. Now they're like, well, maybe it's Turkey. Maybe Turkey was the birth. I mean, Jimmy Corsetti's been talking about this a lot. And I understand, like, where they're coming from, from the, I like, I can see their point of view from the academics. Not that I would act like them or like condone the way they act, but like, when you spend your life, Flint, for example, like, I think his parents were archaeologists, named him Flint because of archaeology, and like, you spent your whole life mucking through these different places, excavating [ __ ], digging up rocks or whatever he was doing, never, and no one ever paid attention to you. And then you have Graham Hancock come in who is like personally fascinated by these things and dedicating his life to writing and researching on his own, but not accredited academically. You can see, like, how those guys would, how those academic guys would be like super salty of somebody like, I understand that. Oh, I get it. It's not an excuse for what he did, which I think was shitty, right? Yeah. It's not an excuse, but like, I understand their perspective, but it's ego-driven. Yeah. If we really were interested, you would take these heterodox scientists and you'd bring them in, and you would say, like, what do you like, these, they're studying data. Guys like Graham Hancock and Randall Carlson, they're studying, they're studying these things. Graham was just in Iraq. He just was go, going over there to look at, like, ancient Sumerian stuff, you know. He sent me some photos of his trip. He said it was fascinating. Wow. Yeah. It's these structures are incredible, and they don't really understand them. We really don't. We don't even know, like, who really built the Aztec temples, you know, like, uh, I was reading about, uh, Tenochtitlan. They, like, they found it. The Aztecs found that there, and they don't even know who built it, right? There's a bunch of those things. They're like a previous civilization existed in the same place. Fascinating discoveries, figured out how to do agriculture, figured out how to make grids and cities and make these incredible stone structures that are cosmologically connected somehow. And then they went away, like, and all over the world. All over the world, there's, like, people reinvent civilization, the places where these ancient structures exist and even build upon them. They build over them. Yeah. I think there's probably so much [ __ ] that that people were able to do in antiquity and way before that, that would seem like magic to us today. Like, kind of like getting back to what we were talking about with our senses that we don't really have today that probably have atrophied over millennia. Like your fart theory, which is amazing. Remember, you remember your fart theory? Oh, how's it going again? Imagine if somebody farted and you didn't have a nose, and you haven't developed this nose that enables you to survive and smell predators, fire. You would have no idea you're sitting there bathing in somebody's fart, right? So, like, and so, like, dogs, you, dogs and cats when they go into weird houses and they notice, like, some sort of weird energy. You know, people describe energy in a house, like, this is, this feels off. Like, what is that? Like, is there, is there something that really is there that we just don't have the organs anymore to detect or something in our brain that has atrophied over thousands of years that have stopped us being able to detect this stuff? Well, think about how birds can, they can figure out a way to travel, like, super accurately through the sky, but drawn by the magnetic force of the earth. Yeah. Yeah. They, they have, somehow or another, they can, they figure out a way to navigate with the earth's magnetic field. M, we don't even understand it, but they do it. They migrate successfully every year, we know they do it. That, that's a sense that they have that we don't have. Like, it's probably a fun, a [ __ ] [ __ ] ton of, there's probably a bunch of things going on in the world that we're not interacting with because we don't have the senses for. Right. Yeah. And, uh, you know, one of the things that I've been, like, really interested in lately is, uh, this, I mean, people talk about this ability to, like, download information, like, in the UFO world, you know, like, people talk about, oh, I got this from a download or something like that. They talk about, like, I have an antenna, I can connect to something. Mhm. But, like, for me, like, that connected when I first heard about people talking about that, I always thought that that was, like, the muse, you know, like, you have this sort of antenna in your head that connects you to creativity and gives you the ability to just create [ __ ] out of thin air, you know? And I feel like over with people I've observed over my lifetime, I feel like that peaks at an early age, right? Before you get older and before you start the burden of life, the responsibilities of life, and all these mundane things in your life start to compile on, and you trade your dreams for securities, that, that spark starts to go away, you know? And, uh, like, that could easily be described as something magical if it was way more powerful thousands of years ago. Like, I really noticed this the other day. So, I was, the other day I was hanging out with, uh, with Kirk, the lead guitarist for Metallica, and he was, for some reason, I don't know why, but he likes my show. And we were just like, \"You got a great show.\" We were talking. Thank you. I appreciate it. It's weird. I feel like an impostor. Uh, that's good. That's why you're good at it. But he loves this stuff. The dude's, like, you know, he's in his 60s, like, early 60s, and he's [ __ ] obsessed with all of these topics that, like, that you cover, I cover, a lot of people cover, and he's, like, at the same time, he's the dude is, like, got this crazy spark where he's so inspired to do [ __ ] and, like, still creating new music and, like, coming up with new riffs and, uh, and wanting to do more things where, like, I've never met a dude like that who's had so much success, toured everywhere for the last 40 years, being the number one metal band in the world, basically, and still, like, wanting to learn stuff. The dude is trying to translate ancient Greek music for his guitar and trying to figure out how to play this stuff. He can't figure it out. And he was telling me, he's like, \"Dude, I think this wasn't recreational.\" He's like, \"I think this music was magical.\" He's like, I think they were performing magic. He thinks it was, like, religious medical rights they were performing with music. It wasn't supposed to be entertainment back in the day. Well, there is this weird connection with music and psychedelics where music can sort of, it, it, it changes the trip. Like, if, if you listen to, do you know what ikaros are? No. Ekaros are these, uh, Hook it up, Jamie. Ikaro are these South American songs that they play while you're doing ayahuasca. And if you do DMT and listen to these things, they take over the trip, and the song, the, the trip moves with the song in harmony. Like, exactly. It's not like the trip is chaotic, and you hear the songs, and these songs are, like, a technology to move the trip. It's really fascinating because you listen to the songs, and you're like, well, what are these things? Like, what are they trying to do with these? They, they sound kind of weird, but when you listen to these songs while you're tripping, it makes the trip dance. It makes the geometric pattern. [Music] So, you are lying on the floor. It's Costa Rica. You're lying on a yoga mat in the jungle with a bunch of 40-year-old ladies with boob jobs trying to get their life together. Tech entrepreneurs. Tech entrepreneurs. Navy Seals. Yeah. And you just threw up. You have horrible diarrhea. And this trip just starts coming on. I think I just found Jesus. Give me, give me a little more something that would, like, a little more beat to it. I got some on my phone. I heard the one that, uh, you know, you had Luke on recently. Luke Caverns. He's great. He had a great, uh, great little clip that he played. Here we go. This is my favorite one. And they dance. They dance to this song while you're tripping. Balls. You, no, the psychedelic experience dances to this song. Oh, when you're lying there with your eyes closed, that's wild. And the whole time it's doing, it's like synchronized together. And the whole time it's doing, it's like, it's like a method for showing you more things. And as you go through it with the music, there's something comforting in the pattern of the music and the way it dances to the music that allows you to relax and unveils more and more of itself. It's very trippy. And the fact that these guys figure this out, how did you figure this out? Yeah, man. There's, well, he's your, your friend is probably right. The Metallica guy's probably right. Yeah, it's probably, they were probably, that music probably synchronized with the trips, like, when they were doing the Elusinian Mysteries. Yeah, when I went to their concert in Tampa the other day and I was walking in, I made me regret not going to more concerts when I was younger, but, like, being in that stadium, the, the Buck Stadium, where there was 90,000 people. Every seat in that arena was full, and you hear, well, it goes black. There it is. Lightning strike happens. Insane. Look at this lightning strike. Caused an earthquake. They're actually, I mean, super dangerous, but that was badass. That is [ __ ] insane. Ride the lightning, [ __ ]. That's so dangerous, dude. Being there with 90,000 people, the light, the thundering electric guitars and the, the, the, the fire, the pyrochnics, and all those people, like, focusing, like, all 90,000 people, every atom in their body is vibrating at the same frequency. And it just, like, that is, it's like magic that penetrates every fiber of your being. And if I was a dude from 2,000 years ago and took a time machine to that Metallica concert, those dudes are gods, right? They're [ __ ] gods. I think that's what the Elusinian Mysteries probably was. Well, they probably had music that, that enhanced the trip. It probably guided the trip. They probably learned how to do it while they were tripping. Mhm. Like, they figured out so much. They figured out democracy. They, they, they started so, so much of what we think of as, like, Western government. Yeah. And the scientific method, democracy, all this stuff, tripping balls. And then the Romans came along and said, \"Put stop. We're here to make slaves out of you [ __ ] people. We don't want you tripping.\" Right. Yeah. That was, uh, yeah. They killed, they killed Elus in, like, what, 400 AD, I think. Well, they did exactly the same things the Nixon administration did to psychedelics in this country. They're like, \"Oh, this is a problem,\" when they were turning everything schedule one to try to stop the anti-war movement and the civil rights movement. That's the exact same thing. Like, governments when they get to a certain position of power, they're not representing the people anymore. Now they're, now they're the [ __ ] jack-booted thugs that tell you what you can and can't do based on how inconvenient it is for you to be doing that for them running things, right? Yeah. It's just, it's terrible. It's the opposite of what it should be. It's the opposite of what got, it's the opposite of what got us here, I think, bro. Yes. And I had, we're too big now. There's too many of us. That's part of the problem. It's like, you want to govern 330 million people plus Mexicans. Good luck. I had this dude on my show, speaking of, uh, the academic, the strife between the academics and the self-taught, uh, online people, influencers, whatever you want to call them. This dude was, uh, he was kicked out of his university for, he first of all, he wrote a dissertation on ancient pharmacy, the Roman, Roman pharmacy and Greek pharmacy. And it was a dissertation based on this guy named Galen, who was, like, the surgeon general of ancient Rome. And he had a\n\n\nChapter in his dissertation, his PhD dissertation about uh recreational drugs in Rome.\nAnd the head of the department reviewed his dissertation and said, \"Everything looks great. Delete the section on recreational drugs in ancient Rome.\"\nSo he's like, \"Okay, why?\"\nThey're like, \"Cuz the Romans wouldn't do such a thing.\"\nSo he's like, \"Okay.\"\nHe deleted it and then submitted it, got his PhD, and then wrote a book based on that part of the dissertation that he left out, which the book was called The Chemical Muse.\nAnd uh I learned about this from Hamilton Morris.\nHe did a podcast with the dude first, and I read that book, and you know, he was basically making the case that drugs were ubiquitous in antiquity during the Roman times.\nLike they were being used for everything because people were not dying from old age.\nThey were dying from war, hand-to-hand combat, famine, plague, infection, all these things.\nInfection.\nSo like people were constantly using drugs, and there was a law in ancient Rome that he said there was only one law when it came to using drugs, and that was that you were not allowed to kill people with drugs.\nYou were not allowed to murder people, which is why Marcus Aurelius was using this drug compound called a uh uh theak.\nAnd the theak was a concoction of like 11 different North African vipers, their flesh and their venom combined with opium and all kinds of like body bodily fluids.\nAnd he was using this as like a performance-enhancing drug.\nWhoa.\nBecause people were trying to assassinate him with poisons.\nThat's how they assassinated people.\nThey were using scorpions, poisons, arrows, all like all different kinds of weird things to sneak in and kill him.\nSo he was drinking this theory to build up his immune system against the venoms.\nAnd uh dude, this dude Galen who wrote about this, he was talking about giving, he was Marcus Aurelius's physician, and he was like, \"Marcus Aurelius, it's getting ridiculous, it's getting annoying. I keep having to up his opium dose. He keeps using more and more opium. I can't get him off of it.\"\nOh my god.\nYeah.\nAnd uh so Galen, the physician, the surgeon general of the Roman Empire, uh under Marcus Aurelius uh and Nero, I think, basically uh equates to 10% of all the Greek literature from antiquity.\n10% of it is medical, and this dude that uh wrote this dissertation based it all of Galen is talking about all these drug compounds that are used and all the so what does is he looks at all the ancient literature from from Homer to, you know, like 800 to like the time that Beowulf was written, basically uh 80, and he's like finding all of this evidence of crazy drug use.\nAnd he has this crazy theory also that uh I don't know if it's crazy.\nI don't know the problem like with with talking to people like them like him is that I don't know ancient Greek.\nI can't read it.\nRight.\nAnd I try to have I've tried to have like four or five academics come on the show to like refute him, but they won't come on with him.\nThey all refuse to debate him except for one guy.\nInteresting.\nYeah.\nWhy?\nCuz he's saying Christ is a drug.\nOh, I saw that video.\nOh, you saw the whole thing.\nNo, I saw that video pop up my YouTube.\nI'm like, Danny Jones going crazy, like what is he doing?\nChrist is a drug.\nWhat?\nSo, but that's also what John Marco Allegro alleges, kind of kind of.\nWell, he said that the ancient Sumerian word for uh a mushroom, it no, for Christ is a mushroom that's covered in God's semen.\nYeah.\nCuz the mushrooms would come out of the ground, and they thought the rain was God coming on the earth, and that's where, you know, that's what gave life to the earth, and then they would take these mushrooms and see God.\nRight.\nYeah.\nI don't know much about John Marco Allegro, but I think that I I read his book, the uh the sacred mushroom in the cross.\nYeah.\nHe was like using Sumerian roots or something to translate the Dead Sea Scrolls.\nBut this guy is basically saying the word Christ, the word the the the root of the word Christ is creo in Greek, right?\nAnd it was used since Homer, and there's all these passages which he's this dude sent me.\nI literally I I call him all the time, and I ask him, I'm like, \"I need more evidence. Send me more.\"\nAnd he sends me passages from like ancient literature, Homer, that's translated with the English directly under it.\nAnd they're using this word Christ as a term for applying drugs to people in antiquity.\nWhoa.\nLike Christing arrows with poisons, right?\nIt's like uh and and what year was this where they were doing this?\nBack all the way to like 800 BC was when Homer starts using it.\nSo they're using this term before Christ.\nWay before Christ.\nIt was well, so to be clear, in antiquity, if you look it up on the thesaurus, the actual like Greek thesaurus, it's called the TLG, and you look up the word Christ, there's there's over 200,000 or more uses of the word Christ.\nAnd there's like 350 times where it's used in the context of drugs before Jesus Christ is ever written about.\nWhoa.\nAnd uh what he's what he's basically claiming is that there's like it's it's it's the the process of applying something, like there's there's different context, like there's a guy who like Christed himself in cow.\nThere's people who are Christing ships with plaster to make them more waterproof.\nBut there's a vast majority of literature, including Galen, who writes about Christing using drugs.\nAnd he's coming up with this controversial theory, which is, you know, super controversial, that Christ was like, if you think of the word Christ, a person can be a Christ, like a Christ.\nLike, think of Bob the Builder.\nHe's a builder.\nHe builds.\nChrist was, they called him Jesus the Christ.\nSo he thinks Christ was somebody who was involved with drugs, taking drugs, giving people drugs, performing performing magic like a shaman.\nYeah, exactly.\nSimilar to that.\nAnd uh like by the way, a real shaman would say all the things that Jesus said.\nYes, that's a good point.\nSo and it gets like it gets way weirder, bro.\nAnd again, like I this is all according to him.\nI don't know if any of this is real.\nI just find it fascinating, and I wish I could find somebody who really knows the Greek to debate this dude and call him out in his, but I can't.\nThe only person I found was an exorcist who's done like 10,000 exorcisms on Skype.\nA Skype exorcist.\nSkype exorcist.\nBoy, that sounds like a scam and a half.\nAnd he came in, and they were just arguing about it for a little while.\nAnd the guy tried to baptize me with uh holy oil.\nAnd you know, I got into an argument with him about drugs.\nHe tried to baptize you?\nYeah.\nHe brought holy oil, and he tried to baptize me with the holy oil.\nDid he say why he was doing this?\nBecause he thinks that I uh he thinks that Satan is inside of me.\nOf you.\nOf me.\nYeah.\nAnd uh which he might be.\nWhat did what evidence did he have that Satan was inside of you?\nBecause I like to consume drugs recreationally.\nAnd I was telling him if Satan is drugs, if I can smoke marijuana and it's prescribed by a doctor, is it still Satan?\nHe goes, \"No, don't play those games with me.\"\nAnd I'm like, \"Well, how come every time I get really really bombed, I think about things like spending more times with my kids and things like good things?\"\nLike, yeah.\nAnd he's like, \"Don't try to patronize me. You know what it is? It's the devil.\"\nOh, he's a fool.\nOh, yeah.\nLike, that's a problem.\nLike, this guy's a show.\nIt's a show a showman.\nWell, cannabis was used in churches.\nThey used to, you know, the incense where they would go around, they would that was cannabis.\nThey would use that, and they would get everybody in the church high and fumigate it.\nYeah.\nYeah.\nThey would literally hotbox the church.\nUhhuh.\nAnd this is a part of this whole ritual of, you know, giving in to to Christ, giving in to God, right?\nThis the idea that it's bad because some people have bad experiences, man.\nYou could apply that to almost anything.\nMhm.\nI think marijuana makes people more compassionate, kinder, more sensitive, but also paranoid.\nYou could freak out.\nYou could if you're riddled with anxiety and you have a hard time controlling that anxiety in your mind and you take a high dose of marijuana, you could freak out.\nYeah.\nIt's also connected to schizophrenia.\nMhm.\nBecause I think there's people that have a tendency towards schizophrenia anyway, and then a large dose of marijuana tends to give them psychotic breaks.\nThere's like real literature.\nThere's real real evidence of that.\nSo, this is like important that if you're a person who thinks that marijuana is overall net positive, which I do, it's important to talk about the negatives.\nJust like everything else, like alcohol, food, everything.\nThere's a lot of different things that if you do, if you drink too much water, you'll die, okay?\nThere's a lot of things that aren't good for you under certain circumstances.\nBut the only way we know how to do it and how not to do it is to do studies.\nAnd when it's illegal and you're terrified you can go to jail or if you're an academic and you want to study this as your main, you just get dismissed.\nIt's could be career suicide, right?\nSo these people are foolish.\nYeah.\nAnd that's the problem, like like this was the only dude I could get to agree to come sit with him because this guy had a YouTube channel.\nHe wanted to promote himself and all this stuff.\nBut like a lot of the academics I talked to, a lot of Harvard philologists to try to come debate this guy.\nAnd like the philologists, like there's a difference between a linguist, which I think Marco Leger was, and a philologist, where the linguists look at the actual uh like the the complexities of the text itself and the language, but the philologists what they do is they're looking for context.\nSo like they what they do is they take words and they try to figure out what these specific words meant in certain time periods.\nSo they take a word, take their time machine back, let's take it back to 200 BC, 100 BC, whatever it is, and they say, \"Okay, let's just use the example of the word Rio Christ.\nLet's look at all of the corpus of all the literature that existed in the library of Alexandria.\nThere there was ancient comedy, ancient plays.\nWhat did you say there?\nThe the the word fo What did you say?\nCreo.\"\nCreo.\nCreo.\nYeah, that's the it's like it's spelled X R I O, but it's pronounced likeo.\nAnd that was the original word for Christ.\nThe original word for Christ is ho.\nYeah.\nOh, and I've had people like confirm this with me.\nAnd I I recently had a scholar on the show, a religious scholar who turned atheist.\nWeirdly enough, he started out Christian and turned atheist.\nAnd he was telling me he like I'd be surprised if the word creo was ever used before before Christ.\nAnd I literally pulled up the source of Uripides talking about using Christing drugs in like I think it was 200 BC.\nAnd the dude was like blown away.\nSo he didn't know that.\nHe didn't know it.\nAnd this dude's like a serious academic.\nSo this guy that you had on your podcast, what is his name again?\nThe Christ drug guy.\nAmen Hillman.\nAmen Hillman.\nYeah.\nAnd he So he's a legit scholar.\nHe's a legit scholar.\nPhD.\nAnd other legit scholars are unwilling to even entertain this.\nYes.\nI've talked to many of them on the phone, and a lot of them say uh they don't want to give him I won't name the people, but one of them said that they they just don't want to give him the platform or the credibility of being in the same room.\nOther people say that it would just take too much time for them to prep for it, and I just think it's a bull, I just think it's.\nLike I this is the only way to get to the truth is to hear like a credible person dismantle his argument.\nRight.\nSo like I have it.\nI just keep falling deeper and deeper into this rabbit hole of all this crazy ancient Greek.\nAnd like you know he's talking about ancient like vaccines that they were using like similar to what we're talking about the the he says that there's text that talks about cutting kids cutting children, soaking bandages in drug in in snake venoms and wrapping the cut with a snake venom so that that the young person would create antibodies because they have more robust immune systems because they're younger and they would use that the kid's bodily fluid as vaccines to snake bites.\nYeah.\nOh, they were making kids into vaccine factories.\nThey were turning kids into vaccine factories so that they could get snake venom cuz everyone was getting bitten by snakes back then.\nAnd then they would take drugs too, like they would I'm sure they would take psychotropic drugs that would and they would call them death inducing drugs where they would have snake venoms.\nThey would like take snake venom drugs that if you don't have an antidote for it, an antichrist for it, that you would die.\nSo you have to take this antidote so you don't die from the drug you just drank, right?\nThese antidotes.\nAnd like he connects this all to Jesus in this elaborate way where there there's Mark 14:53 where Jesus is caught in the Garden of Gethsemane with the naked boy, right?\nAnd then there's a scene of the the young boy running away naked, right?\nWhen the when the when the Roman SWAT team pulls up on him, and then the little kid runs away, and he goes, \"Oh, I'm not I'm not a I'm not a trafficker.\nI'm not a robber.\"\nWhatever the word lace means.\nmeans like pirate, trafficker, robber.\nAnd then they take him, and then he's on the cross the next day, and he's like screaming out like dying of thirst in between two traffickers and he's asking and there's this\n\n\nDude,\nNonus, who writes about this scene specifically in ancient Greek, and he talks about them giving, trying to give him the sponge, and he's denying the sponge, right? So the sponge, Nonus is writing about this, that the sponge is the antidote to the dip sauce, which is the antidote to the North African viper, but he's refusing to take the antidote. He's just dying because he took this death inducer at 4:00 a.m. in the park in the garden of Gethsemane. And now he's just going to let himself die in the cross.\nSo, like, yeah, there's that. I don't know. I don't know what to make of any of it. I don't know what to make of this stuff. I just, you know, I hear people saying that it's all [ __ ], but like [ __ ], is it interesting?\nWell, bizarre that they use the term Christ before Christ. Yeah, just bizarre.\nIt's been used. Yeah, you can look it up. It's used all throughout Homer, Euripides, all these other authors. Like, there's, like, again, getting back to the philology stuff. The philologists, they go back in time and they look at the context of all of the literature, not just, not just the biblical canon, which is like a narrow lane of ancient literature, right? But they're looking at the philosophy, the, the, the, um, legal texts, the medical texts, everything, and saying, \"Okay, let's take this word, look where it's used in all of these different texts throughout all kinds of professions, and see what the consensus is of what it meant during that time period.\" And what he's claiming is that the [ __ ] word Christ meant drugs back then.\nWhoa.\nYeah.\nWhoa. Pretty bananas. Well, it's so hard to know what all that stuff was about. It's so hard to know why these people wrote these things down. You know, when I had Wes Huff on, Yeah, one of the things he talked about is the book of Isaiah. When you see it in the Dead Sea Scrolls, and then a thousand years later, it's verbatim. A thousand, a thousand years after the Dead Sea Scroll, the version that they find of the book of Isaiah is word for word.\nReally?\nYeah. A thousand years. Like, what were they trying to document? Like, what were the original stories? 'Cause, like, human beings are not a good source of information, especially back then. It's just too hard to be accountable. Why would you be honest? People make grandiose claims. They exaggerate. We see it today. It's like humans today are the same as humans back then. We're flawed, right?\nSo, we know today that our versions of history are, are, are deeply biased. Our versions of world events, our versions of, I mean, if the United States government could write the story about the invasion of Iraq without investigative journalists, right? What would be the story?\nAnd this is part of the problems, like, we don't really know what they were trying to say. It was an oral history for who knows how long before they ever wrote down the Old Testament.\nYeah.\nAnd it got redacted and added to over time. And there's, like, all kinds of weird secret gospels, secret gospel of Mark that they claim that this dude, uh, Morton Smith, came up with, which was similar to Almond's theories, but that then, you know, people say, \"Oh, that's a forgery. It's a forgery.\" Secret gospel at the secret gospel of Mark's a forgery that he [ __ ] knew Greek really well, and he knew the culture really well, and all the cults, you know, and like,\ndude, like,\nyou know, even like the mysteries of, uh, of the hospitals in ancient Rome, like the, um, the temples of Eskeipius and doing all those rituals in the temples of Eskeipius using medicine and drugs simultaneously, and these, these venoms and all this stuff is, uh, it's interesting to learn, you know, and especially when you compare that stuff to the biblical stuff, you know, like how much has it been changed, how much has the meaning been changed? And, like, the people, most of the academics who study this stuff are, maybe not most of them, but a large major, a large percentage of them, I think that I've talked to, they're religious scholars, scholars of the Bible and Christianity, but they also subscribe to Christianity, you know, so I'm like, there is that, like, a, it's weird that there's kind of, like, a built-in bias into this stuff. You kind of want this stuff to mean something, right?\nYou know what I'm saying?\nYes. For sure. That was what was interesting about Algro, because John Marco Algro was an ordained minister who, once he became a theologian, a theologist, theologian, rather, once he studied theology, he started to have agnostic thoughts. And so he, when he was one of the deciphers of the Dead Sea Scrolls, when he was on the committee, he was agnostic at the time. Mhm.\nSo he had already decided, and through his study of all these different religions, that maybe he wouldn't subscribe to any of them and leave an open mind.\nSo he was the only person on the commission that was deciphering the Dead Sea Scrolls over a period of, like, 14 million, or 14 years, rather. He, he studied this stuff. He was the only one who was agnostic. And he, again, his claims are widely dismissed by many, many people.\nBut I think, yeah, this dude Almond thinks he's full of [ __ ]. Does he, what does he think?\nHe just, he, uh, he, he was, like, came up under this, under, like, some of the top classical scholars of, like, modern times. One of those dudes is Carl Ruck. He wrote The Road to Elusus. And this other guy is John Scar Bro, who's dead now. And for some reason, none of them, whenever I ask him about Algro, like, I don't [ __ ] know. They don't pay attention to it for some reason.\nWell, I think you would have to be a real scholar in biblical languages to even understand what the [ __ ] he's saying.\nYeah.\nAnd to be able to translate ancient Sumere, yeah, ancient Sumerian, like, according to Wes Huff, he's like, \"I tried. I couldn't even figure it out to do it.\"\nAlso, how does ancient Sumerian connect to Hebrew?\nRight.\nIs there any correlation between ancient Sumerian and ancient Hebrew? Do they share any roots? Is there any, are there any bridges that connect those two languages? I have no idea.\nI don't know either. But, you know, you're dealing with, if, if it really goes back that far. So if he's talking about this term from ancient Sumeare where they are calling it a drug, they're saying it's a mushroom, and this is from 5,000 years ago, 6,000 years ago, you know, you're predating the Bible by a long stretch. And how old was that? How, I mean, if, if they're right about Turkey, and Turkey was the original civilization. Like, what, when is that? Is that 12,000 years ago? What, what is the real date of Egypt? What is the real date of the original structures of Egypt? Do they know?\nMhm. I mean, we're told it's 2,500 BC for the Great Pyramid, but, boy, there's a lot of people that don't agree with that, including geologists. When you get guys like Robert Shock who say, like, this water erosion is thousands of years of rainfall. Last time you had heavy rainfall in the Nile Valley, you're looking at 9,000 years ago, right?\nSo, you have thousands of years of rainfall before 9,000 years ago that's going to create this kind of erosion.\nMhm.\nAnd so it's hard to know because everybody wants to be right, and they all, they all have this date that they've been talking about and writing books about and giving lectures about. They never want to revise that. They, they gatekeep that information till the day they never want to have an open mind and say, perhaps there's this, there is evidence, of course, that there was a sophisticated civilization there 2,500 BC, but maybe they were a part of a very old civilization. And this is the Zeppy thing that Zawi Hawas was totally ignorant of, and he thought it was just completely [ __ ]. And this is the King's List that goes back 30,000 years that they, they talk about, and the way Egyptologists that are conventional thinkers, they, they think that it's mythology. They think that's myth. But, you know, you get to about 2,500 BC, that's all real.\nWell, how the [ __ ] do you know, right? They don't.\nYou don't. And also, if, if there was an advanced civilization 11,800 years ago that was able to create Gobeclette, which we know now to be true, what else have we not found?\nRight. Was it a breakaway civilization? Did they escape the Earth and go to the moon?\nRight.\nRight. Like they're trying to do now. Or, you know, was it just that they had achieved a very high level of sophistication in technology that's very different from the path that we took?\nRight. Totally.\nThat's what I think. I think the path that they took involved immense stone structures, cosmology. They probably didn't have internal combustion engines. They probably had a completely different kind of technology that we wouldn't even think of because we went in this internal combustion engine, plastic, microchip, electricity. We went into that direction. Yeah. And they, but you could imagine primitive man evolving to create technology that's far different than the way we went.\nYeah. Do you think we might have cracked that somewhere, like, in some deep black programs that we could have that they wouldn't want to unleash that on society because it could, like, [ __ ] up the economic system or, like, collapse the world?\nI know Jesse Michaels believes that there's gravity technology that they were researching in the 1960s and that they had achieved some sort of breakthrough propulsion system that is probably a lot of what you see when you see these, uh, UAPs and these crafts that move in very strange ways. Yeah, that, that makes sense to me. That make, I mean, and again, the idea that they couldn't keep that secret. Shut the [ __ ] up. Of course they could, right? Of course they could.\nThere's this lady, Katherine Fitz, who is the, uh, she was the head of the department of HUD under George Bush, and they brought her in, uh, after, like, the mortgage crisis to, like, figure out how to, like, restabilize the economy and what the banks were doing and all this stuff. And she was looking at, uh, like, missing money, and, uh, she found that there was, like, when, when she, when she applied her knowledge of mathematics and, like, what's going on with, like, the, the federal budget and where all the money's going, she said the most reasonable explanation, you know how there's, like, $21 trillion missing from the DoD, the day before 9/11, Donald Rums found, like, there's, like, two, two and a half trillion dollars, whatever it was. Uh, now that's ballooned to, like, $21 trillion. And she thinks that, you know, pull up, let's pull up the spreadsheet, see where that money went. Oh, it's not on the receipt. I don't know where it went. She thinks it went to, like, black budget [ __ ], like, military, black military technology, like, anti-gravity. And she thinks that Mr. Global, whoever that is, the bankers, the central bankers, are literally using all of that money and funneling it into black projects to create a breakaway civilization in case there's, like, some sort of catastrophe on Earth or something happens.\nOh, God.\nAnd, like,\nwhere are they doing this?\nThey're doing this at [ __ ] Lockheed Martin. I have no idea. Underground or something, maybe. Yeah. Oh, yeah, that's another thing she says. She says there's a lot of money that's going into building all these underground, underground bases, continuity of government, tunnel systems, all this stuff. And I'm looking at this, I'm like, she legit worked under the Bush administration. She was, like, a financial genius, right? But she could be a cook.\nShe could be.\nYeah. That's the problem when people are super intelligent but also crazy.\nYeah.\nYou know, and also had a prominent position in government but also crazy.\nYeah. I guess there's a lot of really intelligent people that are super crazy. And does she physically, has she been to these places? Like, how does she know that they're real? Does she know, has she talked to someone that explained this breakaway civilization thing, or is it just theory?\nShe's friends with the dude who wrote the book that's titled Swastikas, Scopes, and Saucers.\nWhat?\nWhat's that book about? How the Nazis are controlling UFOs and and scops and controlling the world and, you know, playing the world like it's their [ __ ] docu-drama and and recreating reality and inventing all this crazy off-world stuff and how Roswell was, uh, Soviet Union crashing stuff here, and basically, it's all Nazi black budget stuff, I think, is, like, the main point that that guy\nDo they dismiss the idea that we're visited at all by something from somewhere else? I mean, who? What do you mean, who, who, like, these people that think that it's all Nazi stuff and Soviet Union stuff?\nI don't think that they're saying it's all that, but they're probably saying, I haven't read all his books, but I think he's saying, when he wrote that book, it was probably all Nazis, no aliens. But now, I'm sure his points, his, uh, views have evolved on it.\nThat's part of the problem, too. It's like, you know, when you see these reports, when whenever I see, like, a story that's in the New York Times where the Pentagon is admitting we have, you know, there's been off-world crafts and all these different things, and you get these David Grush guys that are testifying about that we've recovered crashed vehicles. It's like, how much of that is a scop?\nI think most of it.\nI think a lot of it. Yeah. I, I don't even know if it's, if they know it's a SCOP, but if I was the government and I was working on top secret propulsion systems, the first thing I would do is spread a bunch of fake rumors about UFOs.\nYes.\nThis is how we can't explain it. We don't know. We're being visited. They're super intelligent. We don't know where they're from. We don't know how they're doing this.\nY\nand then you have an explanation for why these people are seeing these things in the sky when it's really just your [ __ ] that you're flying around. Mh.\nBut yet, if you listen to Jock Valet and you read any of his books, he's got these stories that people were telling from the 1700s in the 1800s that mirror\n\n\nAlmost exactly the experiences that\npeople are having today.\nMhm.\nThat's where it gets weird because,\nokay, now you're predating any\npossibility of this being modern\ntechnology, you know, that is just\nhidden and tucked away. They couldn't\nhave done that in the 1700s. There were\nno way. They didn't even have airplanes\nyet. Right. Okay. Right.\nSo, if we admit that,\nthen we have to go, okay, well, what\nwhat's going on then? Are we is there\nsomething else here that's been here\nforever like some people think, or are\nwe looking at something that's visiting\nus and keeping an eye on us from\nsomewhere else?\nThat's where it's fun. That part, that's\nthe fun one.\nThe fun one is not that it's ours. The\nfun one is that we're being visited.\nYeah. Like, and are we being visited or\ndo they just live under the oceans,\nright?\nYou know, like have they been here\nforever? And like, you know, there's\nthis case, uh, Richard Dolan came on my\nshow recently and he was telling me, he\nwrote this new book about all the\nunderwater cases ever documented of\nunderwater UFOs, UFOs. And there's one\nfrom like the early 1700s where there\nwas this like ship sailing across the\nPacific and this giant\nglowing orb came out of the ocean and\nthese sailors all wrote about it. How\nthis massive like football\nstadium-sized glowing orb came up out of\nthe ocean and like flew away and you\nknow like if we've how much of the ocean\nhave we explored? Like how very small,\nvery small amount. We've explored the\nmoon, I think.\nAnd it would be the perfect base if you\nwanted to come here and observe human\nbeings without them being able to see\nwhat's going on. That's the best place\nto hide\nbecause no one's going there. They don't\nhave the capability of going there. You\nknow, we have submarines, but I mean, how\nwhat do the submarines see? I mean, if\nthe submarines see things, do they tell?\nYeah.\nLike if the submarine saw a UFO\nunderwater, would they have a press\nconference?\nRight. Exactly.\nWe know about the nuclear bases above\nground because those guys have come out\nand talked about it. But like\nall of the nuclear submarines that are\npatrolling the oceans at all times, like\nright off of our coast, off both coasts.\nLike if they're carrying multiple\nnuclear warheads, I'm sure they're\nseeing something or they're detecting\nsomething there.\nWell, there's this one video of\nsomething that was moving 500 knots\nunder the water, like this this thing\nthat like flew by their camera. They\ndon't\non the sub.\nYeah, it was I I forget where it was\nbeing recorded, but it was a video of\nsomething that was like a beam of light\nthat shot through the screen. Like you\ncould see it moving underwater at this\ninsane rate of speed with\nno ripples, no disruption of the water,\njust moving through the water.\nYeah.\nAnd then there's these trans medium\nvideos, these videos of these things\nflying. And they go into the water with\nno splash, no nothing\nand they don't lose any momentum.\nYeah. I think the best evidence that\nthose things have been here forever is\nprobably like ancient stories, biblical\nstories, like aliens and or like angels\nand demon stuff, like\nlike before the Yeah, Ezekiel too,\nright?\nEzekiel in the Bible. That that story is\nnuts. The wheel within a wheel. The way\nhe's describing, like, what are you\nseeing?\nRight.\nAnd imagine there's you've no context.\nYeah. Yeah,\nimagine seeing something that's\nfloating, some geometric pattern that's\nhovering in the sky above your head and\nemitting light and trying to explain\nthis and then also going back and trying\nto remember exactly what you saw because\nyou're probably freaking the [ __ ] out.\nYou really do have some sort of an\nencounter with some orb that's flying in\nthe sky. How do you even describe it?\nWhat context do you put it in? Do you\ndescribe it as an alien? Do you describe\nit as an angel? Do do you think it's\nGod? Like, what do you think it is?\nRight? Or is it drugs? Does drugs are\ndrugs playing a role in drugs play a\npart of it?\nWell, then there's like James Fox's\nAlien from the Varia film which smelled\nlike sulfur,\nright?\nAnd there's biblical accounts of demons\nsmelling like sulfur and having cloven\nfeet. So did that exactly describes that\nbeing in James' documentary,\nright?\nThe hospital smelled like sulfur for\nlike a week after they said\nand the guy who was handling it died of\na horrible infection. This is all all\ndocumented. The guy who picked up the\nalien, put it in his squad car, took it\nto a hospital. That hospital wouldn't\ndeal with it. Took it to another\nhospital that and then that guy dies of\na horrible bacterial infection that they\ncan't cure with antibiotics.\nYeah, it's [ __ ] nuts, dude.\n[ __ ] nuts. And then the all the\npeople, the eyewitnesses that were there\nthat saw the thing and when he brings\nthe police officer to the site of the\ncrash, the officer starts weeping\nuncontrollably,\nrecounting the story. Unless that guy's\nthe greatest actor of all time, like\nwhat is going on there?\nThere's a story where he walked up to\nthe guy's house and the guy like pulled\na gun on him. He's like, \"If you guys\ncome any closer, I'm shooting you.\"\nYeah.\nYeah. It's weird [ __ ] though.\nIt's weird, dude. And it's weird that\nlike everyone's trying to paint their\nown narrative. There's different groups\ncompeting on like how they want to paint\nthe UFO thing, right? You have like\ndifferent camps of people like in the\ngovernment or in media. I don't know\nwhat the difference is.\nAnd there's guys like you and I that are\nbasically useful idiots. Exactly. They\ncome on our podcast, talk a lot of [ __ ]\nand we go, I don't know.\nFigure it out, folks.\nYeah, we're feds. We're feds. We got the\nPalanteer Honey Trap over here.\nLike, what is that thing? That thing's\nall filled with Pegasus\nPalunteer, bro.\nThey're they're reading every single one\nof your little jot downs that you put on\nthat.\nYeah. Who knows? But if you did have\nsome sort of like infinitely superior\ntechnology and you've had it for a long\ntime, when do you if ever let the public\nknow? And how do you do that? What do if\nyou're the guy, right? Like how many I\ndon't know how many people know all the\nsecrets, right? Okay. If there is a\nhandful of dudes, how do you go about\nliving your life when you're that dude\nand when you know like [ __ ] that can\nchange\nthe face of humanity forever? How do you\ngo home to your wife and kids? Right. Is\nit like are you living in that show uh\nwhat's the show where they go up in the\nelevator and it wipes their mind?\nOh, severance.\nSeverance. Yeah. Yeah. Yeah. Is it like\nthat? Do they have real life severance?\nI don't think so. No, I think they just\nrely on these people being secret. And\nyou know, there's the thing about Bob\nLazar story. You know, Bob Lazar lost\nhis job because his wife was cheating on\nhim\nbecause his wife thought that, you know,\nhe he couldn't tell her what he was\ndoing. So when he was flying off to S4,\nhe would say, \"I got to go to work.\" And\nshe's like, \"At 11:00 at night on a\nFriday, get the [ __ ] out of here.\" So\nshe starts [ __ ] this other guy. And\nthey were listening to his phone calls.\nSo they had his his phone tapped. And\nbecause his wife was having an affair,\nhe was deemed to be at a risk of being\nemotionally unstable.\nSo they released him. And so then he's\nlike, \"This is bullshit.\" and he starts\ntelling people, \"Hey, man, we're working\non UFOs. They have a crashed UFO. I saw\nit.\" They they fly it every Wednesday or\nwhatever it was. Come, I'll show you.\nAnd so he brings people out to the test\nsite where they can observe from one of\nthe mountains\nand then he gets arrested\nand then he goes public so that he\ndoesn't get killed.\nThis is his justification of it all.\nYeah. I used to think Bob Lazar was full\nof [ __ ] but I've come around on it. I\ndon't think that anymore. After learning\nmore about all like the disinformation\nand all the all the time and money they\nput into just confusing people like the\nPaul Benowit story, you know,\nuh I I think it's he would be the\nperfect candidate candidate uh to\nrecruit just because of his background\nlike you know his first wife committed\nsuicide he ran a brothel\nhe was a nut\nhe was a nutcase dude perfect person\nhe's perfectly they they could deny him\nso easily like look at this dude's\nbackground you think we would hire this\ndude\nand also a legitimate genius\nright\nI mean the guy put a rocket engine on a\nHonda. Wow.\nIn like 1985.\nYeah.\nHe was a nut. He converted his Corvette\nto a hydrogen engine.\nYeah.\nIn like, you know, I think it was the\n'90s he did that. He had a\nhydrogen-powered Corvette that he\nengineered himself.\nSee if you can find Bob Lazar's\nhydrogen-powered Corvette. He was a nut.\nYeah.\nYou know, but he doesn't seem like a\nliar. And the podcast obviously it\nresonates with people because I think\nthe podcast I had with him on YouTube is\nthe most viewed podcast that we've ever\nhad including Donald Trump.\nReally?\nIs that true Jamie? No. Who's number\none?\nDonald Donnie beat him.\nWho's number one?\nFirst Elon.\nElon. First Elon's number one.\nOkay.\nUm that was the one when he smoked weed.\nYeah. Oh yeah. Oh yeah. Yeah.\nSmoking weed really took it over the\ntop.\nThat was a good That was a good moment.\nDo you smoke on all podcasts?\nNo.\nNo. Just certain ones. Just certain.\nYeah. So, this is Bob Lazar's\nhydrogen-powered Corvette.\nThat's amazing.\nWhat a [ __ ] kook.\nIt's beautiful. I love it.\nWhat a kook. I mean, who [ __ ] did\nthat? This guy created a\nhydrogen-powered Corvette. And that's an\nold ass Corvette, too. That's a shitty\none in the '90s.\nIf you're throwing [ __ ] at the wall\ntrying to figure out a new way to move\n[ __ ] planes that you might as well\nfind people like this to\nhomemade hydrogen-powered Corvette. Look\nat this. Play it. Go full screen.\nOh, this is way throwback.\nYeah, I don't hear anything. I just read\nit\ntank. When the tank's heated, it\nproduces hydrogen and the car burns it.\nSo, there's never much gaseous hydrogen\nin the system at any given time.\nWow.\nSo, these are the these are the fuel\nlines. No, what are these? Those are\nthese are the you can't see what they're\nlooking at for there. Actually,\nthe heater in the tank and also reads\nback the temperature of the tank.\nWhy is that important? Well, when you\napply heat to hydride, it releases\nhydrogen. So, as power is applied to\nhere, it heats the hydide, right?\nAnd then the gas comes out,\nthe big hoses on the end.\nThey have four hoses. Do they all mix\ninto one big hose or something?\nDidn't he like hang out with Ed Teller\nor talk to Edy?\nI don't know.\nAt a certain rate with a certain\ntemperature and a single tank, you can't\nget it out at the volume you need. So,\nso this guy was a legitimate genius and\na propulsion expert and that's why they\nbrought him in to say, \"How does this\nwork?\"\nAnd that story, he's told the same story\nfor, you know, whatever it is now, 50\nplus years or 40 years.\nYeah.\nWhat is What year was it?\nAnd there's a good reason, I think, uh,\n85. So, 40 years\nsomewhere around 85.\nThe biggest argument against him is the\nis the, uh, MIT stuff, right? That. But\nthere's something that I'm sure\nbut the MIT thing though, like look, if\nyou're working at Los Alamos Labs and\nyou're working on top secret stuff for\nthe government, it's not inconceivable\nthat you would be educated at MIT and\nthere wouldn't be a record of it.\nEspecially if you're working on\nsomething that's like really devious\n[ __ ]\nYeah.\nYeah. I'll tell you what he told me off\nthe air.\nYou will?\nYeah. Yeah. Yeah.\nGod, I can't [ __ ] wait.\nYeah. As soon as we're done, we'll wrap\nthis up. I'm kidding. But no, I wanted\nto like like the stuff and the stuff\nlike the the like the thing that is so\nastonishing to me is like all of the\nbrightest minds and unlimited money have\ngone to more and more ways to figure out\nhow to kill people. Like like the during\nOperation Paperclip during the time Bob\nLazar was at Los Alamos and and at uh S4\nif he was at S4 or whatever was going on\nthere like and and that dude John von\nNoman who was the mathematician who was\nuh he he was in he came up the equation\nto who and who by the way was like the\nmost brilliant mathematical mind of our\nof in American history came up with the\nthe equation of the perfect altitude to\ndetonate Fat Man and Little Boy to kill\nthe most people, which is like you're\nusing this [ __ ] intellect to do these\nkinds of things.\nAnd\nnow there's a $21 trillion black hole in\nthe DoD. Like,\nimagine what they could have what they\ncould have. They could have something\nthat's probably I mean\ngoing way out on a limb conjecture\nobviously I don't [ __ ] know but like\nmy my conspiracy mind wants to go to\nlike oh my god they have like another\nwhole military air force navy that is\ndisconnected from America that is\nprobably more powerful than every other\ncountry combined\nthat could just you know t take over the\nworld in an instant but can't they\nalready wipe each other out? I mean the\nthe whole world has nuclear weapons.\nThere's nuclear weapons in how many\ndifferent countries? Yeah, they all\nlaunched them simultaneously. There's no\nlife left on Earth.\nWhat what I'm saying with the 21\ntrillion, they could have some [ __ ]\nweapon that would render a nuke\ncompletely irrelevant, you know, if they\ndo have anti-gravity. And if they have\nfigured out some of this crazy\nparasychology stuff, the psionic stuff\nwith the UFOs and like the mind\ninterfacing, uh, you know, all this just\nkooky stuff that you want to eas you\nwant to dismiss, but 21 trillion, if\nthey were if they were spending\n$50 on Stargate\nand they they thought it was worth some\nsort of intelligence to spy on the\nRussians, like, how much money would\nthey keep throwing at something if there\nwas\n\n\nJust a shred threat of possibility that it could work. And if there was evidence that like this works 3% of the time and we spent a million dollars on it, let's spend a trillion dollars on it and see how much more advanced we can get and see how much more control and do world domination we can get. And one of the things Lazar said about the craft that he was the sport model, which is that thing on the desk, that's the copy of it.\n\nUm, one of the things that he said about it was that there were no controls when you sit inside the thing. There's no, there's no joystick. There's no steering wheel. So, you use your mind.\n\nYeah.\n\nThere was probably some I mean, that's probably what we're getting to anyway. We're kind of close to that with phones now. Yeah. Right. Like, how many times do you text where you don't even text, you just press the button and say, you know, text Danny, say this, and it just says it for you. Or, you know, how old is Barbara Stryand? And and it just it gives you an instant information. You're talking to it all the time.\n\nAnd what's next? Well, you think it does. And then as technology scales further and further more advanced, you're going to get to a point where you can move your car with your mind. And then when you have spacecraft, of course, it would be the same sort of technology. You would use technology to move the craft with your mind. You know, they already have these interfaces with uh fighter pilots where where you look is where the crosshair shows up. So instead of having to like move a crosshair with like a like Yeah. You know, like if you're playing a video game and you're moving the mouse, you're moving the crosshair to the side. Or if you're using a Xbox controller, you're moving that crosshair to where you want to hit, right? The crosshair goes where their eyes go. So you're wearing this thing that knows where you're looking. And they already have this kind of technology with virtual reality. They have this technology with uh these meta glasses that they're developing. So they can while you're while you have this helmet on. This helmet is not simply a thing that protects your head. It's an electronic interface with a guidance system and where your eyes look the crosshairs go.\n\nYo, did you see the LLM stuff trying to get soldiers to leave the battlefield in uh the Russia Ukraine war?\n\nNo. They're using LLM to and they're and the Russians are like hacking the Ukrainians phones with LLMs, reading everything on their phone, seeing how they communicate with their family and using LLM to send messages to their phones of like their family trying to get them to lay down their weapons and leave the war.\n\nWhoa.\n\nYeah.\n\nWhoa.\n\nYeah. Like where does that end up? Well, that's what gets real weird because if you get if AI starts controlling all the war systems and it just has a goal and it doesn't have any ethics or morals or any concern about life or death. It just has a it has a directive like I want you to accomplish this, take control of the resources and dumbass. Do this, do that, whatever it is. It just does it the most effective way possible which can be unbelievably brutal.\n\nYeah. And then like even [ __ ] like telepathy or like being able to communicate without words.\n\nWell, Elon says that's 100% the goal of Neuralink.\n\nAre you optimistic about that?\n\nI'm not optimistic or pessimistic. It's I think it's inevitable.\n\nYeah.\n\nI think we're we're looking at what we have now as normal because it's become normal to carry around a phone with you everywhere. It's become normal to have an Apple Watch on and get all your text messages on your your wrist. It's become normal. And I think it's it'll become normal to be interfaced with the great hive mind. I think we're all going to be connected with some new technology. The same way we're all connected with social media and email and FaceTime videos and all that [ __ ] that we are now, WhatsApp messages, we're all going to be connected with something that's far more technologically advanced and it'll become normal just like this is normal.\n\nI just hope like if it does get there, when it does get there, that we can overcome this sort of place that we've reached with social media where people are just like spatting out whatever comes to their to the front of their mind at any given moment or like just like rage impulse and and fighting where there's no there's no filter which I think has just created more and more division and miscommunication.\n\nOh yeah. Like if you're if if me and you are just talking and we're communicating our minds back and forth, right? I don't know how your mind works, but my mind is like a constant hornets nest of [ __ ] ideas just bouncing around everywhere. Yeah. Right. So, if you can read my mind, you're going to be so goddamn confused and there's probably going to be [ __ ] in there you don't I don't want you to know. And it's like I like to the writing process, right? Like when you write, you know about writing more than anyone. When you write something and you try to like distill an idea down to like the most profi precise form to communicate it accurately to the audience, right? Like you go through so many revisions and refi and you revise and you refine until you get it perfect so you can communicate that message to your audience. But if it's just if it's just a direct stream of consciousness unedited, I can't imagine that would be a good thing. You know, unless you're like some some meditative yogi that like has a really editorialized stream of consciousness, which I don't.\n\nWell, maybe instead of just having access to all your thoughts, maybe it's just simply what you're trying to communicate about your thoughts. Maybe it won't be as simple as we all have access to each other's minds. Maybe it'll just be much more you'll be able to purely transmit your feelings and your ideas without the context of a language.\n\nOr maybe we'll have to develop some sort of universal language. Yeah. Which would be, you know, the tab tower of Babel, you know, and I' I've made that connection. I made that connection last night, I think, about Christ, like Christ was of a virgin birth. Like what's more of a virgin birth than sentient super intelligence from AI?\n\nYeah. Yeah, if that becomes a being that is essentially a god and is given birth by a virgin mother. I mean, that's the story of Christ. It's just it's just confusing. It's just confusing if you translate it over and over over time. But if Christ is supposed to return, that would be a way something like a god would return. It would return through artificial intelligence. If it just emerged out of our creation and our insatiable desire to make new and better things.\n\nYeah. No, that that that makes a lot of sense. Like why else do we have this insane desire to have new and improved things because like isn't your phone good enough? Like I have a a Samsung Galaxy S25 Ultra and I have an iPhone 16. They're good. They're good enough. They don't You don't need to make a better one.\n\nHave you seen Westworld on HBO?\n\nUh-huh. Yeah.\n\nOne of my favorite.\n\nSeason one is [ __ ] amazing. It's the best.\n\nGot a little squirrely in season two.\n\nIt is. Season two and three. Yeah. Got a little squirly for sure. But like one of my favorite lines in that is when he's when um Ford is talking to Bernard and or not Bernard, one of the ladies, one of the robots, and he's like explaining the the human psyche and he's like all of the greatest achievements of humanity, the the Eiffel Tower, the statue of David, the Mona Lisa, all just elaborate an elaborate mating call. It's all peacock feathers. Ooh, it's all just this desire to procreate and to, you know, it's it's that really got me [ __ ] thinking and it's like, is that what drives human beings to do things and for to create new things and new art? I always thought it was sex, but I I think it might be that combined with the fear of death because we we want to live forever and we want we want to have a symbolic immortality. We want to leave something behind after we die. It might not just be sex. It might just be social recognition. Yeah. Status. Yeah. You know, you want to be adored as a genius.\n\nYeah. And there's also that painting that on the Systeine Chapel, the creation of Adam, which is also in that movie where it shows God creating Adam and all the angels and he's sitting inside of the perfect anatomical illustration of a human brain. If you look at it, can you find that, Jamie?\n\nYeah, pull up the creation of Adam and it's got like the prefrontal cortex, the brain stem, the visual cortex. It's all there. And he's creating Adam. And like the point he makes in the movie is like the divine gift does not come from a higher power, but from the human mind.\n\nThat's bananas.\n\nLet me see that other image that you just had of the two of them below it.\n\nNo, I'm sorry. Go back to that one and then go below it. The one that you just had.\n\num\n\nwith the brain\n\nwith the one where shot the brain. Yeah, the bottom right. Yeah, that's it. Yeah, look at that.\n\nThat's weird, man. It is weird, isn't it?\n\nIt's pretty close. And it's also that that is, you know, the eye of Horus. Um when you look at the side section, a cross-section of the um pineal gland, it looks exactly like that.\n\nThis weird symbology.\n\nWhat looks just like that? the um the eye of Horus from ancient Egyptian.\n\nUm\n\ngo to uh so that gland when you see it at the bottom go to the eye of Horus. Go uh pineal gland eye of Horus.\n\nTake out the cyine chapel.\n\nYeah, there it is. So that's what the eye of Horus looks like. It looks exactly like the pineal gland. It's the same shape.\n\nThere's a lot of weirdness, man, that ancient art. Like, what were they trying to say? Like, what were they trying to document?\n\nIt's funny. The people who like don't believe Jesus existed, they'll make the argument like, \"Imagine 2,000 years from now that uh people wanted to say that there was this mythical divine person and he existed because we know there's this divine trilogy called the Lord of the Rings and his name was Gandalf and he came from the center of the earth. But it's like no other no nothing else corroborates it.\n\nBut you know I don't know. I think Jesus was a real person.\n\nIt seems like it was a real person.\n\nYeah.\n\nThe question is like what really happened, right? And the whole coming back from the dead thing is like what was that all about? Right. Yeah. I don't think that's real.\n\nWell, it doesn't make any sense. But right neither does the birth of the universe from something smaller than the head of a pin. That doesn't make any sense either.\n\nYeah. But if you, you know, if this one unique moment in time that God did send us his son to try to like sort things out and we wind up killing him, he died for our sins, you know, like would that be any weirder than super massive black holes? Would that be any weirder than most of the stuff that we know is real?\n\nAnd how do you reconcile that with the simulation? You know, I don't know. I mean, it might be part of the whole weirdness of this whole thing is that we have mythology. Part of the weirdness of the simulation of the simulation might be that we have this fantastical mythology that you sort of have to suspend disbelief and accept.\n\nMhm.\n\nIt's part of this whole weirdness that we have where we're susceptible to ideological belief systems like cults, you know, like political ideologies. We're essentially just like cults. You know, when you're on the right and you're, you know, right with everything and you know, you're all MAGA or if you're on the left, you're blue no matter who, you're in a cult. You're in a cult. People get into cults. And why is that? Like, why is that a part of if we are in a simulation? Why are we so malleable? Is it because we recognize it and we're supposed to oppose it and we're supposed to fight the instinct that we all deeply have embedded in our system, but we also know is wrong. Like what is it about these systems? Like why is that in place? Is this simply a just an ancient relic of our tribal past where you had to follow the rules of the tribe in order to survive and so it was instilled in people in the psyche and that's how we developed or is there something more to it? Is it like part of the mechanism that allows us to resist which allows us to innovate which encourages us to push forward and ask more questions because we know there's a lot of [ __ ] Like the reason why people ask so many questions now in 2025 as opposed to 2019 is because of co because we went through so much [ __ ] and propaganda. We were so gaslit by the government, by the CDC, by everybody that now we question way more. So it's probably benefited us somewhat to go through that.\n\nYeah. When Mary was on here, did she tell you about Kevin McCirin?\n\nRefresh my memory.\n\nHe was the dude who worked for the human genome project. It's like a DNA wizard. He like he basically he was working for the human genome project trying to figure out different sort of medical treatments for cancers based on your genome. So like they could target a specific type of leukemia in you and they would take your DNA and they would like basically make designer drugs to to target that cancer and to kill that cancer. And during the pandemic, uh, somebody sent him four unopened vials of the Fiser vaccine and he analyzed them and ran them through all of his processing systems, whatever, whatever the [ __ ] he does, and he found out there was uh, DNA plasmid contamination in them, which were like promoters of this SB40 [ __ ]\n\nI did hear about that. Yeah, I talked to uh Brett Weinstein about that and he was explaining that when they first um were sequencing certain vaccines, they you know because with the vaccine you have to use living cells in order to create these antibodies initially.\n\nYeah.\n\nAnd when he's for traditional vaccines, right?\n\nRight. Yeah. And so when they started using these things, they were using kidney cells of these monkeys and they didn't understand that these\n\n\nMonkeys had this SV40 Simeon virus 40, right? And that this, when introduced into human cells, causes tumors. Yep. Causes cancer, like rampant cancer. You see the uptick of cancer, and everyone else, like, bury their head in the sand and pretend that it didn't happen. But people that took the vaccine are getting cancer at an astounding rate. Yeah. And this, and Kevin was telling me that he was doing a study. He pulled some tumors from some people that died somewhere in Europe. Um, and he was studying, sequencing the tumors of these people that died, um, with the vaccine. And he said that the SV40 was in the tumors. And some, I don't know, I don't remember the science. I'd have to go back and listen to it.\n\nBy the way, that episode got pulled off YouTube, really, off my channel. I got a strike for it.\n\nWhat did they say?\n\nMedical misinformation.\n\nWhat part of it's medical misinformation?\n\nThe whole thing. We talked about vaccines, and we talked about...\n\nWhat year was this?\n\nThis was like, uh, November of last year.\n\nWhoa.\n\nYeah. I wonder if you could put it up now because they seem to lighten up, didn't they? They changed their regulations recently.\n\nDid they?\n\nYeah, they changed their guidelines.\n\nThat's the problem with this [expletive] dude. I'm like, I'm so afraid to talk about [expletive] I want to talk about.\n\nI know. Isn't that [expletive] up?\n\nIt's like, it sucks, dude. It, it sucks because there's no way to know who's telling the truth unless you let people say crazy [expletive] and then have someone come on, refute it, and then have the two of them get together and debate it, right? You know, and then even then sometimes you don't know, like with this Flint Dibble, Graham Hancock thing.\n\nYeah.\n\nYou know, if it wasn't for Dan Richards, we wouldn't know that a lot of the things that Flint Dibble said were just absolutely not true, right?\n\nYouTube loosens rules guiding moderation of videos. Yeah. So, um, favor freedom of expression over the risk of harm in deciding what to take down. So specifically, scroll down to what they said, what the, the actual policy shift, which hasn't publicly disclosed.\n\nU... what does it say? Public statements.\n\nWhat is, they used language that I thought was, uh...\n\nThey don't make public statements. They broad brush it. They don't give you an exact reason. They just say, \"Oh, this falls into this category.\" Like, there's no jury at YouTube. They're just like, they find the most excusable reason to go back to where you were. Go back to where you were. Recognizing the definition of public interest is always evolving, we update our guidelines for these exceptions to reflect the new types of discussions we see on our platform today. Our goal remains the same: to protect free expression on YouTube while mitigating egregious harm. So, you know, they could still, but the thing is, like, they're controlled by their advertisers to a certain extent. And...\n\nI don't buy that [expletive] dude.\n\nWhat do you mean? They get funds from the advertisers.\n\nThey're Google, though. They [expletive] own advertising. Like, you're, you're going to tell me, like, some company is going to go to Google and say, \"Listen, bro, we're not going to advertise you with you unless you take that guy's video down.\"\n\nNo, I think pharmaceutical drug companies have influence. And I think if you're getting an enormous percentage of your advertising revenue from pharmaceutical drug companies, which Cali Means has said, the reason why they do that is not to promote their drugs, it's to stop criticism. And this is why they promote, this is why brought to you by Pfizer. Anderson Cooper brought to you by Pfizer. Why the, what that is for is to make sure that they never criticize Pfizer.\n\nSure. I understand that.\n\nAnd it works, right?\n\nFor, for cable TV. Yeah. But for, like, YouTube has a monopoly on advertising. Google does, at least. I could, I mean, I guess I could see it, but like, you know, they got [expletive] trillions of dollars.\n\nSo it says, YouTube's ad apocalypse and the gatekeeping of cultural content on digital platforms. This is how it all started. 2017 advertiser revolt on YouTube, popularly known as the ad apocalypse, introduced widespread and radical changes on the platform's policy related to moderation and content, their monetiz, monetizability, and the terms of the relationship between the creators and the platform. And these changes in turn have caused significant discontent within the creator community while also gradually transforming the predominant nature of the content on the platform. So they did do it. They did it by cutting the ads.\n\nYeah.\n\nYeah. It's, it's dirty business, man. And they're, they're doing it because they don't want people finding out certain things that are actually true. And that's what they did during the pandemic. And that's what the FBI tried to do when they, they were banning people like Jay Badacharia and prominent scientists and, like, legitimate academics. But then I, I'll have, like, UFO thing will happen to videos I do about UFOs. Like, the same thing will happen, not taken down, but you know how [expletive] will get, like, buried where you can't search for it.\n\nOh yeah.\n\nMe and Jesse were talking about this. This happened to Jesse, too, with, with Grush, where he was like, was like the number one video on Grush, and all of a sudden, you can't search it. Like stuff like that. I mean, the, the co, one was the first one I actually had taken down. Um, which was scary, and it, it makes me think about that. I hate the fact that I actually have to think about whether I'm going to get the axe. I know, based on the topic I'm discussing, like, where, like, I don't know if that leads, that doesn't lead to a good place as far as journalism goes, because journalism is supposed to be shining light on the dark places that people don't want them shined, and it's supposed to piss people off, especially when you consider that a lot of the things that you used to be taken down for are now confirmed, like the lab leak theory that used to get you kicked off of YouTube, saying masks don't work, that would get you kicked off of YouTube, like all these things that we now know to be true, that the, the vaccine does not stop infection, that would get you kicked off YouTube. All these things that we now know are 100% fact, and it's all orchestrated by financial interests.\n\nMhm.\n\nYeah. The, um, the SP40 stuff is, is wicked freaky, dude. It's wicked freaky, like, with the, with the cancer and how, you know, it goes all the way back to the, the, the early days in the '60s or the early '50s and '60s in New Orleans, how they were working, uh, trying to develop the polio vaccine with Alton Ashner at two university, and trying to weaponize some sort of a, there's a theory based on that book, Mary's Monkey, where they were growing the polio vaccines on the monkey kidneys and using this to also create bio-weapons to assassinate people like Castro. And that's apparently what, according to that book, what, uh, um, Lee Harvey Oswell was doing with that lady, Mary Sherman, and they were using that lac machine to try to, like, supercharge the SV40 to make it more deadly.\n\nOh my god.\n\nTo induce cancer with people.\n\nYeah. And then...\n\nOh god, that, like, the, the cutter event where Alton injected his two grandkids with the polio vaccine in front of the whole auditorium of students, and, uh, his granddaughter lived, was paralyzed, but his grandson died the next day, right after they did that. Jesus. And they were like, there's people pushing back, like, don't do this. We tested this on monkeys, and like, half of them are dead. Let's not push this out. I think it was the sulk vaccine, the sulk polio vaccine, and then they [expletive] did it anyways.\n\nYeah. Well, I think you got to be able to talk about this stuff, even if you get it wrong, and even if someone comes on, they say things that can be refuted.\n\nYeah. Refute it then. That's the whole point of all this. Yeah. If someone comes on and says something that's not correct. Oh, but it stays.\n\nNo, excuse me.\n\nBless you.\n\nThank you. If someone comes on and says something that's not correct, like, have someone on that refutes it. Figure it out. this. You have to be able to talk about stuff, and some of it's fun.\n\nYeah, it's fun.\n\nIt's all super fun.\n\nIt is, right?\n\nYeah.\n\nHow'd you get started?\n\nWell, I didn't, I obviously didn't always do podcasts, but I, I was originally, I always wanted to make movies when I was... used to call it concrete. Why was it called?\n\nIt was called concrete. So, okay, I'll tell you. It was, uh, first of all, I always wanted to make movies when I was a little kid. I was telling Jamie the story earlier. I tried to go to full, I was going to go to Full Sail, where Jamie went in Florida, in Orlando, but it was just, I didn't have the money to do it, and I couldn't get into UCF 'cause my, my grades were [expletive] in high school. So, luckily, I got the opportunity to work on this movie called Dolphin Tail. It was a, was a movie about a dolphin who got its tail stuck in a crab trap, and they, and Morgan Freeman came in and builded a prosthetic tail, and, uh, and it was swimming around in the aquarium, and Carrie Kic Jr. and Morgan Freeman were in it, and it was like a big, you know, uh, Warner Brothers movie. And I realized working as a camera production assistant on that movie, that was my film school, but I realized I did not want anything to do with making movies because it was the closest thing I ever experienced to work in construction. It was like I was in charge of swapping the ca, the camera lenses, the camera batteries, taking the SD cards back to the media truck, getting everybody breakfast and coffee. And these dudes, these camera department dudes, a lot of them are really cool. Like the dude Pete Sukarini, who was the underwater cinematographer who filmed all the Pirates of the Caribbean movies. He was [expletive] awesome. But a lot of the other guys were, like, really unhappy, like, deeply unhappy because they never saw their families. They were always on the road, fac, like, third, fourth wives, facetiming their kids, and it was like, you know, they were like, caries with dental plans. They made great money, but they were, they were [expletive] deeply unhappy. So, like, I, I realized I didn't want to make movies anymore. So, I started an advertising company and, uh, making commercials, and I started doing, like, spec ads and, like, winning a bunch of contests to make commercials. I won really, uh, one big contest for Land Rover USA, where we made, like, a, a free ad, and they paid us to make a bunch of other ads for them. And then that's where concrete came in. So, I was, it was called something else, and I got sued by some advertising company in, uh, California saying, \"Hey, [expletive], you can't use this name anymore. Change your name.\" So, my friend who owns a concrete construction company said, \"Bro, there's this, uh, really cool website domain for sale with concrete with a K.\" He's like, \"It's like a couple thousand bucks. You want, you should buy it.\" I was going to buy it. I'm like, \"Sure, [expletive], yeah. Let's do it.\" So, I called my company Concrete Stupid. And then, um...\n\nAnd how'd you start a podcast?\n\nSo, so after the advertising stuff, I started... I, I met a bunch of people. I met Hulk Hogan in the process of the whole advertising thing because me and Hulk live, like, five minutes from each other, and which is, like, five minutes from the Church of Scientology, which is great, and we started, I started making a bunch of commercials with him because he would always have companies that would hit him up and say, \"Yo, let's partner on this new product,\" and, uh, one of them was a hosting company called Hostamania. They wanted to make Hulk the face of the company. And we created this whole [expletive] thing where we, it was like right when Miley Cyrus dropped the wrecking ball video, and we put Hulk on a wrecking ball. We're like, \"Yo, Hulk, we want to put you on a wrecking ball and have you freaking dropkick Vanam, who's like the GoDaddy guy, right?\" And he's like, \"Fuck yeah, brother. Let's do it. This is it.\" It was actually, it was poor execution, but it was funny. And, uh, he's like, \"Brother, there's only one thing missing from this commercial idea.\" I'm like, \"What?\" He's like, \"I need to be in my birthday suit.\" I was like, \"What?\" So, we did that, and, um, then I started working on a bunch of, like, show. This was like the boom of reality shows when, like, Duck Dynasty and Pawn Stars were all taking off. So, I was like, I could probably [expletive] make a reality show. So, I hit up a bunch of my friends, and we started, like, uh, touring around, trying to find people to come up with, like, TV show ideas and concepts. And I got a couple people to invest in a couple TV show ideas and pilots that I spent, like, six years working on. And it was this long process of shooting, editing, taking notes, uh, from production companies that you know, you have to, you know, but you have to, like, work with production companies who already have relationships with networks.\n\nMhm. And they were like constantly giving us notes, like, \"Okay, change this for A&E, change this for Spike TV, and we got to make sure it fits each network because we, we're pitching these network, these show to all these networks.\" I was like, \"Okay, great.\" So, it was just this roller coaster of emotions of, like, \"Oh my god, we're going to get, we're going to sell a TV show. We're going to do a TV show.\" And then finally, we got one of those shows to a greenlight meeting at Spike TV or A&E. And like, I was like, \"This is it. We're going to do it,\" and the CEO of ICOM killed it because it did not fit their roster of existing advertisers. And I was just like so frustrated and fed up with it. I was like, \"Fuck this. I'm taking all this stuff that I've been working on, and I'm going to repackage them and put them on YouTube.\" And I did. And the first one that really took off, got millions of views in, like, 2015, was called Deckands. And it was the story of these alcoholic dudes, these drunks that were hanging out in front of 7-Eleven in this little sleepy town called Madira Beach, where I'm from. So, me and my buddy Luke went up, and we started filming these guys and asking them questions, like, \"Yo, what the...\n\n\n\"Do you guys do here every day?\" And they're like, \"We're [__] fisherman, bro. Come see how we live.\" And one of these dudes took us back to his boat he lived on. He had this broken down boat in this old, uh, dusty marina where it was the boat didn't work, but he had, he lived in this boat and it had amplifiers stacked to the ceiling. He had a stack of porno DVDs like 6 feet tall, laser light machines, fog machines, and he wore these fairy wings and like an armor helmet. And he would jam out to like Rob Zombie on his guitar while playing the music videos on this big, big projection screen in his boat. And we're like, \"This is [__] the Twilight Zone, dude.\" And then they started telling us more and more about like what they do. This is it. Yeah. This is the first episode. The gates of hell. This is Shane Lee.\nRIP.\nUm, so we're like, we're asking these guys about like, what do you like, you're fishermen, but like, explain to me how does this thing, how does this work? And they were all pissed off about, oh, we're getting screwed by the boat owners and these IFQs and we don't make any money. And you know, we're like, dude, there might be a story here. So we started interviewing more people. And we give, eventually interviewed the people who own the boats and own the fish houses. So like, Madiraa Beach is the John's Pass, Florida is the grouper capital of the world. There's more grouper caught there than anywhere in the world. And the way it works is before 2007, there was a quota system where it was like for red snapper, it was like 3 million pounds per year are allowed to be caught in this area, right? So it was like derby fishing. So all the boats would go out and they would catch as much fish as they possibly could and they would wait at the when they get back from their trip and then they would, you know, quantify that or, or you know, tell the federal government this is where we're at. And sometimes they would reach that 3 million pound limit in like October. So what do they have to do for the rest of the year? They stop fishing. They can't do anything. So in 2007, the federal government made a monopoly where they gave boat owners an aotment of fishing quota per year. So some guys got a £100,000, some guy's got 200,000, which is if it's red snapper, that's a dollar a pound. So that's like the best retirement plan known to man. The federal government is handing you 200,000 pounds of red snapper quota per year. And then what happened was eventually the boat owners sold off their quota and now it's become so discombobulated where now like you can just buy this fishing quota and trade it like stock. You don't have to own a boat. You don't have to be a fisherman. You can just be some dude sitting in Manhattan in a high-rise and buying and selling fishing quota. You're not. And there's, there are like fishing communities in America like in the Northeast where it doesn't work like that where you have to have your hand on the throttle. You have to take care of your people and it's a lifestyle and it's like a, a way to, it's a culture. And where in Madiraa Beach, at least when I was there filming, it was they were all just like carnese carney ride operators, you know, and these dudes were and the the lowest level of this of this, uh, fishing industry are those deck hands, those dudes like Shane Lee, and they're [__] drug addicts. They're a lot of them are on hooked on heroin. What that, what happens is they get home from fishing from 10, 10 days of fishing offshore and they get like four or $5,000 and they blow it all on prostitutes and coke and hookers and heroin and they just, they're kids, dude. They're like kids. They're like kids with money.\nAnd, uh, by the end, by the time they run out, they have to go fishing again. So they're going to all the fish houses saying, \"Bro, let me go. Let me go.\" So they go offshore again and they seahhab where they rehab at sea for 10 days cuz they have no more drugs.\nWow.\nAnd they come back and then rinse and repeat. And one of the one of the people, uh, that we interviewed, there was three main characters in that in that series. There was Shane Lee, there was space, and there was Hollywood Kim. And Hollywood Kim was the last episode, which was sometimes when I think I have problems in my life, I remember her story and realize I don't really know what [__] problems are. She, uh, was from Alabama and when she was 17 years old, she gave birth to her father's son.\nOh god.\nAnd when she was 6 years old, she would wake up every morning and ride her bike to the beach to try to escape her dad.\nAnd no one would believe her.\nJesus Christ.\nShe tried telling people and no one would believe her because her dad was a cop.\nOh god.\nSo she eventually gave birth to her son and escaped to Florida and became a deckhand working fishing and, uh, working on these boats, dude. And she was just, I met her and she would wake up every morning and just start slamming vodka and looking for drugs and, uh, dude, it was just the Twilight Zone in my own backyard.\nWow.\nIt was nuts. And that that led to like podcasts, like, so after that, then we're just like, let's start doing podcasts in between these documentaries, you know, more content, and then the podcast started to get more views in the documentaries and here we are.\nWell, I'm glad it happened. You got a great show, man.\nThanks, bro. I appreciate it.\nI appreciate you coming on here, man. It was a lot of fun.\nThank you.\nLet's do it again for sure.\nHell yeah, bro.\nUh, The Danny Jones Podcast, it is on YouTube.\nAre you on Spotify as well?\nSpotify. It's just Danny Jones on YouTube and, uh, same with Instagram.\nIt's an awesome show. Lots of fun stuff on there. All right.\nThanks, brother.\nThank you. Bye, everybody.\n[Music]\n[Applause]\n[Music]\n",
  "metadata": {
    "summary": "In this episode of the Joe Rogan Experience, Joe Rogan and Danny Jones delve into a variety of intriguing subjects. They explore theories about the pyramids, including the possibility of hidden structures and advanced technologies. The conversation then shifts to the moon landing, with discussions on potential fakery and the influence of Stanley Kubrick. The hosts also touch on the impact of social media on mental health and the potential of new technologies. They also discuss the use of psychedelics, the nature of consciousness, and the role of ancient knowledge and mythology. The conversation also touches on the Epstein case and the role of propaganda.",
    "topClaims": [
      {
        "text": "If you think the moon landing was fake, you're a [ __ ].",
        "rating": 8.5,
        "chunkId": "ck-89IEFOiW-Z0-16"
      },
      {
        "text": "I don't think we went to the moon.",
        "rating": 7.8,
        "chunkId": "ck-89IEFOiW-Z0-20"
      },
      {
        "text": "When an ideology forms, people step in line and follow that ideology verbatim to the line.",
        "rating": 8,
        "chunkId": "ck-89IEFOiW-Z0-41"
      },
      {
        "text": "I think a large percentage of the mental illness that we have in this country is greatly accentuated by social media.",
        "rating": 9,
        "chunkId": "ck-89IEFOiW-Z0-61"
      },
      {
        "text": "I don't think the innovation of all this new technology and now that it's like exponentially taking off with AI is going to lead us to a good place.",
        "rating": 7.5,
        "chunkId": "ck-89IEFOiW-Z0-70"
      }
    ],
    "topQuotes": [
      {
        "text": "If you think the moon landing was fake, you're a [ __ ].",
        "chunkId": "ck-89IEFOiW-Z0-16",
        "chunkNum": 16,
        "relevance": 8.5,
        "interesting": 8.2
      },
      {
        "text": "I don't think we went to the moon.",
        "chunkId": "ck-89IEFOiW-Z0-20",
        "chunkNum": 20,
        "relevance": 7.9,
        "interesting": 7.8
      },
      {
        "text": "I think a large percentage of the mental illness that we have in this country is greatly accentuated by social media.",
        "chunkId": "ck-89IEFOiW-Z0-61",
        "chunkNum": 61,
        "relevance": 8.1,
        "interesting": 8
      },
      {
        "text": "I don't think the innovation of all this new technology and now that it's like exponentially taking off with AI is going to lead us to a good place.",
        "chunkId": "ck-89IEFOiW-Z0-70",
        "chunkNum": 70,
        "relevance": 7.6,
        "interesting": 7.5
      },
      {
        "text": "We're essentially just like cults.",
        "chunkId": "ck-89IEFOiW-Z0-134",
        "chunkNum": 134,
        "relevance": 8.1,
        "interesting": 8
      }
    ],
    "topTopics": [
      {
        "name": "moon landing",
        "count": 12,
        "description": "Theories and discussions about the moon landing."
      },
      {
        "name": "social media",
        "count": 10,
        "description": "The impact of social media on mental health."
      },
      {
        "name": "ancient pyramids",
        "count": 8,
        "description": "Theories and discussions about the pyramids."
      },
      {
        "name": "psychedelics",
        "count": 7,
        "description": "The use and effects of psychedelics."
      },
      {
        "name": "jeffrey epstein",
        "count": 6,
        "description": "Theories and discussions about the Epstein case."
      }
    ],
    "videoInfo": {
      "id": "89IEFOiW-Z0",
      "etag": "4wW6vnvFvgFPK0IUehxUdnyeBGw",
      "kind": "youtube#video",
      "snippet": {
        "tags": [
          "Joe Rogan Experience",
          "JRE",
          "Joe",
          "Rogan",
          "podcast",
          "MMA",
          "comedy",
          "stand",
          "up",
          "funny",
          "Freak",
          "Party"
        ],
        "title": "Joe Rogan Experience #2349 - Danny Jones",
        "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
        "localized": {
          "title": "Joe Rogan Experience #2349 - Danny Jones",
          "description": "Danny Jones is the host of “The Danny Jones Podcast,” a program exploring the fringes of culture and the boundaries of free thought.\n@dannyjones \n\n50% off your first box at https://www.thefarmersdog.com/rogan!\n\nThe ultimate wireless hack. Make the switch at https://visible.com/rogan"
        },
        "categoryId": "22",
        "thumbnails": {
          "high": {
            "url": "https://i.ytimg.com/vi/89IEFOiW-Z0/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/89IEFOiW-Z0/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/89IEFOiW-Z0/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "default": {
            "url": "https://i.ytimg.com/vi/89IEFOiW-Z0/default.jpg",
            "width": 120,
            "height": 90
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/89IEFOiW-Z0/sddefault.jpg",
            "width": 640,
            "height": 480
          }
        },
        "description": "Danny Jones is the host of “The Danny Jones Podcast,” a program exploring the fringes of culture and the boundaries of free thought.\n@dannyjones \n\n50% off your first box at https://www.thefarmersdog.com/rogan!\n\nThe ultimate wireless hack. Make the switch at https://visible.com/rogan",
        "publishedAt": "2025-07-15T17:00:09Z",
        "channelTitle": "PowerfulJRE",
        "defaultLanguage": "en",
        "defaultAudioLanguage": "en-US",
        "liveBroadcastContent": "none"
      },
      "statistics": {
        "likeCount": "3198",
        "viewCount": "55879",
        "commentCount": "960",
        "favoriteCount": "0"
      },
      "contentDetails": {
        "caption": "false",
        "duration": "PT3H9M23S",
        "dimension": "2d",
        "definition": "hd",
        "projection": "rectangular",
        "contentRating": {},
        "licensedContent": true
      }
    },
    "checkCount": 27,
    "nodeCounts": [
      {
        "node": "video",
        "count": 5
      },
      {
        "node": "bob-lazar",
        "count": 5
      },
      {
        "node": "christopher-dunn",
        "count": 4
      },
      {
        "node": "mk-ultra",
        "count": 4
      },
      {
        "node": "jamie",
        "count": 4
      },
      {
        "node": "podcasts",
        "count": 4
      },
      {
        "node": "youtube-channel",
        "count": 3
      },
      {
        "node": "chris-dunn",
        "count": 3
      },
      {
        "node": "nazi-scientists",
        "count": 3
      },
      {
        "node": "operation-paperclip",
        "count": 3
      },
      {
        "node": "michael-collins",
        "count": 3
      },
      {
        "node": "tripping",
        "count": 3
      },
      {
        "node": "perverts",
        "count": 3
      },
      {
        "node": "ipad",
        "count": 3
      },
      {
        "node": "simulation",
        "count": 3
      },
      {
        "node": "academic",
        "count": 3
      },
      {
        "node": "galen",
        "count": 3
      },
      {
        "node": "drugs",
        "count": 3
      },
      {
        "node": "marijuana",
        "count": 3
      },
      {
        "node": "breakaway-civilization",
        "count": 3
      },
      {
        "node": "pyramid-structures",
        "count": 2
      },
      {
        "node": "satellite-images",
        "count": 2
      },
      {
        "node": "subterranean-chamber",
        "count": 2
      },
      {
        "node": "zawi-has",
        "count": 2
      },
      {
        "node": "symmetry",
        "count": 2
      },
      {
        "node": "library-of-alexandria",
        "count": 2
      },
      {
        "node": "pyramids",
        "count": 2
      },
      {
        "node": "red-pyramid",
        "count": 2
      },
      {
        "node": "agriculture",
        "count": 2
      },
      {
        "node": "fritz-haber",
        "count": 2
      },
      {
        "node": "nobel-prize",
        "count": 2
      },
      {
        "node": "cyclon-b",
        "count": 2
      },
      {
        "node": "easter-eggs",
        "count": 2
      },
      {
        "node": "apollo-shirt",
        "count": 2
      },
      {
        "node": "documentary",
        "count": 2
      },
      {
        "node": "cubrick",
        "count": 2
      },
      {
        "node": "congress",
        "count": 2
      },
      {
        "node": "hamilton-morris",
        "count": 2
      },
      {
        "node": "mushrooms",
        "count": 2
      },
      {
        "node": "biological-men",
        "count": 2
      },
      {
        "node": "cutting-tits",
        "count": 2
      },
      {
        "node": "testosterone",
        "count": 2
      },
      {
        "node": "trans-people",
        "count": 2
      },
      {
        "node": "anorexia",
        "count": 2
      },
      {
        "node": "cult",
        "count": 2
      },
      {
        "node": "maga",
        "count": 2
      },
      {
        "node": "indoctrination",
        "count": 2
      },
      {
        "node": "comedy",
        "count": 2
      },
      {
        "node": "diddy-thing",
        "count": 2
      },
      {
        "node": "kurt-mezer",
        "count": 2
      },
      {
        "node": "comey-s-daughter",
        "count": 2
      },
      {
        "node": "donald-trump",
        "count": 2
      },
      {
        "node": "social-media",
        "count": 2
      },
      {
        "node": "circadian-rhythm",
        "count": 2
      },
      {
        "node": "chat-gpt-users",
        "count": 2
      },
      {
        "node": "parapsychology",
        "count": 2
      },
      {
        "node": "randall-carlson",
        "count": 2
      },
      {
        "node": "water-erosion",
        "count": 2
      },
      {
        "node": "graham-hancock",
        "count": 2
      },
      {
        "node": "psychedelics",
        "count": 2
      },
      {
        "node": "geometric-pattern",
        "count": 2
      },
      {
        "node": "elusinian-mysteries",
        "count": 2
      },
      {
        "node": "skype-exorcist",
        "count": 2
      },
      {
        "node": "xrio",
        "count": 2
      },
      {
        "node": "snake-venom",
        "count": 2
      },
      {
        "node": "vaccine-factories",
        "count": 2
      },
      {
        "node": "propulsion-system",
        "count": 2
      },
      {
        "node": "black-budget",
        "count": 2
      },
      {
        "node": "aliens",
        "count": 2
      },
      {
        "node": "demons",
        "count": 2
      },
      {
        "node": "ufos",
        "count": 2
      },
      {
        "node": "corvette",
        "count": 2
      },
      {
        "node": "eye-of-horus",
        "count": 2
      },
      {
        "node": "pineal-gland",
        "count": 2
      },
      {
        "node": "refute",
        "count": 2
      },
      {
        "node": "concrete",
        "count": 2
      },
      {
        "node": "advertising-company",
        "count": 2
      },
      {
        "node": "madira-beach",
        "count": 2
      },
      {
        "node": "joe-rogan-podcast",
        "count": 1
      },
      {
        "node": "joe-rogan-experience",
        "count": 1
      },
      {
        "node": "mary-bowden",
        "count": 1
      },
      {
        "node": "ground-penetration",
        "count": 1
      },
      {
        "node": "lidar-technology",
        "count": 1
      },
      {
        "node": "something-tomography",
        "count": 1
      },
      {
        "node": "deep-dive",
        "count": 1
      },
      {
        "node": "giza",
        "count": 1
      },
      {
        "node": "convincing",
        "count": 1
      },
      {
        "node": "artist-rendition",
        "count": 1
      },
      {
        "node": "coils-spirals",
        "count": 1
      },
      {
        "node": "columns-coils",
        "count": 1
      },
      {
        "node": "energy-coil",
        "count": 1
      },
      {
        "node": "electron-harvester",
        "count": 1
      },
      {
        "node": "tesla-connection",
        "count": 1
      },
      {
        "node": "hammer",
        "count": 1
      },
      {
        "node": "giza-plateau",
        "count": 1
      },
      {
        "node": "vibration",
        "count": 1
      },
      {
        "node": "seismic-waves",
        "count": 1
      },
      {
        "node": "tomographic-images",
        "count": 1
      },
      {
        "node": "unseen-structures",
        "count": 1
      },
      {
        "node": "underground-temple",
        "count": 1
      },
      {
        "node": "gatekeepers",
        "count": 1
      },
      {
        "node": "underground-structures",
        "count": 1
      },
      {
        "node": "2500-bc-people",
        "count": 1
      },
      {
        "node": "pyramids-mystery",
        "count": 1
      },
      {
        "node": "granite-vases",
        "count": 1
      },
      {
        "node": "human-hair-deviation",
        "count": 1
      },
      {
        "node": "light-scanners",
        "count": 1
      },
      {
        "node": "cnc-machine",
        "count": 1
      },
      {
        "node": "vase-handles",
        "count": 1
      },
      {
        "node": "ancient-accuracy",
        "count": 1
      },
      {
        "node": "sculptures",
        "count": 1
      },
      {
        "node": "jeffrey-drum",
        "count": 1
      },
      {
        "node": "the-land-of-chem",
        "count": 1
      },
      {
        "node": "chemical-manufacturing",
        "count": 1
      },
      {
        "node": "chemical-reaction",
        "count": 1
      },
      {
        "node": "fertilizer",
        "count": 1
      },
      {
        "node": "ravines",
        "count": 1
      },
      {
        "node": "chemical-bowls",
        "count": 1
      },
      {
        "node": "limestone",
        "count": 1
      },
      {
        "node": "ammonia",
        "count": 1
      },
      {
        "node": "nitrogen-extraction",
        "count": 1
      },
      {
        "node": "cyclon-gas",
        "count": 1
      },
      {
        "node": "nazi-exile",
        "count": 1
      },
      {
        "node": "wife-suicide",
        "count": 1
      },
      {
        "node": "the-holocaust",
        "count": 1
      },
      {
        "node": "nazi-germany",
        "count": 1
      },
      {
        "node": "warner-von-braun",
        "count": 1
      },
      {
        "node": "simon-whisinthal-center",
        "count": 1
      },
      {
        "node": "the-occult",
        "count": 1
      },
      {
        "node": "annie-jacobson",
        "count": 1
      },
      {
        "node": "interdimensional-aliens",
        "count": 1
      },
      {
        "node": "factory",
        "count": 1
      },
      {
        "node": "nasa-head",
        "count": 1
      },
      {
        "node": "room-237",
        "count": 1
      },
      {
        "node": "nasa-shirt",
        "count": 1
      },
      {
        "node": "237",
        "count": 1
      },
      {
        "node": "psychological-trauma",
        "count": 1
      },
      {
        "node": "contracts-secrecy",
        "count": 1
      },
      {
        "node": "ball-carpet-scene",
        "count": 1
      },
      {
        "node": "danny-ball",
        "count": 1
      },
      {
        "node": "continuity-errors",
        "count": 1
      },
      {
        "node": "science-fiction-movie",
        "count": 1
      },
      {
        "node": "moon-landings",
        "count": 1
      },
      {
        "node": "2001",
        "count": 1
      },
      {
        "node": "faking",
        "count": 1
      },
      {
        "node": "secrecy",
        "count": 1
      },
      {
        "node": "military-guys",
        "count": 1
      },
      {
        "node": "top-secret-clearance",
        "count": 1
      },
      {
        "node": "can-t-keep-secrets",
        "count": 1
      },
      {
        "node": "backup-plan",
        "count": 1
      },
      {
        "node": "video-footage",
        "count": 1
      },
      {
        "node": "training-footage",
        "count": 1
      },
      {
        "node": "gemini",
        "count": 1
      },
      {
        "node": "spacewalk",
        "count": 1
      },
      {
        "node": "capsule",
        "count": 1
      },
      {
        "node": "lunar-module",
        "count": 1
      },
      {
        "node": "orbiter",
        "count": 1
      },
      {
        "node": "apollo-mission",
        "count": 1
      },
      {
        "node": "exterior",
        "count": 1
      },
      {
        "node": "fake",
        "count": 1
      },
      {
        "node": "plumes-of-fire",
        "count": 1
      },
      {
        "node": "car-batteries",
        "count": 1
      },
      {
        "node": "bart-sabrell",
        "count": 1
      },
      {
        "node": "earth-s-gravity",
        "count": 1
      },
      {
        "node": "pulled-by-strings",
        "count": 1
      },
      {
        "node": "remote-camera",
        "count": 1
      },
      {
        "node": "the-farmer-s-dog",
        "count": 1
      },
      {
        "node": "kibble",
        "count": 1
      },
      {
        "node": "real-meat-and-vegetables",
        "count": 1
      },
      {
        "node": "vet-nutritionists",
        "count": 1
      },
      {
        "node": "thefarmersdog-com-rogan",
        "count": 1
      },
      {
        "node": "vietnam-war",
        "count": 1
      },
      {
        "node": "anniversary-speech",
        "count": 1
      },
      {
        "node": "press-conference",
        "count": 1
      },
      {
        "node": "radiation-belts",
        "count": 1
      },
      {
        "node": "jolly-west-photo",
        "count": 1
      },
      {
        "node": "nuclear-war",
        "count": 1
      },
      {
        "node": "interceptor-missiles",
        "count": 1
      },
      {
        "node": "icbm-nukes",
        "count": 1
      },
      {
        "node": "north-korea",
        "count": 1
      },
      {
        "node": "putin",
        "count": 1
      },
      {
        "node": "kim-jong-un",
        "count": 1
      },
      {
        "node": "retaliatory-strike",
        "count": 1
      },
      {
        "node": "missile-launch",
        "count": 1
      },
      {
        "node": "zoom",
        "count": 1
      },
      {
        "node": "party-pooper",
        "count": 1
      },
      {
        "node": "combing-hair",
        "count": 1
      },
      {
        "node": "comb-over",
        "count": 1
      },
      {
        "node": "manson-stuff",
        "count": 1
      },
      {
        "node": "lsd",
        "count": 1
      },
      {
        "node": "hoffman",
        "count": 1
      },
      {
        "node": "sleep-deprivation",
        "count": 1
      },
      {
        "node": "psychological-techniques",
        "count": 1
      },
      {
        "node": "information-extraction",
        "count": 1
      },
      {
        "node": "training-exercises",
        "count": 1
      },
      {
        "node": "royal-marines",
        "count": 1
      },
      {
        "node": "dosing",
        "count": 1
      },
      {
        "node": "missile",
        "count": 1
      },
      {
        "node": "exercises",
        "count": 1
      },
      {
        "node": "indecision",
        "count": 1
      },
      {
        "node": "freaked",
        "count": 1
      },
      {
        "node": "radio-communication",
        "count": 1
      },
      {
        "node": "darpa-grant",
        "count": 1
      },
      {
        "node": "university-of-north-carolina",
        "count": 1
      },
      {
        "node": "lsd-psychedelic",
        "count": 1
      },
      {
        "node": "super-soldiers",
        "count": 1
      },
      {
        "node": "edge-detection",
        "count": 1
      },
      {
        "node": "psychedelic-benefits",
        "count": 1
      },
      {
        "node": "battlefield-effectiveness",
        "count": 1
      },
      {
        "node": "vikings",
        "count": 1
      },
      {
        "node": "berserkers",
        "count": 1
      },
      {
        "node": "warlike-culture",
        "count": 1
      },
      {
        "node": "odin",
        "count": 1
      },
      {
        "node": "joe-schilling",
        "count": 1
      },
      {
        "node": "kickboxing",
        "count": 1
      },
      {
        "node": "kickboxer",
        "count": 1
      },
      {
        "node": "body-awareness",
        "count": 1
      },
      {
        "node": "dana-beal",
        "count": 1
      },
      {
        "node": "ibagane",
        "count": 1
      },
      {
        "node": "russian-meth",
        "count": 1
      },
      {
        "node": "new-age-meth",
        "count": 1
      },
      {
        "node": "unlimited-data",
        "count": 1
      },
      {
        "node": "verizon",
        "count": 1
      },
      {
        "node": "wireless-plan",
        "count": 1
      },
      {
        "node": "adderall",
        "count": 1
      },
      {
        "node": "gavin-mcinness",
        "count": 1
      },
      {
        "node": "joe-rogan",
        "count": 1
      },
      {
        "node": "budweiser",
        "count": 1
      },
      {
        "node": "steve-bannon",
        "count": 1
      },
      {
        "node": "trends",
        "count": 1
      },
      {
        "node": "marxism",
        "count": 1
      },
      {
        "node": "leftist-ideology",
        "count": 1
      },
      {
        "node": "gavin",
        "count": 1
      },
      {
        "node": "punk-rock",
        "count": 1
      },
      {
        "node": "trans-ideology",
        "count": 1
      },
      {
        "node": "autogophilia",
        "count": 1
      },
      {
        "node": "leah-thomas",
        "count": 1
      },
      {
        "node": "tony-hinchcliffe",
        "count": 1
      },
      {
        "node": "transgender-competition",
        "count": 1
      },
      {
        "node": "fallon-fox",
        "count": 1
      },
      {
        "node": "biological-males",
        "count": 1
      },
      {
        "node": "medical-disclosure",
        "count": 1
      },
      {
        "node": "puberty-impact",
        "count": 1
      },
      {
        "node": "victimization",
        "count": 1
      },
      {
        "node": "mma-fairness",
        "count": 1
      },
      {
        "node": "fractured-skull",
        "count": 1
      },
      {
        "node": "bizarre-loophole",
        "count": 1
      },
      {
        "node": "locker-rooms",
        "count": 1
      },
      {
        "node": "inappropriate-behavior",
        "count": 1
      },
      {
        "node": "hippies",
        "count": 1
      },
      {
        "node": "creepy-sexual",
        "count": 1
      },
      {
        "node": "nero",
        "count": 1
      },
      {
        "node": "boys-extinct",
        "count": 1
      },
      {
        "node": "fake-dicks",
        "count": 1
      },
      {
        "node": "posttop",
        "count": 1
      },
      {
        "node": "pee-standing-up",
        "count": 1
      },
      {
        "node": "enormous-scars",
        "count": 1
      },
      {
        "node": "giant-chunk-of-flesh",
        "count": 1
      },
      {
        "node": "thigh",
        "count": 1
      },
      {
        "node": "hormonal-structure",
        "count": 1
      },
      {
        "node": "identity",
        "count": 1
      },
      {
        "node": "autistic-people",
        "count": 1
      },
      {
        "node": "hormones",
        "count": 1
      },
      {
        "node": "women-s-spaces",
        "count": 1
      },
      {
        "node": "gender-dysphoria",
        "count": 1
      },
      {
        "node": "body-dysmorphia",
        "count": 1
      },
      {
        "node": "legitimate-person",
        "count": 1
      },
      {
        "node": "women-s-locker-room",
        "count": 1
      },
      {
        "node": "feeling-healthier",
        "count": 1
      },
      {
        "node": "skeleton",
        "count": 1
      },
      {
        "node": "bodybuilders",
        "count": 1
      },
      {
        "node": "plastic-surgery",
        "count": 1
      },
      {
        "node": "manipulation",
        "count": 1
      },
      {
        "node": "compounds",
        "count": 1
      },
      {
        "node": "skeptical-people",
        "count": 1
      },
      {
        "node": "gullible-people",
        "count": 1
      },
      {
        "node": "ideology",
        "count": 1
      },
      {
        "node": "verbatim-following",
        "count": 1
      },
      {
        "node": "communist",
        "count": 1
      },
      {
        "node": "mooneyies",
        "count": 1
      },
      {
        "node": "transition-surgeries",
        "count": 1
      },
      {
        "node": "grocery-stores",
        "count": 1
      },
      {
        "node": "republican-mayor",
        "count": 1
      },
      {
        "node": "bill-delasio",
        "count": 1
      },
      {
        "node": "protesting-kids",
        "count": 1
      },
      {
        "node": "curtis-lee",
        "count": 1
      },
      {
        "node": "goofy-beret",
        "count": 1
      },
      {
        "node": "republican-side",
        "count": 1
      },
      {
        "node": "protesting",
        "count": 1
      },
      {
        "node": "assassination",
        "count": 1
      },
      {
        "node": "iranian-government",
        "count": 1
      },
      {
        "node": "gold-medalist",
        "count": 1
      },
      {
        "node": "free-iran",
        "count": 1
      },
      {
        "node": "dictatorship",
        "count": 1
      },
      {
        "node": "iranian-people",
        "count": 1
      },
      {
        "node": "arming-people",
        "count": 1
      },
      {
        "node": "bill-hicks-joke",
        "count": 1
      },
      {
        "node": "sock-puppets",
        "count": 1
      },
      {
        "node": "bill-hicks",
        "count": 1
      },
      {
        "node": "manipulation-of-money",
        "count": 1
      },
      {
        "node": "large-corporations",
        "count": 1
      },
      {
        "node": "huge-donors",
        "count": 1
      },
      {
        "node": "podcast-guest",
        "count": 1
      },
      {
        "node": "awareness",
        "count": 1
      },
      {
        "node": "internalize-ideas",
        "count": 1
      },
      {
        "node": "reading-insight",
        "count": 1
      },
      {
        "node": "fascinating-things",
        "count": 1
      },
      {
        "node": "ghislaine-maxwell-case",
        "count": 1
      },
      {
        "node": "horrendous-things",
        "count": 1
      },
      {
        "node": "going-to-jail",
        "count": 1
      },
      {
        "node": "being-shocked",
        "count": 1
      },
      {
        "node": "sexual-things",
        "count": 1
      },
      {
        "node": "child-trafficking",
        "count": 1
      },
      {
        "node": "underage-kids",
        "count": 1
      },
      {
        "node": "missing-kids",
        "count": 1
      },
      {
        "node": "diddy",
        "count": 1
      },
      {
        "node": "18-year-olds",
        "count": 1
      },
      {
        "node": "cultish-thing",
        "count": 1
      },
      {
        "node": "golden-carrot",
        "count": 1
      },
      {
        "node": "blackmail",
        "count": 1
      },
      {
        "node": "cassie",
        "count": 1
      },
      {
        "node": "prostitution",
        "count": 1
      },
      {
        "node": "jail",
        "count": 1
      },
      {
        "node": "james-comey",
        "count": 1
      },
      {
        "node": "prosecutor",
        "count": 1
      },
      {
        "node": "allegations",
        "count": 1
      },
      {
        "node": "trials",
        "count": 1
      },
      {
        "node": "ghislaine-trail",
        "count": 1
      },
      {
        "node": "twitter",
        "count": 1
      },
      {
        "node": "rapper",
        "count": 1
      },
      {
        "node": "high-profile-people",
        "count": 1
      },
      {
        "node": "epstein-files",
        "count": 1
      },
      {
        "node": "pam-bondi",
        "count": 1
      },
      {
        "node": "epstein-client-list",
        "count": 1
      },
      {
        "node": "kain-maxwell",
        "count": 1
      },
      {
        "node": "netanyahu",
        "count": 1
      },
      {
        "node": "epstein-house",
        "count": 1
      },
      {
        "node": "honeypots",
        "count": 1
      },
      {
        "node": "political-football",
        "count": 1
      },
      {
        "node": "trump-epstein",
        "count": 1
      },
      {
        "node": "bill-clinton",
        "count": 1
      },
      {
        "node": "batch-of-evidence",
        "count": 1
      },
      {
        "node": "compromised-people",
        "count": 1
      },
      {
        "node": "epstein-island",
        "count": 1
      },
      {
        "node": "pedo",
        "count": 1
      },
      {
        "node": "jeffrey-epstein",
        "count": 1
      },
      {
        "node": "clinton",
        "count": 1
      },
      {
        "node": "banging-hookers",
        "count": 1
      },
      {
        "node": "people-s-desire",
        "count": 1
      },
      {
        "node": "hooker",
        "count": 1
      },
      {
        "node": "home-detainment",
        "count": 1
      },
      {
        "node": "underage-sex",
        "count": 1
      },
      {
        "node": "vicky-ward",
        "count": 1
      },
      {
        "node": "intelligence-sheriff",
        "count": 1
      },
      {
        "node": "prosecuted-person",
        "count": 1
      },
      {
        "node": "worldwide-decisions",
        "count": 1
      },
      {
        "node": "propaganda-iran",
        "count": 1
      },
      {
        "node": "propaganda-israel",
        "count": 1
      },
      {
        "node": "propaganda-saudi",
        "count": 1
      },
      {
        "node": "intelligence-perspective",
        "count": 1
      },
      {
        "node": "bots-online",
        "count": 1
      },
      {
        "node": "power-dynamics",
        "count": 1
      },
      {
        "node": "politicians",
        "count": 1
      },
      {
        "node": "exposure",
        "count": 1
      },
      {
        "node": "tucker-ted-cruz-interview",
        "count": 1
      },
      {
        "node": "ted-cruz-israel",
        "count": 1
      },
      {
        "node": "lobby-influence",
        "count": 1
      },
      {
        "node": "bend-the-knee",
        "count": 1
      },
      {
        "node": "financial-receipts",
        "count": 1
      },
      {
        "node": "corrupt-politicians",
        "count": 1
      },
      {
        "node": "mayoral-race",
        "count": 1
      },
      {
        "node": "political-allegiance",
        "count": 1
      },
      {
        "node": "the-communist",
        "count": 1
      },
      {
        "node": "loyalty-allegiance",
        "count": 1
      },
      {
        "node": "mayoral-candidates",
        "count": 1
      },
      {
        "node": "israel-focus",
        "count": 1
      },
      {
        "node": "news-cycle",
        "count": 1
      },
      {
        "node": "therapy",
        "count": 1
      },
      {
        "node": "stanford-study",
        "count": 1
      },
      {
        "node": "digital-well-being",
        "count": 1
      },
      {
        "node": "facebook",
        "count": 1
      },
      {
        "node": "instagram",
        "count": 1
      },
      {
        "node": "meta",
        "count": 1
      },
      {
        "node": "random-sample",
        "count": 1
      },
      {
        "node": "deactivation",
        "count": 1
      },
      {
        "node": "emotional-gains",
        "count": 1
      },
      {
        "node": "facebook-deactivation",
        "count": 1
      },
      {
        "node": "instagram-deactivation",
        "count": 1
      },
      {
        "node": "psychological-interventions",
        "count": 1
      },
      {
        "node": "cognitive-behavior-therapy",
        "count": 1
      },
      {
        "node": "mindfulness-based-interventions",
        "count": 1
      },
      {
        "node": "adults-over-35",
        "count": 1
      },
      {
        "node": "young-women-under-25",
        "count": 1
      },
      {
        "node": "digital-alteration",
        "count": 1
      },
      {
        "node": "social-media-filters",
        "count": 1
      },
      {
        "node": "addiction",
        "count": 1
      },
      {
        "node": "dopamine",
        "count": 1
      },
      {
        "node": "phone",
        "count": 1
      },
      {
        "node": "scrolling",
        "count": 1
      },
      {
        "node": "amber-light",
        "count": 1
      },
      {
        "node": "gold-mining",
        "count": 1
      },
      {
        "node": "kindle",
        "count": 1
      },
      {
        "node": "dopamine-system",
        "count": 1
      },
      {
        "node": "anti-technology",
        "count": 1
      },
      {
        "node": "outdoor-sunlight",
        "count": 1
      },
      {
        "node": "charged-up",
        "count": 1
      },
      {
        "node": "computer-screen-glare",
        "count": 1
      },
      {
        "node": "florida",
        "count": 1
      },
      {
        "node": "text-messages",
        "count": 1
      },
      {
        "node": "healthier",
        "count": 1
      },
      {
        "node": "pictures-videos",
        "count": 1
      },
      {
        "node": "amber-backlight",
        "count": 1
      },
      {
        "node": "routine-change",
        "count": 1
      },
      {
        "node": "patagonia-bag",
        "count": 1
      },
      {
        "node": "bezels",
        "count": 1
      },
      {
        "node": "kindle-technology",
        "count": 1
      },
      {
        "node": "ipad-technology",
        "count": 1
      },
      {
        "node": "iphone-one",
        "count": 1
      },
      {
        "node": "james-macccan",
        "count": 1
      },
      {
        "node": "new-phone",
        "count": 1
      },
      {
        "node": "distraction",
        "count": 1
      },
      {
        "node": "spotify",
        "count": 1
      },
      {
        "node": "shitty-camera",
        "count": 1
      },
      {
        "node": "black-and-white-screen",
        "count": 1
      },
      {
        "node": "phone-addiction",
        "count": 1
      },
      {
        "node": "anti-tech-direction",
        "count": 1
      },
      {
        "node": "technological-innovation",
        "count": 1
      },
      {
        "node": "ai-exponential-growth",
        "count": 1
      },
      {
        "node": "limited-phone-user",
        "count": 1
      },
      {
        "node": "decreased-happiness",
        "count": 1
      },
      {
        "node": "technological-mind",
        "count": 1
      },
      {
        "node": "psychic-mind",
        "count": 1
      },
      {
        "node": "paul-rosalie",
        "count": 1
      },
      {
        "node": "amazon-jungle",
        "count": 1
      },
      {
        "node": "offload-memories",
        "count": 1
      },
      {
        "node": "telepathic-communication",
        "count": 1
      },
      {
        "node": "technology-takeover",
        "count": 1
      },
      {
        "node": "llm-pinnacle",
        "count": 1
      },
      {
        "node": "technological-reliance",
        "count": 1
      },
      {
        "node": "phone-number-memorization",
        "count": 1
      },
      {
        "node": "navigation-dependence",
        "count": 1
      },
      {
        "node": "pre-technology-memory",
        "count": 1
      },
      {
        "node": "technology-memory-impact",
        "count": 1
      },
      {
        "node": "communication-evolution",
        "count": 1
      },
      {
        "node": "digital-atrophy",
        "count": 1
      },
      {
        "node": "human-atrophy",
        "count": 1
      },
      {
        "node": "relying-on-chat-gpt",
        "count": 1
      },
      {
        "node": "pondering-questions",
        "count": 1
      },
      {
        "node": "data-absorption",
        "count": 1
      },
      {
        "node": "chat-gbt",
        "count": 1
      },
      {
        "node": "mit-study",
        "count": 1
      },
      {
        "node": "open-ai",
        "count": 1
      },
      {
        "node": "google",
        "count": 1
      },
      {
        "node": "eeg",
        "count": 1
      },
      {
        "node": "copy-paste",
        "count": 1
      },
      {
        "node": "neural-linguistic",
        "count": 1
      },
      {
        "node": "behavioral-levels",
        "count": 1
      },
      {
        "node": "entropy",
        "count": 1
      },
      {
        "node": "e-mc-",
        "count": 1
      },
      {
        "node": "claude-shannon",
        "count": 1
      },
      {
        "node": "ralph-landar",
        "count": 1
      },
      {
        "node": "ones-zeros",
        "count": 1
      },
      {
        "node": "simulation-meaning",
        "count": 1
      },
      {
        "node": "morphic-resonance",
        "count": 1
      },
      {
        "node": "covid-vaccine",
        "count": 1
      },
      {
        "node": "rupert-sheldrake",
        "count": 1
      },
      {
        "node": "conserving-energy",
        "count": 1
      },
      {
        "node": "anti-science",
        "count": 1
      },
      {
        "node": "the-dude",
        "count": 1
      },
      {
        "node": "super-gravity",
        "count": 1
      },
      {
        "node": "tampa",
        "count": 1
      },
      {
        "node": "computational-code",
        "count": 1
      },
      {
        "node": "computer-simulation",
        "count": 1
      },
      {
        "node": "university-of-maryland",
        "count": 1
      },
      {
        "node": "error-correcting-codes",
        "count": 1
      },
      {
        "node": "coding-theory",
        "count": 1
      },
      {
        "node": "data-transmission",
        "count": 1
      },
      {
        "node": "super-symmetry",
        "count": 1
      },
      {
        "node": "pseudoscientific",
        "count": 1
      },
      {
        "node": "scorpions",
        "count": 1
      },
      {
        "node": "pigs-on-fire",
        "count": 1
      },
      {
        "node": "elephants",
        "count": 1
      },
      {
        "node": "fringe-people",
        "count": 1
      },
      {
        "node": "classically-educated",
        "count": 1
      },
      {
        "node": "impact-theory",
        "count": 1
      },
      {
        "node": "younger-dryas",
        "count": 1
      },
      {
        "node": "core-samples",
        "count": 1
      },
      {
        "node": "atlanta-georgia",
        "count": 1
      },
      {
        "node": "ancient-apocalypse",
        "count": 1
      },
      {
        "node": "flynn-dibble",
        "count": 1
      },
      {
        "node": "racist",
        "count": 1
      },
      {
        "node": "white-supremacist",
        "count": 1
      },
      {
        "node": "opposing-views",
        "count": 1
      },
      {
        "node": "gobekli-tepe",
        "count": 1
      },
      {
        "node": "sumer",
        "count": 1
      },
      {
        "node": "jimmy-corsetti",
        "count": 1
      },
      {
        "node": "tenochtitlan",
        "count": 1
      },
      {
        "node": "weird-energy",
        "count": 1
      },
      {
        "node": "dogs-and-cats",
        "count": 1
      },
      {
        "node": "magnetic-force",
        "count": 1
      },
      {
        "node": "bird-migration",
        "count": 1
      },
      {
        "node": "atrophied-brain",
        "count": 1
      },
      {
        "node": "predators",
        "count": 1
      },
      {
        "node": "creativity-connection",
        "count": 1
      },
      {
        "node": "the-muse",
        "count": 1
      },
      {
        "node": "trading-dreams",
        "count": 1
      },
      {
        "node": "creative-spark",
        "count": 1
      },
      {
        "node": "mundane-things",
        "count": 1
      },
      {
        "node": "early-age-peak",
        "count": 1
      },
      {
        "node": "magical-creativity",
        "count": 1
      },
      {
        "node": "kirk",
        "count": 1
      },
      {
        "node": "metallica",
        "count": 1
      },
      {
        "node": "topics",
        "count": 1
      },
      {
        "node": "impostor",
        "count": 1
      },
      {
        "node": "ikaros",
        "count": 1
      },
      {
        "node": "dmt",
        "count": 1
      },
      {
        "node": "ayahuasca",
        "count": 1
      },
      {
        "node": "trip-technology",
        "count": 1
      },
      {
        "node": "costa-rica",
        "count": 1
      },
      {
        "node": "40-year-old-ladies",
        "count": 1
      },
      {
        "node": "tech-entrepreneurs",
        "count": 1
      },
      {
        "node": "navy-seals",
        "count": 1
      },
      {
        "node": "luke-caverns",
        "count": 1
      },
      {
        "node": "great-clip",
        "count": 1
      },
      {
        "node": "psychedelic-experience",
        "count": 1
      },
      {
        "node": "dancing",
        "count": 1
      },
      {
        "node": "synchronized",
        "count": 1
      },
      {
        "node": "comforting-pattern",
        "count": 1
      },
      {
        "node": "unveiling",
        "count": 1
      },
      {
        "node": "relaxation",
        "count": 1
      },
      {
        "node": "trips",
        "count": 1
      },
      {
        "node": "metallica-concert",
        "count": 1
      },
      {
        "node": "buck-stadium",
        "count": 1
      },
      {
        "node": "electric-guitars",
        "count": 1
      },
      {
        "node": "pyrochnics",
        "count": 1
      },
      {
        "node": "same-frequency",
        "count": 1
      },
      {
        "node": "metallica-gods",
        "count": 1
      },
      {
        "node": "democracy",
        "count": 1
      },
      {
        "node": "nixon-administration",
        "count": 1
      },
      {
        "node": "anti-war-movement",
        "count": 1
      },
      {
        "node": "schedule-one",
        "count": 1
      },
      {
        "node": "governments",
        "count": 1
      },
      {
        "node": "jack-booted-thugs",
        "count": 1
      },
      {
        "node": "academic-strife",
        "count": 1
      },
      {
        "node": "ancient-pharmacy",
        "count": 1
      },
      {
        "node": "influencers",
        "count": 1
      },
      {
        "node": "recreational-drugs",
        "count": 1
      },
      {
        "node": "the-chemical-muse",
        "count": 1
      },
      {
        "node": "theak",
        "count": 1
      },
      {
        "node": "sacred-mushroom",
        "count": 1
      },
      {
        "node": "sacred-mushroom-in-the-cross",
        "count": 1
      },
      {
        "node": "christing-arrows",
        "count": 1
      },
      {
        "node": "north-african-vipers",
        "count": 1
      },
      {
        "node": "tlg",
        "count": 1
      },
      {
        "node": "christ-drugs",
        "count": 1
      },
      {
        "node": "christing",
        "count": 1
      },
      {
        "node": "christed-cow",
        "count": 1
      },
      {
        "node": "christing-ships",
        "count": 1
      },
      {
        "node": "christ-drugs-theory",
        "count": 1
      },
      {
        "node": "christ-shaman",
        "count": 1
      },
      {
        "node": "shaman-jesus",
        "count": 1
      },
      {
        "node": "weird",
        "count": 1
      },
      {
        "node": "greek-debate",
        "count": 1
      },
      {
        "node": "holy-oil-baptism",
        "count": 1
      },
      {
        "node": "drug-argument",
        "count": 1
      },
      {
        "node": "scam",
        "count": 1
      },
      {
        "node": "exorcism",
        "count": 1
      },
      {
        "node": "baptism",
        "count": 1
      },
      {
        "node": "satan-inside",
        "count": 1
      },
      {
        "node": "kids",
        "count": 1
      },
      {
        "node": "bombed",
        "count": 1
      },
      {
        "node": "patronize",
        "count": 1
      },
      {
        "node": "cannabis",
        "count": 1
      },
      {
        "node": "incense",
        "count": 1
      },
      {
        "node": "hotbox",
        "count": 1
      },
      {
        "node": "paranoid",
        "count": 1
      },
      {
        "node": "compassionate",
        "count": 1
      },
      {
        "node": "kinder",
        "count": 1
      },
      {
        "node": "schizophrenia",
        "count": 1
      },
      {
        "node": "psychotic-breaks",
        "count": 1
      },
      {
        "node": "alcohol",
        "count": 1
      },
      {
        "node": "career-suicide",
        "count": 1
      },
      {
        "node": "illegal-studies",
        "count": 1
      },
      {
        "node": "academic-debate",
        "count": 1
      },
      {
        "node": "linguist-philologist",
        "count": 1
      },
      {
        "node": "text-complexities",
        "count": 1
      },
      {
        "node": "context-analysis",
        "count": 1
      },
      {
        "node": "marco-leger",
        "count": 1
      },
      {
        "node": "harvard-philologists",
        "count": 1
      },
      {
        "node": "word-analysis",
        "count": 1
      },
      {
        "node": "corpus-analysis",
        "count": 1
      },
      {
        "node": "ancient-comedy",
        "count": 1
      },
      {
        "node": "creo",
        "count": 1
      },
      {
        "node": "atheist-scholar",
        "count": 1
      },
      {
        "node": "christing-drugs",
        "count": 1
      },
      {
        "node": "amen-hillman",
        "count": 1
      },
      {
        "node": "legit-scholars",
        "count": 1
      },
      {
        "node": "credibility",
        "count": 1
      },
      {
        "node": "word-creo",
        "count": 1
      },
      {
        "node": "uripides",
        "count": 1
      },
      {
        "node": "rabbit-hole",
        "count": 1
      },
      {
        "node": "credible-person",
        "count": 1
      },
      {
        "node": "ancient-vaccines",
        "count": 1
      },
      {
        "node": "antibodies",
        "count": 1
      },
      {
        "node": "snake-bites",
        "count": 1
      },
      {
        "node": "immune-systems",
        "count": 1
      },
      {
        "node": "death-inducing-drugs",
        "count": 1
      },
      {
        "node": "antidote",
        "count": 1
      },
      {
        "node": "garden-of-gethsemane",
        "count": 1
      },
      {
        "node": "roman-swat-team",
        "count": 1
      },
      {
        "node": "traffickers",
        "count": 1
      },
      {
        "node": "mark-14-53",
        "count": 1
      },
      {
        "node": "ancient-sumerian",
        "count": 1
      },
      {
        "node": "wes-huff",
        "count": 1
      },
      {
        "node": "bible",
        "count": 1
      },
      {
        "node": "turkey",
        "count": 1
      },
      {
        "node": "scar-bro",
        "count": 1
      },
      {
        "node": "algro",
        "count": 1
      },
      {
        "node": "great-pyramid",
        "count": 1
      },
      {
        "node": "nile-valley",
        "count": 1
      },
      {
        "node": "zeppy",
        "count": 1
      },
      {
        "node": "king-s-list",
        "count": 1
      },
      {
        "node": "egyptologists",
        "count": 1
      },
      {
        "node": "sophisticated-civilization",
        "count": 1
      },
      {
        "node": "conventional-thinkers",
        "count": 1
      },
      {
        "node": "gobeclette",
        "count": 1
      },
      {
        "node": "sophistication",
        "count": 1
      },
      {
        "node": "stone-structures",
        "count": 1
      },
      {
        "node": "black-programs",
        "count": 1
      },
      {
        "node": "economic-collapse",
        "count": 1
      },
      {
        "node": "jesse-michaels",
        "count": 1
      },
      {
        "node": "gravity-technology",
        "count": 1
      },
      {
        "node": "uaps",
        "count": 1
      },
      {
        "node": "katherine-fitz",
        "count": 1
      },
      {
        "node": "anti-gravity",
        "count": 1
      },
      {
        "node": "mr--global",
        "count": 1
      },
      {
        "node": "lockheed-martin",
        "count": 1
      },
      {
        "node": "underground-bases",
        "count": 1
      },
      {
        "node": "swastikas-scopes-saucers",
        "count": 1
      },
      {
        "node": "nazis-ufos",
        "count": 1
      },
      {
        "node": "roswell",
        "count": 1
      },
      {
        "node": "soviet-union-crash",
        "count": 1
      },
      {
        "node": "dismissal",
        "count": 1
      },
      {
        "node": "nazi-stuff",
        "count": 1
      },
      {
        "node": "soviet-union",
        "count": 1
      },
      {
        "node": "view-evolution",
        "count": 1
      },
      {
        "node": "off-world-crafts",
        "count": 1
      },
      {
        "node": "david-grush",
        "count": 1
      },
      {
        "node": "crashed-vehicles",
        "count": 1
      },
      {
        "node": "fake-rumors",
        "count": 1
      },
      {
        "node": "super-intelligent",
        "count": 1
      },
      {
        "node": "sky-sightings",
        "count": 1
      },
      {
        "node": "jock-valet",
        "count": 1
      },
      {
        "node": "modern-technology",
        "count": 1
      },
      {
        "node": "extraterrestrial-visitors",
        "count": 1
      },
      {
        "node": "1700s",
        "count": 1
      },
      {
        "node": "1800s",
        "count": 1
      },
      {
        "node": "underwater-ufos",
        "count": 1
      },
      {
        "node": "richard-dolan",
        "count": 1
      },
      {
        "node": "glowing-orb",
        "count": 1
      },
      {
        "node": "submarines",
        "count": 1
      },
      {
        "node": "1700s-sighting",
        "count": 1
      },
      {
        "node": "ocean-exploration",
        "count": 1
      },
      {
        "node": "ufo-bases",
        "count": 1
      },
      {
        "node": "submarine-ufo",
        "count": 1
      },
      {
        "node": "nuclear-submarines",
        "count": 1
      },
      {
        "node": "nuclear-warheads",
        "count": 1
      },
      {
        "node": "underwater-object",
        "count": 1
      },
      {
        "node": "beam-of-light",
        "count": 1
      },
      {
        "node": "trans-medium-videos",
        "count": 1
      },
      {
        "node": "water-entry",
        "count": 1
      },
      {
        "node": "ancient-stories",
        "count": 1
      },
      {
        "node": "biblical-stories",
        "count": 1
      },
      {
        "node": "ezekiel",
        "count": 1
      },
      {
        "node": "orb-encounter",
        "count": 1
      },
      {
        "node": "infection",
        "count": 1
      },
      {
        "node": "eyewitnesses",
        "count": 1
      },
      {
        "node": "ufo",
        "count": 1
      },
      {
        "node": "palanteer",
        "count": 1
      },
      {
        "node": "technology",
        "count": 1
      },
      {
        "node": "severance",
        "count": 1
      },
      {
        "node": "emotionally-unstable",
        "count": 1
      },
      {
        "node": "phone-tapped",
        "count": 1
      },
      {
        "node": "crashed-ufo",
        "count": 1
      },
      {
        "node": "disinformation",
        "count": 1
      },
      {
        "node": "paul-benowit",
        "count": 1
      },
      {
        "node": "recruit",
        "count": 1
      },
      {
        "node": "rocket-engine",
        "count": 1
      },
      {
        "node": "brothel",
        "count": 1
      },
      {
        "node": "hydrogen-corvette",
        "count": 1
      },
      {
        "node": "youtube-podcast",
        "count": 1
      },
      {
        "node": "elon",
        "count": 1
      },
      {
        "node": "smoking-weed",
        "count": 1
      },
      {
        "node": "hydrogen-engine",
        "count": 1
      },
      {
        "node": "hydrogen-car",
        "count": 1
      },
      {
        "node": "gaseous-hydrogen",
        "count": 1
      },
      {
        "node": "old-corvette",
        "count": 1
      },
      {
        "node": "fuel-lines",
        "count": 1
      },
      {
        "node": "heater",
        "count": 1
      },
      {
        "node": "hydride",
        "count": 1
      },
      {
        "node": "hydrogen",
        "count": 1
      },
      {
        "node": "big-hoses",
        "count": 1
      },
      {
        "node": "ed-teller",
        "count": 1
      },
      {
        "node": "propulsion-expert",
        "count": 1
      },
      {
        "node": "mit",
        "count": 1
      },
      {
        "node": "los-alamos-labs",
        "count": 1
      },
      {
        "node": "devious",
        "count": 1
      },
      {
        "node": "los-alamos",
        "count": 1
      },
      {
        "node": "john-von-noman",
        "count": 1
      },
      {
        "node": "dod",
        "count": 1
      },
      {
        "node": "conspiracy",
        "count": 1
      },
      {
        "node": "military-air-force-navy",
        "count": 1
      },
      {
        "node": "nuclear-weapons",
        "count": 1
      },
      {
        "node": "21-trillion",
        "count": 1
      },
      {
        "node": "anti-gravity-weapon",
        "count": 1
      },
      {
        "node": "mind-interfacing",
        "count": 1
      },
      {
        "node": "stargate",
        "count": 1
      },
      {
        "node": "world-domination",
        "count": 1
      },
      {
        "node": "voice-texting",
        "count": 1
      },
      {
        "node": "barbara-stryand",
        "count": 1
      },
      {
        "node": "advanced-technology",
        "count": 1
      },
      {
        "node": "technology-scaling",
        "count": 1
      },
      {
        "node": "crosshair-technology",
        "count": 1
      },
      {
        "node": "llm-warfare",
        "count": 1
      },
      {
        "node": "ai-ethics",
        "count": 1
      },
      {
        "node": "telepathy",
        "count": 1
      },
      {
        "node": "neuralink",
        "count": 1
      },
      {
        "node": "hive-mind",
        "count": 1
      },
      {
        "node": "ai-god",
        "count": 1
      },
      {
        "node": "mating-call",
        "count": 1
      },
      {
        "node": "procreation",
        "count": 1
      },
      {
        "node": "symbolic-immortality",
        "count": 1
      },
      {
        "node": "legacy",
        "count": 1
      },
      {
        "node": "genius-adoration",
        "count": 1
      },
      {
        "node": "human-behavior",
        "count": 1
      },
      {
        "node": "prefrontal-cortex",
        "count": 1
      },
      {
        "node": "brain-stem",
        "count": 1
      },
      {
        "node": "visual-cortex",
        "count": 1
      },
      {
        "node": "bananas",
        "count": 1
      },
      {
        "node": "symbology",
        "count": 1
      },
      {
        "node": "cyine-chapel",
        "count": 1
      },
      {
        "node": "mythical-divine-person",
        "count": 1
      },
      {
        "node": "gandalf",
        "count": 1
      },
      {
        "node": "unique-moment",
        "count": 1
      },
      {
        "node": "mythology",
        "count": 1
      },
      {
        "node": "disbelief",
        "count": 1
      },
      {
        "node": "ideologies",
        "count": 1
      },
      {
        "node": "political-ideologies",
        "count": 1
      },
      {
        "node": "malleability",
        "count": 1
      },
      {
        "node": "tribal-past",
        "count": 1
      },
      {
        "node": "innovation",
        "count": 1
      },
      {
        "node": "propaganda",
        "count": 1
      },
      {
        "node": "kevin-mccirin",
        "count": 1
      },
      {
        "node": "human-genome-project",
        "count": 1
      },
      {
        "node": "medical-treatments",
        "count": 1
      },
      {
        "node": "leukemia",
        "count": 1
      },
      {
        "node": "designer-drugs",
        "count": 1
      },
      {
        "node": "fiser",
        "count": 1
      },
      {
        "node": "fiser-vaccine",
        "count": 1
      },
      {
        "node": "dna-plasmid-contamination",
        "count": 1
      },
      {
        "node": "sb40",
        "count": 1
      },
      {
        "node": "brett-weinstein",
        "count": 1
      },
      {
        "node": "traditional-vaccines",
        "count": 1
      },
      {
        "node": "sv40-simeon-virus-40",
        "count": 1
      },
      {
        "node": "human-tumors",
        "count": 1
      },
      {
        "node": "cancer-uptick",
        "count": 1
      },
      {
        "node": "kevin",
        "count": 1
      },
      {
        "node": "tumor-sequencing",
        "count": 1
      },
      {
        "node": "vaccine-cancer",
        "count": 1
      },
      {
        "node": "monkey-kidney-cells",
        "count": 1
      },
      {
        "node": "antibody-creation",
        "count": 1
      },
      {
        "node": "sulk-vaccine",
        "count": 1
      },
      {
        "node": "sulk-polio-vaccine",
        "count": 1
      },
      {
        "node": "making-movies",
        "count": 1
      },
      {
        "node": "ucf",
        "count": 1
      },
      {
        "node": "orlando",
        "count": 1
      },
      {
        "node": "dolphin-tail",
        "count": 1
      },
      {
        "node": "morgan-freeman",
        "count": 1
      },
      {
        "node": "carrie-kic-jr",
        "count": 1
      },
      {
        "node": "warner-brothers",
        "count": 1
      },
      {
        "node": "aquarium",
        "count": 1
      },
      {
        "node": "camera-production-assistant",
        "count": 1
      },
      {
        "node": "film-school",
        "count": 1
      },
      {
        "node": "crab-trap",
        "count": 1
      },
      {
        "node": "unhappiness",
        "count": 1
      },
      {
        "node": "pete-sukarini",
        "count": 1
      },
      {
        "node": "camera-department",
        "count": 1
      },
      {
        "node": "pirates-caribbean",
        "count": 1
      },
      {
        "node": "camera-batteries",
        "count": 1
      },
      {
        "node": "sd-cards",
        "count": 1
      },
      {
        "node": "media-truck",
        "count": 1
      },
      {
        "node": "facetiming-kids",
        "count": 1
      },
      {
        "node": "commercials",
        "count": 1
      },
      {
        "node": "spec-ads",
        "count": 1
      },
      {
        "node": "contests",
        "count": 1
      },
      {
        "node": "land-rover-usa",
        "count": 1
      },
      {
        "node": "concrete-stupid",
        "count": 1
      },
      {
        "node": "website-domain",
        "count": 1
      },
      {
        "node": "concrete-construction-company",
        "count": 1
      },
      {
        "node": "hulk-hogan",
        "count": 1
      },
      {
        "node": "hostamania",
        "count": 1
      },
      {
        "node": "wrecking-ball",
        "count": 1
      },
      {
        "node": "vanam",
        "count": 1
      },
      {
        "node": "duck-dynasty",
        "count": 1
      },
      {
        "node": "pawn-stars",
        "count": 1
      },
      {
        "node": "tv-show-ideas",
        "count": 1
      },
      {
        "node": "scientology",
        "count": 1
      },
      {
        "node": "network-pitching",
        "count": 1
      },
      {
        "node": "spike-tv",
        "count": 1
      },
      {
        "node": "icom",
        "count": 1
      },
      {
        "node": "youtube",
        "count": 1
      },
      {
        "node": "deckands",
        "count": 1
      },
      {
        "node": "7-eleven",
        "count": 1
      },
      {
        "node": "luke",
        "count": 1
      },
      {
        "node": "2015",
        "count": 1
      },
      {
        "node": "fishing-quota",
        "count": 1
      },
      {
        "node": "shane-lee",
        "count": 1
      },
      {
        "node": "hollywood-kim",
        "count": 1
      },
      {
        "node": "danny-jones-podcast",
        "count": 1
      },
      {
        "node": "seahhab",
        "count": 1
      },
      {
        "node": "boat-owners",
        "count": 1
      },
      {
        "node": "derby-fishing",
        "count": 1
      }
    ],
    "topicGroups": {
      "groups": [
        {
          "topics": [
            "pyramids",
            "red-pyramid",
            "pyramid-structures",
            "giza",
            "giza-plateau",
            "library-of-alexandria",
            "underground-temple",
            "water-erosion",
            "satellite-images",
            "subterranean-chamber",
            "zawi-has",
            "eye-of-horus",
            "concrete",
            "columns-coils",
            "coils-spirals",
            "geometric-pattern",
            "tesla-connection",
            "energy-coil",
            "electron-harvester",
            "hammer",
            "vibration",
            "seismic-waves",
            "tomographic-images",
            "unseen-structures",
            "artist-rendition",
            "lidar-technology",
            "ground-penetration",
            "something-tomography"
          ],
          "category": {
            "id": "ancient-mysteries",
            "name": "Ancient Mysteries",
            "description": "Ancient structures, history, and related mysteries."
          }
        },
        {
          "topics": [
            "aliens",
            "ufos",
            "bob-lazar",
            "breakaway-civilization",
            "black-budget",
            "propulsion-system"
          ],
          "category": {
            "id": "ufos-and-aliens",
            "name": "UFOs and Aliens",
            "description": "UFOs, aliens, and related phenomena."
          }
        },
        {
          "topics": [
            "mk-ultra",
            "nazi-scientists",
            "operation-paperclip",
            "congress",
            "donald-trump",
            "cult",
            "maga",
            "indoctrination",
            "vaccine-factories",
            "demons",
            "skype-exorcist",
            "xrio",
            "deep-dive",
            "refute",
            "convincing",
            "snake-venom",
            "black-budget"
          ],
          "category": {
            "id": "conspiracy-theories",
            "name": "Conspiracy Theories",
            "description": "Conspiracy theories and government secrets."
          }
        },
        {
          "topics": [
            "podcasts",
            "youtube-channel",
            "joe-rogan-podcast",
            "joe-rogan-experience",
            "video",
            "documentary",
            "social-media",
            "advertising-company",
            "comedy",
            "hamilton-morris",
            "chris-dunn",
            "christopher-dunn",
            "kurt-mezer",
            "comey-s-daughter",
            "mary-bowden",
            "jamie",
            "graham-hancock"
          ],
          "category": {
            "id": "podcast-and-media",
            "name": "Podcast and Media",
            "description": "Podcast, media, and related personalities."
          }
        },
        {
          "topics": [
            "simulation",
            "chat-gpt-users",
            "circadian-rhythm",
            "parapsychology",
            "symmetry",
            "tesla-connection",
            "electron-harvester",
            "lidar-technology",
            "ground-penetration",
            "something-tomography",
            "propulsion-system"
          ],
          "category": {
            "id": "science-and-technology",
            "name": "Science and Technology",
            "description": "Science, technology, and related topics."
          }
        },
        {
          "topics": [
            "tripping",
            "drugs",
            "marijuana",
            "psychedelics",
            "mushrooms",
            "pineal-gland",
            "elusinian-mysteries"
          ],
          "category": {
            "id": "drugs-and-altered-states",
            "name": "Drugs and Altered States",
            "description": "Drugs, altered states, and related experiences."
          }
        },
        {
          "topics": [
            "nazi-scientists",
            "operation-paperclip",
            "fritz-haber",
            "nobel-prize",
            "michael-collins",
            "cubrick"
          ],
          "category": {
            "id": "historical-figures-and-events",
            "name": "Historical Figures and Events",
            "description": "Historical figures and events."
          }
        },
        {
          "topics": [
            "perverts",
            "cutting-tits",
            "testosterone",
            "trans-people",
            "anorexia",
            "maga",
            "indoctrination",
            "cult"
          ],
          "category": {
            "id": "social-and-cultural-issues",
            "name": "Social and Cultural Issues",
            "description": "Social and cultural issues."
          }
        },
        {
          "topics": [
            "ipad",
            "easter-eggs",
            "apollo-shirt",
            "academic",
            "galen",
            "biological-men",
            "diddy-thing",
            "corvette",
            "agriculture",
            "madira-beach"
          ],
          "category": {
            "id": "miscellaneous",
            "name": "Miscellaneous",
            "description": "Miscellaneous and unrelated topics."
          }
        }
      ]
    },
    "shortSummary": "Joe Rogan and Danny Jones discuss a wide range of topics, including ancient mysteries, the moon landing, social media's impact, and the potential of psychedelics.",
    "lastStoryCheck": "2025-07-15T19:09:24.084Z",
    "storyCheckResults": {
      "missingChunks": [],
      "missingStories": [],
      "totalCategories": 9,
      "totalChunksChecked": 147
    }
  }
}