{
  "id": "dmR9wnz1-yg",
  "title": "Joe Rogan Experience #2337 - Oliver Anthony",
  "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
  "publishedAt": "2025-06-13T17:00:59.000Z",
  "cleanText": "Joe Rogan podcast. Check it out. The Joe Rogan Experience. Train by day. Joe Rogan podcast by night. All day.\n\nAnd we're up, my friend. How are you? Good to see you. Long time no talk. Yeah, brother. Yeah. How you doing? You good? Good. I um man, I remember like towards the last the end of the last time I was here, you said, \"Oh, yeah. We'll probably see you again in a couple years.\" And I was just looking around like, \"Yeah, I'll never see any of this again.\" You're back quicker than you thought. Yeah, bro. That new song is fire. Oh, thanks. Yeah, I played that song about 20 times in the green room. And uh the first time I played it, everybody just sat around and went, \"Oh, shit.\"\n\nIt was so funny that um yeah, I didn't expect the song to Well, you know, I didn't I wasn't the one I guess it was Adam that sent it to I don't even know how you got a hold of the song originally. Yeah, Adam sent it to me originally. Yeah, I sent it I'd sent it to him like um Yeah, just kind of just to get his opinion of it or whatever. And he's like, \"I got it.\" He's like, \"Do you mind if I share this around?\" And I was like, \"Yeah, go ahead.\" Bro, the first time I heard it was in the green room. And the green room has a killer sound system. So, we we put it on the Bluetooth and cranked it and all of us there was like 10 dudes in that room going, \"Oh [ __ ] oh shit.\" Some of those lines like, \"Oh shit.\"\n\nYeah. Woo. What what makes that song different, I guess, than anything I've done or than a lot of music now is that we're um we tried to like do it the way Leonard Skynyrd or somebody would back in this where we're all just in the house and there's no like man there's so much editing that goes into music now on the back end and stuff and with this we're just like in there doing it and you know try to keep it as real as as possible like um you know there's no there's no click tracks, there's no real editing. It's just kind of like we're all just in this house. I mean it's it was is the worst timing to record. But um that was that January 5th, 6th, 7th window was the only time that everybody could meet up. You know, Billy Contreras on the fiddle and everybody and cuz he he tours with Ricky Skaggs and he's kind of all over the place. So that was like our time to meet. So a couple days before we all went to West Virginia to record at my house up there the um this like terrible storm they were calling for. It's like the worst one since the '90s supposedly or that's what Draven says. But so we got all the snow, all this ice. So, um, so yeah, we used a a side by side and a jeep to haul everything up and down. It was like just all we could do to get up and down to the house. And then as right as soon as we get everything plugged in, ready to go, the power knocks out. And uh, I was like, we were all just so discouraged. And um luckily there you know there's a Lowe's not terribly far away and they had one they had like a Honda inverter generator that was like safe to plug everything into you know like a where the waves aren't going to mess everything up and um so yeah we you know we recorded the song while on a generator. So you have to worry about the waves of the generator like the sound of the generator. Is that what it is? No like the electrical pulses. Yeah. Like plugging all of that expensive equipment into just like a a Yeah. a generator that's on an inverter. Like the voltage like goes up and down, I guess. Or I don't know. That's all above my pay grade. But we had to find one that was like safe to plug all that equipment into, you know? Well, it maybe that's something in the song, too, you know, like maybe that you're trapped in a storm. That's a scary ass song, dude. It's a scary I can't wait for the Yeah.\n\nSee, I hadn't put a lot of new music out because um well, I think back to even when I was here last time and before we did the episode and all um walking around on the sidewalk out in front of the hotel with Draven and a couple other people arguing that I needed to just cash out from Richmond and roll and not make this into a long-term thing cuz I just um well, dude, I just don't Some people thrive in this environment like everybody looking at them, but I to me it's just like so it just it kind of takes it kind takes a little bit out of me putting new music out. And so, you know, after Richmond, I only had those two new songs. I really just wanted to let everything kind of slow down. And I could still maybe do five or 10 shows a year and make a little bit, but I wasn't trying to be like a superstar. I didn't want everybody just to be I didn't want to be stuck in that spot I was when I was at Richmond where everybody's just like obsessing over stuff. And so, I kind of just tried to let it die. And then it, you know, it wouldn't. It was like the streams kept continuing and people were still messaging me and emailing and the shows were still selling out and I just realized like I don't know, you know, I believed everybody that said, \"This kid's got 15 minutes of fame and whatever.\" And I would have been during when Richmond blew up, I would have been one of those guys who would have been like, \"Oh, that stupid guy.\" You know, like I would have been a hater, too. So, I'm I was almost like rooting for them like, \"Yeah, you know, cuz you got to think, man, the first check from Richmond was $800,000. Like, I can I could have lived a long time off of that money, you know, like I don't need a whole lot of like that was crazy, you know, that was a decade or more of work for me easily.\" And so, it's like I was like, \"Heck yeah, I'm good. I'll just take it, you know?\" And um anyway, I say all that to say that now it's like I'm going to at least just I'm going to at least just hit it good one more time. I've got we've got six songs recorded now to come after Scornful that are all like I'm pretty proud of them. They're good. And so, um I'm going to put those out and then who knows after that. But let me tell you what's going to happen. You got a relationship with those people now, man. They love you. Yeah.\n\nIt's just your mission in life. You know, you just got handed a wild hand of cards and this is your your deck of cards. You know, your deck of cards is or your hand of cards is you put this song out, this authentic song that's very simple in this time where nothing's simple. In this time where everything's confusing and all, you don't know who's telling the truth. The news is lying to you. Everything is being funded. Nothing's organic. It's half the [ __ ] traffic on social media is bots. At least politicians are lying. Everybody's confused. People are sing for politicians. They're they're getting paid to repeat talking points on television and on podcasts and all over social media. So when someone comes up with something like that is just that dude telling you how he feels. Yeah. Real raw. You know, I remember we had that conversation on the phone and I was like, if you can do that, you could do that again. You don't they don't need anybody else. You don't need these [ __ ] who want you to cash out all these. They they just they they're doing that because they think that you're gullible. They think that you're naive in the ways of the entertainment music business. The first [ __ ] live show you ever performed was a giant soldout show at a state fair. Do you know how crazy that is? That's your first live show. That Well, that that very first show was actually um it was even more amateur than that. It was at a farm market. It was um it wasn't even a there weren't even any tickets. It was just like so it's crazy how it all it just it goes back to when I I still believe just as much now as I did the last time I was here about and I don't I definitely won't bug everybody too much with all my hokeyp pokey religious stuff either. Like I definitely want to read a little bit out before we go. But I do believe it was just it was all too perfectly timed. But I had actually picked that date out at the at the farm market before Richmond blew up. That was going to be my that was going to be my first time playing live either way. Oh wow. That date it was like August the 12th. I think I had booked it back in July with that Morris Farm Market. I was going to get 200 bucks and go play for like it was like two and a half hours. Like seriously. And in that time that's what h so like I already had that date picked and yeah it was just at a farm market and um like kind of near the beach in Outer Banks and they say like 12,000 people showed up and that was the very first one.\n\nYeah. And I just I remember even then like I just I just expected everybody to sing Richmond and that was going to be it and it'd be cool and I'd go back to work the next week. But it was like even in that crowd at that very first show, all the other songs they knew the words to too and I was like this is like something you know but wow. Um the important thing too is that the the important thing to take away from this and I said this during Richmond but people you know it was like take me out of it. The fact that people can now choose what they want and push it to the top even in a system that's rigged where there is bots and there's mass marketing money going into songs and like labels spend a million dollars on their own song to get it up the label. Yeah. The fact that people can just decide they like something and just shoot it up to the top. Like people need to realize how much power and influence they have at least for a short period in time in society. It's like the stars are aligned where we can kind of It's funny technology like can only develop on the backs of people using it. And so like AI and and all of this over the years, social media, like all the back end of that, it's been it's all that information's being sort of extracted from us. Like you think about like the like the way a Tesla car rides down the road and it's watching you drive and you're like it's like reading your analytics so it can learn how to drive better. We know AI, that's the only reason why they let everybody use AI is so it can make the AI it's the user input that's that's what makes it you know and so for a very short period in time it's like the stars are aligned where they're having to like while they're sucking all the humanity out of us to put into this AI we also have full access to it and like so we can do like even in the even in the music business you know everything that the label used to hold exclusive control over like the publicity and the marketing and the digital streaming service relationships, like all that stuff is now just alocart to anybody. Like you don't need the you don't need those big companies. All that stuff you can just go and hire a really good social media person and you can work with a good music distributor without having to sign anything or give any of your rights up. And yeah, right now the people have the power is what I mean for like a very short period of time. But this should be a this should just be a reminder of that. This song being able to go up into the iTunes charts even with stuff with way bigger audiences with all kinds of marketing reach. you know, the fact that this can just organically go into the iTunes charts like that and people, you know, it's just that's the thing that's the thing I always take away from it is just like, damn, dude. If we could just get organized even for like two or three years, we could just fix everything. Like we have like the people really do have the power, at least right now for for a short window of time, but we really do. I mean, we just but people have to understand that we are all in this together and that there's organizations that want to drive us apart. And the way to work out our differences is conf having conversations and negotiations and figuring out how to work it out. It's not lighting cop cars on fire. Like this is, you know, but the spirit of those like not to defend any of that crap, but I just that rebellious nature in us is important too though. It just has to be it has to be directed correctly. You shouldn't be burning Whimos while holding a Mexican flag trying not to get sent back to Mexico. I mean, you're confusing the [ __ ] out of me, dog. Like, who is your oppressor? Is it the electric car? Is it the country which you know, you want to stay, but you're holding a flag of another country? Like, what? Why are you wearing a mask? Are you proud of this? Do you not want to get arrested? What are we doing? Are you scared of COVID? Like, I want to know.\n\nWell, it goes back to what you said about mass manipulation and also like we don't we've all sort of lost our identity. That's why politics has become so prevalent in like the way people represent themselves to other people and like you know that's like as as our as our culture and our tradition and like sort of the the knowledge of where our families and all of that stuff comes from. like we're just sort of all we're just little boats out in a big ocean and we're looking for somewhere to we're looking for some kind of identity to reach out and grab and politics they make politics so easy to reach out and grab and make just like in the same way that people just absorb themselves into sports. Exactly. You know, they're way out of shape, but they that like they refer to their sports team as we like our our defense did really Jimmy does that all the time. We won. Talks about a college where I'm from\n\n\nSome college where he's from.\nWell, that's maybe get out of here.\nMaybe if he's from there though, then it doesn't count.\nI'm just [ __ ] around.\nI'm a I'm not a team sports guy, you know?\nI'm a combat sports guy, and I would never say we won.\nLike if Kamaro Usman beat somebody, I'd never say we won, you know?\nCamaro would call me up.\nWhat the [ __ ] are you saying, man?\nWe You know what I did in camp, you know?\nI mean, rounds I sparred, you know?\nYeah.\nAll the punches he took.\nIt's so crazy.\nBut if there's a group of guys, you can say we.\nBut that's I see that like I just see that becoming more and more prevalent where there's not like I don't know.\nIt's sort of just like it's kind of even even to expand on the thought of it.\nIt's even like the way that now we've all just sort of we're all in these subcategories the way we would be if we were in prison.\nWe're all like, you know, like in the same way that when we use the word black and white to describe like how many different types of white and black are there that all just get merged?\nIt's like it's it like creates this maybe like group identity that's a lot easier to control like for sure.\nWell, and then it it shifts over time.\nLike my family wasn't white.\nMy family was Italian.\nThey were they were disparaged when they first came to America from Europe.\nAnd my grandfather used to tell me terrible stories of what happened to him when he was a boy living in America as an Italian.\nThey treated them the same way terribly racist people were treating people from Guatemala that sneak in here.\nIt's the same kind of thing.\nYeah.\nThen after a while they sort of integrated, and now I'm white.\nYeah.\nNow now you're just a white person, and I'm just a regular white.\nBut it's easy now in like in big public narrative and stuff to it's e it's a lot easier to accuse you and 30 other different nationalities of people who were all very culturally different and unique and just call all of you white people and then pick the worst thing that one of those nationalities did and just cast it among the whole group.\nBut it happens with that with every ethnicity, every identity.\nThe go the goal is to like put everyone in the world in one of three or four buckets and then hopefully figure out how to just put all of them into one bucket eventually.\nIt's like it's just m it's just it's so much easier to control two or three different types of people than it is 30 or 40 or 100 or a thousand, you know, which is also I think why they never fix the problems that ail our inner cities.\nThey they want to keep that conflict.\nI really believe that cuz if somebody wanted to have a better, stronger economy, the first thing you would do is you want more people in the workforce.\nSo you'd want less people that are disenfranchised, completely out of society, felons, all that stuff.\nThat doesn't do anything but cost the country money, right?\nUnless you have private prisons.\nNow in private prisons, those people become a business, and then that business contributes to the escalation of laws, and they want to make sure the laws stay in place because that way their business is always full.\nThey have plenty of customers.\nTheir customers are human beings that they turn into batteries to generate money.\nThat's what it is.\nIt's like those people, every person they have in there, they get more money, which is wild.\nIt's wild that we allow that.\nBut then it's also like keeping a certain amount of crime in certain areas ensures that you're always going to have debates over law enforcement.\nYou're always going to have conversations over disenfranchisement.\nWe need DEI.\nWe need this.\nWe need quotas.\nWe need to hire more people of this or of that.\nIgnoring the fact that these a lot of these things, especially with universities, are the most racist, especially towards Asians.\nThey're racist as [ __ ] towards Asians.\nThere's lawsuits about it.\nHarvard is is that still going on?\nThe Harvard lawsuit where they specifically made their application process, like the whole acceptance process, more difficult for Asians cuz they were kicking too much ass.\nThey had too many like Asian people that were willing to [ __ ] work their ass off, study 12 hours a day, get straight A's.\nThey're like, man, there's too many of these folks.\nWe got to make it tougher.\nWhat did they do to make it more difficult?\nSpecifically, they attached a bunch of things.\nI believe the argument is they attached a bunch of things like social stuff like how much do you uh engage in, you know, activism?\nHow often are you involved in you know social activities on campus?\nYou know, what other things are you doing other than just pure academic work?\nThey're like trying to slow them down.\nThey're literally trying to slow them down.\nYeah.\nUm, that's another great example too like uh like even just to even just to that they can blanket Asian like that as such a like like it's Indian, it's Chinese, there's a lot of but yeah, people that come from a hard place are willing to work hard.\nThat's the difference.\nAnd the the problem with meritocracy is that some [ __ ] will go for it.\nAnd if you get a whole country of people going for it, that gets scary for the people that just want to take naps.\nIt's the same psychology that goes in like in a lot of the smaller Appalachian towns like um like where we where we recorded was really close to Bramwell, West Virginia.\nBut if you look at like even if you look at Bramwell, West Virginia and their recent political history like the last mayor they had, she she embezzled money from the town, and there was like you know and this is in a very small t like so so government corruption exists like everywhere, and it almost is like maybe in those big cities.\nI I I understand definitely that I think things are intentionally neglected like to create chaos and to create this like you said this need for more resources and more but it's also just that maybe a lot of those people that are in positions are just very spineless and self-centered and like they don't even care that people are dying in their streets.\nThey're worried about the the the money that can be made and the ego and the power of it.\nIt goes back to kind of what I said in that arc speech about lack of leadership.\nI just see that like if we had people in big cities or in small Appalachian towns that had like a real backbone to them and like and and had they were in a real position of like leadership where they wanted to fix things that a lot of that stuff would get addressed and covered.\nBut we just don't have the right people in power maybe even is what it is even in even in state government.\nThe right people don't run.\nThey don't want that job, man.\nThey don't want that smoke.\nThey don't want people attacking them.\nThey don't want any of it.\nThe right people are the people that don't want to be president.\nIt's almost It's almost like they've made these positions only appealing to people who are like sort of criminals.\nSociopaths are criminals.\nYeah.\nReal like who the [ __ ] wants to run everything.\nYou got to be crazy.\nI don't even like running my whole house.\nI don't like having employees.\nIt's too much.\nIt's too much responsibility.\nWhat do you think would happen if just some normal people ran the country though?\nLike just some average Joe.\nLike what if me and you just went and ran the What if me if you ran for president?\nWhat would happen?\nThey would be get killed.\nWould you put a [ __ ] convertible?\nThey would definitely shoot.\nThey would definitely be able to hit my big head.\nThat's for sure.\nThey wouldn't My head's not that little either.\nYou want a cigar?\nYeah, let's do it.\nGet on that big dog.\nWell, the I smoked a cigar with a guy one time that\nWhat happened?\nThis is the second cigar.\nIt ended up all on the internet.\nYeah.\nThis is your second cigar ever?\nYeah.\nHere.\nI keep it keep it running for a minute.\nYeah.\nAnd just pull on it.\nThe the real cigar guys, they want you to do that first.\nShe kind of baked the outside.\nLike it's a like it's I'm in high school and it's like a fat joint.\nOh, imagine a joint like this.\nI guarantee you there's some people out there, some rappers rolling blunt blunts.\nYou got to do it this way or they get mad at you.\nYeah, this is really good.\nYeah.\nWith how much your privacy is being invaded online, VPNs are no longer just a nice thing to have.\nIt's a necessity.\nSome people think, \"I don't need a VPN because I have nothing to hide.\"\nBut that's exactly what data brokers want you to think because their profits depend on you having nothing to hide.\nWhat you do online is your business.\nAnd if you want to keep it your business, you need ExpressVPN.\nWith ExpressVPN, 100% of your online activity travels through secure encrypted servers.\nIt hides your IP address so no one can use it to track and sell your online activity, and your privacy is restored.\nExpressVPN is also a great tool to secure your sensitive information from hackers.\nIf you're using public Wi-Fi, like at a hotel, airport, or coffee shop, anyone can hijack your connection and access your most sensitive information.\nWith ExpressVPN, you know that your passwords and banking info are safe and secure.\nExpressVPN is the number one ranked VPN by the experts at CNET and The Verge.\nAnd right now, you can get an amazing deal.\nThey're offering four extra months free if you go to expressvpn.com/rogan or tap the banner.\nAnd if you're watching on YouTube, you can get your four free months by scanning the QR code on screen or clicking the link in the description.\nShout out to Foundation Cigars.\nWell, hey, I did I did smoke I smoked half a block of black and mild with um Chris Davidson from the Davidson brothers while we were on tour one time.\nSo, I guess that counts as as a cigar.\nKind of a cigar.\nLike a Swisher sweets.\nThey kind of count as cigars.\nI have a talking about Swisher Sweets.\nI have a friend of mine that I ride side by sides with a lot um named Jeremy, and that's all he smokes are Swisher Sweets.\nAnd that's like his anytime I see him, I'm like, \"Yo, what's up, Swisser Sweet?\"\nSo, I ended up hitting him up on Instagram, Swisser Sweet.\nAnd I said, \"Hey, I got a friend of mine.\"\nI was like, \"Will you just send him some merch?\"\nAnd and they totally did.\nLike he got this whole like he got like all these shirts and hats, and he's the only guy I know that smokes them, but he's like all day smoking them.\nHe's a um he was in the Marines and stuff, and he's he's out now and just like rides a boat around all day and hangs.\nHe's like lives his dream life now and smokes Swisser sweets.\nSo I wonder what percentage of Swisser sweets get sliced open for blunts.\nIt's got to be 50, right?\nJamie higher.\nWay higher 60% or so.\n75%.\nJeremy's the only guy I know who really smokes them without putting weed in them or anything.\nHe like he just likes them.\nYeah.\nHeck yeah.\nDoes he inhale them?\nYeah, bro.\nRon White does that with them little tiny Ron White.\nThose little tiny cigars.\nWhat are those things called again, Jamie?\nWe have a bunch of them.\nYeah.\nI don't know.\nLike little cigarellas or something.\nYeah, he brought me a case of them.\nDid I ever tell you the my Ron White story?\nNo, I don't think so.\nDid you?\nI'm going to mess it all up, but that's okay because that's what the that's what this is for is to mess stuff up.\nSo, it was the night we recorded Gosh, my head is like spinning now from this thing.\nThis is crazy.\nUm, the night that we tobacco the day that we recorded the podcast that night is when we went to the mothership for the first time cuz Tom Segura invited me, and right, so we're sitting in there in the green room.\nRon White's there and Tom and um a bunch of people, William Montgomery, and I got to meet all these really cool people that night, and so Tom was like, \"Man, you ought to get up at the end of our set and do a couple songs.\"\nAnd we only had one guitar, and I really wanted my guitar Joey, you know, the guy from he's in the Scornville video, Joey Davis.\nI wanted him to get up there and get to do it with me.\nAnd Ron's like, \"Well, I got a guitar in my house.\"\nBut and dude, he's going to he's supposed to be getting on stage to do a set in like less than an hour, you know, 45 minutes.\nSo him and Joey get in his car, and they run every red light from his house to back and go and get Ron White's guitar, and that's what we used for our second 15 minutes away.\nThat was such a risky move.\nYeah.\nLike he said they flew there and back.\nSo you guys performed on stage at the mothership.\nThat was the first time a musical act had ever performed there supposedly.\nYeah.\nYeah.\n100%.\nAnd except for back when it was a musical venue.\nYeah.\nI mean Steve Rayvon performed.\nYou saw the photos that we have in the the tunnel.\nStevon performing there.\nI think it was 83 he was there.\nI think if um I think I think even by the end of this weekend we will be able to really have a good blueprint for sound in there again.\nLike it's it's a small room, but I think it would just sound you could really have an immersive listening space for people to like just such a cool spot to maybe do music now and Oh yeah.\nNo, I think it would be a great spot to do music.\nIt's just we're always packed with comedians, you know.\nWe'd only do it for someone like you for It could be a lot.\nYeah, it could be like a every once in a while like I love the idea of it being like a live recorded thing that cuz I my favorite music to listen to is the live version of almost anything anyway of people, and it would be cool to go back and I mean our plan with this we're going to record we'll record Friday and Saturday night, and my plan is to put out some kind of mothership live at the mothership and like have some of the money go back to the humane society.\nOh, that's awesome.\nUm that's beautiful.\nWe're going to record it and just see what h see what happens.\nBut even if we just get a couple songs out of it or something and\n\n\nPut them out, and oh, that's badass.\nBut yeah, I like that.\nI really like the Austin Humane Society.\nThey, um, I was looking at all their... they got like some really funny dogs and stuff on there, too.\nBut I, uh, I think it'd be... I think it's cool getting to do something with them.\nYeah, I can't go to those places.\nI would have a 100 dogs.\nThey got this one dog on their website.\nI should have... I should have sent it to you, but I don't know.\nMaybe Jamie can find it.\nBut it's like there's this one, like, older dog.\nI think he's a Chihuahua or something, but he's got this real funny name, like Buddy or Poppy or something, but he's like the most... like he doesn't have any teeth.\nHis tongue's hanging out.\nI was like, that's my... I could just take him home with me.\nBuddy or something.\nI've had a bunch of rescue dogs in my life.\nUm, there's a thing... there's like a relationship you have with them that's different than any other dog.\nLike they... they're so... they love you so much.\nThey're so happy you rescued them.\nLike they know that you rescued them.\nWhereas my dog Marshall, he has no idea.\nHe's like living the best life.\nHe's just like, \"Everyone's my friend.\"\nYeah.\nHe has, uh, he's never growled at a person in his life.\nHe's nothing but sweet.\nThink about how lucky you got to be to be Joe Rogan's dog.\nThat's pretty cool.\nLike, what's the odds of that out of all the dogs?\nHow lucky am I to have a dog like him?\nYeah.\nHe's the best dog ever.\nYeah, I know.\nHe's like a little human.\nHe's like a human.\nLike we have conversations.\nLike he... he knows, like, not just words.\nHe knows, like, when I'm saying something, like what to do.\nLike he... me and that dog are like locked in.\nIt's wild.\nHe's the best.\nHe's just all love.\nLike for everybody that comes over.\nLike when people come over the studio and he's here, he just does a circle.\nHe's like, \"I'm your friend.\"\nAnd then he licks you.\nI'm your friend.\nAnd just goes around and he sees you.\nThe first thing he does is flop on his back, like, \"I know you want to rub my belly.\nCome on.\"\nYeah.\nHe's just so used to being just loved on.\nYeah.\nI just got a, um... well, I had, you know, I had the three... I had three dogs, and then I lost my white shepherd, like, right after we got off a tour.\nHe got bone cancer, and he was gone within, like, a month or a month and a half.\nYou know, it's a really important thing that we should probably tell people about right now when we're talking about cancer.\nStop feeding your dog processed food.\nI know it's expensive, but if you can get it, get yourself your dog real food.\nThere's companies like, um, Farmer's Dog, that's what you use, right?\nFarmer's Dog, and they'll send you, like, real food, and you feed your dog real food.\nIt's like real human meat and vegetables.\nYour dog will be way better off, just like you would be way better off.\nAnything that can sit on a shelf for 6 months and not rot is not good for you.\nYeah.\nIt just sustains them, you know, and then, you know, obviously dogs are running around drinking out of puddles and who knows what toxins they're exposed to.\nI need a lot of, like, horse... and stuff, too.\nThey're obsessed with it.\nBut they, um, you get... but you're going to get a healthier dog if you feed them real food.\nThat's all I'm saying.\nNot saying it's a cure to all ills, but man, it fixed my dog quick.\nMarshall was starting to get a little chubby, and we're trying to lessen his food, but he was always hungry.\nAnd I was like, \"This sucks.\"\nAnd then we found out the company that I'm using is Mave.\nM A V.\nAnd they sell you frozen food, and he eats it frozen, and it's just meat and vegetables, and... and he, like, loves it, and he gobbles it up, and he lost the body weight.\nHis coat looked better.\nHe had way more energy.\nI'm like, of course he's eating real food instead of eating some processed... that's filled with preservatives.\nHe could sit on a shelf for, like... if you only ate protein bars all day long and nothing but protein bars, you'd probably get sick.\nHow was that thing just sitting there?\nLike, how... how can you just live off of that?\nPlus, you got... you got to get tired eating the same thing every day.\nYeah, that too.\nYeah.\nLike at this point, I mean, I feel like for your dog, he might as well live a pretty cool life.\nUh, he's got, you know, he's Joe Rogan's dog.\nHe can't just be eating regular dog food anyway.\nI, uh...\nPeople don't know, though.\nThey think dog food is what you give dogs.\nThat's the problem.\nLike, they... they need to understand, like, dogs are just like any other animal, like human beings.\nWhat they eat has a giant effect on their overall physical health.\nYeah.\nYeah.\nI... I've been feeding mine eggs.\nWe've got a bunch of lay birds now and meat birds and stuff, but they'll... they just eat raw eggs.\nSo, how long do your meat birds live before you whack them?\nUm, so we... I just... I've got some now that are about two weeks old, and they'll be gone, like, they'll be gone before it starts to cool off.\nIt's quick.\nIt's, um... I want to say, like, two and a half months with them.\nThey get... they get to the point where they get so fat they actually can't hold themselves up anymore.\nThat is so crazy.\nYeah.\nCuz I don't have meat birds.\nI have egg laying hens.\nAnd these little ladies just run around all day long.\nLet you run loose.\nYeah.\nYeah.\nYeah.\nI do... I do the chicken tractors, but then I will let them out during the day some, too, just so they can run around.\nBut yeah, it's good for them.\nMakes the eggs healthier.\nBut they're hilarious to watch, too.\nThey're just great.\nMy friend who runs, uh, he... he has, uh, meat ones, and he said he waits until their legs break, and I go, \"What?\"\nHe goes, \"They get so big that their legs break, and that's when you kill them.\"\nI'm like, \"Jesus Christ, what did we do to these chickens?\"\nIt's kind of... it's kind of sick.\nYeah, it is totally sick, cuz I'm seeing my chickens that are years old just running around, and these chickens get to be two months old and their legs break from the weight of their bodies.\nYeah.\nYeah.\nYeah, it's kind of depressing, but that's why at least in their short life, I try to let him have... I let him get us some sunshine and run around and read stories to him at night and all that.\nAnd that way it's not been so bad.\nThat way it doesn't feel like I'm just a, like, a horrible dictate, like a chicken dictator or something.\nImagine the amount of chickens that get whacked in this country every year is crazy.\nYeah.\nAnd and honestly, raising birds in your yard is so much better than buying them from Tyson or something like that.\nOh, so that's a regular chicken on the left from 1957.\nAnd then by the time 1978 rolled around, we got them pretty fat.\nIt kind of looks like... it just looks kind of like what happened with all of us from then from back then till now.\nAnd you know, probably no coincidence.\nWe're all eating terrible food, too.\nBut I think there's something going on with their genetics, too.\nI think they... Look at that thing.\nThat's crazy.\nLook at the size of that butter ball.\nYeah.\nThat looks like a soccer ball.\nIsn't that nuts?\nThat's nuts.\nThat's a chicken.\nThat is insane.\nLook at that one sitting there in a ball.\nLook at that one that's in a ball.\nLook at that.\nThat is bananas.\nWow.\nYeah, they're still my favorite.\nI've tried so far.\nI've tried, um... I do guinea birds, turkeys, and we've tried... tried a few different types of chickens and stuff, but, um, turkeys overrated.\nTurkey's good.\nThey're funny.\nOh, yeah.\nTo eat, they're probably overrated, but they're really funny in person.\nThey're good.\nThey're good to eat if you eat them right after you get them out of the oven or if it's going to be on a sandwich with a bunch of other on it.\nOtherwise, they're dry and boring.\nIt's a weird bird.\nIt's a bird that, like, somehow or another we... it became our holiday bird.\nYou know what I mean?\nIt's very strange.\nThey make this real guttural noise.\nIt's like, um... it's like a vibration more than a noise.\nBut the males, they have this, like, crazy, like... I... I can't... I don't even know how to describe it, but it's like that... it's with... it's a noise they make internally that you can hear.\nIt sounds like, um... sounds like a UFO.\nIt sounds like when you're getting sucked up in a UFO or it's just crazy noise like that.\nYeah.\nOh, really?\nBut I like they're like dogs to me.\nI've got a couple, Timmy and Tommy, and they... they run around the yard.\nYeah.\nWell, I did Timmy's... now Timmy's in the freezer, but we still got... we still got Tommy.\nSo, Tommy's still your friend.\nTim...\nBreakthrough on the birds domesticated.\nAnd then Jean.\nAh, there it is.\nThat played a key role came in 2010 with a study of the genomes of eight different populations of present-day chickens from around the world.\nResearchers found they all carried two copies of one version of a gene called the thyroid stimulating hormone receptor, which apparently set in motion changes that plumped up the birds.\nThis dominant version of the gene or alil had swept through all the domesticated chickens, regardless of whether they were boilers... broilers, rather, bred for size or strains bred for laying many eggs.\nAlthough the precise function of the gene is not known, it regulates metabolism reproduction.\nSo probably stimulated chickens to lay more eggs year round.\nSo the big ass chickens that lay more eggs.\nIt started off... it's from a decree from a pope a thousand years ago.\nWhoa.\nBan on four-legged animals.\nWhat?\nYeah, they got tough and banned meat from four-legged animals on fasts.\nOh, on fasts, which numbered 130 days out of the year?\nDamn, 130 fasts.\nWhat were they doing back then?\nYeah, you couldn't eat, like, you had to fast all of Lent, which is 40 days.\nThat's like the Christmas Easter fast.\nYou probably had to do it again around Christmas.\nBut when they say fast, but you could eat chicken.\nYeah, they didn't... that's not a fast or fish.\nThat's... Yeah, the Lent thing when I was a kid.\nI remember that.\nI remember.\nI don't know.\nI can't fish on Friday.\nI don't think that the Catholic Church... I just can't imagine the Catholic Church ever coming out with some kind of decree that just doesn't make total sense, though, you know, for everybody to follow.\nI don't know.\nForever.\nI'm sure it's some... I'm sure there's some... Yeah, forever.\nI'm sure there's some reasonable explanation.\nYeah, they definitely have it dialed in.\nYeah.\nIt's not like churches a thousand years ago would... would ever do anything that didn't make a lot of sense.\nSo, well, I think back then, when did they stop being allowed to have wives and... When did that happen?\nLike, when did the Catholic Church put a ban?\nLike, when did they make it so that everybody had to be celibate?\nBoy, what a stupid idea that was.\nYou want to get people com... completely disconnected from society and sexually insanely repressed.\nJust you give them salt peter and tell them they can't beat off.\nIt became canon law in the 11th century.\nThey later reinforced at the Council of Trent 1545.\nSo I bet there... sounds like there's 300, 400 years of a little slippery times.\nWhat do you think?\nThis episode is brought to you by MASA Chips.\nDid you know that all chips used to be cooked in tallow up until the '90s when big corporations switched to cheap processed seed oils?\nAnd today seed oils make up 20% of the average American's daily calories.\nWell, MASA decided to do something about it.\nThey created a tasty and delicious tortilla chip with just three ingredients and no seed oils.\nJust organic nyx tamalized corn, sea salt, and 100% grass-fed beef tallow.\nMasa Chips is beloved by tens of thousands of customers, including me.\nI buy them.\nThey're... they're awesome.\nThey've been endorsed by leading health and nutrition experts like Ben Greenfield and Gary Breco, who have appeared on this show as well.\nReady to give Masa a try?\nGo to masachips.com/jre and use the code jre for 25% off your first order.\nUltimately, what is the motiv?\nIt's all control, obviously, but just... it's crazy to think about all the things that, you know, the church at one point in time, the church was almost like the power structure.\nThey were like the government for a long time, you know.\nYeah.\nFor Rome.\nYeah.\nYeah.\nI mean, they had immense power.\nThe... like the Pope would decide whether or not armies were going to be sent places.\nYeah.\nIt's nuts.\nYeah.\nAnd if you look at the Vatican, you go, \"Oh, this is what you guys did.\nYou stole everybody's art.\nThey have so much art.\nLike, how did you get this?\"\nYeah.\nHow did you get billions of dollars in art?\nI mean, it's kind of cool.\nI love the fact that it's there and you can visit it.\nAnd you should visit it if you've never been to the Vatican.\nIt's bananas.\nIn a way, it's like there's always been somebody trying to use a moral high ground to control other people.\nLike now it's the opposite, right?\nIt's like now it's people... now it's like the people opposite of church that are sort of like trying to control people through this moral authority of, like, this is what's right and like this sort of new society that we have to live in where everything has to be comfortable and nobody's allowed to be offended and we're not... and it's like all this... that's like the same authoritarian psychology that was in the old church.\n\n\nIt's like this is the moral, you have to follow this because it's the moral high ground of, you know, you're not allowed to speak it. It's like it's always somebody trying to control somebody else with this virtuous bunch of propaganda that and it. Yeah, it's like I was talking, you know, my most of the people on my team, I say most, there's only really four of us now, like in my music business, but two of them are from Ireland and they were and my tour manager was telling me about like growing up in, you know, growing up in Dublin when he was younger. Um, I guess like back in the 70s or 80s and the um, like just just the stigma within the church and all the like so much stuff that the church was doing wrong that would get kind of covered up and brushed to the side and it's just cra, it's really crazy when you read into all that like how like how much corruption existed back then. You know, we, it's like now it's now it's easy to point to corruption in government and in society and everything else, but it's not like the church is more dead now than it is corrupt, I'd say, but back then it was just like this power hung hungry thing, you know, that and that to me, that's not real church. That's just like I said, that's just government or a regime using church as a, you know, using God as a way to control people. But it's a lot different than than what church should be or could be. For sure. I mean, that's it's that's just a function of human beings when they get in power. Human beings when they get in power, they want more power. Like if you're in the automo business, automobile business, and you're making cars, you want to make more cars. I want to make more cars. I want to sell more cars. Got to sell more cars. If I'm in the power business, I want more power. I don't want this amount of power. I want more power. These people trying to take my power away. I want extra power. The best way to keep them from taking my power away is to get more power and get it so that they can never take my power away. You know, lock it down. Make the elections [ __ ]. You know, make it like Russia. Hey, Putin won again. Everybody clap. Did you have you seen that video that went around recently of, I think it was in Romania, but there was like a overthrow that happened in a day. There was like the It was a It was from back in the 80s. It was a I think it was like a It was a dictator that it was over Romania, I believe. I don't know. I'm I'm not on the internet a whole lot anymore, thankfully. But um, I remember watching a bit of this video where this is like a Romanian dictator who had he had been in power for like 20 years and had done a lot of oppressive stuff, but overall was like maintaining power. And then at some point a police officer or a military official or something shot, I think like a like a preacher or a pope or something and the the the dictator dude took the side of the police and it sort of was like a cultural shift and basically like he went to give this big speech and all these people showed up and they had applause playing over loudspeakers, but really the crowd was there to like mob and within like a day they had like taken the whole government over, the whole military turned against them. It was a big video that just got uploaded about it like maybe a month ago. I think it was Romania, I believe. But um, it was so quick. It was like he went from being in this position of power and like ruling over everything and having just just extreme wealth and the whole military at his disposal to to everyone turning on him and he was publicly executed. I think the day after that speech, but that was just something I watched. Here we go. Yeah. Executing a dictator. Open wounds of Romania's Christmas Revolution. Whoa, they did it on Christmas. Damn.\nDamn.\nWow. And there's a video on this. Yeah, there's a video on YouTube that that somebody sent me that I was watching through. It was just it just showed out. It just showed though going back to like if enough people have their minds made the same way, they can just pretty much do anything. Wow. But um, I believe it was with it was within like a two-day period that all this happened. He went from being in power to being publicly executed and they held a elections afterwards and like and I don't know all the history of it. I know very little, but it's just something that seemed really interesting to me that I've never I was never taught this in school or anything. I know that. But of course, I didn't pay a whole lot of attention while I was there either. So maybe I maybe I did get taught. I don't know. There's been so much war in that part of the world, man, for so long. For so long. It's like baked into the ground. The crazy [ __ ] that's going on in Ukraine right now. Have you seen that they uh they're flying these drones that you can't jam and the way they are, they have like miles of fiber optic cable attached to them? Yeah. This is so crazy. They're like fishing. They're like fishing with a drone. And now birds are making like nests out of this fiber optic stuff. They're picking it up like, \"Oh, this is perfect. Make a little nest with this shit.\" You see how they got those drones in for the attack on the planes recently? What did they do? They drove them in in trucks, right? Yeah. that they were like I don't know if buried is the right word, but they were like secretly in the trucks and then like they all came out at once or something like the roofs opened up of these like log cabins or something. They all came out and they all went out and attacked all the sheds. There were sheds loaded on the trucks stuck around the. Pretty [ __ ] ingenious, man. And they said it took like a year and a half to come up with this plan. This will change war forever. Forever though, I guess. I mean, artificial intelligence will too. I'm reading a book about it right now. um, a fiction book, one of the Greyman books um that is specifically about uh using autonomous weapons.\nIt's um, the chaos agent by uh Mark Grainy. It's uh it's about a guy who's this uh billionaire who develops this autonomous weapons weapons program. But they're doing that. They're doing that right now. And we don't know like how advanced China stuff is like, but we know their drones are insanely advanced. Like their drone shows that they put on. They they just put on another one recently, like the largest ever drone show. And you watch these coordinated things in the sky that are creating images and you're like that 100% could be a weapon. Like that thing can you can get that thing to be so precise. They coordinate together. All you have to do is like put a suicide drone. Put like look at this thing. Look at these things, bro. These are drones.\nHow nuts is this? I mean, that is [ __ ] bananas. Look at that.\nI mean, it's crazy. I've heard, you know, this is all just generalization stuff, but I've definitely I've heard people make pretty compelling arguments about like, you know, all these sort of like prophetic visions of the end of times, all the stuff in the sky and all the imagery and all that that a lot of that could be. I don't I just I I see a time coming very soon where the where warfare is conducted with these drones and also with like probably ground machinery too. Like you see they've got Tesla bots and other variants of that that are able to catch tennis balls and organize groceries and these things are all fed off of artificial intelligence which knows everything about all of us collectively. It sees where we go and what we do and what we say and what we shop for and what we look for and how we drive. And it's like this almost like this very godlike thing. And I don't think that it even matters whose AI it is. If it's China or ours or some private company, I think it's like at some point it will just be the thing. We won't It won't even be China's AI anymore. It will just be Yeah. It'll say, \"Fuck you, China. You know, we're taking over. We don't believe in countries. We believe in the hive mind.\" How do you stop that? Like how do you like it goes into it goes into industry and creativity and almost everything almost everything that a human can provide out outside of very select few things can be emulated and replicated and done by it. It makes us practically irrelevant in the eyes of in in a lot of ways. It doesn't make us irrelevant in art because you're always going to want art from a person. You're always going to want art. You're always going to want paintings from a real person. You're always going to want music from a real person. And you're always going to I don't know though. Like I I think with I I I think AI is already like deeply ingrained in music. I don't think I can't\nI don't know. I would bet I'd bet a lot that most of the new big song, the big hot songs that get written and just the big I think AI drives all that. I know for a short period of time I used a social media company in Nashville. There was also a period of time that I used a management company in Nashville and both of those girls I worked with at both of those companies who were helping me with social media stuff. They even had AI like trying to write my captions and stuff and I would always just like it was always the most dumb sounding stuff, but it was like if there they would take pictures from after a show or something and they would want to make a post on Instagram the next day that says, \"Oh, had so much fun in this town. It was I'll never forget it. Can't wait to see you next time,\" and it was just like this little they had like a little thing, but it it pre-wrote all these based off of like how I wrote in the past and stuff and it's weird how um I it goes back to what you said about most of what's on the internet isn't real anyway, but I think in music AI is much more prevalent than we realize. I just think it's like kept in the I don't people aren't going to say that they're using it, but I think like in the big these big songwriter circles and things where they have to generate you have to generate 20 or 30 songs a week and like there's all this pressure. I mean like and that's your job and you're like, \"Oh my god, what am I going to do? Like, you know, like I can't go back and live with my parent. I got to do.\" I don't know. I just I don't see how people aren't it's in almost people use AI in almost every job now. I know like people who are in sales who use it to like help them manage their customer bases and who they're going to call on and what they're going to just I don't know. I think it will become I think it's already become ingrained in us. We're already so addicted to we're so reliant to technology. It's it's pitiful, you know, just like how hard it is to walk around without a phone, you know, we're integrated. Even even with when I had periods of time where I knew I had months off and did I would always at least I got to the point where I I weaned myself down to like this. I bought a flip phone from Walmart that still runs on a Verizon SIM, but that's that's what I'd carry and two or three people knew my, but even then I always felt like I at least had to have a flip phone on me in case like what happens if you're out in the woods and break your leg or I don't know where like, but they are now a part like those phones are a part of us. We don't go anywhere without them. We feel naked. No phone. We feel vulnerable without them. So I know you really do like if you go for a quick walk without a phone, like, \"Oh my god.\" So when the time comes when it's like will there if there even is a definitive time, but it's like when we have to choose between integrating with AI and not, most people are going to do it. Most people will just immediately submit and be a part of it and be maybe even excited to be a part of it. It probably won't be a decision that you're allowed to make it. It's probably something that's going to be if you want to function in society, you have to integrate like we talked about in that text about how it feels like we're in an alternate dimension and it seems like there's these like things coming. You know, it's like it does it does it also it is just because things happen so fast and chaotic that we can't really keep up with anything. One day the submarine collapses and the next day this other crazy thing happens and then, you know, I don't know, it's just like it's so hard to keep up with what anything of what's really going on. I think the problem is that we have to start having people gather together again and hang out and not just make all of our hangouts digital because the systems like you said there's bots and algorithms and marketing approaches and psychology that's just deeply rooted that goes into like just the way we fundamentally communicate now as societies and just globally, like we all just talk on I mean, gosh, like I've used this example before somewhere talking, but it's like I think about back when I was in high school, like my high school girlfriend, you know, we would have some trivial argument about something. There was no way that me and her were going to text and figure out how to fix that. And now, you know, like and that was a high school relationship, like that was over something stupid. It's like real world problems. You can't fix just texting. And I don't think we can fix all this [ __ ] on X and Facebook and all that. I think it's like it's I think people just have people are we're almost to the point now where we prefer socializing on the internet because it's it's almost like our minds have become more adapted to think that way. But it's but it's we're we're in this digital world chasing and emulating all of the things that we're that are that we have this void from from not having in real life. Like I don't know. It's it makes it very complicated to fix anything when we're the only way that we can we have this amazing intricate English language where all these words can mean all these different things and it's so easy to put everybody together in a digital space with AI and bots and manipulation and and algorithms and big companies and how do you fix all that in that space? It's just like it's you'll never It's like in a house we're just in a house of mirrors, you know? Yeah. You you're you're supposed to not engage. That's what people need to stop doing.\n\n\nBut the problem is the consequences of the actions of the rest of the world do affect you if they're big, and so you worry about the big ones. So you pay attention. So you got to pay attention to the bad news of 8 billion people, which is just unsustainable. And it's also this ability to interact or not interact as you choose all throughout the day. Hey, like you don't have to be invested in a conversation. If you and I are going to have a conversation and you ask me about something and I start to answer and I just wander off, you're like, \"Well, how rude.\" But on the internet, that's normal. Like somebody posts something, somebody has a response an hour later, and nobody cares. It's like, \"I guess he was busy,\" you know? It's normal because you're engaging and not engaging. It's very unhuman. All of it is unhuman. And it's all like constant. Even though if you think you're immune to it, there's this constant input of other people's thoughts into your own that makes you foggy. It gives you, like I was talking to Sugashan Ali about it once, and he said, \"I get a low-level anxiety just scrolling.\" I'm like, \"Yeah, right.\" Like, what is that? I think it's on purpose though. That that's captiv that keeps you, it keeps you engaged though, you know? Yeah, but I don't even know if it's on purpose. I mean, I think it's just they figured it out along the way that people get engaged like that. Like that's why when you open up Tik Tok, it immediately starts playing you things, like you're you're on the hook right away. The Instagram, you got to choose. Like sometimes you might get a picture of someone's dog, and then you scroll up and it's a music video, and then you scroll up and it's a guy getting assassinated, and it's and you you get to choose. You know, with Tik Tok, they just start hammering you. Even with Instagram, it seems very flashy. Like there's always stuff, you know, and there's always sex always ends up somewhere in it. Like something gets popped up or whatever, and you just it's all for engagement, and that's your attention is what's worth so much money, which is so strange. It's so strange. Your data and your attention. Nobody thought about the data part. Boy, if we thought about the data part and they set up different regulations back in the 1990s when AOL first burst onto the scene, if they realized like data is going to be one of the most valuable things, and tech companies that do nothing but offer you free email and a free search engine are going to be the biggest [ __ ] companies in the world. And it's because of your data, and they're going to be like siphoning off your data without telling you about it. They're even going to be lying about it. They're going to be running like little secret things where they're snatching up your contact list and snatching up your email and all your friends and trying to get them to buy [ __ ]. It's like, wow. Yeah. Well, it's it look Yeah. I mean, even just that's what I mean, even just the little bit of access I have to my fan base and like the reports that can be ran on like what they do and what and who they are, and like it's seeing seeing it from that side is just it just really um it goes back like I said, just saying that I I think we're for right now in society, our job is to feed this machine, and so and it know, like it just knows entirely too much about all of us, and that's very important in every aspect. And whether it's in like comedy, music, um any kind of pop culture, like everything, all of our reactions and behaviors to what is presented to us on these platforms only makes it refined down even further. And they're able to see like your lookalike audiences and what they look at and where they shop and what they like and the what their retention is on certain videos that have this certain type of thing. And it's like this whole just it's a lot of psychology that goes into it that people don't realize. It's very easy to download the app and get on there and look and but you don't have to pay attention to it. You could just be yourself. That's also possible. That's I just couldn't find a way to be on there and still um the only time I'm ever on my profiles is if I'm with Draven or somebody and we're like looking through comments together and replying to stuff or doing things, but I don't have any of I haven't had anything logged in on any of my devices since last November. Yeah, just keep doing what you're doing. Like um that's the the thing that I was saying about what AI can't recreate in music. Yeah, I'm sure there's AI songs in. There was a great AI song by Drake that they made that they had to get removed, right? Didn't they don't they remove those?\nI think so. Um but people still want to hear the real [ __ ]. Like the reason why your song became so popular was because you could really see it's just a guy with a guitar like standing Yeah, you know, grass behind him and [ __ ] and a dog in the background. there's a there's a thousand more people that are way better than me that are in that same space. And I think I think my dream of this long term is to figure out how to like like how do you get all those people into the limelight? like like what I've been working on since I guess you know the one important thing to to drill home to people too as a follow-up since the last time we were here. It goes back to that first conversation we had. But you know you remember I was arguing that I really wanted to put all the money from Richmond into a nonprofit and not ever even touch it cuz I was just I didn't want all that. I felt like it wasn't my money. I felt like all those people went out of the way and supported me and like blew all these other huge songs off the chart and I just I wanted to. So, and then you said, \"Well, no, don't do that because nonprofits are sketchy and people are corrupt and like just keep the money yourself and then figure out how to do good with it.\" And that was the biggest thing I walked away from that first conversation we had. And so, you know, now it's like that's the one thing I do want people to know too though is like that Richmond money and everything, it's um it's went to good. It's went to do a lot of what I think will be in in the long run a lot of important things. I've been buying most of it's went towards buying land and stuff, but I've got this whole kind of crazy thing. I'm like a just a way for people to unscrew their minds um to get reconnected into nature and um You going to be a cult leader? I was thinking about it. Yeah. Yeah, I was thinking about I might I might try to get with Vermin Supreme. He's got this cool idea about everybody having a free pony and stuff, and I think that would work out. You ever seen him? Vermin? No. Who's that guy? Vermin Supreme. Do you know who he is? He runs for president. I think he's from uh Connecticut, maybe. He runs for president every time. He wears He has a big boot on his head. What? Yeah. How do I not know this guy? Yeah. Yeah. You He's hilarious. There's a If you go There's a video of him from that New Hampshire. There's a video of him from that New Hampshire primary. How do I not know about this guy? He has a boot on his head.\nHe his Yeah, he says he'll take he's he's going to take everyone's guns away, but he'll give you ones that are better. Says he runs on gingivitis and zombie power. He uh Yeah, he has a mandatory toothbrushing policy. And he he'll say things like, \"Well, no, you know, it doesn't have anything to do with the toothbrushing control camps and the the dental hygiene authoritarian center or I don't know. He just Give me some video of this cat. Oh my god, I got the best one of him is from that new is from that Connecticut um that one like where he's wearing the yellow jacket wherever that video is. That's a There you go.\nVermin Supreme. Thank you. is has been eroding the gum line of this great nation long enough and must be stopped. For too long, this country has been suffering a great moral and oral decay. Spirit duck says, \"A country's future depends on it on its ability to bite back. We can no longer be a nation indentured. Our very salivation is at stake. Together, we must brace ourselves.\nAs we cross over to the bridgework into the 23rd century, let us bite the bullet and together make America a sea of shining smiles from sea to shiny sea.\nNow, friends, some people will tell you that this mandatory toothbrushing law is about the secret dental police kicking down your door at 3:00 a.m. to make sure you've brushed. Friends, it is not. Some will mention the dental re-education centers or the preventive dental re-education facilities. It's about none of these things. It's not about the government issue toothpaste containing an addictive yet harmless substance. No friends, it is not even about DNA gene splicing to create a race of winged monkeys to act as tooth fairies.\nFriends, what this mandatory toothbrushing law is really about is strong teeth for strong America.\nin this room. What does this guy do for a living? He looks like an open mic that you would find at the comedy store. He looks like somebody that would be on like a Kill Tony, but he's he runs every time and just he just tries to make like at the at the very end of this he whoever the guy is beside him running, he's like sprinkles dust all over him and says he's going to make him gay. And so I don't know, he just he just makes he's just in there making a mockery of it, I guess. You know, but that's funny. But yeah, that's who I have to team up with him for my for my cult or whatever. My toothbrush and cult. 100%. You need him on board. It needs to be the toothbrush guy. If you're going to have a cult, you can't have stinky breath.\nYeah. Got to keep it together. But yeah, that's my Yeah, maybe it's like a cult or something. I don't know. But helping uh other musicians that they have talent, like giving them a vehicle, that's huge, man. Like cuz a lot there's a lot of people that just don't know how to get started. And sometimes the thing that makes you a brilliant musician or even a brilliant comic makes you bad at promoting because you're not thinking about yourself. You're like really locked into the work. You're really locked into your thing. And it takes someone who's really thinking about themsel a lot and promoting themsel. It's a totally different mindset to be like the social media guy, like to be like really into like social media videos and really into like promoting your gigs and really, you know, so like a lot of guys fall by the wayside because they just never put their stuff out there. Like there's some brilliant comics. Like I don't want I don't want to make a special. Like you should put this out, man. This is great stuff. And but they're they just want to kill. They just want to go up their their thing every night is get on that stage and do the thing right and then rewrite it. Go back to It's also the attention and stuff of it. Uhhuh. It's the It's the not Yeah. I mean, that's kind of what I I kind of laugh when all this happened again with Scorn with the Scornful song. I was I remember I called Draven like right after everything went up and everything was starting to move and I was like, \"Oh, what like what have we done?\" You know, like here we go. here comes the the New York Post is going to come showing up again at my grand, you know, my grandparents house next week again or whatever. And it's just like but I think it's also just yeah, people just maybe don't want the attention. There's a lot of really funny, genuine people that do comedy, but and and they can do they can get up there and have enough attention on them to do the comedy, but they don't want to be like, \"Hey, look at me.\" I mean, I fight that constantly. Even like that little video where we were going in the plane yesterday and I said, \"Plane by day, Joe Rogan P.,\" you know, like I don't even just making little videos like that, I feel way out of place. Like I don't want I don't need I don't want people to think like I'm saying, \"Hey, look at me.\" You know? I mean, that's why I try to go through these periods where I just don't post or At least you were in a regular airport. You know, the worst is when people are doing those things in front of a private jet. I'm like, \"Okay, we get it. You're rich.\" You know, if people try to take photos of me in front of a jet, I'm like, \"Uh-uh. I'm not I'm so not into this. I'm not I don't like that tension. I don't want it. I don't need it. It's which is weird because I got a lot of it and I think it's probably why I have a lot of it because I'm not looking for it. Yeah. But you're also able to you're channeling it out through all these other I mean think about all the things that you've influenced and been a part of and done even just through this podcast and all the conversations had and the information shared. Like it's not like you're just posting a bunch of pictures with your shirt off like, \"Hey, look at me.\" Like you're using it. I mean I I don't know. I I almost would say it's I don't know that it's a coincidence that you got put in this spot for a lot of reasons. I mean, there's a lot you probably don't even look at it that way, but there's a lot of important things that come out of this and all the other podcasts you've inspired that have done. I mean, gosh, dude, it's a there's no way to even calculate what you've if you if you had never been born, there's no way to calculate how different things would be now. Like, well, that's important to think about, though, you know, like it\n\n\nIt's sort of, but sort of.\nBut from my perspective, I was just one piece in this thing that happened.\nYeah.\nAnd you know, that's why I always have my friend Adam Curry on, who's the original.\nHe's the podfather.\nWithout him, there would be none of this.\nHe figured out a way to do this.\nAnd you know, and then also Anthony Cumia from Opie and Anthony and Tom Green.\nThose are my number one influences.\nAnd then Adam Corolla already had a podcast when I started.\nI was like, \"Oh, Adam went from radio to the internet.\nMaybe I could do that.\"\nI remember going to his place and oh, that's pretty cool.\nIt's back when we were doing it on a little laptop.\nI'm like, \"Wow, Adam has like a real studio.\nHe's got employees and [ __ ] And then, you know, we just kept doing it.\nJust kept doing it, you know.\nAnd then eventually it was webcams.\nOkay, now it's not just a laptop camera.\nIt's actual webcams.\nOkay, now maybe we should get like real cameras.\nOkay, let's get real cameras.\"\nAnd then like maybe we should get a [ __ ] studio.\nSo, we tried it at the ice house for a little bit.\nLike, maybe I should get another place.\nThen we got another place.\nI'm like, I think I need a warehouse.\nAnd then like I think I need armed security.\nI think I need [ __ ] special ops guys around me all the time.\nAnd then it just kept going, man.\nI remember the moment.\nI've talked about this before, but I didn't understand what was happening until one day I was on stage in Chicago and I think this was 2012.\nSo I think I think it was around then.\nSo the podcast was only three years old and I didn't realize how many people watched it or listened.\nA lot of it was listening at the time because I wasn't I don't look at the numbers.\nI just kind of keep I feel like all that's bad for you, you know, reading the comments, looking at the numbers.\nI just like do what you do.\nThat's why I do it exactly the same way.\nI have a bunch of people on that no one's ever heard of, you know, and then a few Bonos and stuff, you know, every now and then I'll have Russell Crowe on something crazy like, whoa, that guy's here.\nDennis Quaid's here.\nThis is nuts.\nYeah, your Mel Gibson one was good.\nYeah, he's the best.\nBut but I was on stage in Chicago and I was telling the story about the podcast.\nI go, \"How many you guys listen to the podcast?\"\nAnd it went it was like 3,700 people in this place and they were all screaming.\nI went whoa.\nYeah.\nThat's when I realized like at that moment I was like, \"Holy [ __ ] how big is this thing going to get?\"\nAnd this is another funny thing.\nWhen I went over to Spotify, I was trying to get 10% less famous.\nThat was my goal.\nMy goal was to fade away.\nMy goal was like, look, if somebody has to pay me, you have to go to this app to get it.\nAll the people that are getting at the other apps, they'll probably stop listening.\nYeah.\nLike, this would be great.\nI'll get all the money and I'll just [ __ ] drift into this place where it's only like the hardcore fans that make the track over to Spotify.\nAnd then this [ __ ] co thing happened.\nRemember in the beginning of the podcast, we lost 50% of our views and Jamie was in a hot panic.\nYeah, that's exactly what I meant earlier about not putting a lot of songs out.\nThere's like a there's some cool place where you can be where you're where you have your real fans and you're having fun, but you're not into all the sensationalism, all the crap, you know, like you can avoid all that.\nYou're a real guy.\nYou're a real dude.\nAnd I think one of the ways that the world has prepared you for this is that you've lived a a normal life for a long time, you know, a normal life with no live performances, no notoriety, no fame, no nothing.\nYou developed like a re like when people want to hear working man songs.\nYou [ __ ] know Bruce Springsteen isn't a working man.\nDo you know what I'm saying?\nLike he probably was never really a working man.\nHe was never working on the docks.\nYou know what I mean?\nHe was never really a guy grinding it out.\nHe he became famous pretty [ __ ] young.\nYou know they Bruce Springsteen and and the East Street band, they got hot early.\nLike they're great.\nDon't get me wrong.\nI mean, especially as early born to Run.\n[ __ ] He's got some jams, dude.\nHe's got some great songs, you know?\nBrilliant disguise.\nOh, I [ __ ] love that song.\nBut you're a real working man.\nLike, you were a real working man when you made Richmond, North of Richmond.\nLike, that is real.\nAnd you can't fake that.\nAnd people want that.\nThey want a [ __ ] trucker hat.\nThey want ripped jeans.\nThey don't want like ripped jeans that are ripped from work.\nYou know what I mean?\nThey don't like real oil stains on your knees cuz you're fixing your own car, you know?\nLike that's what people want in this world.\nThey want authenticity.\nAnd it's possible to maintain authenticity regardless of how big you get.\nIt is possible.\nAnd I think you can do it.\nI think you can do it because you got here later in life.\nYou got here and lived a real life and then you you made it into magical fantasy land where we all live.\nYeah.\nWell, the thing that I've gotten the most from you, like I said, I don't look at my streaming numbers or anything either.\nThat's what I mean.\nLike when I I finally did go back and look at Spotify like a after a year a year and a half later, it's just like, oh my god, like I'm this is still the thing, you know?\nBut um so I agree with you there.\nI don't look at the numbers.\nI I do I do catch myself reading a lot of the comments, but only because a lot of them are important and they I think some of the stories in them are important for me to I don't I don't want to completely isolate myself from that.\nAnd like I said, I also really like some of the negative ones, too.\nI think and the negative ones are a lot less now than they used to be.\nIt was just really early on.\nPeople didn't understand how everything happened and I really didn't understand it either.\nThat's why I was like whatever, you know.\nBut um moving forward now, yeah, I've got a good like core team of people.\nI've got Draven from RadioWV.\nI've got two or three people on staff.\nI don't have a management company or a publicist, you know.\nPerfect.\nThat's the key.\nI'm keeping it real real low.\nWell, I mean, it amazed me when I came here for the first time and saw the staff you have.\nAnd then like meeting Lex, you know, Lex does all of it.\nHe even turns his own cameras on and stuff.\nThere's only Lex in the whole place.\nIt's like, gosh, I don't need all these.\nIt's like a lot of those positions and jobs and services that musicians use, I think they don't realize that they don't even need.\nThey just are like, oh, that's how it is in music.\nThat's what I want to I want to Yeah.\nI don't eliminates eliminates the executive influence.\nIt eliminates the corporate mindset.\nIt eliminates that because there's always going to be a person that wants you to make a decision that's better for you financially, whereas like your instincts are guiding you towards this artistic decision.\nYeah.\nAnd anytime those people get in the mix, they [ __ ] everything up.\nI'll give you a great example.\nIt's like the only It's the only like call out on here that's negative that I'll say at all is that um just to show like how stuck in the mud the industry is and how how much I think it's going to change in the near future is um leading up to the Scornful release, me and Draven had went back and found about 30 or 40 people who just without us even knowing who they were made the Richmond reaction videos and they were a big part of of the push of it, especially long term.\nYou know, like people on TikTok and stuff that had made these videos.\nAnd so I I don't have I own 100% of my publishing.\nYou know, all the music's mine, thankfully.\nI have my own label technically that collects the money, but you have to use a publishing administration deal in order to collect money like overseas.\nI don't know if you're familiar no if it's the same in comedy but like yeah most any musician whether you're independent or you're with somebody you have to have some kind of pub admin and it's basically somebody that goes and helps you collect publishing money from over basically mostly from overseas is the way I understand like all these obscure places that money exists so Warner Chapel does it for me for 9% right so they go collect all the stuff they keep 9% of it they're the same to me as if I had a commercial landscaping company managing a property for me so all I asked them to do was, \"Hey, Warner Chapel, this 6ft square of grass where all these reaction videos exist, just please whitelist these people so they don't get copyrighted.\nI want them to actually make the money they make on the scornful reaction videos, you know, like I don't I don't feel right if they're going to go and make a scornful woman reaction video or or play drums over it or whatever.\nI don't want to take 50% of what you know what I mean.\nJust don't copy.\nJust whitelist them.\"\nAnd it should have been, \"Okay, great.\nGood idea.\"\nyou know, instead they just said, \"We can't do that, but it's for your protection.\"\nSo, because they wanted the money.\nSo, and they get a percentage or they how do they how do they get Well, yeah, they get they they take 9% off of what I get.\nThey don't want But I tried to explain to him, well, no, like in the business sense, I I even counterargued him and I was like, well, let's think about it in the business sense.\nThis little bit of money, right, that you're not going to collect off these reaction videos will generate who knows how much traffic to the music, which is worth the money you really want.\nAnd it shouldn't matter anyway.\nIt's not their It's not their [ __ ] to decide on.\nIt's mine.\nThey're just It's It's the same thing as if I hired a guy to cut the grass at my commercial property and said, \"Don't cut the sixoot square.\"\nAnd they're like, \"No, we're cutting it.\nWe're cutting all the grass and it's for your So, I had to get my attorney involved and spend like four grand.\"\nAnd they whitelisted them for 30 days.\nAnd so I'm like, okay, like that's why all that's why all of you industry people are like so, you know, it's like that's why this is happening.\nThat's why it's like I don't know, just they don't care at all about the little guy or the the people who are like doing all the work.\nThey just I just picture all these like stinky librarian type old people sitting around a table like, you know, they can make all this money and make all these horrible decisions and pour all these millions of dollars into songs that don't work and it doesn't matter because it's just like a it it's not there.\nThey don't care.\nThey're getting their big salary and yeah, so uh so yeah, it's just even even in the l even in the most minuscule relationships I've had in Nashville, I get resistance and push back and like it's I don't know like why wouldn't they want me to whitelist those 30 people?\nIt's just little stupid stuff like that that I've constantly dealt with.\nSo I've just decided now like I don't need I just don't want to do anything in the music like I don't even need to be in the music business like in that sense, you know?\nIt just I write my songs, I record them, I go do my shows and have fun, but I don't even need to follow any of the model of what of what like a traditional musician, artist person would have done.\nYou definitely don't need to.\nYou don't need to do it that way.\nIt's not necessary.\nAnd you you have a the right mindset is that all those reaction videos would just get more people to listen to your music.\nIt's that's fact.\nBut those are real those people were like real fans who went and did it not because they were trying to get traffic or money or whatever.\nThey just liked it and wanted to push it and so the least I can do is not take 50% of their stuff and like it just but isn't that crazy that it's like there's nobody's ever done that I guess like before they were just acting like that was just the craziest thing in the world so I ended up releasing this scornful song through a company called Soundon which is like the music distribution side of Tik Tok which seems like something I would never want to do but they give me the flexibility to go and like and do all the they don't care cuz they're not music industry people.\nThey're just social media people.\nSo I uploaded it through them basically.\nSo I'm still I own all 100% of the rights.\nIt's all my stuff.\nI don't have any deals or records or labels or anything.\nBut they push it to the streaming services for me and they do all the stuff.\nSo that way I'm not even having to use a music company to push my music.\nI can kind of just like not even be there at all, you know, like not even be in Nashville at all.\nThat's the goal is just to get and so now that I've got data from, you know, since Richmond basically and have learned a lot.\nI my goal long term is to I want I'm going to always put new music out and write stuff and you know, but it's going to come in spurts and there'll be times where people won't see a lot of me, but I'm going to be in the background with other people.\nLike I want to help I want to find these people on TikTok that have like a hundred followers, but I know that they've got what it takes and get with like Draven and some of these other people I've met and like help them write\n\n\nSome really good songs and record them and put them out and push them and just like I would love to plant like 10 or 15 people into music. Like give him everything I can give him to to push them forward and make like that way he doesn't feel like I'm I'm the guy in the spotlight trying to like I feel like I'm just in a I feel like I'm like the most I don't know these companies that got like all these employees and all this money and all this backing and it's literally like four or five of us taking them. It just I don't know to me I just think I I think there's strength in numbers if I could help more artists push forward and like help them break that cycle too that it would just it would be like a multiplication factor on this whole thing. That's kind of what that's going to be kind of my next thing I get into is is helping produce music and doing festivals and like starting a label basically kind of sort of. That's [ __ ] awesome. But a non-predatory one. Like even even when Draven puts somebody on RadioWV, if they get 30,000 views, there's already people trying to sign them. Like they just want control of every new thing. That's you know.\n\nWell, that's what they were trying to do to you right off the bat. Oh, and it felt terrifying, too, to not do it. It just felt like I was just It felt like I was just everything it was everything in me felt wrong doing it, you know, but I just decided that I didn't care about it and that it I just, you know, I I remember being very adamant at the beginning that every decision moving forward was based off the fact that I wasn't scared to go back to my old job if I had to cuz I'd rather go back to my old job and be me then go to Republic but just be Republic's little [ __ ] you know, and have to do everything they want and say everything like and also seeing where all your profits go and realizing that you got hoodwinkedked into these deals. deals cuz these deals when they give you a big chunk of money, you got to pay that money back. That's all just an advance. Well, if I had went with a label, I would have been a lot bigger though cuz they would have made me push 30 songs out a year and they would have put all this marketing money into and they would have kind of inflated me into this big fake like every other country superstar. And so it feels a lot better just kind of being a little a little scaled back, a little smaller, but yeah, collecting 100% of my money. And then also just knowing that I don't have a boss anymore other than, you know, other than the man upstairs.\n\nLike I don't gosh, dude. I mean, like imagine, you know, I've heard stories from bands and stuff now that have told me that they've went and had to record music like under a label contract and really didn't like the way the album turned out, but still had to release it anyway. Like, oh my gosh, that would just make me to have to put music out that I didn't think was good or promote it and they're going to get behind it. Yeah. Yeah. You don't want other people, especially financial people, to ever be involved in your art, ever. Even if they're good people, like, \"No, we can work out a beneficial deal for both people.\" No. No. It's not going to be beneficial for you. It's going to influence you and it's going to turn you in one way or another that's not the way you would have originally gone on your own. And the reason there's so much money in music is because music's such a big part of us as human beings. And it's like, it's so funny. The first thing they do when they sign somebody is like try to rip their identity away. And it's like they it's like the labels don't understand that it's the identity of the person that put them in the position they're in in the first place. It's like you said the relatability of it, you know.\n\nWell, there's also people have this instinct to try to influence people. So, it's one of the things that executives do in the beginning when someone's just starting, they go, you know what you should do? You should get a crew cut. I think you look great with a crew cut. And then like the crew cut was my idea. And like, you know, something about Oliver Anthony's crew cut, everybody loves that crew cut. Yeah, man. Just like he doesn't give a [ __ ] about his hair. That was my idea. Yeah. you know, there's a little of that cuz like people are easily influenced because like in the beginning you're not sure like I can't even believe I got signed like am I going to be a star? Are these people all here for me? You know, and they'll [ __ ] get in there.\n\nThat's happened to me. I mean, I brought um around February or so, I hired this management company that stayed. They were my management company for three weeks. So, that kind of tells you how well things worked. But, he was super nice, like loved everything I was doing. And then as soon as I got as soon as I started with him, he was telling other people that I know like, \"Yeah, we got to figure out how to make him cool and he needs to put like 40 or 50 songs out this year.\" And they were wanting me to make this social media post like complimenting Beyonce's country album because he thought it was going to get me in a position like it's exactly what you're saying. It's just like and I just told him I was like dude I if I wanted to just be if I just wanted to be somebody's little like somebody's little puppet I there's a I would have taken a lot more money for it that like you know I'm independent so I don't have to do that. It's like but that's like and it's like the thing is is I don't need to be cool. It's okay that I'm kind of lame and I just but I'm just me and you know it is what it is. It's like I don't have to I don't have to try to get on the internet and pretend to be cool. There's enough people you're cool man. Stop this. You're cool. You're not lame. You're not lame at all. What the [ __ ] are you talking about? You're a cool guy. You make great music and you're fun to hang out with. How are you? How are you lame? Because you're normal. Guess what? Everybody's normal. It's a ruse. Beyonce's normal, too. She takes horrible shits. I'm sure we all do. We all do. It's They're humans. Human beings, man. This illusion of celebrity. It's complete total nonsense.\n\nDude, that's the best thing. Yeah. Everybody takes horrible [ __ ] You want a brain gummy? Want some brain gummies? I was hoping you had some of the Alex Jones ones. Well, these are the Onit ones. The new They're Alpha Brain gummies. We just got them. How is Alex doing these? He's great. He lost a lot of weight, man. I saw he's getting like Mhm. Yeah. He's ready for the next My friend Sean Johnson's training him. Oh, really? Yeah. He gets up every morning. He works out for [ __ ] hours. He's lost I think he's lost 70 pounds at this point. He looks fantastic, man. He looks fantastic. He looks like he's 20 years younger. People think this is really funny because you know his whole business is conspiracy theorist conspiracy that Alex has been replaced. Yeah. Yeah. Listen folks, that's real Alex. I've watched every step of the way and my friend trains him. So I can tell you for a fact that is the real Alex Jones. Quit drinking. Quit [ __ ] around. Quit eating bad food. He's eating healthy food now. He works out every day. It's like no OMIC, no [ __ ] no shortcuts. He did it the right way. He looks great. Yeah. Yeah. He's um he's definitely he's definitely one of my bucket list people to meet at some point. I can introduce you to Alex. We can make that happen for sure. 100%. It'd be just I thought that just be hilarious. That's done. Done. Done. Nice. Yeah. We'll we'll hook that up. Be prepared. That'd be an interesting conversation. Yeah, cuz off air he's just like he is on air. He's That's Alex Jones. He's ready to go. He's got billion [ __ ] what Bill Gates is doing right now. And then you're like corny like what how does he get away with that? But what? But basically what they did, they paid off all the mass media. If you see there's a $350 million donation that he gave to all the media companies. Like what? 350? Is that real? Then Jamie will look it up like holy [ __ ] Yeah, I know. He's he's right a lot of the time. He's right most of the time except that one big one. But other than that, you'll get that with like they say, like the kids say, you get that with those big jobs.\n\nYou know what also I think happens, and this is I think this is 100% real, is that there are a bunch of fake stories that get propagated to people that are really invested in conspiracy theories, hoping that those people promote those fake conspiracy theories and then get outed as being wrong. Yeah. You know, I think uh you can get caught up in that. And then I also think if you're real quick to not check and and I'm guilty of that all the time to see if something's legit. You know, that's one of the vital roles that Jamie plays. Like Jamie's like, \"Maybe that's not real.\" Like what? Why are you [ __ ] this up Jamie? Like we want it to be real, right? You want a nice juicy conspiracy to be real. Um, and then also, you know, at the time of the Sandy Hook stuff, he was drinking like a lot. And I think he was genuinely overwhelmed by all the real stuff that he was finding, you know, when he's getting into the Iraq war and all these different things. It's like he was just overwhelmed, man. I think he had a psychotic break, you know, and he'll he'll be the first to say that, too. It's like when you're your whole business is uncovering uncovering insane conspiracies that everybody thinks you're out of your [ __ ] mind and then 20 years later you're like, \"Holy [ __ ] he was right about every step of the way.\" He was telling me about central bank digital currency connected to a social credit score system that it's game over because they'll lock you in just like they've done with China. And he was like saying this like a decade plus ago and I was like, \"What? Huh?\"\n\nYeah. It's great. like um the guy before him that I think I think the two of them actually didn't get along but I always if I ever when if I ever do meet Alex I was going to ask him about that is Bill Cooper but he was a guy who kind of came before Alex that was Behold the Peril Horse guy right? Yeah. Yeah. But yeah, even back then it just most of it seemed like total madness now back then and now it's like but it's just sort of like I laugh about when I was a kid everyone thought that Michael Jackson was the big like sexually perverted guy and who knows with Mike but you know now I look at Michael as like this just kid that was put in this terrible position from a child up and now all these other musicians that you wouldn't even think are the sex predators are it's just kind of like you just don't really know much of anything anyway but yeah like with with the Michael Jackson thing too is his doctor said that he chemically castrated when he was young to maintain his voice. And I believe him because that that totally makes sense. You look at his frame, he his his really thin frame where it doesn't look like he has any testosterone. You look at all his brothers. His brothers are like thick. Like what would chemically what does chemically castrated mean exactly? Well, it's a crazy thing. It's hormone blockers. It's exactly what they're doing to trans kids now. Yeah. It's the same thing. Okay. And that's why Michael Jackson had that voice. It's very similar to a castrada's voice. Do you know what a castrada is? So these kids in opera were castrated when they were young. And there's only one available recording. I think it's just it's like one guy, right? Have you ever heard it? You should hear a long time ago. Yeah. I'd like to hear it. Let's let's listen to some of it cuz it's [ __ ] creepy. I just have heard stories about like uh about that being a thing that they would cast children so that they never had testosterone so that their body never really developed and then they would have them maintain that young voice that high pitch that's only possible if you don't develop the deepness that comes with that's why when trans men when women start taking testosterone their voice starts getting deeper things start getting weird they started getting very Dwayne Johnson you know, it's like that's testosterone. That's what it that's the effect that it has on your voice. And um these um poor [ __ ] Aleandro Moreski.\n\n[Music]\n\nI don't want to I'm not going to Don't make fun of him. It's a beautiful woman.\n\n[Music]\n\nYeah, this is a grown man, right? Yeah, it's a grown man.\n\nOh [ __ ] Sorry. That'll be like sampled in the next Kanye song or something. Yeah, we can leave it there. We don't have to play anymore of it. It's so haunting. It's so haunting. First of all, what [ __ ] psycho figured out that if you cut off little boys balls, you could make them sing like that forever. Like, what [ __ ] psycho was the first person to do that? Yeah, cuz these are little kids they're doing it to. They're doing like six-year-olds. Was this in the church? Was this like a church thing or a I do not know. It was an opera thing, but I know opera thing. Castrating men, you know, Unix was a common thing. when people were working in the the homes of royals, they'd castrate them. There's one of the most horrific stories was Nero. Nero um beat his wife to death and then took a slave boy who looked like his wife and castrated him and changed his name to his wife and presented him as\n\n\nHis wife.\nYeah. People in power have always been horrible. Yeah. People, when they get unchecked power, have always been horrible. That's why directionally, like this whole \"no kings\" protest that's supposed to go down on Saturday, directionally, it's correct. Like, you don't want kings. You don't want oligarchs. But who's funding it? Well, it turns out it's funded by an oligarch. It's funded by a lady worth $20 billion who is the heir to Walmart, a company that employs cheap labor and sells a lot of stuff from China that would be affected by tariffs. Mhm. You know, it's like that with all of them, though. It's like, it's like that with everything, man. Everything is like it presents as being this moral situation. Like they're really looking out for you. They're really looking out for people. They're never really looking out for people. There's always some primary profit motive that's causing any organized thing. All there's, it's never for the human race. It's never, unless the people are all on mushrooms. It's never for the human race. And until mushrooms get legalized, that's probably never going to happen. And that's the real battle. The real battle is what gets legal first, AI or mushrooms, you know. Yeah. It's uh, both of us will lead towards God. Both of them will lead towards God, but one with a completely different outcome. I've, it's going to take me like four or five times listening to it to be able to talk about it. But the, I've went back and listened to the maps, maps of meaning on Audible, and it's one of Jordan's earlier works, you know, and he's talking about society and how it's structured and basically talks about like the motivations and the origins of why people always resort to evil, you know, like in this, I mean, we talk so much about the Holocaust, but not at all about all the other horrible tragedies that happened there at the same time. But even like talking about with Russia, like just think about the Soviet Union and what happened there and how easily people were turned against. It's just, we, I, this little moment in time we're in is just so, we should just be so thankful for it, even though it is mass chaos right now. Like the fact that we can, the fact that people are allowed to speak freely and do things and have, have the influence and power they do is just nuts when you think about, you're right. I mean, it's this, the, the same crazy people that we're arguing about today have always existed in different forms and with different names and faces. But, but we are better off today than anybody else in human history. And this is a struggle and it is a battle. But I think we can come out of this on the other side if we all realize that we're being played against each other. And that's where it's important. You know, when you're paying people to protest, you're leaving pallets of bricks around, and you're organizing the whole thing, and you're shipping people in on buses, and you're making sure that all the people show up at a certain amount of time, and they're all compensated, and you give them water and snacks. Like, we got to realize what's going on here. This is not for you. When you light your city on fire and you burn cop cars, it's never good. It's not good for you. It's not good for the cause. They're not going to change the laws. One thing that I heard, I, I heard from Trump today that I thought was very promising is that he wants to make an executive order where uh, people that are here for a long time that have been like working on farms that are undocumented, that they won't be targeted and that they'll be exempt from all this stuff. This is my feeling, like, if you got here and you're, you've integrated into our society, yeah, maybe you shouldn't have snuck in, but you did it and you're not breaking any laws. You're a hardworking person. Those, those people need a path to citizenship, man. Because if you don't, then they're just pred, they're just prayed upon by people that will take advantage of the fact that they're undocumented and not pay them what they're legally supposed to pay them and not give them benefits if they're legally supposed to have benefits, and they can't say anything because they're worried that immigration is going to get called on them. So, the, these people are in this constant state of anxiety, and then they hear about the ICE raids like at Home Depot. Like, what the [ __ ]\nYeah, there was a, there was a big ice raid um, at the, at the Facebook data center job not far from my place where I used to have to go when I was Facebook data center ice. Yeah, the Facebook project. It's in um, it's not far from me in Virginia. I think it's technically, would be in, would it be South Boston? I think it's technically in. ICE didn't bribe or Facebook didn't bribe Ice. Facebook, I would have [ __ ] bought ice some new cars. There's a big job that um, a big job site that I used to have to go on, some that's in um, the southern part of Virginia, like not far from North Carolina. And I, somebody was sending me pictures there from the other day, but they had a big ice raid and there was dudes like running through the, like people were just escaping the job, like running away from the job and stuff. It was nuts. But why, why, like gang members? Yes. Criminals, yes. This why? Why? Like I think as crazy as it sounds, the only way to do this and look like you have a heart is evaluate people on a case-by-case basis. Like there's good people. There's good people. It's also so complicated because it goes back for so long. And the idea, the thing now is that there's two very polarizing opinions of what America even is or represents or what job it's supposed to serve to the world. So, like, you know, in some, yeah. Sure. There, like any, for any country to exist, it has to have, there has to be something there that identifies what it is as a country, and you have, and like there's like, yeah, like it just seems like without citizenship or without some definitive thing of who's a citizen or not, it's like then it's not even a country. It's like, and, and most every country has some, like the idea of there being no immigration laws for a country means that it's no longer a country. But I also think it's like the, the, the opposite side of that, too, is like America's always, in theory, even though it's always been ran by these, there's always been these corrupt people involved in it. In theory, you know, America was, was started as sort of this thing that was like that could maybe be like, like a sanctuary that like that doesn't allow the, doesn't allow monarchies and dictators and horrible things, you know, like as bad as America maybe has been in certain cases, like the fact that when, when Japan lost, they didn't just go and take it over and call it another part of America. Like they went and tried to rebuild. Like in theory, America is supposed to be this vein that exists of, you know, it's, it's, it's origination is from people who wanted to get away from monarchies and dictators. And of course, like it's so easy to pick on the founding fathers and all their faults and the crazy things they did, but it was centuries ago in a different culture. And they probably were all maniacs. You'd have to be a maniac to, to go up against the world's biggest empire and take it on, you know, like with a musket with a [ __ ] Yeah. Like you'd have to, you have to be crazy. And of course they had personality flaws, but they, the reality is is that here's the thing that sucks is like, and it goes both ways. There's a lot of things about people on the left that people on the right don't realize that they have in common. And it's the same way with this. Like I, I, it breaks my heart when people just totally trash the founding fathers. Not because they were these morally, they took horrendous shits, too. I'm sure probably not as bad as Beyonce, but pretty close. And you know, the fact, like, of course they were bad people. They were all bad. We're humans. We're flawed inherently. Even the best of us, even the ones who act like we're the best and the most, like we're all screwed up. We all have our problems and our faults and stuff, but the fact that they were willing to like go somewhere to another land with all these, with all this crazy stuff and then take on the, you know, the world's biggest empire at that time just so they could be able to do what they, you know, religious freedom. It's like the, they didn't want religious, religious freedom because they were not even necessarily because they wanted to go to church. I always thought it was like it's so weird that they, they were fighting for religion, but it wasn't, they were fighting for religion. They were fighting for the mandate of religion for the, they were, they were tired of the church and like I know it's not considered the church anymore, but there is still a church that dominates us and tries to, to control us now, and that now, unfortunately, now the church is just sort of this weird thing, but it's the, it's the zebra mentality, you know, among politicians. It's like, it goes back to that, I think it's Jordan Peterson that talks about the zebras and how they'll do a study on zebras and they'll, it's in the maps and meaning book, I believe, and they'll mark one red to study it, and then the predators take that zebra down because the zebra's stripes aren't camouflaged to their surroundings. They're camouflaged to each other. So, they're not easily identifiable. And so, four or five lions can't take one zebra down if they all look the same. And in politics, I believe that's what's happened, especially on the left. You know, I, uh, I had people in Nashville quit working with me because I, I talked about this when I was at the Ryman, but I, uh, we had this, this uh, this dancing um, this chick that plays the fiddle and she does like flat dancing and stuff named Hillary Kug, uh, who lives in Nashville, and we had her come to the Ryman to do this show with us, and uh, it was on a last minute thing, and I'm about to introduce her and I tell the crowd, I'm like, hey, you know, I said, I got Hillary about to come out, and I was like, but it's not, don't worry, it's not that Hillary and just made all, it took, just made a joke about it. Well, I just, somebody said something in the crowd that was, and I don't know. I just interact and I just say what comes to mind and I don't care, you know, I don't worry about all that stuff and what people might think. I just try to say what I feel. But I was like, you know, isn't it crazy that somebody like Hillary, who not that long ago, I can remember vividly as a child or in teenage years, like being completely against the idea of even having two people of the same gender be married. Like she was as against gay marriage as like any, any person on the far right is now, you know, and that was that was in my childhood or early teen. And I said, and now the fact that now that it's okay for kids to become transgender and go through like what Michael did, that's to me is just, it just shows that it's all theatrics and that none of those people really have any real, like opinions about any of this stuff. It's all about what'll sell, you know? Like again, did you say this at the Ryman? I said this at the Ryman, and so I had my um, I had my management company that I was using then drop me and a bunch of other people without even telling me. They just emailed my attorney and said they couldn't work with me anymore. They were that mad about that. Um, which tells you how far off the deep end. But anyway, it's just, well, everything you're saying is just a, but you're exactly, you're exactly right with all that. It's just um, it's difficult to convey that to people because there's so many emotions involved. But at the end of the day, it's like, I don't see a whole lot of difference in people on the left and the right anymore. I think we're all just like, like you said, we all, we all are trying to just effectively accomplish the same thing just in, in different ways. And it's really easy to get angry at somebody that's on the same level as you than somebody that you don't even know exists, which is like with these private equity companies and these people in the background that do all the, like it, the enemy that. So what's happened is, is going back to the zebra thing, what I think has happened is, like especially in politics, the reason why Hillary Clinton can be against gay marriage and then four transgender kids in my, in a very short period of my lifetime and and a whole bunch of other politicians with her is that they're all just constantly rearranging their stripes. So all the zebras look just alike because as soon as one of them looks a little bit different, right? You know, like um, that's a great, like Tulsi Gabbard or whatever. I don't know name. There's plenty, there's plenty of people besides that's just the first one that comes to mind that's like, you know, trying to be a Democrat and and upholding most of what the Democratic party would have wanted her to uphold up until very recently, but because she didn't rearrange her stripes, it's like you're dead. But there's a whole bunch of more like her, too, that that aren't even in politics anymore. But that's that's the way I see it now is it's like all these people, and so like even with Big Donnie, you know, I wonder like, yeah, Big Donnie, I see, I just wonder even, I just don't trust, it's kind of my Alex Jones syndrome, but it's like no matter how cool somebody seems like that, I think like, man, does, does him and Hillary really still chill? Like they're probably smoking a fat joint right now just laughing. I don't know. Like you just don't really know. You don't really know. You're just, you have to see what you see and you have to take it in and just hope that you have that somehow you have the discernment to know what's true or not. But you really just don't, I mean, even with me, man, so much crazy stuff that gets said and done. And um, I just don't even when things come out about me that aren't true, I just don't even reply or acknowledge them anymore. I just let them exist in their own little space and be part of it. And I've just decided that again, we're just all on the, we're just in this crazy thing where all this stuff happens and it's just, I don't know. You can't. You can't. The problem is so many people that don't do that, there's, they're not aware of how much influence is being peddled onto\n\n\nThem. How much, how much their mind and their opinion is being affected by this nonsense on social media, by bots and by all these different things. What you said about the zebras and the stripes is so [ __ ] perfect. One of my favorite clips is, uh, Hillary Clinton when she was running, um, I think it was 2012.\nIt might have been, when did she first become president? 2008, right?\nWho?\nUh, Obama. Yeah, it might have been 2008, but she was running and she was more MAGA than MAGA. She was talking about the border and about people coming over here. If you want to stay, you get a stiff fine, and if you've done anything illegal, you get exported. No questions asked. And listen to this. Give me this full volume from the beginning.\nWait till you hear this. This is wild.\nSo, I think we got to have tough conditions. Tell people to come out of the shadows. If they've committed a crime, deport them. No questions asked. They're gone. If they, if they've been working and are law-abiding, we should say, \"Here are the conditions for you staying. You have to pay a stiff fine because you came here illegally. You have to pay back taxes. And you have to try to learn English. And you have to wait in line.\"\nIf Trump, like, you have to wait in line. That's so MAGA. I mean, it just proves the point that none of that really means they're sitting in the green room in the back before that speech, and there's like some stuff written out, and they're just like, \"Oh, I got to try to remember all this crap.\" Like none of that meant anything, you know? Like none of that. I don't think she even believed when she said it back then. In other words, she thought it was what the country wanted to hear. That's all it is. It's all focus group [ __ ]. It's all what the country wants to hear and what the party agrees upon, what the zebras all agree on. When you just said that, that's it perfectly. And as it morphs, as it gets into trans kids, you got to support trans people in the military. Whatever it is, they just all [ __ ] hop in line. What flag am I putting in my Twitter bio? And to go back to, go back to what you said at the beginning about those kids that are riding with the, and they don't really even know what they're riding. They got the mask on, but they're doing this. And it's like, I guess what I mean is, is there's a bunch of human beings on earth, especially now, like in our, in this sort of like American culture and all the other subseries of it, like in, you know, Europe and everywhere is so Americanized now, but there's all these people who are really angry. It's kind of like why, it's the reason why, you know, there's so many of these videos where they interview like the Antifa dudes, and they don't really even know why they're, they're not able to talk. They're not really able to articulate why they're there or what they believe. They're just there because they want to, they're just there to riot, you know, right? There's this like general anger that I think has that dwells in a lot of us towards this system that we realize is inefficient and ineffective and rigged, but it's just too complex, at least individually and through the means of the internet, for us to identify who our enemies really are. And so instead, it's like, let's just go do, like, let's just go, let's go catch, catch some [ __ ] on fire because at least it feels like we're doing something, even though, but I think, like, I think there's a lot more in common between the patriotic cosplaying type people who, who want to, who talk all the time about, like, you know, that, and the people who are like Antifa. I actually think that they're two of the same cloth. They just both, they both just don't really realize it. But I think, I think, like, the, there is this really amazing sort of rebellious spirit of the left that just needs to be reintegrated in society with the right, and then it's like, then it becomes unstoppable, and, and it no longer becomes a left and a right thing. But I just don't think, like, I'll give you another great example, like, um, like when I was younger, I'd go to these, some of these protests in DC and stuff, and I would always stay at George Washington University with these kids, and, um, we were all in our early 20s, probably, and we're all very, like, at that point, there wasn't any like real political identity to it. I don't think those people would have called themselves left back then, but you better believe most of them ended up going to all the Black Block and the Antifa and the Black Lives Matter and every other protest there was just 'cause they wanted to go protest. They just are like, you know, like, it's like, it's like, yeah. It's like, it's a thing of, of, of like, rebelling against the system. It doesn't really, it doesn't really matter what part of the system it is or if it really even makes any sense. You just know that that's, yeah. It's like, I think, I think, and that's what I mean is, through the means of the internet, I don't think we'll ever be able to organize all those people together in a way that's productive. But I do think in real life we can. I do think, I do think through, I think music is, I think that's why I want to focus mostly on music and like trying to influence and in a way to where the rich don't control it and the rich don't choose what songs we listen to and what songs make it on the charts like we do. I think that's the first step. I think actually think music is some, like, I guarantee you there, if you looked, if there was some way to, I'm sure there's some report to be ran where you could see how people voted versus what kind of music people listen to, and I guarantee you a lot of people who voted differently listen to the same exact lyrics and resonate with them, like, what is that? Like, they're, that's all I mean is this, we just been, we, we've just been mass distracted and misled, is all. Like, well, also, when you get these kind of organized protests, they're all organized with this one thought in mind, like, there, there, there's unlawful full, you know, changes in policies that's shipping our community back to Mexico, and we got to stop this. These are all, you know, oligarchs are involved, and this is a dictatorship, and they feel like they're fighting against something bad, and if they're uninformed, and who the [ __ ] who's 21 is informed, you know, most people who are young, especially if you're going to college, you're around a bunch of other like-minded people in an echo chamber, and you're all trying to like, get social credit by being the most woke and the most activisty, and you're the person who's the most involved, and you're helping organize, and you like, get a sense of purpose. And then there's also the thing of being on the ground with a bunch of other people that are moving in a certain direction that to me, it, I think it ignites a thing. I think there's things inside of us that get ignited. One of them is like, here's a, the best way to describe is like fishing, you know, when you go fishing, I've seen people catch their first fish, when that fish gets on the line, you get excited, everybody gets excited because it's this ancient thing inside of you that lets you know you're now successful. Your family's going to eat. You caught a fish, and it just like sparks it inside of you. It does it with bow hunting, but very few people are going to go bow hunting. But the other thing that it does it with is war. And protests are like war. You're marching. You're all together. Who's opposing us? [ __ ] them. And everyone's all aggressive, and they're all chanting, br. [ __ ] Ice. [ __ ] Ice. And you think you're doing the right thing. You think you're doing the right thing, you know, and then you see [ __ ] like cops shooting rubber bullets at reporters, and you're like, \"What the [ __ ]? These people are garbage.\" Like, how are you shooting a reporter? Yeah. As long you're supposed to shoot the rubber. Well, and I, but I think the, the problem now is that it's so, there's, it's too complicated to be able to dissect it and correct it that, like, like with these ICE protests, though. In other words, there's been such a heavily disputed and mismanaged protocol over immigration my entire life. So now it's like, you can't now just go in and just try to like, that's what's going to, people are going to protest, though, when you just all of a sudden go in and try to just like clean house all at once. It's like we've never even really established as a country what it, what it is, or because, like, because most of the people we've listened to the last 20 years will say stuff like that, and whatever year that was, 2008, and now say, gosh, can you imagine if somebody said that now, that they would be like a, they would be a racist and taken off the internet for saying what Hillary said on there about having to speak English and stuff. So it's for sure. But there's a big difference between protests and organized protests where you're paying people, and then you're leaving bricks around. This is a, it's like, it's a bastardization. It's a, they've, they've taken over the thing, this, the, the virtue of this thing, like this part of the First Amendment, your right to express yourself, the right for the people to get together and say, hey, this is not cool, and they've distorted it with money, like everything else. Yeah. Do, and they've used it as a political tool. I would think maybe that that's happened a lot, though, even in, in the past with like civil rights and everything else. A lot of that was much more organized than it was made. Like, I didn't know until just a couple years ago. Like, I, I've learned the story all through school and heard it a million times about Rosa Parks, but I didn't realize until a couple years ago that she was part of some, I don't know. I don't even know what she was part of, but she was part of some organization, and it was like a planned thing. I just, I, I was always taught it like she just spontaneously did it. But I think another, I think there's just, there's every, every, like, thing in history has this whole backstory to it that we don't really know much about, right? Most things have been manipulated. If they can be manipulated once, they realize they can manipulate people, they started, and they probably started that a long time ago. I mean, we've talked about it a million times, but that's why Smemedley Butler wrote, wrote War is a Racket in 1933.\nYou know, Major General Smemedley Butler, who was, they, they tried to get him to overthrow the [ __ ] government with a coup, and he wouldn't do it. And then he writes this book about how every single operation he was involved with, he thought they were doing this, but really they were just making it safe for bankers. They're really just overthrowing a government, installing a friendly one. It's like, it's been going on since they could. And back then it was way easier to pull off because there was no internet where you could pull up a Hillary Clinton video from, yeah, more than a decade ago and go, \"Look at her. She's, uh, pretty MAGA. You could put a [ __ ] red hat on that lady, and she'd be standing on that stage right next to RFK Jr., you know?\" Yeah. And it's just, it's because there's such an information overload. Stuff like that will always be forgotten about too soon for it to make a difference. Like, um, she could have been Trump's vi, vice president back then. Yeah. Like no [ __ ]. She would have been right. She would have been like queen mom of Trump land. There would be people with Hillary Clinton flags flying behind their pickup trucks with her with like two fists in the air with a MAGA hat on and not [ __ ]. And I, but I remember even back then, like, um, well, you know, the one, the one that's what made me fall in love with comedy was Nor McDonald and like his whole bit about the Clintons and stuff and getting on the view and riing all them up and stuff. But even, you know, back then, I remember they were trying to, like, can't, I guess he got kicked off of Saturday Night Live because of that, right? And all. Was it because of the Clinton spec, or it might have been because of, um, it was probably because he's too funny. There was something else.\nYeah. But there's, I don't know. Was one of the funniest people of all time, and his weekend update, that thing that he would do was [ __ ] fantastic. Fant, he was the best ever at it. He was so good, and the jokes were so, he, he would go so out there back when you could, you know, and if that's what got him kicked off a Saturday Night Live, great. Makes him even more of a legend.\nI think more. Yeah, I think that's, I think that's what's important about, I don't, I'm not a fan of all the real crazy vulgar humor sometimes and stuff, like, I, I'm more of a Norm type of comedy guy, like, I like the more goofy stuff that's not like constantly talking about penises and stuff, but like, you know, or whatever, like, whatever it is, sex and everything else, but I, it's really important that all that stuff does exist just because of the idea. I think it's important that there's this place that exists here in Austin that freedom of speech will always be in, even if you know it's, like, it's such a critical thing, especially now more than ever. I think it's critical for everybody, even if you don't agree with it. And that's what's so hard for people to recognize when people don't have a voice and someone has a voice and that voice is different than their opinion. They want to shut, they want to shut it down. They want to silence it, and they want to elevate their voice. Nature, just pure natural. It's natural instincts that human beings have. And you got to, you got to resist that because you got to realize you don't want that used on you, right? Well, then don't use it on other people. Yeah. Well, everyone's guilty. Like, I went, when I was at the ARC, where I g, where we spoke at that thing in London. There was a, a talk we went to, I think the next night that was about freedom of speech. And I can't remember the, I can't remember who all was speaking there. It was some people that I should probably remember, but I, um, yeah, but they, uh, they were talking, it was, it was, it was a group that was defending people in Europe that were like being, being arrested and stuff for things they had reposted online and all, which is really important, you know, like, they're, they're arresting people for political things that they put online in Europe and like, not.\n\n\nEven giving them very obscure reasoning as to why, whatever, in some cases, they won't even tell them what they're arresting them for. And so, like, the cause of what these people are doing is very important, but the whole time they're just, they're referring to it as the woke mind virus, which is, yeah, sure, funny, put in a bid or whatever, but, God, like, no. What it is is, it's like the government using this one specific thing out of a list of things that they could, as part of this moral high ground, to arrest people for speaking out against. Not because it has nothing to do with anything on the left or the right. It's the fact that the state would love for people to not be allowed to criticize anything because then that means they can't criticize them 100%. By them saying woke mind virus every five minutes while they're talking about it, it just immediately polarizes half the people who they need to get on board in order to stop it, which is the left, who it's like, I don't know. There's just, um, I don't know. I think I might try to, one of these days, I might just try to give the old thing a run and see it. But I really think I could, it would be, it would probably... You going to run for president?\n\nIt would probably end in like a nuclear war. But I think we could do, I think it'd be pretty interesting. I think you going to run for office if you will.\n\n[ __ ] that. No, I've... No, I'm not on the same page. Veron Supreme, call me up. No, I'm just kidding. I don't think I would. I, I might do like a governor run somewhere or something, or a mayor. Maybe I'll start with mayor. Maybe that's a good way. Seems like a terrible job, dude. Don't do it. I would say don't do it. But if you have to do it, do it. I mean, someone should do it. That's like you. I just remember my whole life, like, since I was a kid, people were like, \"Man, what would happen if just we got some regular dude in there and like all this, it's just like, I don't know.\" You probably get immediately disillusioned. You'd realize the entanglements that exist, and I think it's impossible to navigate. I think once you get in there, you're like, \"Holy shit.\" You know, when I talk to people that are in this administration now that weren't before, they've realized like all the paperwork and red tape and bureaucracy and all the different departments, all the people that are controlling these departments, and all the [ __ ] resistance you have to any change, and all the people that don't want to give you the information that you're asking for, and it gets wild and exhausting, and you're dealing with a machine that's been operating pretty much unchecked for decades. Let's check them out. Yeah. Give him the old check. Look what they did to Elon. He tried to check him out. They turned him into a Nazi. Yeah. I mean, it's like... Well, do you think was there... I'm not well read on any of this. This is like, this is actually something I wanted to ask you about at one point or another. Anyway, was your take on, like, the Elon Trump situation, but, you know, I, um, apparently they're making up. You think things are cool now? Supposedly conversation on the phone. The argument, but the argument behind it was that they felt like Trump wasn't letting Elon... See, I don't... I don't know what to think of, I really don't know what to think of any of that situation or Elon in general. And I just say, I just, it really fascinated me that it seemed like they were both using Doge for different reasons, maybe, or they had different motivations behind it. But what if, like, what if it was like a genuine, what if there was genuine audits done on everything, and like, what if all that stuff did get uncovered, and what if somebody wasn't scared to just release all that stuff and the consequences of it? Like, people do deserve the truth.\n\nLike, well, they've released some of it, right? So, we know a lot about US aid now. We know what that was. We know what crazy programs are in place. We know through Mike Benz's work where the way he describes US aid as doing things that are too dirty for the CIA, you like, he describes it being used for regime change and, but under the name aid, it seems like it's just aid. Oh, we're helping people, but it's Agency for International Development is what it really stands for. So, there's that, that's been dismantled. The thing is, they're not spending less money. They're spending more money. They're spending like a trillion dollars on the, the, on the Pentagon. It's the whole thing is kind of nuts because nobody wants to stop spending money. Nobody wants to lose their job. And they're all in a position where they have influence, and there's thousands of different points of influence. And if you're the president or the vice president or, you know, any of these [ __ ] people, it's a very difficult road. The one of the things that I felt like was the most important was Bobby Kennedy, because Bobby Kennedy getting in there, he was determined to find out what is the root cause of America's massive health crisis that we're all facing. Like, why are we having this? Why do we have, uh, different toxins that are in our foods that are banned in Europe? Why are we allowing the use of these different things that we know are terrible for the body? You know, why is there not greater scrutiny on these pharmaceutical drug corporations? Why are they not, you know, why are they able to lie and get away with it and prescribe things for people that don't need them and and not be responsible for the health consequence of these things, and that this needs to be cleaned up? And so that's what he's doing right now. I'm very happy and I hope that he can really make meaningful changes because it seems like he is. He follow, he fired the 17 people that were the head of, uh, the vaccine schedule, and he's hired a bunch of new people. They were all very qualified, and one of them being Robert Malone. Robert Malone, the guy that everybody said was a kook, that I got in trouble for initially for having on my podcast when they were trying to, you know, like when [ __ ] Neil Young was trying to get me removed from Spotify. This is over Robert Malone. Robert Malone, who owns nine patents on the creation of mRNA vaccine technology. Certifiable genius. Like, unquestionably, they were calling him a cook. This guy's a kook. A guy who took the vaccine and had a horrible reaction. They were calling him a cook. So that guy being a part of this administration, being a part of the, you know, make America healthy again movement, very important. All that stuff is very important for everybody, not Republicans, not Democrats. And if there's any area we where we should be bipartisan on, it's that. And realizing that corporations have taken advantage of loopholes and of a bunch of different creepy laws that have allowed them to poison you, and you're getting poisoned, and you're addicted to this poison, and there's a way out of this. Well, he's, he's kind of where I got the inspiration for the call idea from. Um, you know, he, he, uh... No, well, he, he and I actually met, he came out to my, he came out to the property where we filmed Richmond and all, and I met him. This was before he got linked up with Trump. He was still running. This is during all that, and he was, he was still running for himself. But we had a long conversation about this concept for a healing center, which is like this thing that he's been kind of like as a part of all this, which is like, which is kind of the the idea of people going out into nature and like learning how to grow food and learning how to, like, cuz in, in this, in this neverending abyss of chaos where everything's changing so fast and nothing, you know, nature is nature has been affected by that through like some, you know, through chemicals and technology and other things, but for the most part, it's all the systems in nature, all the organization there and the all that stuff is sort of like the last thing that's untouched by man. You know, when you go out on two or 30 hundred acres and you just sit there and you're watching the water go by, it's like, it, you just sort of, you take everything that we've talked about, like, all this, these are all very complex, like, just crazy century, thousands of year long things that that mankind have done. But meanwhile, nature just sort of exists and does its thing. And and it's like, it's, it's sort of a way to compartmentalize all this monstrosity into one little thing and realize that there is other, there is a reality outside of the reality that like modern society has constructed us to exist in 24/7. That's 100%, 100%. Like, gosh, dude, that's the only thing that saves me is, like, especially being a little bit, probably a little bit too introverted for this job position. Um, you know, going out on tour, even for a weekend or two, or like, dude, by the time Sunday comes and we get through this in these two mothership shows, we have, uh, we got West Virginia next weekend, but I'll spend the, this whole week, I probably won't talk to anybody except for like immediate family, you know? I'll just have my, I'll just go sit out in the woods with the dogs and just watch the birds chirp and all that. But it's amazing. There's something really important about that that I want to, I want to, I want to understand, like, you take, if you can take two or 30 hundred acres, like, what can you plant on it that brings in the c, the, the types of nature that benefit human beings the most? It's like, I want to conduct studies on, like, everything from birds to plants to wildlife to different type, like, how do you put a human being who is so screwed up in the most optimal condition to heal and to fix, like, cuz it's obviously not the ca, like, you're not going to go to a mental institution or, and I'm not even suggesting for people who should be in a mental institution. I just mean, like, you know, people who, like, a guy I know who, you mentioned mushrooms and stuff, but there's a guy I know, like, that's in the Marines who's dealing with PTSD. Like, how do you get him into a spot where he can just go out and, you know, like, you can't, it's hard to get, it's hard to fix that part of your brain living in a city or living in a suburb and not having an act, like, so that's, you know, um, so yeah, it's just like this crazy dream I have where, like, it's sort of a, it's a way to rebel against all of this without rebelling, it's just creating a better way to do it. But imagine if you, like, this is like the pilot program for this thing where it's this sort of outdoor amphitheater, and it's like, very immersive and in nature, and you can and you can like, re-reunlock these parts of your brain you talked about that are sort of very primitive and to us, and then and then just emulate it over a period of time, like, so I'm doing these shows where they're, they're, they're nonprofit, and the idea is just to go into an area that hasn't had music that's in an A or B ticketing market, do a show there, build them a blueprint, whether it's on a main street or in a farm field or whatever, but just somewhere where Live Nation and Ticketmaster can't touch it, build them a blueprint with like ingress, egress, promotions, how to sell the show, where to put the stage, how to set everything up, here's all the vendors they use, and then give them this blueprint where can do it over and over and over again and just build like these sort of sanctuaries that exist all over the country that can't be like molested and prayed upon by all those big companies and all their crap. And I think inherently by doing that through like music and public speaking and other things, those spaces will almost serve as like, like the way that communities thrive again and the way people reconnect. And I, I joke and say that, like, I, everyone, every human being likes music and food and socializing at least a little bit. And if you don't, you're probably a robot, and we don't, I don't want you there anyway, kind of a thing, you know. But like, so that's, that's it in a nutshell. But that all was inspired by Bobby's sort of idea for this healing center that he talked about. I think it's a place over in Italy that he used as a reference of, um, he had a relative go to, and like, they were able to work with, like, leather and do all the stuff on a vineyard, I think, and it like, it had a, there's a lot of, you know, we know very little about the human mind. And that's why psychedelics are still illegal and so, and there's so much misunderstanding and misconception and just confusion even there because think, I mean, like, our brains are just so infinitely complex, even, you know, uh, yeah, so nature's is definitely a part of your health. Without nature, I don't think you really get totally healthy. We're a part of nature, you know, like, we're a, we're a natural thing existing in a world that we've created that isn't natural, and so, like, this is all, you know, like, this is all everything that we've talked about is just sort of man-made, constructed [ __ ] that is now, that is now reality to us. But there, but it's just part of a bigger thing, too, that it's we sort of get isolated inside of it, especially when we're on our phone all the time. It's like, yeah, especially I've laid off social media, and it's, it's amazing. It's like, it lifts this weight off your brain. How do you, how do you manage social? This is one thing I really have a hard time with, and it makes, I feel bad because I end up upsetting people or whatever, but like, how do you... A lot of people want your time, and they want to send you text messages, and they want to bother you with stuff, and they want to, and it's not even they want to bother you, they really gen, but like, how do you manage that? Do you just have a small social circle? Are you just really social, or like, how do you find... There's people where I just won't text them back for like months, and then they, then they think I hate them, and it's not that I hate them. It's just like, I can't just sit and text. I just can't send hundreds of texts every day. Like, I have to, like, how do you balance all that, or how do you... You got to keep changing your phone number. But you also got to get comfortable with not texting people back because you can't text everybody back. Like, look at my phone. Want to see something? I'll show you this. Look and see how many unread text messages I have in the upper left-hand corner. What does it say? 623. Yeah. Good luck. How... How am I going to read those? I know. Well, it's not possible. I think it goes back to my when I was at work before and I had to keep up\n\n\nWith the phone for work, and I had, you know, it's like it's just instilled in me that like it just drives me.\nSo, I don't know.\nThat's why.\nYeah.\nI've I've bought that flip phone that I carry, and there's just times.\nGood move.\nIt's a good move.\nYou get your brain back.\nIt's also tough though because there's people I do want to stay in contact with, like, you know, like.\nYeah.\nBut you can always reach out to them.\nYeah, it's like, you know, we have this idea of immediate interaction with people that it's necessary.\nIt's important.\nAnd sometimes it is important.\nLike maybe there's something going on.\nMaybe your wife is pregnant.\nLike, who knows, right?\nYou need immediate contact.\nBut most of the time, you don't.\nThe vast majority of the time you don't.\nWe lived a long time without it.\nYeah.\nI mean, you don't want to not be there for somebody who needs you in an emergency, but other than that, yeah, it's good to be free.\nYou just, it's better for your brain.\nI don't, I, you like I was saying, I don't think we're supposed to be getting the bad news from 8 billion people.\nIt's just too nuts.\nIt's, we're just too, I don't think we're even supposed to socialize with that many.\nI mean, we, we thrive in smaller, I mean, that's why all these.\nYeah.\nWe, we definitely thrive in smaller.\nYeah.\nKeep a tight tribe.\nYeah.\nYeah.\nKeep a tight tribe.\nKeep a tight tribe of people that are cool and make it so it's beneficial to everybody so there's no resentment.\nYou know, that's one of the things that happens in when a guy gets really famous like you're getting is that some of you can have the wrong people around you.\nYou know, maybe you like look past some of the resentful behavior that they showed when you weren't successful, and then it manifests itself when you're successful.\nThey, you could tell like someone around you actually wants you to [ __ ] up, and that's a ter, I've seen that happen with friends.\nIt's a terrible place to be.\nThere just has to be some kind of way that I don't have to be famous though.\nLike there's a way where this is.\nYeah, but there's a way where this is like, I'm just like, I don't know.\nIt's gotten a lot better.\nBut um, you're just going to have to deal with it.\nLike I said, this is the, the path that you've been given in this world.\nI just mean that, I just mean that like I should like, I just don't want fan, I just don't want people to perceive like I'm just some dude that's written a song, and we're, but this is like a colle, like I said, this is a collective thing.\nLike the fact just, if you look at the, if you look at the rate of people who buy my songs on iTunes versus most label artists, it's like comically disproportionate.\nLike people, people buy my songs out of support and stuff.\nAnd so what I'm saying is that this is like a thing, like this isn't just I'm sitting up here and y'all are all down there.\nLike this in my mind, this is just a thing where we're all equal, and it just happens to be this is the music cat.\nThis is the music catalog that we're giving people a middle finger with.\nI don't, I wouldn't for a second want to ever think that like that I'm above somebody else on some social hierarchy because of it or something.\nI guess I don't want to feel like I, that's not necessary.\nThis is just something where like let, I just, I'm just so excited to see where this can go in the sense of like, like, like I said, it's just exciting that like, like some just full-blown idiot like me with a couple of his buddies can figure out how to do this and and rally enough support up behind it.\nI'm just like, what could really happen if we like, what could really happen if things were like, if I actually knew what I was doing or if like enough of us got together?\nLike we could really just flip, we could just flip everything upside down pretty quick, and it'd be hilarious.\nYou don't have to become a different thing just because you're famous.\nThat's a myth.\nYou know, you don't have to become better than people.\nYou don't have to think you're better than people just because you're famous.\nYou can maintain who you are.\nIt's totally doable.\nTotally.\nYeah.\nYeah.\nI do it.\nI'm just me.\nI'm the same person.\nYou are.\nYeah.\nI've been doing it the same, and I, that's one of the reasons why I do the podcast the exact same way.\nI do it the same way.\nI don't think, oh, this is going to be a big one.\nEverybody asks, that's the first thing a lot of people ask is how was Joe Rogan?\nAnd I was like, he's Joe Rogan.\nLike there is no, so much easier that way.\nJust be you all day.\nYeah.\nLike if you've watched him on the podcast, you've seen him in real life.\nHe's, you know, it's you see me at my worst, and you see me at my best.\nThat's it.\nBut you know, I'm a human being just like anybody else.\nThis is why why I encourage everybody who wants to do something like this to go do it.\nAnybody can do this.\nExactly.\nIt's not, you might not do it this well immediately because you're going to learn how to do it, but it's like everything.\nYou can learn how to do it.\nLike you, you can learn how to sing.\nYou can learn how to do standup.\nYou, you can learn how to play guitar.\nYou can learn how to draw.\nYou can learn, oh, I could never do that.\nYou can.\nSome people can do it better than you.\nSome people are naturally talented in different areas, you know, especially when it comes to athletics.\nBut you can do it.\nYou can do it.\nYou can get better every, and getting better at something and doing something is beneficial to the whole of your life because if you can apply that same, those same principles to everything, you can get better at everything, and you get better at being a person and inspire other people like.\nYeah.\nLike the more, the more good that you can do and the more you can put out, the more it inspires others to do, too.\nYeah.\nThe more work you put out too, the more songs you put out like Scornful Woman, the more stuff that like really resonates with people.\nIt affects people, man.\nIt's like you, it's that wings of the butterfly, man.\nYou know, you're like, you really, you're like spreading it out, and you know, and it'll inspire more people to write songs.\nIt'll inspire more people to do things.\nIt'll inspite, it'll inspire people to write books.\nIt's just that's what we do.\nWe inspire people.\nPeople inspire people.\nAnd people by doing something that we know is difficult and they get through it and they create something like wow.\nAnd you go to see, you know, [ __ ] YouTube with the sphere like wow.\nYeah.\nYou know, that's what it's all about, man.\nYou know, that's that's the beautiful thing that is this kind of artistic connection that you have with the community with the people that that enjoy your work.\nAs long as you respect that and as long as you understand what it is, you'll be great.\nYou're just going to have to deal with being famous, [ __ ].\nYou know, I, I have to, I have to, you know, like I do, I do think you're actually right.\nI probably was a little misspoken or now that you've said what you said about AI being able to replace music and stuff, I do agree that like there is a part of it that AI will never, they'll never understand the human experience enough to be able to write music about it.\nThat's that captivates people in a way that music can that's been written by people.\nI do agree with that.\nYeah, they can make it sound better and cooler and catchier, but I do think like I do think the people that are really writing it are the ones that um, and the ones that really write.\nI mean, like just to talk about this, the songwriting process with Scornful, you know, we were, I had been um, we had just gotten done with the touring over the summer for the most part in 2024, and um, well, obviously things are what they are, but there's just been, there was just a like multiple different negative things happening at once.\nAnd I kind of got in a, I got in a spot where I, I did my thing where I sort of spiraled and just was isolating myself.\nAnd so I spent a month and a half or two months in that house pretty much.\nI didn't do, I didn't do Thanksgiving or Christmas last year.\nI just, just really didn't hardly talk to anybody or anything.\nAnd so I was like at a, you know, I was in a, I was in a position, it was in a position where it was like probably time to write a song like that.\nAnd um, and there's a few things I do want to clarify too, talking about this.\nBut so anyway, so me, Draven from Radio WV, and Joey are all sitting in the kitchen of this house where we recorded the song.\nAnd it's probably in the fall sometime.\nAnd Joey, it's 3:00 in the morning, right?\nAnd um, we like we were all just like wired, and um, I can think about Joey talking about really wanting to write a song.\nAnd so him and Draven were asking me about my songwriting process and what I do.\nAnd so like I just went and got the guitar, and I said, we were sitting there around the table, and I can remember it was me and Joey sitting here and Draven leaning up against the counter, and we were just talking about it.\nAnd I said, \"Well, I said, if you're going to write a song, I was like, the first thing you got to do is figure out what you're going to write about, and it's got to be something that you feel, not something that you can just articulate about.\nIt's got to be something that's like in there that needs to come out, you know?\"\nAnd so we sat there for like 10 seconds, and scornful woman was the word that was used, you know, and it was like it was, it was specific relationships, but also it was a collection of all like the experiences that we had all had, like I think in horrible, we'd all had horrible relationships too in the, of course we all have, you know, like every dude on earth has been, has been through what that song talks about in one way or another.\nCan we play it?\nLet's, let's ceue it up.\nYeah, let's queue it up, Jamie.\nQueue it up.\nBut within two or three minutes, the whole song was written.\nIt was just like it just, it just came out.\nYou know, that's, and um, AI is not going to do that.\nThere's something, there's, there's, there's things that resonate in that song that AI is never going to be able to understand.\nYeah.\nYeah.\nAnd that's the thing, that's the thing that's going to separate people from the machine and live performance.\nThat this kind of stuff, this kind of stuff right here.\nMercer County, West Virginia.\n[Music]\nWell, she got a side tour I want to run from.\nShe'll turn a warm afternoon into a cold, cold one.\nWell, he grabbed the apple and Adam took a bite.\nAnd now all these years later, and the mass still ain't right with a scornful woman.\nA scornful woman.\n[Music]\nI used to sleep so good.\nDidn't have a nightmare.\nI was busy dreaming, believing he's always going to be right there.\nAnd now the middle of the day is like the middle of the night.\nAnd the court says 50/50, but the math don't ain't right with a thorn for woman.\n[Music]\n[Applause]\nWell, she can have all the money and they can keep all the fame.\nI go back to being broke as a joke if I could just get a break from the pain.\n[Music]\n[Music]\nIt's in the description of the video, but there's a, the biggest shout out of all this is to the, there's a firefighter that we, he let us use this footage too.\nI think it's out of Brazil, but the name of the firefighter is in the description, but for the, the GoPro footage, it was really cool.\nHe let us use that.\nOh, so that's a real fire.\nYeah, that's a real firefighting.\nWow.\nGoPro video that we found, and we reached out to the guy and asked him if we could use it.\nUm, but I just wanted to give him a shout out on here.\nJoseph, volunteer volunteer firefighter, third company, Bomb Luendos in Chile.\nIn Chile, sorry.\nYeah, that's awesome.\nI've been, my mind's been in kind of a blur lately, so I should have remembered that right.\nBut that's all right.\nWe got it.\nThat's awesome.\nThat [ __ ] song, dude.\nWoo.\nThat song's, that song's a firecracker.\nI can't wait for you to hear some of the, like, um, let me turn, I'll, I'll turn this on.\nI'll play like just like, I'll leak like 20 seconds of one of the other ones.\nLike when is it going to come out?\nI don't know when the next ones will.\nUm, I don't even want to say a day cuz I don't know.\nI'm such a procrastin, I want to say like within a month or so.\nLike what are you doing with it?\nYou changing anything on it or you just not releasing it yet?\nJust not, I've just got, I just need to get my life together a little bit.\nWell, just release it right now.\nPut it out.\nJust release it right now.\nPut it out on the show.\nSend it to Jamie.\nUm, I'll play like 30 seconds of, I don't even have like a, I don't even have like a full file of anything on here.\nI've just got stuff that I've recorded off my phone.\nBut just to give you an idea of like some of the other stuff I'm working on like this one.\nUm, let me see, which one of these.\nThey're all just say like new recording 432.\nSo, I got to remember which like probably this one's probably one.\nI don't know if this will be right or not, but this will give you an idea of something.\n[Music]\n[Music]\nAll right.\n[Music]\n[Applause]\n[Music]\n[Applause]\n[Music]\nI just got a bunch of little clips like that of where we were practicing the guitar parts.\nBut anyway, I got a few more that are like pretty heavy.\nI don't know what they are.\nI don't know.\nPeople will figure it out.\nThere's something.\nI don't, I don't even, I don't like to even try to describe many of that stuff cuz I don't know what it is.\nBut so, are you going to release it all as a full album or you going to just do it like um, song at a time?\nProbably just song at a time right now just because it's simpler that way.\nUm.\n\n\nYeah, and then I'll just, I don't know\nwhat I'm gonna, I don't know what the\nlong-term plan is.\nSo, I want to get, I'll get to the end of this tour this year in October, and um, you don't need a long-term plan.\nYeah.\nJust keep doing what you like doing.\nYeah, I will.\nYeah.\nThis all long-term plan.\nThat's people with vision boards.\nYou don't need.\nYeah, you're right.\nYeah.\nNo, you're right.\nI have been take, I've just tried to take it.\nI do have to think long term though because I want to make the most of this just for\nI don't know, man.\nThe only thing I want, like I just want to look back when I'm old and just think like, just think like, yeah, we did it.\nLike we did this thing.\nKeep doing what you're doing.\nYou will do that 100%.\nYeah, but I mean bigger.\nI just want to see, like I just want to see the, I just want to, I don't know.\nI just want to watch the machine crumble, you know?\nLike I just, I have this like thing inside of me that probably crumble on its own.\nIt'll still exist in some form, but you know, as long as you can thrive without it, it doesn't matter.\nIt really doesn't matter.\nAnd more people will realize that there's a way to do it that's authentic.\nThere's always going to be people that are drawn to that, and it'll be more and more people as things get more and more disconnected and feel less and less human.\nYeah, there's been so many big people go up against it and not be able to quite figure it out.\nLike even Pearl Jam back in the 90s, you know, trying to go up against, I think Live Nation it was or Ticket Master.\nAnd I don't know, man.\nAnd I just want to see that's like that, that would be my biggest accomplishment, that would be the biggest thing that I would feel some sense of accomplishment about a long time is like, just how do you get all these people together who have been disenfranchised by the music industry and just rally them together in a way that like it's not to take anyone down or to do anything bad at all towards anybody, but it's just to like imagine what society would be with real music again without a bunch of label propped up in everybody's head.\nLike what if people really listened to what they loved and like that, and like it was real.\nIt was like the organic side of things is what drove music through the roof.\nLike imagine what that would, imagine what, cuz think about what music can do to you, like not even in the moment, but just what it means to you over time.\nLike going back and I go back all the time, like uh, and I listen to like a 1999 live uh, like a like a live stain session or something from back then and just or like old Hank Williams III songs or like, I don't know, stuff I listen to a lot as a kid and like, man, it'll just unlock all these memories, you think about, like all of a sudden you're like back in a place that you never even remembered you ever were.\nIt's just, it's such a powerful thing on us, you know.\nExcuse me.\nSo sorry I had to sneeze.\nYeah, but that's it.\nIt's powerful, man.\nIt's powerful to do what you're doing.\nWhat you're doing is that you're doing that.\nYeah.\nYou're in that groove.\nShut the up.\nYou are.\nYou are.\nYou're in that groove.\nYou know, just keep doing what you're doing.\nIt's awesome.\nAnd it's inspiring.\nAnd more people are going to do it.\nAnd I love that you want to help more people do it.\nThat's great because the, I'm guarantee you there are these Charlie Crockett out there.\nThere's these guys out there that people haven't heard of before.\nAnd then you see him playing on street corner one day, you're like, \"Where are you from?\"\nLike, how are you doing this?\nThis is crazy.\nYeah.\nYou know, there's people like that out there in the world.\nI remember we went, what was that place that we went to?\nWe saw Ellis Bullard, the white, what is it called?\nWhite horse.\nWhite horse.\nYeah.\nYeah.\nAnd we were like, look at this guy here in town, right?\nYeah.\nNobody there.\nWe went there last time we were here.\nWe're planning on going back.\nWe was actually thinking about trying to swing by there this evening and see.\nThat was so much fun last time.\nGreat little spot.\nSo, there's people like that out there.\nYou know, they just have to get an audience.\nYeah.\nYou know, someone has to, you know, give them a little boost, reach back, grab their hand, help them up.\nYeah.\nThat's one of the best things about the comedy community right now is that we all do that for each other.\nSo, it's like there's a real pathway.\nSo, there's a lot of people that are moving to Austin from all across the country, you know, that like, hey, I think if I get there, that's a place where you could really launch from.\nWhat's powerful about your platforms here, like you and just and all the other people, like you said, that are in that network, is that you, this is all stuff that you've built that you have control over.\nLike these are, that's what's cool about it is it's like this sort of new, it's a whole new business that you've kind of got here, like in the comedy world.\nIt's not, it's not owned by anybody or anything.\nIt's like it's wild and free and chaotic and it could go anywhere.\nAnd that's what's, that's what's exciting to me is like, um, dude, like I said, I just don't know.\nI just don't know what, who knows what'll even come of what you got going on here in um, in Austin.\nBut this has shaped a lot, like in a, in a world where everything is so, is so predicted, like there's less and less people able to sit around in a boardroom in a skyscraper somewhere and decide what the next big thing is going to be.\nIt's like, it's more, it's, I don't know.\nIt's just, it's exciting to be a part of that despite all the, there's so many ways that you can, you can look negatively about everything going on.\nBut there is this sort of transfer of power that I just hope can happen in a, we only have a very short window of time for it to happen in though.\nYou know, pretty soon, pretty soon we'll all have a neural link and we'll be, we'll be talking to each other in, you know, but we've got a little bit of time maybe before that.\nYeah, maybe.\nI think we're the last real people.\nWe're the last people that knows what it was like before to understand what's what, like what real life really is.\nUm, and it's so hard to even say what that, what that even means.\nBut I just mean that like even already there's people on YouTube that that comment on a video that's AI.\nEveryone in it AI, the whole narrative is, and it'll have like a million and like probably half the people commenting on it are bots too.\nBut I just mean that it's not even like we're going to be deceived that way.\nI think at some point it'll almost somehow, somehow it'll come to a point where we won't really understand what is real life or what is digitally artificially created, and it won't even, it's not that we won't even be able to tell the difference, but we won't even care to tell the difference.\nThe, the fake world will feel more real than the real world in a short period of time somehow.\nLike it'll, it will, it'll influence our, our, our sensory, like it'll, it'll, it'll influence that more than real life will.\nLike it'll become just like everything will just feels, I mean it already feels that way, that's why we're so drawn and all, but as it all becomes more realistic and more creative and more tailored to, to draw us in, it will be um, just mass deception.\nThis is what's pro, it might have already happened.\nThis is what's really terrifying is the simulation theory, the idea that, oh, I would be able to know if it was a simulation, would you?\nI don't know.\nYou know, Elon thinks it's a simulation.\nHe thinks the chances of it not being a simulation are in the billions.\nHe thinks that this whole thing is probably our consciousness interacting with a program, which is very bizarre to think, but if you keep going with what we're doing right now, that is inevitable.\nIf you look at the way technology is recreating things with AI and making things look completely realistic, and then you, you extrapolate, you look into the future 20, 30, 40, 50 years, yeah, they're going to be able to give you an experience that's you're not going to know.\nSo, how do you know if that's already happened?\nAnd maybe that's how the world actually works.\nMaybe this idea of the material world is an illusion and that everything is your consciousness interacting.\nWell, we're only able to perceive reality through a limited, through limited means.\nI mean, sight, sound, smell, etc.\nLike there's, there could be components of reality here that we're not able to see.\nI mean, and that's where like I definitely lean into recognizing that there is this whole, like I do believe there is this whole spiritual element at play too.\nAnd I see, yeah, it's just, it's hard to, it's just, no, there's no way to tell.\nThis, it's kind of like, it's funny though, because the same mentality that you could use to think about the world being a simulation, you could also think about it being, I mean, it's so organized and so perfect that, yeah, I agree that it's operating on some program.\nI just think that that program is being mandated and created by, by what is represented in my mind as God or, you know, Jesus Christ.\nOther people may just be considered like a, like a software or a program, but it is all the same thing.\nObviously, there is some like, life is a thing that we don't quite understand that that finds itself in the, in the midst of so many different parts of reality, like life, like just in the soil, there's so many different millions of bacteria that just make it possible for stuff to even be able to grow.\nAnd all those things are arguably intelligent and have these organized systems.\nAnd then you see the way birds fly in the sky and just the way that like the way that even we have these sort of inherent parts programmed into us.\nIt's just, it's, there's really no way to tell.\nBut what's so funny is that in just a short period of time, we'll all be forgotten about anyway, and we'll never really know.\nAnd maybe even this, even this technology that has existed has existed before and will go away again.\nIt's just no way to really tell.\nI think at the end of the day, like to your point, I think humanity and the truth within it is what is all that really exists, and everything else just sort of swirls about and and we're always wanting to expand upon what already exists.\nYou know, we're not creatures that like repetition or we like to just always figure out what the next big thing is, even if it is our demise.\nYou know, it's weird.\nWe're sort of, even if it is our, we're sort of chasing to build these, to build our replacement somehow.\nI don't know.\nOh, that's a fact.\nYeah, we're definitely doing that.\nNo question at all.\nWe've already replaced our memory with your contact list.\nI mean, how many numbers, I know like three people's phone numbers.\nI used to know everyone's phone number.\nI used to be able to rattle off all my friends phone numbers.\nI used to be able to call them from a pay phone.\nThat was how I got a hold of people back in the day.\nNow I don't remember anything.\nI remember my high school phone number that I had when I was a kid.\nI don't remember my best friend's phone number.\nI can remember my best friend's phone number from high school.\nHe still has it.\nI'll still text him now and then and Yeah.\nBut I, it's crazy that you, your contact list has replaced your memory.\nIt has.\nYeah.\nYeah.\nAnd then, you know, anytime you have a question, you just press that button on your phone.\nHey, you know what year was this?\nYou know, what year was Gettysburg?\nWhat year?\nYou know, and you can find anything instantaneously.\nAnd that's good.\nBut it's also weird because now you're dependent upon that thing and you're connected to that thing.\nThat thing is just going to get more and more a part of your life, whereas you said before, you can't even leave your house without your phone.\nYou feel weird.\nYeah.\nBut that all those resources right now are used because there is no like real protocol or way for us to be necessarily productive with it, like, like in a broader spectrum that a lot of people just use all those tools and resources as just endless entertainment and mind-numbing distraction.\nBut really, all that stuff is makes us super powerful if we're able to harness it correctly.\nLike I said, like, like just imagine the, imagine the information and the data and the resources that we have access to that people like kings and dictators and emperors and the most powerful people in the world could have never dreamed.\nLike we have it just right here for free on our phone.\nLike I think we don't realize how informed we are in comparison to people in the past.\nPeople in the past were extremely naive about the way things work.\nJust that has just been something that we have just accepted as being normal in the last 20 years.\nBut it's not normal.\nIt's not normal to know this much about congressional insider trading, you know, like how do we all know about that now?\nAnd how, how do we all know that it's been going on forever and nobody did anything about it?\nYou know, there's a lot of things that we know now that make the people, the powers that be, very creeped out.\nYou know, including things like podcasts.\nThey don't like it at all.\nThat there's no one that, no corporate entity pulling the strings behind the scenes.\nIt's just people and that some person like a Theo Vaughn or whoever can have whoever they want on anytime they want and say whatever they want.\nYeah.\nAnd that person might say some wild that has the internet scrambling.\nIs this true?\nAnd then they have to Google it.\nThey don't like that at all.\nThey don't like that this affects elections, that people realize like, hey, you're being lied to.\nHey, the, the FBI contacted Facebook and was telling them to remove factual information because it might affect the election.\nLike this is crazy.\nLike the stuff that we know now that a lot of people know now was the stuff of conspiracy fantasy when I was 20 years old.\nBut what does it really, what does it mean to us though?\nBecause yeah, we know all that about Facebook, but we all still use Facebook, like, like it's um, I think that now our ability to communicate has become so contingent upon these platforms that we know they're no good.\n\n\nFor us, we know they harvest our data and they do all the terrible things that are associated with them, but we still... It's like, where else, where else, but Facebook Marketplace can you find all these sweet, you know? I mean, that's like, you don't have to get totally influenced by it, though. The more you're aware they're influencing you, the less effect it has on you. You know, the more you're aware of the magic trick, you're like, \"Oh, that rabbit's up his sleeve.\"\n\nThere's just a connectivity that we can't find elsewhere. So, there's this void that we have, like we have to use it to fill the void, I guess, is what I mean. Like, maybe through... That's why I really want to try doing, um, I've had two or three people really pushing me heavy to try to do jiu-jitsu, but that's something where, like, it's the... It's like the community and the relationships you get out of it that's just important, maybe, than the practice of itself. Like, the... I don't know, that's the way it's been, like, maybe in those sort of circles you do get that, but you just don't get it in a... You know, there's not a lot of broad ways to get it now, but jiu-jitsu is definitely a way to do it. It's also a way where you get out all of your aggression in a very healthy way, in a cooperative way. You're doing it with other people that are your friends. And the beautiful thing about jiu-jitsu sparring, as opposed to, like, when I was kickboxing, like, you kind of resented your sparring partners. They're [ __ ] you up, you know? They're they're rocking you. Whereas in jiu-jitsu, even if someone taps you a lot, you... You're still their friend. You know, you realize, like, oh, you got... And they'll tell you, \"You can't... You can't do that with the right arm. The right arm has to stay tied to your chest because otherwise, once it's exposed...\" \"What I'm trying to do is get you to do that so I can go to the other side.\" Like, \"Oh, okay, let's try it again. I'll show... I'll show a guy.\" And when you do that with people, you're... You're helping your friend beat you next time. But that's the way to get better. Like, you know, Eddie Bravo taught me that a long time ago. He goes, \"The more you teach people to catch you in the stuff that you do, the more people you... You'll be able to get it in people that even know it's coming. You'll be able... It'll sharpen that technique up even more. If you can get people that know what you're doing and you tell them what you're doing, you can still do it.\" Like Hicks and Grace used to tell people, \"I'm going to get you in an arm bar in your right arm.\" You're like, \"The [ __ ] you are.\" And he would still get it.\n\nBut he was so much better than everybody that he would do that on purpose. And there's a beautiful thing about learning something that's very difficult that prepares you for life. Also, the other beautiful thing about jiu-jitsu in terms of your mental health is that it's so difficult to do that it makes regular life easy and regular conflict seems to be silly. Like, sometimes people get, like, super nervous if two people are just yelling at each other and you think a fight might break up. If you're, like, so used to strangling people, that's like totally normal. Like, \"Oh, you guys get a fight.\" Like, you see that in this... You see that in some of the videos that go around where somebody will get, like, broken into, like, they're... And it's like the security footage. Like, I'm trying to think... There was one that went around recently. Um, like, some guy was trying to break into a UFC fighter truck and he went out there and just, like, kicked his ass. I think that was it. Yeah. He tried to carjack Justin Gate and he beat the [ __ ] out of him. Yeah. The guy did that with Jon Jones. Jon Jones ran out with a shotgun and a [ __ ] Belgian Malam. Like, that's the wrong dude to break into his house. He's ready. And Sean Strickland. That was another one. Sean ran off. That's who I was thinking of was pistol. Yeah, I was thinking of that one. I think... Yeah, there's... There's a lot of... You could [ __ ] with the wrong dude. And that happens. That there's... There's a lot of those wrong dudes out there now. There's so many people that are training in martial arts now. You never know. Like, if you're picking a fight with someone and you don't know how to fight, you are rolling the dice. Those dudes are a lot scarier in real life than on TV, too. Like, I finally got to meet... I met... I've met Brock Lesnar a couple times now. I've just ran into him randomly and just, like, the size of his hands, you're just like, \"God, like, what?\" Like, where did this guy come? He's just like a machine, you know? He's a Viking. That's 100% Viking DNA. 100%. But I don't know the ex... There's no exercise I'm aware of that, like, makes your fist twice the size of a normal man. But he's just like... Yeah. He's just like... You see his daughter? Yeah. His daughter's a shot put champion. Like, jeez Louise, she's a tank. Yeah. That's just pure Viking genetics, man. Those were the people at the front of the boat with the big battle axe. When you saw that boat pull up to your village, you knew you better start running to those mountains. My god, I can't... I just can't imagine having to get in the ring with a guy like that and, like, know you got to just, like, go... Good luck. I know. You know, imagine the guys beat him, too. That's what's even crazier. Guys beat his ass. You know, Alistair Overeem beat his ass. Kane Velasquez beat his ass. There's guys better than him, which is really... He's always a bigger fish. Yeah. Yeah. And Kane wasn't even bigger. Kane was a bad [ __ ]. He was like 240. He was like 25 pounds lighter than Brock and he still beat his ass.\n\nWho in... Who in fighting right now is exciting you, like, coming up into it? Like, who's... There's so many guys? There's so many, man. Did you watch Morab's last fight last weekend? Barav Dwish William Sea Ali. That guy is insane. He's insane. His cardio is like something to that everyone who has been involved in the sport for as long as I have is blown away by it. The guy's a freak. Daniel Cormier went to visit him after he won the title. He... He won the title Saturday night at the Sphere in Vegas. Beat Shaun Ali. Dominant five-round decision. Just steamrolled him. The next day Daniel Cormier goes to visit him. He's out running. Yeah. I mean, doesn't stop. Yeah. Doesn't stop. Just this guy from Georgia, from this, you know, war-torn country, who is just embraces that [ __ ] grind at a level that nobody else can compete with. And when he gets in the ring, like, no one can match his cardio, no one can match his pace. He melts the greatest of the greats. You see guys like Umar Nurmagamedov, who's elite. He's world class. Like, in any other time, he would be a world champion. And Morab's just overwhelming him. You see him just getting overwhelmed by the pace and Morab doesn't even get tired. He's a freak. So he's train... He's probably trained in Georgia most of his life, then. Do you think that gives him an advantage, like, he's been... He's trained in, like, sort... Maybe his fighting style, or is it just, like... Is he doing the same type of fighting, but just better, you think? Or is it just that they can't see the evolution of his... His technique? So a lot of it is in America. So it's just his mindset and his... His drive. And I think some of it, you know, Farasah Hobby did a whole video about him saying it needs to be studied in a lab. Farasah Hobby, who runs Tristar in Montreal, it's like one of the greatest gyms of all time. And he's one of the best minds ever in the history of MMA. And he's blown away by this guy. He's like, \"There's guys that are on EPO,\" which is like, uh, you know, that's the cyclist take that makes you have more blood cells and it makes you have more cardio, but it's... You can have a [ __ ] stroke. It's like super dangerous to take. But that's like a lot of the, like, Tour de France guys get busted for that kind of [ __ ]. Some fighters get busted. He's like, \"Guys that I know that have been on EPO don't have that kind of cardio. This is crazy cardio. This is like something freakish.\" And he's like... He thinks some of it's genetic, but Morab says it's not. Morab says, \"No, you still get tired. I used to get tired.\" But he's just... I mean, he's a freak. He's a freak. And he just keeps getting better with his technique. He gets better with everything. His... That drive is not just for his cardio. That drive is for his whole skill set. So, he's a [ __ ] monster. And then Ilia Tapora, who's fighting Charles Olivera at the end of the month. Like, that guy is insane. That guy's knocked out two of the greatest featherweights of all time. Vulcanowski and Max Holloway. Nobody could knock those guys out in featherweight before. And he did it. And he did it. And he made it look easy, you know? He made it look like they... Like he's just on another level from everybody, you know? And then now he's moving up to 155 pounds. He's like decided he cleared out that division. He's moving up. Like, he's insane. Insane. There's guys like that that are just so... They're just... They're their level is above everybody else's level. And with Ilia, it's everything. It's his submissions, his kicks, his punches, everything. He does... He can do anything. I mean, he does everything perfect. All his technique is perfect and he's [ __ ] driven and ultra confident. You know, this is an amazing time for the sport, man. It's a... It's a crazy time because these guys that are coming in with, like, one fight in the UFC, they look like world-class contenders, like, right away. Yeah. Well, it's cool because it seems like it's... It's like a really... It's a really good way to get, like, obscure people into the spotlight. Like, it doesn't seem... It seems like if you can just go in there and fight good that you... It's like you can really work your way up to the top pretty quick, I guess. Like, I guess it... It does take some fights, but like, if you're even if you're like the guys that are in the top at the UFC now, how many fights do you think it takes them before they wreck? Like, how many big wins is it really just a win or two? I guess if they're big enough and they're like... It really depends entirely on their skill set and who they're fighting and how good they are when they get into the organization. Like, the best example of a quick rise to the top is Alex Pereira. But Alex Pereira is one of the greatest kickboxers of all time. And Alex Pereira went entered into the UFC, like, a lot of people were completely unaware of him. And me as a... A giant kickboxing fan, he was the guy that I was like, \"When this [ __ ] comes over here, bodies are going to drop, man. I'm telling you, you ain't never seen nothing like.\" And I remember Daniel Cormier saying to me, like, \"Really?\" I'm like, \"Dude, I'm telling you.\" I was pointing to him on his... In his debut. I go, \"That's the [ __ ]. That's the boogeyman of boogeymen.\" I go, \"He knocks people into orbit.\" I was showing him some videos of kickboxing fights and he was like, \"Holy shit.\" I go, \"Dude, everybody he touches, he's got the touch of death.\" And then we start steamrolling people in the UFC and he knocked out Strickland in one round and the... The opening fight that he had when he hit that dude with a flying knee and just sent him into orbit and everybody's like, \"Woof.\" I'm like, \"Yeah, dude. This guy is scary.\"\n\nSo that guy was within three years was a two-division world champion, which is just nuts. Like, nobody's done that before. And you know, defended the light heavyweight title multiple times in just a few years. And he's only really been fighting MMA for, like, five or six years. That's the excitement, I think, of MMA over other athletics, maybe, is just the unpredictability of it that, like, anybody can just come in and catch everybody off guard and you just don't ever know. It's just... Yeah. Well, it's specialists. So, the thing about specialists is if you're a specialist kickboxer, what you really need is someone to teach you how to fight on the ground. Like, and he had Glover Teixeira, who was also a former UFC light heavyweight champion, one of the greatest and an amazing technician. And Glover helped him along with all his other training partners avoid the takedowns, learn how to fight off, learn how to fight on the ground, learn how to get back up to your feet. When you got a guy who's the best of the best kickboxers, every fight starts standing up. So, while you're standing there with him, it's just... You got to get that guy to the ground. You got to get that guy to the ground. This is terrifying. And he... He'll fight with broken toes. He fought... He's fought so [ __ ] up before. He fought, uh, when... When he fought Yuri Prohaskca the first time, he had a completely blown-out knee. Like, his knee wouldn't support him. He knocked Yuri Paskca out with a left hook and then he got his knee fixed. Came back, fought him again, and iced him in the second round. And he's just different, man. He fought this last fight with a broken hand and he had, uh, Noro virus. Oh my god. And still lost a close decision in the fifth round. Maybe it almost... Yeah, it almost help... Like, almost helps him like that. Nah, it doesn't. It definitely doesn't. You could tell his energy was lower in...\n\n\nThat last fight than it has been in the past.\nLike the Khalil Roundtree fight was a [ __ ] masterclass, and Khalil is like one of the best strikers in the light heavyweight division, and Alex just pieced them apart.\nI think about what happens to what happens after their careers are finished.\nLike what do they, where do they direct all of that energy to, or does it, or does it, is it difficult when you're, does it, does it, is difficult when you're a high-level fighter and then you get out of it?\nLike, \"Oh, it's so difficult.\nYour whole identity is wrapped up in it.\"\nYou know, I just messaged Sean Strickland the other day because I saw that he was talking about his investments and that he's, he's got, he's got 4 million in investments and he's doing really well.\nAnd then, you know, he's got a plan.\nLike Sean is very intelligent.\nHe's wild and crazy.\nHe says crazy [ __ ], but very intelligent, and I was very happy.\nI imagine like you're really thinking about like having money in the bank, retirement, investment, so you're good.\nYou're good forever.\nAnd he'll always be able to do seminars and and things along those lines.\nPeople, it's very valuable to be like a former champion.\nYou could visit gyms and people will line up and pay 50 bucks, and you can teach them things that'll genuinely help their careers.\nSo that a lot of guys have a thing like Misha Tate.\nShe was just in Austin recently, and she, uh, she went to Ways to Well to get, uh, some work done on her knee, and she was out here doing seminars.\nSo she's traveling with her family around the country, and they'll go, and she'll teach a seminar at a gym, and then they'll go, you know, on an RV trip, you know, nice family time.\nYeah.\nHave a good time in between, but they can make a lucrative living doing that, which is really nice, you know, but it's, it's hard for them.\nThe identity thing is very...\nWell, I just wonder too, like the, it seems like some of those people are, um, well, you know, this is totally different than MMA fighters, but I look at like, like a great example is like, like that David Goggins type of thing where they're like just at it, like you said, dude, man, like you fight, and the next day you're able to go run.\nIt's just like what happens when all that slows down?\nDo you redirect that somewhere?\nDo you think it's difficult?\nLike if you don't have somewhere to dis, you know, you found this really effective way to displace all of this because obviously those people have got something in them that like drives their spirit to be able to do that.\nWell, I think George St. Pierre has the healthiest model because George still trains almost every day, and George still comes to Austin to train with the Donna and Gordon Ryan and all all these elite jiu-jitsu guys, and he'll still go to Thailand and train Muay Thai.\nHe's a genuine martial artist.\nMaybe he stopped before he destroyed himself too much.\nHe definitely did.\nHe definitely did.\nHe's in good.\nHe definitely did.\nDo you think those guys will ever come back?\nLike, like a, I know there was rumors about, do you think they would ever, do you think for them that it would be beneficial for them to come back and fight once they've been out of it for so long?\nLike, like the Tyson fight and stuff, was that, that seemed like, and I don't even know, that's a whole another can of worms, and I don't, I'm not articulate enough in this space to like give my opinions on things, but I just, I would have liked to seen Mike Tyson just, I don't know, just seemed like that just wasn't it, didn't seem like he enjoyed that coming back.\nI bet he enjoyed the 20 million bucks.\nI think that's why he did it.\nI think he did it for money.\nAnd I'm happy that he could do it for money.\nI'm happy that he can make a large amount of money doing something like that.\nThat's all I'll say about that.\nBut you're not supposed to be getting hit really hard in the head when you're 57 or 58 years old.\nIt's probably not the best thing for your, your health.\nAnd at a certain point in time, like I kind of stopped kickboxing for the most part when I was like 30.\nI was like, \"This is just not good for you,\" you know?\nI, I was still sparring, and I was, I was acting at the time.\nSo, I was doing news radio, and I was still going to the gym and kickboxing, and you know, sometimes I'd have like a little black eye that I have to get touched up with makeup and [ __ ] before I go out to the like, and I kept doing jiu-jitsu, but jiu-jitsu, I would get black eyes in jiu-jitsu sometimes, too.\nBut jiu-jitsu didn't, I didn't get my head rattled the same way.\nLike, you still accidentally catch a knee sometimes, and or you headbutt each other sometimes, something elbow stuff happens, but it's not like the constant jabs to the face and kicks to the body, and you just get, you, you're beating your brain up, you know, and it's just not good for you at a certain point in time.\nLike if you're an athlete and you're competing professionally, you manage it.\nYou do your best to recover and take care of your health.\nBut there's a, there's a price you pay, and I don't think you should pay that price if you don't have to, you know, and that's what, that's the thing about sparring that's like, d, especially if you're sparring with someone who's like a hard hitter, and they, they're not that good at pulling punches, and then it gets competitive, and next thing you know, you're, you're basically fighting full on fighting somebody.\nHappens all the time.\nHappens all the time.\nHappens in a lot of gyms.\nIt happens more often than not.\nYou're actually fighting rather than sparring.\nYou're just lucky you're not knocking each other unconscious every day, you know, because it's like your skill.\nBut there's, there's something to be said for that if you're fighting because like you got to be aware that there's real consequences to these shots.\nAnd if someone's pity patting you in sparring, maybe you'll develop a false sense of security, you know, and someone crack you.\nYou got to be on the edge all the time.\nLike Ferasa Hab, who I was talking about earlier, would pay sparring partners to try to knock George St. Pierre out.\nHe would pay them.\nI want you to try to knock him out, like for real.\nBecause he wanted George to be like really prepared.\nYou know, you're going in there and you, you know, you're gonna fight some [ __ ] killer.\nYou know, you, you can't be kind of half you're, you know, you're fighting Carlos Condit.\nHe's gonna try to take your head off.\nYou got to be training with guys that are trying to take your head off.\nYeah.\nWhen they're in the middle of those fights, is it a lot of muscle memory, or are they consciously thinking?\nLike I feel like a lot of it, it's they've trained so much that it's more automatic, right, when they get in that fight?\nLike, like, like the way you see these slow, these slow motion replays of fights, and they're able to like almost predict their opponent's move and like react in real time with it and like just use it to their advantage.\nThat's all sort of almost, it's not involuntary, but they've like trained their muscle memory to react that way, I guess, more so than them.\nYeah, so having to like think like, oh, here it comes.\nI'm going to, you know, it's just so incredible to watch it.\nLike the way it's, sometimes those fights are so good.\nThey almost like, it's almost like choreographed.\nIt's so good the way they're able to like use their opponent's movements and to their own advantage and stuff.\nThat's what's so, so crazy to me watching the, just watching how like a human being can get to that level to where they're so good, you, when someone's at the elite level, like the highest of high levels, it's an amazing thing to watch.\nLike, there's a guy who's defending his flyweight title, um, at the end of June, Alexandre Pantoja.\nHe's one of the best fighters of all time.\nI mean, he's so [ __ ] good, but he's 125 pounds.\nSo, people, you know, they don't appreciate him as much as if that guy was 170, he would be a [ __ ] superstar.\nHe's so good.\nHe's so good everywhere.\nElite black belt on the ground, nasty striking, hyperaggressive, just dominant, just comes in, he has this look in his eyes like, I'm here to [ __ ] you up.\nAnd it's awesome to watch.\nI mean, he, he's like when a guy reaches the pinnacle of his career, like when he's at the height of his powers, when he's at the peak of his, his performance and career and as a elite MMA fighter, it's something to behold, man.\nIt really is.\nWhen you watch a guy just piece a guy up and take him apart, you're like, god damn, you know?\nI, I never get bored with it.\nNever.\nNever get bored calling the fights.\nNever get bored.\nLike when, when I know it's a UFC night, I'm like, \"Oh, baby, here we go.\"\nIt still get, it still gets you excited just like it did at the beginning.\nYeah.\nAnd and Daniel Cormier, who was a two division world champion who's sitting next to me, he gets fired up.\nI mean, he's like grabbing my shoulders.\nOh man, we, here we go.\nHere we go.\nWe get so fired up, and it's, you know, as far as excitement generated, I think it's the most exciting thing in the world.\nI don't think there's anything like two people trying to figure each other out.\nYeah.\nYou know, I mean, and then when someone's in that flow state, it's amazing thing to watch.\nIt's beautiful when they really hit that flow state, and they just everything is just perfect.\nIt's like, oh man, that's so hard to get there.\nIt's like an art form that you really can only truly appreciate if you understand the amount of effort that it took to get to that point.\nIf you could do a little bit of it, you can do it somewhat.\nYou know, you have to be able to do some martial arts to really appreciate what they're doing.\nYou know, you can see someone kick somebody in the head like, \"Wow, that's crazy.\"\nBut to really know how hard it is to pull off what he did, it's just like, damn.\nIt's easy.\nIt's easy to watch world star hip hop where they're just like sucker punching each other.\nBut to watch a guy exhibit that kind of skill on somebody else knowing that like, and not even knowing, like I said, just meeting like the, the few UFC fighters that I've met and stuff, just looking at him and being like, gosh dude, like these dudes are just animals, you know, like to start, and then to watch somebody else be able to exhibit that kind of, just to kind of like unleash that kind of skill on them is just, you're right there.\nIt's such a raw, it unlocks such a, it unlocks that sort of monkey part of our brain that's just like, yeah, you know, your DNA, man.\nIt's hard to.\nYeah.\nIt's just such a, such a human thing, I guess.\nBut yeah, like when people are really into cricket and someone scores in cricket, they get excited.\nI don't give a [ __ ].\nBut if somebody kicks somebody in the head, everybody knows what happened.\nEverybody understands it.\nThat's the, I think that that's the same psychology behind chicken fighting, which is surprisingly prevalent.\nUm, like where we recorded this song and all that still, but like with the, it's kind of the same, like that, that's just, that's what they do up there.\nThey don't hit each other.\nThey just get chickens and do it, and they gamble.\nThat's the big thing is gambling on chicken fights.\nNew York roosters.\nOh yeah, it's a big deal up there.\nYeah.\nI was just telling a story the other day about, uh, this guy that was my landscaper that that took me to this Mexican neighborhood that he lived in, and his buddy had all these chickens like in cages like all over the place.\nHe had these roosters, and they had a big pit where they would roast goats, and they would just get the chickens out, put them in the box and gamble.\nAnd it was like I was explaining, like you want to talk about like integrated societies.\nThis was a completely Mexican neighborhood in LA.\nLike none of the signs are in English.\nEverything is in Spanish.\nEverybody spoke Spanish.\nWow.\nYou go down the street, you hear there's [ __ ] roosters everywhere, man.\nBut it's like that, that's a part of their culture.\nIt's cruel and awful, but so is chicken farming, you know?\nThey make soup out of the chickens after they have them fight each other.\nIt's kind of [ __ ] up, but it's the, it's that same sort of like, um, it's the same, it goes back to like the coliseum.\nIt's that same kind of thing.\nLike it's that part of our brain that like everybody's got some chase to get there.\nBut yeah, I've always wondered that with the fighters.\nI've...\nThe worst is dog fighting.\nYeah, that's the one I, you know, that one makes my stomach turn, right?\nThat one bothers me because they like fighting.\nThey really do.\nPit bulls love it.\nThey're, they're fighting.\nThey're biting each other in the face and wagging their tails.\nThey really enjoy it, but it's like, God, don't do that.\nDon't do that.\nYou just like, we don't want that.\nYeah.\nYou know?\nYeah.\nMaybe it's when it's something you eat, you don't feel so bad about it.\nBut when it's a dog, it's like I just love dogs way too much, man.\nThat that to me, you know, and I know the dog wants to do it, which is even more [ __ ] up, you know?\nThey want to fight, but they're bred for it.\nThat's what's so crazy.\nPeople are so psycho.\nThey bred a dog that wants to fight all the time and will fight anything.\nThey'll fight bulls.\nThey used to use them to grab bowls.\nYeah.\nYeah.\nThey're nutty dogs, man.\nWell, you know, where I was at in Virginia, we had, um, I...\nYeah.\nI was, I don't know if I'd say we were officially dating or not.\nI kind of was hoping we were, but I was, there was this girl I used to talk to a lot in middle school, and they, um, you know, they weren't, they didn't...\n\n\nI didn't live too far away from Michael Vick's place when all that went down.\nSo, she actually had some puppies that were originally, they never fought.\nThey were still puppies when he got busted, but they were some of Vick's dogs that she had.\nI remember as a kid, and that was like, yeah, that I remember when all that went down.\nI didn't live, you know, we weren't relatively that far away from where all that happened, but that was a real eye-opening experience for a lot of people.\nThey're like, \"Wait, like what?\nThat guy's doing that?\nThat that's crazy.\"\nBut I'm the same way.\nI have dogs, and humans are like at the same level of importance to me almost, you know?\nLike, um, I finally, I didn't, it's not a, not in any way to say replace, but just like for me, I've always, I'm used to having three or four dogs around, cuz once you train, if you train a couple dogs real good, and you get a couple more, nine times out of 10, they'll just learn everything from you.\nYou kind of get this pack mentality.\nAnd so I've had four for forever, and then I had gotten down to two when I lost Hooch, the white shepherd.\nSo I finally just got this black German shepherd off this lady who was a real, really nice lady, and it wasn't, she didn't necessarily neglect the dog, but the dog was just a breeder's dog, so all she did was just have puppies with it.\nAnd so like, here I am, I'm taking this 5-year-old black German shepherd down like to go swimming in the creek with us and stuff, and like it was like her first time stepping on a stick, you know?\nShe stepped on a stick and like jumped completely in the air, like she didn't know what it, you know?\nNow within two weeks, now she's like swimming in the creek with them and running all around, and she acts like she's a farm dog.\nBut like this dog had just kind of been in this lady's front yard for years, I guess, and just didn't hadn't even gotten to.\nBut to me, it's like, here I am, like, ra, it's like, you know, they're like, they're my children, you know?\nThey just, I don't, I can't, I can't separate a dog and a human in level of import, you know?\nIt's like that, like you're like, it's like that, that theoretical scenario where the train's coming and you got to figure out which way to switch the tracks, and it's like elderly people or dogs, and you're like, \"I don't know what I'm...\"\nYeah.\nBut I'm with you.\nI love, I'm a, yeah, I just love, I love dogs.\nI like people more than dogs, but I love dogs.\nYeah.\nBut yeah, people are more important to me, but it's close.\nIt's close.\nThere's some people that I would kill for my dog.\nHey, while I'm here, I'm going to go pick up Poppy or whatever is I got.\nI wish I would have, um, I wish I would have saved him on there.\nI think his name was Poppy or Buddy or something, but that little Chihuahua at the Humane Society.\nI got to go pick him in.\nI might, I don't know.\nHe's really goofy.\nWhy not, man?\nTake him.\nHe's like 12 years old or something.\nSo, he just needs somewhere to go, you know?\nWell, you'll give him the last few years of his life.\nBe awesome.\nOh, and then you'll be telling all the other people.\nOliver Anthony came and got me.\nYeah, the rich man from Richmond guy.\nWhat a sweetheart.\nYeah.\nHey, he likes me more than people.\nYeah.\nWell, this is exciting.\nI, I, um, the mothership and just being able to go in there and do music and stuff is going to be nuts.\nI've got a few, like I brought, um, I got a friend of mine named Craig, who's like one of my buddies growing up, who does just like amateur st, he's a really funny guy.\nSo, I got him doing a little bit, and um, I've got Hickok45's son, John, who he does uh, comedy in Chicago right now.\nHe's going to do a little standup thing there, and just it'll just be fun.\nI'm just, it'll be real cool.\nI got the guys that opened for me, the Davidson Brothers, they're going to do a couple songs.\nThey're real, they're really good, and just um, I don't know.\nI've been, this has been like through all the stress and chaos of the last however many months of things going on and stuff being rearranged and all.\nThis has been like my beacon that I've held on to of like, \"We just got to get to the mothership, and then everything will work out,\" you know?\nAnd well, we've been really looking forward to having you.\nEveryone and the staff, all the comics are real pumped.\nEverybody's excited.\nI just couldn't believe the reception I got.\nLike even when I came with Tom that first time, just how everybody sort of took me in, like, like, I don't know.\nI'm just sort of the...\nWell, also a lot of people don't even know who I am because all they've seen of me is like just the internet stuff and all the political stuff.\nAnd so it was really surprising the first time even when we went to that mothership how, I don't know, just everybody there just was like very respectful and like, and it just kind of like welcomed me with open arms.\nI kind of, I thought I was going in there like really like kind of an outsider, and it was way more receptive than I've ever been in Nashville, you know, like with music people.\nYeah.\nThey just, I don't know.\nLike William Montgomery and all those guys were just so, so nice and so, um, just like, you know, you know they're funny and they can make you laugh up on stage, but even in person they're all just like really good people.\nLike they're all just really genuinely good people, you know?\nYeah, we got a great tribe.\nYeah, it's a great tribe.\nAnd the the the whole mentality of the club is like that.\nLike everybody that's there is cool, you know?\nWe've really, I think in comedy, comedy still there's a lot of struggle in comedy for people to make it.\nI think even more so than in music, like that some of those people were telling me stories about like how tough it is to go out, you know, trying to make a, make trying to make a career out of comedy.\nLike I guess unless you get a big Netflix special or you get a big break, like it's paycheck to paycheck for a long time maybe for some of those guys.\nLike until they get or until they get to where they're like a a regular at a big club like that, you're just you're just off, you know, you're out, you're out putting yourself into a very vulnerable position a lot where people can just say, \"Ah, screw that guy,\" you know?\nIt's just...\nBut you have to do that to get good at it.\nBut I think I think they have some appreciation for it that maybe other people don't.\nLike they're like it, like I think that's I, I pick up on that.\nLike they get this, they get that everybody in there is struggling trying to make it and have put a lot of their heart and effort into it, and it just seems like it's there's a lot of respect in there for each for everybody and stuff.\nYeah, 100%.\nEverybody realizes that there's only one way to do it.\nYou got to work hard for a long time.\nThat's the only way.\nIt's one of the few things in life that there's no shortcut to to developing material and getting good at standup.\nIt's a 10-year process.\nYou, it's a 10-year degree.\nYou want to actually become a real standup, it's probably about 10 years.\n10 years of grinding.\nAnd for a lot of people like, \"Oh, that's too long.\"\nIt is too long.\nYeah.\nThat's why most people don't do it.\nYeah.\nBut if you could do it, the people that are doing it and have been doing it for like 10 plus years, like all those people hanging out in the green room, they're all so cool.\nIt's a lot like jiu-jitsu in that regard.\nIt's like people that appreciate the difficulty of something and are really obsessed with getting better at it, you know, and obsessed with helping other people get better at it, too.\nBecause also like jiu-jitsu, the more people that you have around you that are really funny, the funnier you'll get.\nEverybody has to be sharp because the whole show, like sometimes I'll do these Joe Rogan and Friends show and it's [ __ ] Asana, Brian Simpson, Tony Hinchcliffe, Shane Gillis, Mark Norman, and then I go up, like it's like the show's an hour and a half old before I even get on stage.\nYeah.\nSo it's like you have to stay sharp.\nYou have...\nAnd if you're not, you got to pick up the slack.\nYou got to figure it out.\nGet back to the laptop.\nLet's go.\nYou got to rewrite.\nDo this, do that.\nBut, uh, that's what we're all doing.\nYou know, we're all...\nIt's a, it's a vibrant place that there's the, there's a mindset attached to that place.\nIt's very positive.\nYeah.\nThat makes me real happy, and I'm real happy that you're going to be there this weekend.\nYeah.\nI think this mothership thing's got a long future ahead of it in that sense of like just reshaping.\nI don't know.\nI just...\nIt's like a, it is kind of a beacon right now in a, like I don't know.\nIt's like there's a big light shining up in the sky and every that's kind of where everybody's looking.\nIt seems like in that, you know, it's a, and even with Kill Tony, it's just cool that they...\nThat's the coolest part about that is that like you can just go right in there.\nAnybody can go right in there and give it their all, you know, for better, for worse, but you might make it.\nLook, you might be William Montgomery, you know, you might be Cam Patterson, you might be Hans Kim or any of these people that have like legitimate careers now because of that show.\nIt's pretty awesome.\nOliver Anthony this weekend.\nSorry everybody, it's all sold out.\nYou're not going to be able to get in, but uh, I'm [ __ ] pumped.\nI can't wait.\nYeah, I was going to say thank you for being here, man.\nAnd thanks for the podcast.\nIt was a lot of fun.\nI really enjoyed it very much.\nIt's and it's great to see you find your place, man.\nYou, you're getting it.\nYou got it.\nYou know, like you're, you're here now.\nYou're established.\nIn the beginning, you're like, \"What the [ __ ] is happening?\"\nBut now you're like, you got a plan.\nYou're moving.\nIt was so many pitfalls and so many things, but it's a, it's a cont...\nthe contribution of, I'd say, you know, like at the very beginning, you, Jamie Johnson, David Kushner, and just a couple people who were like had been in it for a while and were able to, well, with David, you know, he was fairly recent, but we were both, but just those people just being able to guide me along at the the first six months was when I could have really slipped up hard and like could have just, I just was so thankful that I got through all that without being married to anybody or any company, like at least everything's still...\nNo, you did it the right way.\nYeah, you did it the right way.\nSo, I appreciate the confidence there because it's a terrifying.\nIt is.\nMan, you've been going to, you've been going to work every day for some guy that you hate and some job you hate for so long for like 50 grand a year, and then some, some dude is like showing you like, you know, like, and they have a really convincing way of doing it.\nIt's just like think about how easy you can get prayed into buying some [ __ ] used car on a lot.\nThese people are like that, but like they're like, they're like the professional UFC fighters of psychological warfare.\nLike they're going to make you feel like you're so stupid and that like you've just tricked everybody for 5 minutes and you better, you better do it while it lasts.\nBut and if you don't come with us, it's never going to make it.\nYou're never going to make it.\nBut you were right.\nThey were wrong.\nHaha.\nAnd I don't care if nothing, like I said, if nothing else ever comes of this.\nThis has been just such a blessing to be able to just meet all the people I have and experienced it.\nAnd like it's just cool, man.\nI don't care.\nI don't care where else where it goes from here.\nI'm, I'm just totally, I'm just enamored by it all.\nIt's just been, um, just another dimension I'm living in, dude.\nI don't know.\nIt's like not real life, but it's beautiful.\nYeah.\nAll right.\nThanks for being here.\nYes, sir.\nThank you.\nMaybe in a couple more years.\n[ __ ] yeah.\nA couple months.\n[ __ ] it.\nAll right.\nBye, everybody.\nLater.\n[Music]\n",
  "metadata": {
    "summary": "In this episode of the Joe Rogan Experience, Joe Rogan hosts singer-songwriter Oliver Anthony. They discuss Anthony's music creation process, the challenges of putting out new music, and his decision to remain independent. The conversation expands to include observations on the current state of politics, the influence of social media, and the manipulation tactics employed by tech companies. They also touch on topics like AI's impact on music, the importance of nature, and the value of freedom of speech. Rogan and Anthony also delve into discussions about MMA, the psychology behind fighting, and the importance of authenticity in art and life.",
    "topClaims": [
      {
        "text": "The news is lying to you.",
        "rating": 8.5,
        "chunkId": "ck-dmR9wnz1-yg-8"
      },
      {
        "text": "Private prisons turn people into batteries to generate money.",
        "rating": 7.8,
        "chunkId": "ck-dmR9wnz1-yg-14"
      },
      {
        "text": "AI will take over and eliminate countries.",
        "rating": 8,
        "chunkId": "ck-dmR9wnz1-yg-36"
      },
      {
        "text": "Financial people should not be involved in your art.",
        "rating": 7.5,
        "chunkId": "ck-dmR9wnz1-yg-66"
      },
      {
        "text": "The rebellious spirit of the left needs to be reintegrated with the right to become unstoppable.",
        "rating": 8.2,
        "chunkId": "ck-dmR9wnz1-yg-86"
      }
    ],
    "topQuotes": [
      {
        "text": "They think that you're gullible.",
        "chunkId": "ck-dmR9wnz1-yg-8",
        "chunkNum": 8,
        "relevance": 9.5,
        "interesting": 9.1
      },
      {
        "text": "It's like it like creates this maybe like group identity that's a lot easier to control like for sure.",
        "chunkId": "ck-dmR9wnz1-yg-11",
        "chunkNum": 11,
        "relevance": 8.9,
        "interesting": 8.8
      },
      {
        "text": "I think AI is already like deeply ingrained in music.",
        "chunkId": "ck-dmR9wnz1-yg-37",
        "chunkNum": 37,
        "relevance": 8.1,
        "interesting": 7.9
      },
      {
        "text": "I'm independent so I don't have to do that.",
        "chunkId": "ck-dmR9wnz1-yg-68",
        "chunkNum": 68,
        "relevance": 8.5,
        "interesting": 8.3
      },
      {
        "text": "I think music is, I think that's why I want to focus mostly on music.",
        "chunkId": "ck-dmR9wnz1-yg-87",
        "chunkNum": 87,
        "relevance": 9.2,
        "interesting": 9
      }
    ],
    "topTopics": [
      {
        "name": "ai influence",
        "count": 12,
        "description": "The impact of artificial intelligence on society."
      },
      {
        "name": "political landscape",
        "count": 10,
        "description": "The current state of politics and its impact."
      },
      {
        "name": "music authenticity",
        "count": 8,
        "description": "The importance of music and authenticity."
      },
      {
        "name": "social media impact",
        "count": 7,
        "description": "The role of social media in modern society."
      },
      {
        "name": "freedom speech",
        "count": 6,
        "description": "The nature of freedom of speech."
      }
    ],
    "videoInfo": {
      "id": "dmR9wnz1-yg",
      "etag": "B9kdTkgiDPDxqg8ufw6iM4dm-jU",
      "kind": "youtube#video",
      "snippet": {
        "tags": [
          "Joe Rogan Experience",
          "JRE",
          "Joe",
          "Rogan",
          "podcast",
          "MMA",
          "comedy",
          "stand",
          "up",
          "funny",
          "Freak",
          "Party"
        ],
        "title": "Joe Rogan Experience #2337 - Oliver Anthony",
        "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
        "localized": {
          "title": "Joe Rogan Experience #2337 - Oliver Anthony",
          "description": "Oliver Anthony is a singer-songwriter of country and folk music. His debut album, “Hymnal of a Troubled Man’s Mind,” is available everywhere music is sold.\nhttps://www.oliveranthonymusic.com\n\nGo to https://ExpressVPN.com/ROGANYT to get 4 months free!\nGet 25% off your first order at https://MASAChips.com/JRE"
        },
        "categoryId": "22",
        "thumbnails": {
          "high": {
            "url": "https://i.ytimg.com/vi/dmR9wnz1-yg/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/dmR9wnz1-yg/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/dmR9wnz1-yg/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "default": {
            "url": "https://i.ytimg.com/vi/dmR9wnz1-yg/default.jpg",
            "width": 120,
            "height": 90
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/dmR9wnz1-yg/sddefault.jpg",
            "width": 640,
            "height": 480
          }
        },
        "description": "Oliver Anthony is a singer-songwriter of country and folk music. His debut album, “Hymnal of a Troubled Man’s Mind,” is available everywhere music is sold.\nhttps://www.oliveranthonymusic.com\n\nGo to https://ExpressVPN.com/ROGANYT to get 4 months free!\nGet 25% off your first order at https://MASAChips.com/JRE",
        "publishedAt": "2025-06-13T17:00:59Z",
        "channelTitle": "PowerfulJRE",
        "defaultLanguage": "en",
        "defaultAudioLanguage": "en-US",
        "liveBroadcastContent": "none"
      },
      "statistics": {
        "likeCount": "21913",
        "viewCount": "841629",
        "commentCount": "4027",
        "favoriteCount": "0"
      },
      "contentDetails": {
        "caption": "false",
        "duration": "PT3H39S",
        "dimension": "2d",
        "definition": "hd",
        "projection": "rectangular",
        "contentRating": {},
        "licensedContent": true
      }
    },
    "checkCount": 26,
    "nodeCounts": [
      {
        "node": "Draven",
        "count": 6
      },
      {
        "node": "influence",
        "count": 6
      },
      {
        "node": "Richmond",
        "count": 5
      },
      {
        "node": "music",
        "count": 5
      },
      {
        "node": "songs",
        "count": 4
      },
      {
        "node": "AI",
        "count": 4
      },
      {
        "node": "Trump",
        "count": 4
      },
      {
        "node": "Hillary Clinton",
        "count": 4
      },
      {
        "node": "UFC",
        "count": 4
      },
      {
        "node": "Music",
        "count": 3
      },
      {
        "node": "identity",
        "count": 3
      },
      {
        "node": "control",
        "count": 3
      },
      {
        "node": "Jamie",
        "count": 3
      },
      {
        "node": "birds",
        "count": 3
      },
      {
        "node": "management company",
        "count": 3
      },
      {
        "node": "Facebook",
        "count": 3
      },
      {
        "node": "podcast",
        "count": 3
      },
      {
        "node": "Spotify",
        "count": 3
      },
      {
        "node": "Oliver Anthony",
        "count": 3
      },
      {
        "node": "Elon",
        "count": 3
      },
      {
        "node": "green room",
        "count": 2
      },
      {
        "node": "Adam",
        "count": 2
      },
      {
        "node": "superstar",
        "count": 2
      },
      {
        "node": "podcasts",
        "count": 2
      },
      {
        "node": "social media",
        "count": 2
      },
      {
        "node": "culture",
        "count": 2
      },
      {
        "node": "Appalachian towns",
        "count": 2
      },
      {
        "node": "mayor",
        "count": 2
      },
      {
        "node": "psychology",
        "count": 2
      },
      {
        "node": "People in power",
        "count": 2
      },
      {
        "node": "president",
        "count": 2
      },
      {
        "node": "internet",
        "count": 2
      },
      {
        "node": "fat joint",
        "count": 2
      },
      {
        "node": "Chihuahua",
        "count": 2
      },
      {
        "node": "Buddy",
        "count": 2
      },
      {
        "node": "Poppy",
        "count": 2
      },
      {
        "node": "Marshall",
        "count": 2
      },
      {
        "node": "Joe Rogan",
        "count": 2
      },
      {
        "node": "toxins",
        "count": 2
      },
      {
        "node": "energy",
        "count": 2
      },
      {
        "node": "human beings",
        "count": 2
      },
      {
        "node": "Russia",
        "count": 2
      },
      {
        "node": "Publicly executed",
        "count": 2
      },
      {
        "node": "War",
        "count": 2
      },
      {
        "node": "drones",
        "count": 2
      },
      {
        "node": "artificial intelligence",
        "count": 2
      },
      {
        "node": "China",
        "count": 2
      },
      {
        "node": "AI in music",
        "count": 2
      },
      {
        "node": "Nashville",
        "count": 2
      },
      {
        "node": "authenticity",
        "count": 2
      },
      {
        "node": "songwriting",
        "count": 2
      },
      {
        "node": "music industry",
        "count": 2
      },
      {
        "node": "Attention",
        "count": 2
      },
      {
        "node": "Contact list",
        "count": 2
      },
      {
        "node": "Vermin Supreme",
        "count": 2
      },
      {
        "node": "Kill Tony",
        "count": 2
      },
      {
        "node": "Webcams",
        "count": 2
      },
      {
        "node": "Podcast",
        "count": 2
      },
      {
        "node": "working man",
        "count": 2
      },
      {
        "node": "RadioWV",
        "count": 2
      },
      {
        "node": "Music industry",
        "count": 2
      },
      {
        "node": "money",
        "count": 2
      },
      {
        "node": "church",
        "count": 2
      },
      {
        "node": "oligarchs",
        "count": 2
      },
      {
        "node": "mushrooms",
        "count": 2
      },
      {
        "node": "God",
        "count": 2
      },
      {
        "node": "Virginia",
        "count": 2
      },
      {
        "node": "America",
        "count": 2
      },
      {
        "node": "MAGA",
        "count": 2
      },
      {
        "node": "Antifa",
        "count": 2
      },
      {
        "node": "Austin",
        "count": 2
      },
      {
        "node": "nature",
        "count": 2
      },
      {
        "node": "Live Nation",
        "count": 2
      },
      {
        "node": "phone",
        "count": 2
      },
      {
        "node": "fame",
        "count": 2
      },
      {
        "node": "songwriting process",
        "count": 2
      },
      {
        "node": "song",
        "count": 2
      },
      {
        "node": "scornful woman",
        "count": 2
      },
      {
        "node": "relationships",
        "count": 2
      },
      {
        "node": "jiu-jitsu",
        "count": 2
      },
      {
        "node": "skill set",
        "count": 2
      },
      {
        "node": "technique",
        "count": 2
      },
      {
        "node": "kicks",
        "count": 2
      },
      {
        "node": "kickboxers",
        "count": 2
      },
      {
        "node": "Daniel Cormier",
        "count": 2
      },
      {
        "node": "flow state",
        "count": 2
      },
      {
        "node": "skill",
        "count": 2
      },
      {
        "node": "UFC fighters",
        "count": 2
      },
      {
        "node": "William Montgomery",
        "count": 2
      },
      {
        "node": "Joe Rogan podcast",
        "count": 1
      },
      {
        "node": "The Joe Rogan Experience",
        "count": 1
      },
      {
        "node": "new song",
        "count": 1
      },
      {
        "node": "the song",
        "count": 1
      },
      {
        "node": "sound system",
        "count": 1
      },
      {
        "node": "Oh [ __ ] oh shit",
        "count": 1
      },
      {
        "node": "his opinion",
        "count": 1
      },
      {
        "node": "Song",
        "count": 1
      },
      {
        "node": "Editing",
        "count": 1
      },
      {
        "node": "Leonard Skynyrd",
        "count": 1
      },
      {
        "node": "Billy Contreras",
        "count": 1
      },
      {
        "node": "Ricky Skaggs",
        "count": 1
      },
      {
        "node": "January 5th, 6th, 7th",
        "count": 1
      },
      {
        "node": "Click tracks",
        "count": 1
      },
      {
        "node": "terrible storm",
        "count": 1
      },
      {
        "node": "West Virginia",
        "count": 1
      },
      {
        "node": "Honda inverter generator",
        "count": 1
      },
      {
        "node": "Lowe's",
        "count": 1
      },
      {
        "node": "power knocks out",
        "count": 1
      },
      {
        "node": "side by side",
        "count": 1
      },
      {
        "node": "jeep",
        "count": 1
      },
      {
        "node": "snow",
        "count": 1
      },
      {
        "node": "recorded the song",
        "count": 1
      },
      {
        "node": "electrical pulses",
        "count": 1
      },
      {
        "node": "expensive equipment",
        "count": 1
      },
      {
        "node": "generator on an inverter",
        "count": 1
      },
      {
        "node": "voltage",
        "count": 1
      },
      {
        "node": "trapped in a storm",
        "count": 1
      },
      {
        "node": "scary song",
        "count": 1
      },
      {
        "node": "waves of the generator",
        "count": 1
      },
      {
        "node": "new music",
        "count": 1
      },
      {
        "node": "cash out",
        "count": 1
      },
      {
        "node": "roll",
        "count": 1
      },
      {
        "node": "slow down",
        "count": 1
      },
      {
        "node": "environment",
        "count": 1
      },
      {
        "node": "15 minutes of fame",
        "count": 1
      },
      {
        "node": "first check",
        "count": 1
      },
      {
        "node": "hater",
        "count": 1
      },
      {
        "node": "shows selling out",
        "count": 1
      },
      {
        "node": "Scornful",
        "count": 1
      },
      {
        "node": "relationship",
        "count": 1
      },
      {
        "node": "authentic song",
        "count": 1
      },
      {
        "node": "the news",
        "count": 1
      },
      {
        "node": "social media traffic",
        "count": 1
      },
      {
        "node": "politicians",
        "count": 1
      },
      {
        "node": "entertainment music business",
        "count": 1
      },
      {
        "node": "gullible",
        "count": 1
      },
      {
        "node": "naive",
        "count": 1
      },
      {
        "node": "television",
        "count": 1
      },
      {
        "node": "live show",
        "count": 1
      },
      {
        "node": "farm market",
        "count": 1
      },
      {
        "node": "Morris Farm Market",
        "count": 1
      },
      {
        "node": "Outer Banks",
        "count": 1
      },
      {
        "node": "August 12th",
        "count": 1
      },
      {
        "node": "hokey pokey religious stuff",
        "count": 1
      },
      {
        "node": "COVID",
        "count": 1
      },
      {
        "node": "mass manipulation",
        "count": 1
      },
      {
        "node": "politics",
        "count": 1
      },
      {
        "node": "families",
        "count": 1
      },
      {
        "node": "sports",
        "count": 1
      },
      {
        "node": "shape",
        "count": 1
      },
      {
        "node": "college",
        "count": 1
      },
      {
        "node": "combat sports guy",
        "count": 1
      },
      {
        "node": "Kamaro Usman",
        "count": 1
      },
      {
        "node": "group identity",
        "count": 1
      },
      {
        "node": "subcategories",
        "count": 1
      },
      {
        "node": "prison",
        "count": 1
      },
      {
        "node": "black and white",
        "count": 1
      },
      {
        "node": "Italian family in America",
        "count": 1
      },
      {
        "node": "Disparagement of Italian immigrants",
        "count": 1
      },
      {
        "node": "Grandfather",
        "count": 1
      },
      {
        "node": "Treatment of Guatemalans",
        "count": 1
      },
      {
        "node": "Integration",
        "count": 1
      },
      {
        "node": "White person",
        "count": 1
      },
      {
        "node": "Grouping of nationalities",
        "count": 1
      },
      {
        "node": "Accusations",
        "count": 1
      },
      {
        "node": "Cultural differences",
        "count": 1
      },
      {
        "node": "Casting blame",
        "count": 1
      },
      {
        "node": "ethnicity",
        "count": 1
      },
      {
        "node": "bucket",
        "count": 1
      },
      {
        "node": "inner cities",
        "count": 1
      },
      {
        "node": "conflict",
        "count": 1
      },
      {
        "node": "economy",
        "count": 1
      },
      {
        "node": "disenfranchised",
        "count": 1
      },
      {
        "node": "felons",
        "count": 1
      },
      {
        "node": "private prisons",
        "count": 1
      },
      {
        "node": "workforce",
        "count": 1
      },
      {
        "node": "Private prisons",
        "count": 1
      },
      {
        "node": "Escalation of laws",
        "count": 1
      },
      {
        "node": "Human batteries",
        "count": 1
      },
      {
        "node": "Law enforcement debates",
        "count": 1
      },
      {
        "node": "Disenfranchisement conversations",
        "count": 1
      },
      {
        "node": "DEI",
        "count": 1
      },
      {
        "node": "University racism",
        "count": 1
      },
      {
        "node": "Racism towards Asians",
        "count": 1
      },
      {
        "node": "Racism lawsuits",
        "count": 1
      },
      {
        "node": "Quotas",
        "count": 1
      },
      {
        "node": "Harvard lawsuit",
        "count": 1
      },
      {
        "node": "application process",
        "count": 1
      },
      {
        "node": "discrimination",
        "count": 1
      },
      {
        "node": "academic success",
        "count": 1
      },
      {
        "node": "social activities",
        "count": 1
      },
      {
        "node": "activism",
        "count": 1
      },
      {
        "node": "Harvard",
        "count": 1
      },
      {
        "node": "Asian people",
        "count": 1
      },
      {
        "node": "hard place",
        "count": 1
      },
      {
        "node": "meritocracy",
        "count": 1
      },
      {
        "node": "Bramwell, West Virginia",
        "count": 1
      },
      {
        "node": "government corruption",
        "count": 1
      },
      {
        "node": "Indian",
        "count": 1
      },
      {
        "node": "Chinese",
        "count": 1
      },
      {
        "node": "Intentionally neglected things",
        "count": 1
      },
      {
        "node": "Need for more resources",
        "count": 1
      },
      {
        "node": "Lack of leadership",
        "count": 1
      },
      {
        "node": "State government",
        "count": 1
      },
      {
        "node": "Criminals",
        "count": 1
      },
      {
        "node": "Sociopaths",
        "count": 1
      },
      {
        "node": "Positions of power",
        "count": 1
      },
      {
        "node": "Big cities",
        "count": 1
      },
      {
        "node": "running the country",
        "count": 1
      },
      {
        "node": "average Joe",
        "count": 1
      },
      {
        "node": "convertible",
        "count": 1
      },
      {
        "node": "cigar",
        "count": 1
      },
      {
        "node": "high school",
        "count": 1
      },
      {
        "node": "Privacy",
        "count": 1
      },
      {
        "node": "ExpressVPN",
        "count": 1
      },
      {
        "node": "Swisher Sweets",
        "count": 1
      },
      {
        "node": "Ron White",
        "count": 1
      },
      {
        "node": "Mothership",
        "count": 1
      },
      {
        "node": "Tom Segura",
        "count": 1
      },
      {
        "node": "Foundation Cigars",
        "count": 1
      },
      {
        "node": "Joey Davis",
        "count": 1
      },
      {
        "node": "YouTube",
        "count": 1
      },
      {
        "node": "Stevie Ray Vaughan",
        "count": 1
      },
      {
        "node": "live recorded thing",
        "count": 1
      },
      {
        "node": "live version",
        "count": 1
      },
      {
        "node": "mothership live",
        "count": 1
      },
      {
        "node": "humane society",
        "count": 1
      },
      {
        "node": "Friday and Saturday night",
        "count": 1
      },
      {
        "node": "Austin Humane Society",
        "count": 1
      },
      {
        "node": "Funny dogs",
        "count": 1
      },
      {
        "node": "Older dog",
        "count": 1
      },
      {
        "node": "rescue dogs",
        "count": 1
      },
      {
        "node": "love",
        "count": 1
      },
      {
        "node": "happiness",
        "count": 1
      },
      {
        "node": "best life",
        "count": 1
      },
      {
        "node": "sweet",
        "count": 1
      },
      {
        "node": "luck",
        "count": 1
      },
      {
        "node": "dog's behavior",
        "count": 1
      },
      {
        "node": "affectionate behavior",
        "count": 1
      },
      {
        "node": "dog's interaction",
        "count": 1
      },
      {
        "node": "friendly greeting",
        "count": 1
      },
      {
        "node": "unconditional love",
        "count": 1
      },
      {
        "node": "playful behavior",
        "count": 1
      },
      {
        "node": "belly rub request",
        "count": 1
      },
      {
        "node": "familiarity with love",
        "count": 1
      },
      {
        "node": "understanding",
        "count": 1
      },
      {
        "node": "communication",
        "count": 1
      },
      {
        "node": "White shepherd",
        "count": 1
      },
      {
        "node": "Bone cancer",
        "count": 1
      },
      {
        "node": "Feeding dogs",
        "count": 1
      },
      {
        "node": "Processed food",
        "count": 1
      },
      {
        "node": "Real food",
        "count": 1
      },
      {
        "node": "Farmer's Dog",
        "count": 1
      },
      {
        "node": "Human meat and vegetables",
        "count": 1
      },
      {
        "node": "dogs",
        "count": 1
      },
      {
        "node": "real food",
        "count": 1
      },
      {
        "node": "healthier dog",
        "count": 1
      },
      {
        "node": "body weight",
        "count": 1
      },
      {
        "node": "coat",
        "count": 1
      },
      {
        "node": "preservatives",
        "count": 1
      },
      {
        "node": "Mave",
        "count": 1
      },
      {
        "node": "protein bars",
        "count": 1
      },
      {
        "node": "dog food",
        "count": 1
      },
      {
        "node": "physical health",
        "count": 1
      },
      {
        "node": "eggs",
        "count": 1
      },
      {
        "node": "meat birds",
        "count": 1
      },
      {
        "node": "egg laying hens",
        "count": 1
      },
      {
        "node": "lifespan",
        "count": 1
      },
      {
        "node": "chicken tractors",
        "count": 1
      },
      {
        "node": "healthier eggs",
        "count": 1
      },
      {
        "node": "Legs breaking",
        "count": 1
      },
      {
        "node": "Raising birds",
        "count": 1
      },
      {
        "node": "Tyson",
        "count": 1
      },
      {
        "node": "Depressing",
        "count": 1
      },
      {
        "node": "Killing chickens",
        "count": 1
      },
      {
        "node": "Short life",
        "count": 1
      },
      {
        "node": "Weight of bodies",
        "count": 1
      },
      {
        "node": "Two months old",
        "count": 1
      },
      {
        "node": "Running around",
        "count": 1
      },
      {
        "node": "Amount of chickens",
        "count": 1
      },
      {
        "node": "chicken genetics",
        "count": 1
      },
      {
        "node": "Catholic Church",
        "count": 1
      },
      {
        "node": "fasts",
        "count": 1
      },
      {
        "node": "seed oils",
        "count": 1
      },
      {
        "node": "Vatican",
        "count": 1
      },
      {
        "node": "moral authority",
        "count": 1
      },
      {
        "node": "Council of Trent",
        "count": 1
      },
      {
        "node": "canon law",
        "count": 1
      },
      {
        "node": "Pope",
        "count": 1
      },
      {
        "node": "MASA Chips",
        "count": 1
      },
      {
        "node": "stigma",
        "count": 1
      },
      {
        "node": "corruption",
        "count": 1
      },
      {
        "node": "power hungry",
        "count": 1
      },
      {
        "node": "regime",
        "count": 1
      },
      {
        "node": "automobile business",
        "count": 1
      },
      {
        "node": "power business",
        "count": 1
      },
      {
        "node": "elections",
        "count": 1
      },
      {
        "node": "Putin",
        "count": 1
      },
      {
        "node": "Overthrow in Romania",
        "count": 1
      },
      {
        "node": "Romanian dictator",
        "count": 1
      },
      {
        "node": "Romania",
        "count": 1
      },
      {
        "node": "80s",
        "count": 1
      },
      {
        "node": "Oppressive stuff",
        "count": 1
      },
      {
        "node": "Big speech",
        "count": 1
      },
      {
        "node": "Military turning against",
        "count": 1
      },
      {
        "node": "Cultural shift",
        "count": 1
      },
      {
        "node": "Preacher",
        "count": 1
      },
      {
        "node": "Executing a dictator",
        "count": 1
      },
      {
        "node": "Romania's Christmas Revolution",
        "count": 1
      },
      {
        "node": "Elections",
        "count": 1
      },
      {
        "node": "YouTube video",
        "count": 1
      },
      {
        "node": "Christmas",
        "count": 1
      },
      {
        "node": "Ukraine",
        "count": 1
      },
      {
        "node": "fiber optic cable",
        "count": 1
      },
      {
        "node": "jam",
        "count": 1
      },
      {
        "node": "attack on the planes",
        "count": 1
      },
      {
        "node": "trucks",
        "count": 1
      },
      {
        "node": "log cabins",
        "count": 1
      },
      {
        "node": "sheds",
        "count": 1
      },
      {
        "node": "autonomous weapons",
        "count": 1
      },
      {
        "node": "Greyman books",
        "count": 1
      },
      {
        "node": "The Chaos Agent",
        "count": 1
      },
      {
        "node": "Mark Grainy",
        "count": 1
      },
      {
        "node": "billionaire",
        "count": 1
      },
      {
        "node": "China drones",
        "count": 1
      },
      {
        "node": "drone shows",
        "count": 1
      },
      {
        "node": "suicide drone",
        "count": 1
      },
      {
        "node": "war",
        "count": 1
      },
      {
        "node": "prophetic visions",
        "count": 1
      },
      {
        "node": "warfare",
        "count": 1
      },
      {
        "node": "Tesla bots",
        "count": 1
      },
      {
        "node": "end of times",
        "count": 1
      },
      {
        "node": "ground machinery",
        "count": 1
      },
      {
        "node": "generalization",
        "count": 1
      },
      {
        "node": "hive mind",
        "count": 1
      },
      {
        "node": "industry",
        "count": 1
      },
      {
        "node": "creativity",
        "count": 1
      },
      {
        "node": "art",
        "count": 1
      },
      {
        "node": "countries",
        "count": 1
      },
      {
        "node": "private company",
        "count": 1
      },
      {
        "node": "AI-generated captions",
        "count": 1
      },
      {
        "node": "social media company",
        "count": 1
      },
      {
        "node": "AI's prevalence",
        "count": 1
      },
      {
        "node": "caption writing",
        "count": 1
      },
      {
        "node": "songwriter circles",
        "count": 1
      },
      {
        "node": "AI in sales",
        "count": 1
      },
      {
        "node": "reliance on technology",
        "count": 1
      },
      {
        "node": "flip phone",
        "count": 1
      },
      {
        "node": "phone integration",
        "count": 1
      },
      {
        "node": "song generation pressure",
        "count": 1
      },
      {
        "node": "AI in jobs",
        "count": 1
      },
      {
        "node": "customer base management",
        "count": 1
      },
      {
        "node": "AI integration",
        "count": 1
      },
      {
        "node": "Alternate dimension",
        "count": 1
      },
      {
        "node": "Fast-paced events",
        "count": 1
      },
      {
        "node": "Digital hangouts",
        "count": 1
      },
      {
        "node": "Bots and algorithms",
        "count": 1
      },
      {
        "node": "Marketing psychology",
        "count": 1
      },
      {
        "node": "High school relationship",
        "count": 1
      },
      {
        "node": "Real world problems",
        "count": 1
      },
      {
        "node": "Societal communication",
        "count": 1
      },
      {
        "node": "Submarine collapse",
        "count": 1
      },
      {
        "node": "socializing on the internet",
        "count": 1
      },
      {
        "node": "digital world",
        "count": 1
      },
      {
        "node": "English language",
        "count": 1
      },
      {
        "node": "AI and bots",
        "count": 1
      },
      {
        "node": "manipulation and algorithms",
        "count": 1
      },
      {
        "node": "big companies",
        "count": 1
      },
      {
        "node": "house of mirrors",
        "count": 1
      },
      {
        "node": "consequences of actions",
        "count": 1
      },
      {
        "node": "unsustainable bad news",
        "count": 1
      },
      {
        "node": "online interaction",
        "count": 1
      },
      {
        "node": "unhuman interactions",
        "count": 1
      },
      {
        "node": "constant input of thoughts",
        "count": 1
      },
      {
        "node": "low-level anxiety",
        "count": 1
      },
      {
        "node": "Sugashan Ali",
        "count": 1
      },
      {
        "node": "internet conversations",
        "count": 1
      },
      {
        "node": "foggy thoughts",
        "count": 1
      },
      {
        "node": "8 billion people",
        "count": 1
      },
      {
        "node": "captiv",
        "count": 1
      },
      {
        "node": "Tik Tok",
        "count": 1
      },
      {
        "node": "Instagram",
        "count": 1
      },
      {
        "node": "engagement",
        "count": 1
      },
      {
        "node": "attention",
        "count": 1
      },
      {
        "node": "flashy content",
        "count": 1
      },
      {
        "node": "sex",
        "count": 1
      },
      {
        "node": "hook",
        "count": 1
      },
      {
        "node": "Data",
        "count": 1
      },
      {
        "node": "Tech companies",
        "count": 1
      },
      {
        "node": "AOL",
        "count": 1
      },
      {
        "node": "Regulations",
        "count": 1
      },
      {
        "node": "Free services",
        "count": 1
      },
      {
        "node": "Fan base",
        "count": 1
      },
      {
        "node": "Reports",
        "count": 1
      },
      {
        "node": "Machine",
        "count": 1
      },
      {
        "node": "Pop culture",
        "count": 1
      },
      {
        "node": "Lookalike audiences",
        "count": 1
      },
      {
        "node": "Retention",
        "count": 1
      },
      {
        "node": "Psychology",
        "count": 1
      },
      {
        "node": "Comments",
        "count": 1
      },
      {
        "node": "Profiles",
        "count": 1
      },
      {
        "node": "Platforms",
        "count": 1
      },
      {
        "node": "November",
        "count": 1
      },
      {
        "node": "AI song by Drake",
        "count": 1
      },
      {
        "node": "Removal of AI songs",
        "count": 1
      },
      {
        "node": "Song popularity",
        "count": 1
      },
      {
        "node": "Guy with a guitar",
        "count": 1
      },
      {
        "node": "Getting people into the limelight",
        "count": 1
      },
      {
        "node": "first conversation",
        "count": 1
      },
      {
        "node": "nonprofit",
        "count": 1
      },
      {
        "node": "corrupt",
        "count": 1
      },
      {
        "node": "Richmond money",
        "count": 1
      },
      {
        "node": "buying land",
        "count": 1
      },
      {
        "node": "unscrew their minds",
        "count": 1
      },
      {
        "node": "reconnected into nature",
        "count": 1
      },
      {
        "node": "Cult leader",
        "count": 1
      },
      {
        "node": "Free pony",
        "count": 1
      },
      {
        "node": "President",
        "count": 1
      },
      {
        "node": "Big boot",
        "count": 1
      },
      {
        "node": "Gingivitis and zombie power",
        "count": 1
      },
      {
        "node": "Mandatory toothbrushing policy",
        "count": 1
      },
      {
        "node": "Dental hygiene authoritarian center",
        "count": 1
      },
      {
        "node": "New Hampshire primary",
        "count": 1
      },
      {
        "node": "Connecticut video",
        "count": 1
      },
      {
        "node": "moral and oral decay",
        "count": 1
      },
      {
        "node": "ability to bite back",
        "count": 1
      },
      {
        "node": "nation indentured",
        "count": 1
      },
      {
        "node": "salivation is at stake",
        "count": 1
      },
      {
        "node": "23rd century",
        "count": 1
      },
      {
        "node": "mandatory toothbrushing law",
        "count": 1
      },
      {
        "node": "secret dental police",
        "count": 1
      },
      {
        "node": "dental re-education centers",
        "count": 1
      },
      {
        "node": "winged monkeys",
        "count": 1
      },
      {
        "node": "Open Mic",
        "count": 1
      },
      {
        "node": "Mockery",
        "count": 1
      },
      {
        "node": "Toothbrush Cult",
        "count": 1
      },
      {
        "node": "Giving a vehicle",
        "count": 1
      },
      {
        "node": "Social Media",
        "count": 1
      },
      {
        "node": "Brilliant Comics",
        "count": 1
      },
      {
        "node": "Scornful Song",
        "count": 1
      },
      {
        "node": "Little Videos",
        "count": 1
      },
      {
        "node": "Private jet",
        "count": 1
      },
      {
        "node": "Podcast influence",
        "count": 1
      },
      {
        "node": "Information sharing",
        "count": 1
      },
      {
        "node": "Influence",
        "count": 1
      },
      {
        "node": "Existential impact",
        "count": 1
      },
      {
        "node": "Picture posting",
        "count": 1
      },
      {
        "node": "Tension",
        "count": 1
      },
      {
        "node": "Adam Curry",
        "count": 1
      },
      {
        "node": "Anthony Cumia",
        "count": 1
      },
      {
        "node": "Tom Green",
        "count": 1
      },
      {
        "node": "Adam Corolla",
        "count": 1
      },
      {
        "node": "Opie and Anthony",
        "count": 1
      },
      {
        "node": "Podfather",
        "count": 1
      },
      {
        "node": "Radio to the internet",
        "count": 1
      },
      {
        "node": "studio",
        "count": 1
      },
      {
        "node": "ice house",
        "count": 1
      },
      {
        "node": "warehouse",
        "count": 1
      },
      {
        "node": "armed security",
        "count": 1
      },
      {
        "node": "special ops guys",
        "count": 1
      },
      {
        "node": "stage in Chicago",
        "count": 1
      },
      {
        "node": "2012",
        "count": 1
      },
      {
        "node": "reading the comments",
        "count": 1
      },
      {
        "node": "looking at the numbers",
        "count": 1
      },
      {
        "node": "Russell Crowe",
        "count": 1
      },
      {
        "node": "Dennis Quaid",
        "count": 1
      },
      {
        "node": "Mel Gibson",
        "count": 1
      },
      {
        "node": "Chicago",
        "count": 1
      },
      {
        "node": "Bono",
        "count": 1
      },
      {
        "node": "how big is this thing going to get",
        "count": 1
      },
      {
        "node": "Fade away",
        "count": 1
      },
      {
        "node": "Hardcore fans",
        "count": 1
      },
      {
        "node": "Lost views",
        "count": 1
      },
      {
        "node": "Sensationalism",
        "count": 1
      },
      {
        "node": "Cool place",
        "count": 1
      },
      {
        "node": "Bruce Springsteen",
        "count": 1
      },
      {
        "node": "East Street band",
        "count": 1
      },
      {
        "node": "Born to Run",
        "count": 1
      },
      {
        "node": "working man songs",
        "count": 1
      },
      {
        "node": "disguise",
        "count": 1
      },
      {
        "node": "trucker hat",
        "count": 1
      },
      {
        "node": "ripped jeans",
        "count": 1
      },
      {
        "node": "oil stains",
        "count": 1
      },
      {
        "node": "magical fantasy land",
        "count": 1
      },
      {
        "node": "streaming numbers",
        "count": 1
      },
      {
        "node": "comments",
        "count": 1
      },
      {
        "node": "negative comments",
        "count": 1
      },
      {
        "node": "core team",
        "count": 1
      },
      {
        "node": "Lex",
        "count": 1
      },
      {
        "node": "musicians",
        "count": 1
      },
      {
        "node": "publicist",
        "count": 1
      },
      {
        "node": "staff",
        "count": 1
      },
      {
        "node": "positions and jobs",
        "count": 1
      },
      {
        "node": "Executive influence",
        "count": 1
      },
      {
        "node": "Corporate mindset",
        "count": 1
      },
      {
        "node": "Scornful release",
        "count": 1
      },
      {
        "node": "Richmond reaction videos",
        "count": 1
      },
      {
        "node": "Publishing administration deal",
        "count": 1
      },
      {
        "node": "Warner Chapel",
        "count": 1
      },
      {
        "node": "Soundon",
        "count": 1
      },
      {
        "node": "Traditional musician",
        "count": 1
      },
      {
        "node": "TikTok",
        "count": 1
      },
      {
        "node": "Streaming services",
        "count": 1
      },
      {
        "node": "Music distribution",
        "count": 1
      },
      {
        "node": "Rights",
        "count": 1
      },
      {
        "node": "Labels",
        "count": 1
      },
      {
        "node": "New music",
        "count": 1
      },
      {
        "node": "TikTok creators",
        "count": 1
      },
      {
        "node": "Talent discovery",
        "count": 1
      },
      {
        "node": "Pushing artists",
        "count": 1
      },
      {
        "node": "Breaking the cycle",
        "count": 1
      },
      {
        "node": "The spotlight",
        "count": 1
      },
      {
        "node": "Helping more artists",
        "count": 1
      },
      {
        "node": "Strength in numbers",
        "count": 1
      },
      {
        "node": "Multiplication factor",
        "count": 1
      },
      {
        "node": "Companies",
        "count": 1
      },
      {
        "node": "Good songs",
        "count": 1
      },
      {
        "node": "music production",
        "count": 1
      },
      {
        "node": "festivals",
        "count": 1
      },
      {
        "node": "label",
        "count": 1
      },
      {
        "node": "views",
        "count": 1
      },
      {
        "node": "terrifying",
        "count": 1
      },
      {
        "node": "felt wrong",
        "count": 1
      },
      {
        "node": "old job",
        "count": 1
      },
      {
        "node": "Republic",
        "count": 1
      },
      {
        "node": "profits",
        "count": 1
      },
      {
        "node": "hoodwinked",
        "count": 1
      },
      {
        "node": "deals",
        "count": 1
      },
      {
        "node": "marketing money",
        "count": 1
      },
      {
        "node": "inflated",
        "count": 1
      },
      {
        "node": "boss",
        "count": 1
      },
      {
        "node": "man upstairs",
        "count": 1
      },
      {
        "node": "scaled back",
        "count": 1
      },
      {
        "node": "label contract",
        "count": 1
      },
      {
        "node": "release music",
        "count": 1
      },
      {
        "node": "financial people",
        "count": 1
      },
      {
        "node": "money in music",
        "count": 1
      },
      {
        "node": "sign somebody",
        "count": 1
      },
      {
        "node": "relatability",
        "count": 1
      },
      {
        "node": "executives",
        "count": 1
      },
      {
        "node": "crew cut",
        "count": 1
      },
      {
        "node": "star",
        "count": 1
      },
      {
        "node": "independence",
        "count": 1
      },
      {
        "node": "being lame",
        "count": 1
      },
      {
        "node": "being cool",
        "count": 1
      },
      {
        "node": "Beyonce's country album",
        "count": 1
      },
      {
        "node": "celebrity illusion",
        "count": 1
      },
      {
        "node": "manager",
        "count": 1
      },
      {
        "node": "social media post",
        "count": 1
      },
      {
        "node": "Alex Jones",
        "count": 1
      },
      {
        "node": "Alpha Brain gummies",
        "count": 1
      },
      {
        "node": "training",
        "count": 1
      },
      {
        "node": "conspiracy theorist",
        "count": 1
      },
      {
        "node": "media donation",
        "count": 1
      },
      {
        "node": "mass media",
        "count": 1
      },
      {
        "node": "healthy food",
        "count": 1
      },
      {
        "node": "Sean Johnson",
        "count": 1
      },
      {
        "node": "business",
        "count": 1
      },
      {
        "node": "Bill Gates",
        "count": 1
      },
      {
        "node": "Casting children",
        "count": 1
      },
      {
        "node": "Testosterone",
        "count": 1
      },
      {
        "node": "Voice deepening",
        "count": 1
      },
      {
        "node": "Trans men",
        "count": 1
      },
      {
        "node": "Dwayne Johnson",
        "count": 1
      },
      {
        "node": "Aleandro Moreski",
        "count": 1
      },
      {
        "node": "Kanye",
        "count": 1
      },
      {
        "node": "opera",
        "count": 1
      },
      {
        "node": "Castrating men",
        "count": 1
      },
      {
        "node": "Unix",
        "count": 1
      },
      {
        "node": "homes of royals",
        "count": 1
      },
      {
        "node": "Nero",
        "count": 1
      },
      {
        "node": "wife",
        "count": 1
      },
      {
        "node": "slave boy",
        "count": 1
      },
      {
        "node": "Unchecked power",
        "count": 1
      },
      {
        "node": "no kings protest",
        "count": 1
      },
      {
        "node": "Walmart",
        "count": 1
      },
      {
        "node": "cheap labor",
        "count": 1
      },
      {
        "node": "tariffs",
        "count": 1
      },
      {
        "node": "moral situation",
        "count": 1
      },
      {
        "node": "profit motive",
        "count": 1
      },
      {
        "node": "human race",
        "count": 1
      },
      {
        "node": "maps of meaning",
        "count": 1
      },
      {
        "node": "society",
        "count": 1
      },
      {
        "node": "motivations",
        "count": 1
      },
      {
        "node": "origins of evil",
        "count": 1
      },
      {
        "node": "Holocaust",
        "count": 1
      },
      {
        "node": "Soviet Union",
        "count": 1
      },
      {
        "node": "mass chaos",
        "count": 1
      },
      {
        "node": "Jordan",
        "count": 1
      },
      {
        "node": "Free speech",
        "count": 1
      },
      {
        "node": "Arguments",
        "count": 1
      },
      {
        "node": "Struggle",
        "count": 1
      },
      {
        "node": "Being played",
        "count": 1
      },
      {
        "node": "Organized protests",
        "count": 1
      },
      {
        "node": "Burning cop cars",
        "count": 1
      },
      {
        "node": "Changing laws",
        "count": 1
      },
      {
        "node": "executive order",
        "count": 1
      },
      {
        "node": "undocumented workers",
        "count": 1
      },
      {
        "node": "path to citizenship",
        "count": 1
      },
      {
        "node": "ICE raids",
        "count": 1
      },
      {
        "node": "Home Depot",
        "count": 1
      },
      {
        "node": "state of anxiety",
        "count": 1
      },
      {
        "node": "benefits",
        "count": 1
      },
      {
        "node": "people that will take advantage",
        "count": 1
      },
      {
        "node": "working on farms",
        "count": 1
      },
      {
        "node": "ice raid",
        "count": 1
      },
      {
        "node": "South Boston",
        "count": 1
      },
      {
        "node": "ICE",
        "count": 1
      },
      {
        "node": "North Carolina",
        "count": 1
      },
      {
        "node": "gang members",
        "count": 1
      },
      {
        "node": "criminals",
        "count": 1
      },
      {
        "node": "immigration laws",
        "count": 1
      },
      {
        "node": "founding fathers",
        "count": 1
      },
      {
        "node": "religious freedom",
        "count": 1
      },
      {
        "node": "zebra mentality",
        "count": 1
      },
      {
        "node": "Hillary Kug",
        "count": 1
      },
      {
        "node": "Ryman",
        "count": 1
      },
      {
        "node": "gay marriage",
        "count": 1
      },
      {
        "node": "transgender",
        "count": 1
      },
      {
        "node": "emotions",
        "count": 1
      },
      {
        "node": "political differences",
        "count": 1
      },
      {
        "node": "private equity companies",
        "count": 1
      },
      {
        "node": "transgender rights",
        "count": 1
      },
      {
        "node": "rearranging stripes",
        "count": 1
      },
      {
        "node": "Tulsi Gabbard",
        "count": 1
      },
      {
        "node": "Democratic party",
        "count": 1
      },
      {
        "node": "Alex Jones syndrome",
        "count": 1
      },
      {
        "node": "Big Donnie",
        "count": 1
      },
      {
        "node": "Hillary",
        "count": 1
      },
      {
        "node": "bots",
        "count": 1
      },
      {
        "node": "border",
        "count": 1
      },
      {
        "node": "illegal",
        "count": 1
      },
      {
        "node": "Obama",
        "count": 1
      },
      {
        "node": "Tough conditions",
        "count": 1
      },
      {
        "node": "Deportation",
        "count": 1
      },
      {
        "node": "Law-abiding immigrants",
        "count": 1
      },
      {
        "node": "Stiff fine",
        "count": 1
      },
      {
        "node": "Back taxes",
        "count": 1
      },
      {
        "node": "Learn English",
        "count": 1
      },
      {
        "node": "Waiting in line",
        "count": 1
      },
      {
        "node": "Focus group",
        "count": 1
      },
      {
        "node": "country",
        "count": 1
      },
      {
        "node": "party",
        "count": 1
      },
      {
        "node": "trans kids",
        "count": 1
      },
      {
        "node": "trans people",
        "count": 1
      },
      {
        "node": "hop in line",
        "count": 1
      },
      {
        "node": "Twitter bio",
        "count": 1
      },
      {
        "node": "American culture",
        "count": 1
      },
      {
        "node": "Europe",
        "count": 1
      },
      {
        "node": "system",
        "count": 1
      },
      {
        "node": "patriotic cosplaying type people",
        "count": 1
      },
      {
        "node": "anger",
        "count": 1
      },
      {
        "node": "riot",
        "count": 1
      },
      {
        "node": "enemies",
        "count": 1
      },
      {
        "node": "rebellious spirit",
        "count": 1
      },
      {
        "node": "reintegration",
        "count": 1
      },
      {
        "node": "George Washington University",
        "count": 1
      },
      {
        "node": "Black Block",
        "count": 1
      },
      {
        "node": "Black Lives Matter",
        "count": 1
      },
      {
        "node": "protests",
        "count": 1
      },
      {
        "node": "political identity",
        "count": 1
      },
      {
        "node": "rebelling against the system",
        "count": 1
      },
      {
        "node": "organize people together",
        "count": 1
      },
      {
        "node": "influence music",
        "count": 1
      },
      {
        "node": "rich controlling music",
        "count": 1
      },
      {
        "node": "songs on the charts",
        "count": 1
      },
      {
        "node": "people who voted differently",
        "count": 1
      },
      {
        "node": "lyrics",
        "count": 1
      },
      {
        "node": "organized protests",
        "count": 1
      },
      {
        "node": "changes in policies",
        "count": 1
      },
      {
        "node": "our community",
        "count": 1
      },
      {
        "node": "dictatorship",
        "count": 1
      },
      {
        "node": "young people",
        "count": 1
      },
      {
        "node": "echo chamber",
        "count": 1
      },
      {
        "node": "social credit",
        "count": 1
      },
      {
        "node": "activisty",
        "count": 1
      },
      {
        "node": "sense of purpose",
        "count": 1
      },
      {
        "node": "Fishing",
        "count": 1
      },
      {
        "node": "Bow hunting",
        "count": 1
      },
      {
        "node": "Protests",
        "count": 1
      },
      {
        "node": "ICE protests",
        "count": 1
      },
      {
        "node": "First Amendment",
        "count": 1
      },
      {
        "node": "Civil rights",
        "count": 1
      },
      {
        "node": "Rosa Parks",
        "count": 1
      },
      {
        "node": "War is a Racket",
        "count": 1
      },
      {
        "node": "Smedley Butler",
        "count": 1
      },
      {
        "node": "book",
        "count": 1
      },
      {
        "node": "government",
        "count": 1
      },
      {
        "node": "RFK Jr.",
        "count": 1
      },
      {
        "node": "information overload",
        "count": 1
      },
      {
        "node": "queen mom",
        "count": 1
      },
      {
        "node": "Nor McDonald",
        "count": 1
      },
      {
        "node": "The View",
        "count": 1
      },
      {
        "node": "Saturday Night Live",
        "count": 1
      },
      {
        "node": "Norm type of comedy",
        "count": 1
      },
      {
        "node": "Clinton spec",
        "count": 1
      },
      {
        "node": "vulgar humor",
        "count": 1
      },
      {
        "node": "weekend update",
        "count": 1
      },
      {
        "node": "funniest people of all time",
        "count": 1
      },
      {
        "node": "goofy stuff",
        "count": 1
      },
      {
        "node": "legend",
        "count": 1
      },
      {
        "node": "Freedom of speech",
        "count": 1
      },
      {
        "node": "Different voices",
        "count": 1
      },
      {
        "node": "Silencing voices",
        "count": 1
      },
      {
        "node": "Natural instincts",
        "count": 1
      },
      {
        "node": "ARC event",
        "count": 1
      },
      {
        "node": "Online posts",
        "count": 1
      },
      {
        "node": "Political arrests",
        "count": 1
      },
      {
        "node": "Reposting online",
        "count": 1
      },
      {
        "node": "arresting people",
        "count": 1
      },
      {
        "node": "the government",
        "count": 1
      },
      {
        "node": "woke mind virus",
        "count": 1
      },
      {
        "node": "the left",
        "count": 1
      },
      {
        "node": "criticize anything",
        "count": 1
      },
      {
        "node": "moral high ground",
        "count": 1
      },
      {
        "node": "polarizes",
        "count": 1
      },
      {
        "node": "nuclear war",
        "count": 1
      },
      {
        "node": "governor run",
        "count": 1
      },
      {
        "node": "disillusioned",
        "count": 1
      },
      {
        "node": "entanglements",
        "count": 1
      },
      {
        "node": "regular dude",
        "count": 1
      },
      {
        "node": "office",
        "count": 1
      },
      {
        "node": "Veron Supreme",
        "count": 1
      },
      {
        "node": "Bureaucracy",
        "count": 1
      },
      {
        "node": "Resistance to change",
        "count": 1
      },
      {
        "node": "Nazi",
        "count": 1
      },
      {
        "node": "Elon Trump situation",
        "count": 1
      },
      {
        "node": "Conversation on the phone",
        "count": 1
      },
      {
        "node": "administration",
        "count": 1
      },
      {
        "node": "paperwork and red tape",
        "count": 1
      },
      {
        "node": "Doge",
        "count": 1
      },
      {
        "node": "genuine audits",
        "count": 1
      },
      {
        "node": "consequences",
        "count": 1
      },
      {
        "node": "the truth",
        "count": 1
      },
      {
        "node": "US aid",
        "count": 1
      },
      {
        "node": "Mike Benz",
        "count": 1
      },
      {
        "node": "Agency for International Development",
        "count": 1
      },
      {
        "node": "regime change",
        "count": 1
      },
      {
        "node": "Pentagon",
        "count": 1
      },
      {
        "node": "health crisis",
        "count": 1
      },
      {
        "node": "Bobby Kennedy",
        "count": 1
      },
      {
        "node": "pharmaceutical drug corporations",
        "count": 1
      },
      {
        "node": "health consequence",
        "count": 1
      },
      {
        "node": "Robert Malone",
        "count": 1
      },
      {
        "node": "mRNA vaccine technology",
        "count": 1
      },
      {
        "node": "Neil Young",
        "count": 1
      },
      {
        "node": "Make America healthy again movement",
        "count": 1
      },
      {
        "node": "vaccine schedule",
        "count": 1
      },
      {
        "node": "bipartisan",
        "count": 1
      },
      {
        "node": "corporations",
        "count": 1
      },
      {
        "node": "healing center",
        "count": 1
      },
      {
        "node": "chemicals and technology",
        "count": 1
      },
      {
        "node": "systems in nature",
        "count": 1
      },
      {
        "node": "compartmentalize monstrosity",
        "count": 1
      },
      {
        "node": "modern society",
        "count": 1
      },
      {
        "node": "introverted job position",
        "count": 1
      },
      {
        "node": "going out on tour",
        "count": 1
      },
      {
        "node": "birds chirp",
        "count": 1
      },
      {
        "node": "planting on acres",
        "count": 1
      },
      {
        "node": "growing food",
        "count": 1
      },
      {
        "node": "healing",
        "count": 1
      },
      {
        "node": "mental institution",
        "count": 1
      },
      {
        "node": "Marine with PTSD",
        "count": 1
      },
      {
        "node": "PTSD",
        "count": 1
      },
      {
        "node": "city",
        "count": 1
      },
      {
        "node": "better way",
        "count": 1
      },
      {
        "node": "rebellion",
        "count": 1
      },
      {
        "node": "outdoor amphitheater",
        "count": 1
      },
      {
        "node": "primitive brain",
        "count": 1
      },
      {
        "node": "nonprofit shows",
        "count": 1
      },
      {
        "node": "blueprint",
        "count": 1
      },
      {
        "node": "A or B ticketing market",
        "count": 1
      },
      {
        "node": "music venue",
        "count": 1
      },
      {
        "node": "sanctuaries",
        "count": 1
      },
      {
        "node": "Ticketmaster",
        "count": 1
      },
      {
        "node": "Public speaking",
        "count": 1
      },
      {
        "node": "Communities",
        "count": 1
      },
      {
        "node": "Healing center",
        "count": 1
      },
      {
        "node": "Bobby",
        "count": 1
      },
      {
        "node": "Italy",
        "count": 1
      },
      {
        "node": "Leather work",
        "count": 1
      },
      {
        "node": "Vineyard work",
        "count": 1
      },
      {
        "node": "Human mind",
        "count": 1
      },
      {
        "node": "psychedelics",
        "count": 1
      },
      {
        "node": "misunderstanding",
        "count": 1
      },
      {
        "node": "brains",
        "count": 1
      },
      {
        "node": "unnatural world",
        "count": 1
      },
      {
        "node": "man-made",
        "count": 1
      },
      {
        "node": "Social media",
        "count": 1
      },
      {
        "node": "Weight off your brain",
        "count": 1
      },
      {
        "node": "Social management",
        "count": 1
      },
      {
        "node": "Time management",
        "count": 1
      },
      {
        "node": "Small social circle",
        "count": 1
      },
      {
        "node": "Text messages",
        "count": 1
      },
      {
        "node": "Being bothered",
        "count": 1
      },
      {
        "node": "Balance",
        "count": 1
      },
      {
        "node": "Changing phone number",
        "count": 1
      },
      {
        "node": "Not texting back",
        "count": 1
      },
      {
        "node": "Unread text messages",
        "count": 1
      },
      {
        "node": "Phone",
        "count": 1
      },
      {
        "node": "Work",
        "count": 1
      },
      {
        "node": "Being driven",
        "count": 1
      },
      {
        "node": "Flip phone",
        "count": 1
      },
      {
        "node": "Brain back",
        "count": 1
      },
      {
        "node": "Contact",
        "count": 1
      },
      {
        "node": "Immediate interaction",
        "count": 1
      },
      {
        "node": "Immediate contact",
        "count": 1
      },
      {
        "node": "Wife is pregnant",
        "count": 1
      },
      {
        "node": "Freedom",
        "count": 1
      },
      {
        "node": "Bad news overload",
        "count": 1
      },
      {
        "node": "Large-scale socialization",
        "count": 1
      },
      {
        "node": "Tight tribe",
        "count": 1
      },
      {
        "node": "Resentment",
        "count": 1
      },
      {
        "node": "Beneficial relationships",
        "count": 1
      },
      {
        "node": "Emergency",
        "count": 1
      },
      {
        "node": "resentful behavior",
        "count": 1
      },
      {
        "node": "wrong people",
        "count": 1
      },
      {
        "node": "terrible place",
        "count": 1
      },
      {
        "node": "success",
        "count": 1
      },
      {
        "node": "collective thing",
        "count": 1
      },
      {
        "node": "music catalog",
        "count": 1
      },
      {
        "node": "social hierarchy",
        "count": 1
      },
      {
        "node": "human experience",
        "count": 1
      },
      {
        "node": "artistic connection",
        "count": 1
      },
      {
        "node": "AI's limitations",
        "count": 1
      },
      {
        "node": "Scornful Woman",
        "count": 1
      },
      {
        "node": "isolation",
        "count": 1
      },
      {
        "node": "Thanksgiving or Christmas",
        "count": 1
      },
      {
        "node": "Joey",
        "count": 1
      },
      {
        "node": "kitchen",
        "count": 1
      },
      {
        "node": "feel",
        "count": 1
      },
      {
        "node": "guitar",
        "count": 1
      },
      {
        "node": "live performance",
        "count": 1
      },
      {
        "node": "Mercer County, West Virginia",
        "count": 1
      },
      {
        "node": "nightmare",
        "count": 1
      },
      {
        "node": "court",
        "count": 1
      },
      {
        "node": "pain",
        "count": 1
      },
      {
        "node": "firefighter",
        "count": 1
      },
      {
        "node": "Brazil",
        "count": 1
      },
      {
        "node": "GoPro footage",
        "count": 1
      },
      {
        "node": "description",
        "count": 1
      },
      {
        "node": "firefighting",
        "count": 1
      },
      {
        "node": "GoPro video",
        "count": 1
      },
      {
        "node": "Joseph",
        "count": 1
      },
      {
        "node": "third company",
        "count": 1
      },
      {
        "node": "Bomb Luendos",
        "count": 1
      },
      {
        "node": "Chile",
        "count": 1
      },
      {
        "node": "firecracker",
        "count": 1
      },
      {
        "node": "Release",
        "count": 1
      },
      {
        "node": "Content",
        "count": 1
      },
      {
        "node": "Show",
        "count": 1
      },
      {
        "node": "Phone recording",
        "count": 1
      },
      {
        "node": "File",
        "count": 1
      },
      {
        "node": "Content idea",
        "count": 1
      },
      {
        "node": "Procrastination",
        "count": 1
      },
      {
        "node": "recording",
        "count": 1
      },
      {
        "node": "guitar parts",
        "count": 1
      },
      {
        "node": "album",
        "count": 1
      },
      {
        "node": "long-term plan",
        "count": 1
      },
      {
        "node": "vision boards",
        "count": 1
      },
      {
        "node": "doing what you like doing",
        "count": 1
      },
      {
        "node": "making the most of this",
        "count": 1
      },
      {
        "node": "looking back when old",
        "count": 1
      },
      {
        "node": "doing this thing",
        "count": 1
      },
      {
        "node": "machine crumble",
        "count": 1
      },
      {
        "node": "authentic",
        "count": 1
      },
      {
        "node": "disconnected",
        "count": 1
      },
      {
        "node": "Pearl Jam",
        "count": 1
      },
      {
        "node": "real music",
        "count": 1
      },
      {
        "node": "label propped",
        "count": 1
      },
      {
        "node": "Ticket Master",
        "count": 1
      },
      {
        "node": "organic side of things",
        "count": 1
      },
      {
        "node": "memories",
        "count": 1
      },
      {
        "node": "1999 live stain session",
        "count": 1
      },
      {
        "node": "Hank Williams III songs",
        "count": 1
      },
      {
        "node": "powerful thing",
        "count": 1
      },
      {
        "node": "groove",
        "count": 1
      },
      {
        "node": "inspiring",
        "count": 1
      },
      {
        "node": "Charlie Crockett",
        "count": 1
      },
      {
        "node": "Ellis Bullard",
        "count": 1
      },
      {
        "node": "White horse",
        "count": 1
      },
      {
        "node": "comedy community",
        "count": 1
      },
      {
        "node": "neural link",
        "count": 1
      },
      {
        "node": "simulation theory",
        "count": 1
      },
      {
        "node": "mass deception",
        "count": 1
      },
      {
        "node": "spiritual element",
        "count": 1
      },
      {
        "node": "simulation",
        "count": 1
      },
      {
        "node": "program",
        "count": 1
      },
      {
        "node": "Jesus Christ",
        "count": 1
      },
      {
        "node": "software",
        "count": 1
      },
      {
        "node": "life",
        "count": 1
      },
      {
        "node": "bacteria",
        "count": 1
      },
      {
        "node": "organized systems",
        "count": 1
      },
      {
        "node": "inherent parts",
        "count": 1
      },
      {
        "node": "forgotten",
        "count": 1
      },
      {
        "node": "technology",
        "count": 1
      },
      {
        "node": "soil",
        "count": 1
      },
      {
        "node": "humanity",
        "count": 1
      },
      {
        "node": "truth",
        "count": 1
      },
      {
        "node": "expansion",
        "count": 1
      },
      {
        "node": "innovation",
        "count": 1
      },
      {
        "node": "demise",
        "count": 1
      },
      {
        "node": "replacement",
        "count": 1
      },
      {
        "node": "Phone numbers",
        "count": 1
      },
      {
        "node": "Best friend",
        "count": 1
      },
      {
        "node": "High school phone number",
        "count": 1
      },
      {
        "node": "Pay phone",
        "count": 1
      },
      {
        "node": "Memory",
        "count": 1
      },
      {
        "node": "dependence",
        "count": 1
      },
      {
        "node": "instantaneously",
        "count": 1
      },
      {
        "node": "weird",
        "count": 1
      },
      {
        "node": "Gettysburg",
        "count": 1
      },
      {
        "node": "Resources",
        "count": 1
      },
      {
        "node": "Protocol",
        "count": 1
      },
      {
        "node": "Entertainment",
        "count": 1
      },
      {
        "node": "Harnessed resources",
        "count": 1
      },
      {
        "node": "Information and data",
        "count": 1
      },
      {
        "node": "Kings",
        "count": 1
      },
      {
        "node": "Powerful people",
        "count": 1
      },
      {
        "node": "Phones",
        "count": 1
      },
      {
        "node": "Informed",
        "count": 1
      },
      {
        "node": "congressional insider trading",
        "count": 1
      },
      {
        "node": "Theo Vaughn",
        "count": 1
      },
      {
        "node": "corporate entity",
        "count": 1
      },
      {
        "node": "people in the past",
        "count": 1
      },
      {
        "node": "powers that be",
        "count": 1
      },
      {
        "node": "Internet scrambling",
        "count": 1
      },
      {
        "node": "Google it",
        "count": 1
      },
      {
        "node": "affects elections",
        "count": 1
      },
      {
        "node": "FBI contacted Facebook",
        "count": 1
      },
      {
        "node": "remove factual information",
        "count": 1
      },
      {
        "node": "conspiracy fantasy",
        "count": 1
      },
      {
        "node": "ability to communicate",
        "count": 1
      },
      {
        "node": "contingent upon these platforms",
        "count": 1
      },
      {
        "node": "Facebook Marketplace",
        "count": 1
      },
      {
        "node": "magic trick",
        "count": 1
      },
      {
        "node": "void",
        "count": 1
      },
      {
        "node": "community",
        "count": 1
      },
      {
        "node": "practice",
        "count": 1
      },
      {
        "node": "aggression",
        "count": 1
      },
      {
        "node": "cooperative way",
        "count": 1
      },
      {
        "node": "kickboxing",
        "count": 1
      },
      {
        "node": "sparring",
        "count": 1
      },
      {
        "node": "Eddie Bravo",
        "count": 1
      },
      {
        "node": "arm bar",
        "count": 1
      },
      {
        "node": "Hicks",
        "count": 1
      },
      {
        "node": "Grace",
        "count": 1
      },
      {
        "node": "Tour de France",
        "count": 1
      },
      {
        "node": "EPO",
        "count": 1
      },
      {
        "node": "cardio",
        "count": 1
      },
      {
        "node": "genetic",
        "count": 1
      },
      {
        "node": "drive",
        "count": 1
      },
      {
        "node": "athletic performance",
        "count": 1
      },
      {
        "node": "physical condition",
        "count": 1
      },
      {
        "node": "athletic ability",
        "count": 1
      },
      {
        "node": "Ilia Topuria",
        "count": 1
      },
      {
        "node": "Charles Olivera",
        "count": 1
      },
      {
        "node": "featherweights",
        "count": 1
      },
      {
        "node": "Vulcanowski",
        "count": 1
      },
      {
        "node": "Max Holloway",
        "count": 1
      },
      {
        "node": "155 pounds",
        "count": 1
      },
      {
        "node": "Ilia",
        "count": 1
      },
      {
        "node": "punches",
        "count": 1
      },
      {
        "node": "sport",
        "count": 1
      },
      {
        "node": "contenders",
        "count": 1
      },
      {
        "node": "spotlight",
        "count": 1
      },
      {
        "node": "organization",
        "count": 1
      },
      {
        "node": "fights",
        "count": 1
      },
      {
        "node": "fighters",
        "count": 1
      },
      {
        "node": "wins",
        "count": 1
      },
      {
        "node": "Alex Pereira",
        "count": 1
      },
      {
        "node": "debut",
        "count": 1
      },
      {
        "node": "boogeyman",
        "count": 1
      },
      {
        "node": "kickboxing fights",
        "count": 1
      },
      {
        "node": "Strickland",
        "count": 1
      },
      {
        "node": "flying knee",
        "count": 1
      },
      {
        "node": "world champion",
        "count": 1
      },
      {
        "node": "Light heavyweight title",
        "count": 1
      },
      {
        "node": "MMA",
        "count": 1
      },
      {
        "node": "Unpredictability",
        "count": 1
      },
      {
        "node": "Kickboxer",
        "count": 1
      },
      {
        "node": "Ground fighting",
        "count": 1
      },
      {
        "node": "Specialists",
        "count": 1
      },
      {
        "node": "Glover Teixeira",
        "count": 1
      },
      {
        "node": "UFC light heavyweight champion",
        "count": 1
      },
      {
        "node": "takedowns",
        "count": 1
      },
      {
        "node": "training partners",
        "count": 1
      },
      {
        "node": "ground",
        "count": 1
      },
      {
        "node": "feet",
        "count": 1
      },
      {
        "node": "broken toes",
        "count": 1
      },
      {
        "node": "Yuri Prohaskca",
        "count": 1
      },
      {
        "node": "knee",
        "count": 1
      },
      {
        "node": "Noro virus",
        "count": 1
      },
      {
        "node": "Khalil Roundtree",
        "count": 1
      },
      {
        "node": "light heavyweight division",
        "count": 1
      },
      {
        "node": "left hook",
        "count": 1
      },
      {
        "node": "careers",
        "count": 1
      },
      {
        "node": "Sean Strickland",
        "count": 1
      },
      {
        "node": "investments",
        "count": 1
      },
      {
        "node": "retirement",
        "count": 1
      },
      {
        "node": "seminars",
        "count": 1
      },
      {
        "node": "champion",
        "count": 1
      },
      {
        "node": "gyms",
        "count": 1
      },
      {
        "node": "MMA fighter",
        "count": 1
      },
      {
        "node": "UFC night",
        "count": 1
      },
      {
        "node": "excitement",
        "count": 1
      },
      {
        "node": "art form",
        "count": 1
      },
      {
        "node": "martial arts",
        "count": 1
      },
      {
        "node": "World star hip hop",
        "count": 1
      },
      {
        "node": "raw",
        "count": 1
      },
      {
        "node": "DNA",
        "count": 1
      },
      {
        "node": "cricket",
        "count": 1
      },
      {
        "node": "chicken fighting",
        "count": 1
      },
      {
        "node": "gambling",
        "count": 1
      },
      {
        "node": "New York",
        "count": 1
      },
      {
        "node": "roosters",
        "count": 1
      },
      {
        "node": "Mexican neighborhood",
        "count": 1
      },
      {
        "node": "LA",
        "count": 1
      },
      {
        "node": "roast goats",
        "count": 1
      },
      {
        "node": "integrated societies",
        "count": 1
      },
      {
        "node": "Spanish",
        "count": 1
      },
      {
        "node": "chicken farming",
        "count": 1
      },
      {
        "node": "chicken fights",
        "count": 1
      },
      {
        "node": "coliseum",
        "count": 1
      },
      {
        "node": "dog fighting",
        "count": 1
      },
      {
        "node": "Pit bulls",
        "count": 1
      },
      {
        "node": "fighting dogs",
        "count": 1
      },
      {
        "node": "fight",
        "count": 1
      },
      {
        "node": "psycho people",
        "count": 1
      },
      {
        "node": "nutty",
        "count": 1
      },
      {
        "node": "dating",
        "count": 1
      },
      {
        "node": "girl",
        "count": 1
      },
      {
        "node": "Michael Vick's place",
        "count": 1
      },
      {
        "node": "Michael Vick",
        "count": 1
      },
      {
        "node": "Puppies",
        "count": 1
      },
      {
        "node": "Dogs",
        "count": 1
      },
      {
        "node": "Eye-opening experience",
        "count": 1
      },
      {
        "node": "pack mentality",
        "count": 1
      },
      {
        "node": "white shepherd",
        "count": 1
      },
      {
        "node": "black German shepherd",
        "count": 1
      },
      {
        "node": "breeder's dog",
        "count": 1
      },
      {
        "node": "swimming in the creek",
        "count": 1
      },
      {
        "node": "farm dog",
        "count": 1
      },
      {
        "node": "children",
        "count": 1
      },
      {
        "node": "dog",
        "count": 1
      },
      {
        "node": "love dogs",
        "count": 1
      },
      {
        "node": "people",
        "count": 1
      },
      {
        "node": "Humane Society",
        "count": 1
      },
      {
        "node": "theoretical scenario",
        "count": 1
      },
      {
        "node": "train",
        "count": 1
      },
      {
        "node": "mothership",
        "count": 1
      },
      {
        "node": "John",
        "count": 1
      },
      {
        "node": "Craig",
        "count": 1
      },
      {
        "node": "Davidson Brothers",
        "count": 1
      },
      {
        "node": "Joe Rogan and Friends",
        "count": 1
      },
      {
        "node": "Brian Simpson",
        "count": 1
      },
      {
        "node": "Tony Hinchcliffe",
        "count": 1
      },
      {
        "node": "Shane Gillis",
        "count": 1
      },
      {
        "node": "Cam Patterson",
        "count": 1
      },
      {
        "node": "Hans Kim",
        "count": 1
      },
      {
        "node": "Jamie Johnson",
        "count": 1
      },
      {
        "node": "David Kushner",
        "count": 1
      },
      {
        "node": "psychological warfare",
        "count": 1
      },
      {
        "node": "used car",
        "count": 1
      },
      {
        "node": "feeling stupid",
        "count": 1
      },
      {
        "node": "meeting people",
        "count": 1
      },
      {
        "node": "another dimension",
        "count": 1
      }
    ],
    "topicGroups": {
      "groups": [
        {
          "topics": [
            "Trump",
            "Hillary Clinton",
            "People in power",
            "president",
            "Russia",
            "China",
            "MAGA",
            "Antifa",
            "Vermin Supreme",
            "oligarchs"
          ],
          "category": {
            "name": "Politics",
            "description": "Politics and Current Events"
          }
        },
        {
          "topics": [
            "podcast",
            "podcasts",
            "Joe Rogan",
            "Joe Rogan podcast",
            "The Joe Rogan Experience",
            "Kill Tony",
            "Facebook",
            "social media",
            "Attention",
            "Webcams",
            "RadioWV",
            "Editing",
            "Spotify",
            "influence",
            "internet",
            "his opinion"
          ],
          "category": {
            "name": "Media and Entertainment",
            "description": "Entertainment and Media"
          }
        },
        {
          "topics": [
            "music",
            "songs",
            "Oliver Anthony",
            "songwriting",
            "music industry",
            "song",
            "new song",
            "the song",
            "AI in music",
            "Billy Contreras",
            "Leonard Skynyrd",
            "Nashville",
            "sound system",
            "Oh [ __ ] oh shit",
            "Music industry"
          ],
          "category": {
            "name": "Music",
            "description": "Music and Songwriting"
          }
        },
        {
          "topics": [
            "Jamie",
            "Elon",
            "Adam",
            "William Montgomery",
            "Draven",
            "Buddy",
            "Poppy",
            "Marshall",
            "Daniel Cormier"
          ],
          "category": {
            "name": "People",
            "description": "People and Personalities"
          }
        },
        {
          "topics": [
            "AI",
            "artificial intelligence",
            "drones",
            "phone",
            "Contact list"
          ],
          "category": {
            "name": "Technology",
            "description": "Technology and AI"
          }
        },
        {
          "topics": [
            "culture",
            "identity",
            "control",
            "authenticity",
            "working man",
            "America",
            "Virginia",
            "Appalachian towns",
            "church",
            "God",
            "relationships",
            "fame",
            "scornful woman"
          ],
          "category": {
            "name": "Culture",
            "description": "Society and Culture"
          }
        },
        {
          "topics": [
            "toxins",
            "mushrooms",
            "energy",
            "human beings",
            "fat joint"
          ],
          "category": {
            "name": "Health",
            "description": "Health and Wellness"
          }
        },
        {
          "topics": [
            "management company",
            "Live Nation",
            "money"
          ],
          "category": {
            "name": "Business",
            "description": "Business and Finance"
          }
        },
        {
          "topics": [
            "UFC",
            "jiu-jitsu",
            "skill set",
            "technique",
            "kicks",
            "kickboxers",
            "UFC fighters",
            "flow state",
            "skill"
          ],
          "category": {
            "name": "Sports",
            "description": "Sports and Fitness"
          }
        },
        {
          "topics": [
            "Richmond",
            "birds",
            "green room",
            "superstar",
            "mayor",
            "psychology",
            "nature",
            "Austin",
            "Chihuahua",
            "songwriting process",
            "Publicly executed"
          ],
          "category": {
            "name": "Miscellaneous",
            "description": "Miscellaneous"
          }
        },
        {
          "topics": [
            "War"
          ],
          "category": {
            "name": "War",
            "description": "War and Conflict"
          }
        }
      ]
    },
    "shortSummary": "Joe Rogan interviews singer-songwriter Oliver Anthony, discussing his music, the music industry, politics, and various societal issues.",
    "lastStoryCheck": "2025-07-14T22:57:54.658Z",
    "storyCheckResults": {
      "missingChunks": [],
      "missingStories": [],
      "totalCategories": 11,
      "totalChunksChecked": 152
    }
  }
}