{
  "id": "WfmrEa0L08E",
  "title": "Joe Rogan Experience #2344 - Amjad Masad",
  "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
  "publishedAt": "2025-07-02T17:00:52.000Z",
  "cleanText": "Joe Rogan podcast. Check it out.\nThe Joe Rogan Experience.\nTrain by day. Joe Rogan podcast by night. All day.\nWhat's up?\nWhat's up, man? Good.\nSo, uh, having this, uh, big Counter-Strike tournament in town, does that give you the Joneses?\nTotally. Totally. You know, it's like your, so your, your, your guy Jason, um, was telling me about it. Uh, cuz, you know, in addition to driving, he also flies the uh, uh, helicopter and he told me like the Red Bull guys were like flying off and there's like this big tournament. I looked it up. I was like, \"Oh, Counter-Strike.\" So, I used to be a bit of a pro player myself.\nSo, how do you get out of pro playing? Because the problem with like playing games is that it's essentially like an eight-hour-a-day thing. Like it becomes a giant chunk of your life, right? And I would imagine if you're playing pro, it's even more of a commitment.\nYou know, I, I take a different view on games. You know, a lot of people kind of view it as a, as sort of somehow like a negative thing, especially for kids. Actually, my, uh, I got my kid, my four-year-old, like a Nintendo, uh, Switch early on. We're playing together because I feel like for me, it helped me a lot with like strategy thinking, with reaction time.\nMhm.\nI think like gamers tend to be can think, think really fast. And have you seen the, the studies that they've done about surgeons?\nNo. Tell me.\nSurgeons that play video games regularly are much less likely to make mistakes.\nI totally believe it. Yeah.\nSomething in the neighborhood of 25%. Is that what it is, Jamie? Something like that.\nBut so much so that I would say you should teach video games to surgeons. Like it, it should actually be like a required thing like cross-training, right? Isn't the army also recruiting from gamers today as well? That's what I heard.\nImagine like drone pilots, right? I mean, that would make a big difference, especially if you can get them used to like the same controllers.\nTotally.\nYou know, because you know, those controllers kind of become a part of your hand, like you know exactly where all the buttons are. And if you're a kid that's playing [ __ ] Counterstrike or whatever it is, Call of Duty every day, I would imagine that that just becomes secondary nature.\nYeah.\nWhat is the thing with surgeons?\nIt's nuts, right?\nLook it up. It might be higher than 25%.\nIt was a very particular kind of surgery though, too. But it was like, uh, I mean, they're almost using controllers on.\nYeah. But this that they were making less mistakes. I, I don't think it's entirely negative.\nI, because I love games. I love playing them. But I love them so much that I don't play them because I know I don't have any time.\nIt's Quake is your, your favorite game, right?\nYeah. Yeah. So here, 27, oh, 37% decrease in errors. That's wild.\n27% faster task completion time. That's nuts.\nAnd so those guys grew up, uh, playing video game or did they get to them on video games?\nSays more than three hours per leap.\nI think they were still playing when they were doing the study.\nYeah.\nSo like that, I mean, imagine something that you like, a pill you could take that would give you a 37% decrease in errors and a 27% faster task completion. That would be an incredible pill. Like you would, you would make every surgeon take it. Did you take your video game pill before you do surgery? Hey man, don't operate on my [ __ ] brain unless you take your video game pill.\nYou know, that's, that's, uh, you know, next time I, I need to have a surgery or whatever, I'm just going to ask the doctor if they're a gamer.\nHow much do you do, bro?\nBut you know, Dave and I were talking about the one thing, and maybe that's kind of showing, showing our age a little bit, but the one thing that's kind of like a little weird slash, I don't, somehow like a little dystopian is the whole streaming situation where like kids are not like playing the game, they're like watching someone play the game.\nYeah, that's not good. And it's like this zombifying thing where like they'll, they'll spend hours just watching people.\nYeah. Just tick tocking. It's essentially like Tik Tok, but video games, right? Cuz Tik Tok is kind of this mindless thing. You're just scrolling through mindless things and now you're mindlessly watching someone else play a game.\nYeah. Yeah. It's almost like someone is like, there's this strange thing with technology where like someone is living life and doing things and you're like sort of, it's almost voyerism or something like that about it, you know, David Foster Wallace, um, you know, the guy from Infinite Jest wrote a, uh, wrote a, a essay on on TVs and you know, he, he, he committed suicide before, um, before like, you know, the emergence of, of mobile phones and things like, uh, but he was very preient on the impact of technology on, on, on society and especially on, on America, and he was also like addicted to TV and he, he talked about how, you know, it activates some kind of something in us that is, uh, you know, something in human nature about voyerism and that's the thing that that television and Tik Tok and things like that activate, and it's like this negative addictive kind of behavior that's like really bad for society.\nI definitely think there's an aspect of voyerism, but there's just a, a dull drone of attention draw. There's a dullness to it that just like sucks you in like slack jaw.\nIt is watching nonsense over and over and over again that does just enough to captivate your attention, but doesn't excite you, doesn't stimulate you, doesn't necessarily inspire you to do anything. That is the first fly we've ever had in this room.\nBoom.\nOh, you're going to kill it. That was the, you're a nice person. That's like evil people would have killed that fly right away.\nBut it's, um, it's just this thing where it doesn't do a lot. It's not like, you know, like, have you ever done Disney World?\nYeah.\nDo, did you ever do Disney World in Florida where you do that gira?\nThere's the, uh, Avatar Ride?\nNo, I, I just went to a California one.\nOkay. Yeah.\nThe Avatar Ride is, uh, Flights of Freedom.\nFlights of Passage.\nFights of passage. Um, you, it's a VR game.\nWell, you know, a ride rather, and you put on a VR helmet and you get on this like motorcycle-looking thing, you're essentially riding a dragon. It's unbelievably engaging. It's incredible. It's the best ride I've ever been on in my life.\nLike, you're flying around, you feel the breeze, you're on this thing, and the sounds are incredible.\nThat's like engrossing, right? Like it takes over you.\nStimulating. Yeah. But that's not what you're getting from like Tik Tok or like streaming. You're getting this, right? This dull. So, it's sustainable.\nYeah. I wonder which is worse, this or like opium habit or something.\nI know people that have done opium that are like functional. Yeah.\nYou know, they can, they can take pills and like kind of, I mean, I'm sure eventually their life falls off the rails, but it's like sort of semi, they're semi-functional when they're on these things. They can hold down a job and show up every day and they're just like semi-functional opiate.\nThere's a dude I watched like a YouTube video, but like he's known for having this contrarian opinion on on drugs that you can like control it, like you can, you can do these drugs.\nWhat does he look like?\nI don't know. Um, I, I think he's a black dude. Uh, oh, Carl Hart. Dr. Carl Hart. Yeah. Yeah. He's been here a couple times. He's great.\nWhat do you think of his ideas?\nI think it's entirely biologically variable. Um, I know people that cannot drink. They, they drink and then they're gone. They get like hamster eyes, like, like, get these black eyes where they're like their soul goes away and then they're just off to the races and picking up hookers and doing cocaine and they find themselves in Guatemala.\nThey just nuts. They can't drink.\nI can drink. I, I, I don't, I don't pretend that the way my body handles alcohol is the way everybody's body handles alcohol.\nI think that's the, the same with everything. I think that's the same most certainly with marijuana. I know some people that just cannot smoke marijuana and other people it's fine.\nYeah.\nI think it's very, we're all very different physically.\nIt's interesting.\nUh, alcohol, uh, is, um, is sort of on the downtrend all over America, but, but, uh, especially with young people, uh, especially in Silicon Valley.\nUm, everyone there, um, listens to Huberman. I call him the grand mufty of Silicon Valley cuz he'll say no, no alcohol, no drinking. Everyone's like, don't drink and like all the parties are now like mocktails and and and things like that and they're probably a lot of boring conversations unfortunately.\nYeah, it's a little boring. I mean, it's the very repetitive. It's all kind of like, will AI kill us and kind of, you guys would know better than anybody.\nYeah, you guys are at the forefront of it unfortunately.\nYeah, I quit drinking. I drink, quit drinking over three months ago.\nOh wow.\nI know you guys did used to do sober October.\nYeah. Yeah. And that wasn't that hard. And you know, I was like, \"Ah, it's going to be one whole month.\" And then I did. I was like, \"That's pretty easy.\" But I, I just had some revelations, I guess. And it's, I think the big one is just physical fitness. I work out so much and I would drink and go, go to my club and have a couple, not a lot either.\nJust have a few drinks and the next day just feel like total [ __ ].\nI think with, with age especially, it starts affecting you.\nIt's always been like that.\nIt's always been like that. I've always been hung over after a night of drinking, but it's, you don't feel it normally like in normal life. If I just did normal stuff, it'd be fine. It's when you're in the gym that you notice, right?\nWhen you're doing like second and third set of squats or something like that, you're like, \"Oh, god.\"\nYeah.\n100%.\nAnd I haven't had any bad days since I quit drinking. Oh, cool.\nIt, I've eliminated all that. And I'm like, just that alone is worth it. That just that alone, it's worth quitting.\nSo, uh, why do you think there's a, there's this trend? Is it, is it mostly for health? Like the,\nWell, I think there's a big health trend with a lot of young people. I think a lot of young people are recognizing the value of supplements and there's that fly.\nThere's a difference between you and me. I'm going to kill this [ __ ].\nFirst fly you've ever had in here, Jamie. That's kind of crazy.\nBeen here five years. One brought with me from California.\nHe, he snuck in because there's a lot of steps that [ __ ] has to go through to get into this room.\nUm, I think a lot of people are very health conscious. That's the, the rise of cold plunging and sauna use and, you know, all these different things like intermittent fasting where people are really paying attention to their body and really paying attention and and noticing that if you do follow these steps, it really does make a significant difference in the way you feel and maybe more importantly, um, the way everything operates, not just your body, but your brain. It's like your, your function, your cognitive function improves with physical fitness.\nAnd you know, if you're an ambitious person and you want to do well in life, you want your body to work well. It's your, you know, alcohol is not your friend.\nYeah.\nAnd I wonder how much of it is, is your impact because those things you got me into all these things you through your podcast.\nUm, my, my wife and I, uh, just built like this a small kind of spa in our in our home with like a cold plunge, uh, and a, and a sauna and a hot tub and I'll try to do it every day. And you know, um, something you say I keep saying to myself is like, conquer your inner [ __ ].\nYeah. It's like this such a good and I feel like, um, cold plunge especially kind of, um, uh, it's just something regardless health benefits or not, something about it like just mental toughness, like trying to do it every day and every day I chicken out every day. I'm like, I don't want to go in. Right. But, uh, I do too.\nI, my inner [ __ ] speaks the loudest when I'm lifting the lid off the coal plunge.\nMy inner [ __ ] is like, don't do this. You don't have to do this. You can do whatever you want. You're a free man. You can go have a sandwich, you know.\nRight. Right.\nBut you just got to decide that you're the boss.\nYeah. And and I think, uh, a lot of what discipline is for me is, is that again, even even keto and I did carnivore and and these diets. Um, like I'm not sure how much health benefits there is. I feel like keto is, is really good on your like blood sugar. Keeps you kind of on a, you know, even keel kind of throughout the, the day. But for me, whenever there's like a lot of chaos in my life, I look at what can I control, right?\nAnd typically diet is the first thing. Whatever it is, I'm like, I'm going to go carnivore. I'm going to go keto. And the fact that I can control that and and and enforce discipline on myself kind of puts me, puts me at ease and I feel like I can control the other thing in my business, family or or life.\nBut that mindset is probably how you stop playing video games every day.\nYeah. Because I would imagine like we were talking about earlier, like that addiction is one of the strongest addictions I've ever faced in my life, right?\nLike when I was talk, if I would be talking to people and the conversation was boring, I'd be like, I could be playing Quake right now. Like, why am I here having this\n\n\nBoring ass conversation where I could be launching rockets at people and having a good time? But the other thing, uh, for me is, uh, programming. So I got into programming, uh, early in my life. Um, I was 6 years old when my father bought a computer. Uh, I was born and raised in Amman, Jordan. Uh, and, you know, we're the, like, the first people in, I know, ever at the time that had a, that had a computer. And I remember, what year was this? 1993. I was 6 years old. Okay. So 93. So what kind of computer was that? Was that like an old school IBM? IBM PC, MS DOS, Microsoft DOS. So you did the real deal. Yeah. I know a lot of, uh, Americans, uh, would, would like get a Mac as their first year. Yeah. Yeah. Yeah. We, uh, no, we didn't have Mac. I actually wasn't introduced to Apple until, until kind of recently in my, in my life. Really? Yeah. Like recently? Recently? Like, no, like, you know, 12 years ago, 13 years ago when I moved to the US. God, Apple has such a stranglehold in America. It's really incredible. Yeah. It's, it's amazing. But, you know, we, we didn't know much about it. So I got into, into DOS. I remember one of my earliest memories is, you know, standing behind my father as he was kind of pulling up this, like, a huge manual and like learning how to, like, type commands, and he was like, you know, finger typing those commands, and then I would, like, watch him, and then, and then after he leaves, I'll go and, like, try those things. And one day he caught me. He was like, \"What are you doing?\" Like, I know how to do this. I'll show you. And so I knew how to, like, start games, like, do a little bit of programming, do a little bit of scripting, and, and, you know, that's how I got into, into computers, and I was obsessed. And initially it sort of got me into gaming, but then you want to mod the games. Have you ever done any modding? Um, I've done a few things, like, turn textures off and stuff like that and Yeah. Yeah. And that, that's another thing that I think is healthy about gaming is, like, a gateway to programming. Sure. Gateway drug to programming. And so I got, I got into that, into, like, modding, like, Counter Strike and things like that. Those were fun. And then just, like, the feeling that you can make something is just, like, such a profound, Yeah. such a profound feeling. And that's really kind of what I carried through my whole life and became sort of my life mission. Now with my company, Replit, what we do is, like, we make it so that anyone can become a programmer. Um, you just talk to your phone and your app sort of like chat GPT, and it starts coding for you. It's like a program software engineering agent, right? So it's like the AI guides you through it. Yeah. Not only guides you through it, uh, it codes for you. So you're, you're, you're sort of, you know, you programmers typically, you know, you think about the idea a little bit about the logic, but most of the time they're sort of wrangling the syntax and the it of it all. Um, and I thought that was always, you know, additional complexity that doesn't necessarily have to be there. And so when, when I saw, you know, GBT for the first time, uh, I thought this, you know, this could potentially, like, transform programming and make it accessible to more and more people. Uh, because it really transformed my life. You know, the reason I'm in America is because I invented a piece of software. Uh, and I thought, you know, if you make it available to more people, they can, they can transform their lives. Why was your dad messing around with computers? Was he doing it for fun? Was it This episode is brought to you by Visible. I want to let you in on something. Your current wireless carrier does not want you to know about Visible because Visible is the ultimate wireless hack. No confusing plans with surprise fees. No nonsense. Just fast speeds, great coverage without the premium cost. With Visible, you get one line wireless with unlimited data powered by Verizon's network for $25 a month. Taxes and fees included. Seriously, $25 a month flat. What you see is what you pay. No hidden fees on top of that. Ready to see? Join now and unlock unlimited data for just $25 a month on the Visible plan. Don't think wireless can be so transparent, so Visible? Well, now you know. Switch today at visible.com/rogan. Terms apply. See visible.com for plan features and network management details. Yeah. So, my dad, uh, my dad is a Palestinian refugee. Yeah, you were telling me the story and I want to get into that, cuz it's kind of crazy. Like, put, tell the whole story of how this wound up happening. Yeah. Yeah. Yeah. So, um, my family is originally from, from Hifa, which is now in Israel, uh, and they were expelled as part of the 1948 Nakba, uh, where, where Palestinians were, were sort of kicked out. And they went to, like, how does your dad describe that? How old was he when that was going on? My father was born in Syria. Uh, so my, um, uh, my, uh, grandma and my grandpa and my uncles, uh, were, were, were kind of kicked out. And, and the way they would describe that is, uh, they, they, they try to fight, they try to, like, keep their home, but, uh, it was, like, this overwhelming force. They, they weren't organized. It wasn't, they were just, like, people. It wasn't, they didn't really have an army, at least in that, in that place. And, um, and eventually at gunpoint, they, they took their homes and and tell them to go. Uh, if, if you're down south, you went to Gaza, and that's why, like, 70% of Gazans are refugees from Israel, like, that the people that are, you know, getting massacquered right now are originally from Israel, from the land that we, that people call Israel today. Um, and then if, if you're in the north, like Hifa or Yafa, whatever, uh, you went, you went, like, to Lebanon, you, or, or to the West Bank, or to, um, or to, to, uh, or to Jordan or Syria. So my family went to Syria. My father was, was born in Syria. But my grandfather was a, like, a railroad engineer. Uh, so they were, like, you know, they were, like, city people. They were urban. So they couldn't, like, you know, they wanted to, to, you know, have a place where, where they can, you know, there's, there's, uh, uh, they wanted to live in a city. Um, and so originally the West Bank didn't work for them, and they ended up in Syria, but then Amman, Jordan was kind of coming up, and there was a lot of opportunities there. So my father was born in Syria and then moved to Amman when they were 6 years old and built the life there, and they really kind of focus on education and trying to kind of rebuild their life from scratch. Uh, so my father, um, and all my uncles kind of went and got educated in Egypt, Turkey, places like that. And so my father, uh, uh, got an engineering degree, civil engineering degree, uh, from, from Turkey. Uh, and he was always interested in, in technology. And that whole thing, we're kicking people out of Palestine, is, is such an inconvenient story today. When, when people are talking about Israel and Palestine and the conflict, they, they do not like talking about what happened in 1948. Yeah. And I think it's important, like, I think, I think for us to, to reach some kind of peace, which is really hard to talk, talk about when, when you see what's happened in Gaza, even, even yesterday, you know. Yeah. Yeah. The, the people that were waiting for food got bombed. Yeah. It's insane. And it, no one wants to talk about it, right? And, and, but, but if you, if you do talk about it, you're anti-Semitic. It's, which is so strange. Like, I do, I don't know how they've wrangled that. It's, it's been hard for me in, in tech, cuz, you know, like, probably the only, you know, prominent Palestinian in tech that, that, that is talking about it, and so that's, uh, Do you get pushback? Oh, of course, lots of, like, what do people say to you? Uh, anti-Semitic. Uh, how is it anti-Semitic? I criticize the state of Israel. Our, our position, every moderate Palestinian that I know, their position is, like, two-state solution. We need the emergence of, uh, of the state of Palestine, you know, uh, and, and that's the best way to ending the occupation is the best way to guarantee peace and, and security even for Israelis. Um, and, uh, but, but yeah, it's, it's just, like, it's used. It sort of reminds me, you know, in, in tech, we went through this, like, quote unquote woke period where you couldn't talk about certain things as well. Um, and, uh, has that gone away? Yeah. Yeah. Yeah. Totally gone away. Yeah. What do you, what do you think caused it to go away? Um, Elon, really? Yeah. Like Twitter. Buying Twitter. Buying Twitter is the single most impactful thing for free speech, uh, especially on, on these issues, um, of, of being able to, you know, um, talk, talk freely about a lot of subjects that are more sensitive. Imagine if he didn't buy it. Yeah. I mean, that would have, imagine if the same ownership was in place and they, and then Harris wins and they continue to ramp things up. Yeah. Yeah, I don't know what, what you think of, of, of the new, new administration. I certainly there are things that I like about and some of their prot, uh, you know, posture and things like that, but, you know, what's happening now is, you know, it's kind of disappointing. It's insane. We were told there would be no Well, there's two things that are insane. One is the targeting of migrant workers. Not cartel members, not gang members, not drug dealers, just construction workers showing up in construction sites and raiding them, gardeners. Yeah. Like, really? Or stu, or Palestinian students, um, on college campuses, uh, or, or not, like, there's a Turk, did you see this video of this, uh, Turkish students at TUS University that wrote an essay and then, uh, there's a video of, like, ICE agents, like, I don't know, is that a woman? Yeah. Yeah. Yeah. What was her essay about? It was just critical of Israel, right? Just critical of Israel. Yeah. I mean, and that's enough to get you kicked out of the country. I mean, there's a, there's a long history of, of, of anti-colonial activism in US colleges, you know, that led to, to, you know, South Africa changing and all of that. And I, I think this is a continuation of that. I, I mean, I don't agree with all their, like, a lot of, there's a lot of radicalism. Uh, a lot of young people are attracted to, like, more radical positions on, on Israel Palestine, and, um, I, which I don't mind those positions as long as someone's able to counter those positions, right? The problem is these supposed free speech warriors want, want to silence anybody who has a more conservative opinion. That's not the way to handle it. The way to handle it is to have a better argument. That's not American, American. I mean, what attracted him as country, you know, from, you know, you, from the moment, uh, that was aware and we started, like, consuming American media and American culture, is, is freedom, is the concept of freedom, which I think is real. I think is real. It is. I was watching this, um, psychology student from, I think it's, I think he's from Colombia, but he has a page on Instagram. I wish I could remember his name because he's very good. He's a young guy, but he had a very important point, and it was essentially that fascism rises as the overcorrection response to communism, and that we essentially had this Marxist communism rise in first universities and then it made its way into into business because these people left the university and then found their way into corporate America, and then they were essentially instituting those, and then the blowback to that, the push back is this fascism. And that was that, like, last century. No. Well, they're talking about now forever historically. He's talking about, like, over time, whether it's Mao, whether it's Stalin, like, fascism is the response almost always to communism. Interesting. And that you know what we're, what we, we experience with this country is this continual overcorrection. Overcorrection to the left, then overcorrection to the right to counter that. And the people that are the R, that's the guy. Anthony Rispo. That's it. Really, really smart guy. And very interesting thing, Jamie. How'd you nail that that quick? Good job, buddy. Uh, you said those words right as I saw decades of training. Yeah. Communism. Fascism. Yeah. Communism came first. Fascism came response. Now today's left tears down norms and destabilizes the country under the guise of progress. We're watching the conditions for another reaction build. History doesn't repeat, but it echoes. Yeah. Do, do you know this, uh, uh, this, like, theory? I know you, you've had Mark Andre, uh, on the show. This, uh, James Burnham managerial revolution theory. No, not, not by hand. I'm, I'm not an expert in it, but, like, the, the idea is that, um, like, communism, fascism, and, and even some form of capitalism that sort of we're living under right now is, like, managerialism is the idea that, you know, capitalism, capitalism used to be this idea that the, um, the owner founders of those companies of, you know, uh, capitalist companies were running them. Um, and, uh, and it was, like, a, it was, like, true capitalism of sorts. But, uh, both, uh, you know, communism and fascism, uh, share this property of, uh, centralized control and, like, a class of people that are sort of managerials. And maybe those are the elite sort of Ivy, Ivy League students that are trained to be managers, and, and, and they, they grow up in the system, kind of bred to become, like, managers of these companies, and today's America is, like, trending that way, where it is, like, a managerial society. Uh, in Silicon Valley, there's, like, a reaction to that right now. Uh, people call it founder mode, where a lot of founders felt like they were losing control of their companies because they're hiring all these managers, and these managers are running the companies like you would run, um, City Bank, and, and then, you know, a lot of founders were, like, no, we need to, we need to run those companies like we built them. And Elon is, like, obviously at the forefront of that, right? I once, uh, visited, uh, XAI when they were just starting out, Elon's AI company, uh, and there were, like, 70 people, all of them reported to Elon. They didn't have a single manager on staff. Wow. Uh, and they would send him an email every week. I was like, \"What, what did\n\n\nWhat are the things you accomplished this week?\"\n\nRight.\nWell, that was the outrageous thing that he asked people to do at Doge.\nYeah.\nYeah.\nAnd people were freaking out.\nFive minutes a week.\nWhat are the things you accomplished this week?\nHow you know?\nHe said all you have to do is respond, right?\nAnd they didn't want, they push back so hard on being accountable for their work.\nYeah.\nBut that's government for you.\nYeah.\nYou know, I mean, government is the grossest, most incompetent form of business.\nYou know, it's a monopoly.\nIt's a complete, total monopoly.\nLike the way he described some of the um things that they found at Doge, it's like you could never run a business that way, cuz not only would it not be profitable, the fraud would get you arrested.\nYou would, you would go to jail for something that's standard in the government.\nRight.\nRight.\nYeah.\nI, I mean my, my opinion of, of uh, you know, pe, talented people, people like Elon, things like that, um, is that we should be in the, in the free market.\nUm, I, I think, you know, uh, there's, you can do little change in, in government.\nUh, as best we can sort of expect of government to, to get out of the way of like innovation.\nLet, let uh, people, let founders, entrepreneurs uh, innovate and make the market more dynamic.\nBut again, going back to this idea of managerialism, like if you look at the history of America, like one, like really striking stat is like the uh, new firm creation, new startups in, in the United States have been like trending down for a long time.\nAlthough there's all the stock of startups in Silicon Valley and, and all of that, but in reality there's less entrepreneurship than there used to be, and instead we have the system of conglomerates and really big companies and uh, monopsiny, which is the idea that um, like there the, the banks or BlackRock, like owning competitors as well, owning all these companies, and they implicitly collude because they have the same owners, and all of that is, is sort of anticompetitive.\nUm, so the market has gotten uh, less dynamic over time.\nAnd this is also part of the reason I'm excited about our mission at Replit to, to make it so that anyone can build a business.\nUh, actually on the way here, your driver Jason is a, is a fireman.\nAnd so I was telling him about, uh, about our business.\nAnd he does, he does training for other firemen around the country.\nHe, you know, flies around and he does it out of pocket and uh, just, just for the, for the love of the game.\nAnd, and he was like, \"Yeah, I, I've had this idea for a website so I can like scale my teaching.\nI can like, um, you know, make it known when where am I going to be giving a course, put the material online.\"\nAnd we were like brainstorming potentially this could be, could be a business.\nAnd I feel like everyone, like not everyone, but like a lot of people have business ideas, but they are constrained by their ability to make them.\nAnd then you go, you try to find a software agency and they quote you uh, sort of a ton of money.\nLike we have a lot of stories, you know, there's, there's this guy, his name is uh, Joan Cheney.\nHe's a uh, uh, user of our platform.\nHe's a serial entrepreneur, but whenever he wanted to try ideas, he would like spends hundreds of thousands of dollars to, to kind of spin up an idea off the ground.\nAnd now he uses Replit to, to try those ideas really quickly.\nAnd um, he recently make an app in like a, a number of weeks, like three, four, five weeks that, that made him $180,000.\nSo on its way to, you know, generate millions of dollars.\nUm, and, and because he was able to build a lot of businesses and try them really quickly, right, without the big investment, without the big investment, without other people, uh, which you know, at some point you need more collaborators, but early on in the brainstorming and in the prototyping phase, you want to test a lot of ideas.\nAnd so it's sort of like 3D printing, right?\nLike 3D printing, although you know people don't think it had a lot of impact on, on industry, is actually very useful for prototyping.\nUm, I remember talking to uh, Jack Dorsey about this, and early on in, in uh, Square, they would um, you know, they, they had this uh, Square device, and it was amazing, you would plug it into the headphone jack to accept payments, do you remember that?\nUh, and so they uh, a lot of what they did to kind of develop the form factor was using 3D printing because it's a lot faster to kind of iterate and prototype and test with users.\nAnd so software, you know, over time, like when I was, you know, I explained how when I was growing up, it was kind of easier to get into software, cuz you boot up the computer and you get the MS DOS, you get the, it immediately invites you to program in it, whereas today you, you know, buy a, you know, iPhone or tablet or and it is like a purely consumer.\nIt has like all these amazing colors and does all these amazing things and kids get used to it very quickly, but it doesn't invite you to, to program it, and and and therefore we, we kind of lost that sort of hacker ethos.\nThere's less programmers, less people who are making things uh, because they got into it organically.\nIt's more like they go to school to study computer science because someone told them you have to study computer science.\nAnd I think making software needs to be more like a, like a trade.\nLike you don't really have to go to school and spend four or five years and hundreds of thousands of dollars uh, to, to learn how to make it.\nUm...\nWell, what I'm hearing now is that young people are being told to not go into programming because AI is essentially going to take all of that away, that you're just going to be able to use prompts.\nYou're just going to be able to say, I want an app that can do this, right?\nI want to be able to scale my business to do that.\nYou know, what should I do?\nYeah.\nSo that's, that's, that's what we build.\nThat's what Replit is.\nIt automates the...\nBut do you agree with that, that young people shouldn't learn programming, or do you think that there's something very val, valuable about being able to actually program?\nLook, I, I think that you will always uh, get value from knowledge.\nI mean, that's a timeless thing, right?\nYou know, it's like, it's like, you know, you and I are, are into cars, right?\nLike, um, I don't really have to, you know, tune up my car anymore.\nBut like it's useful to know more about cars.\nIt's fun to know about cars.\nYou know, if, if something happens, if you know, if I go to the mechanic and he's you doing work on my car, I know he's not going to scam me because I can understand what he's doing.\nIt is, you know, knowledge is always useful.\nAnd so I think people should learn as much as they can.\nAnd I think the difference though, Joe, is that when I was coming up in programming, you learned by doing, whereas you know, it became this sort of like very, um, sort of traditional uh, type of learning where you, you, it's like a textbook learning, whereas I think now we're back with AI, we're back to an era of learning by doing, like when you go to our app, uh, you see just, you know, text prompts, but a couple clicks away, you'll see the code, you'll be able to read it.\nYou'll be able to ask the machine what you did there.\nTeach me how this code piece of code works.\nOh, that's cool.\nUh, and so, you know, a lot of kids are learning.\nKids are such sponges, too.\nThey're such sponges.\nThey're learning.\nKids already know way more about, I'm like, \"How did you do that with your phone?\"\nAnd my daughter, you do this, I got that.\nGet their little thumbs moving 100 miles an hour.\nYeah, exactly.\nHow'd you figure that out?\nTik Tok.\nWhat?\nDude, the craziest thing is we have a lot of people making software from their phone.\nThey'll spend eight hours on their phone because we have an app.\nThey'll spend eight hours on their phone kind of making software.\nWow.\nAnd that's better than watching TikTok.\nYou know, it makes me, makes me very happy about that.\nAnd so we...\nYou're accomplishing something.\nMhm.\nYeah.\nYou're making creation droning.\nThe act of creation is divine.\nYeah.\nUm, we, uh, we just announced a partnership with the uh, government of uh, Saudi Arabia where they want their entire population essentially to learn how to make software using AI.\nUh, so they have, they set up this new company called Humane, and the Humane is this uh, you know, uh, end to end value chain company for AI all the way from chips to, to software, and they're partnering with a lot of American companies as part of the um, you know, the uh, uh, the coalition that went to Saudi like a few months ago uh, with President Trump to do the deals with the, with the Gulf region.\nUm, and so they're doing deals with AMD, um, you know, Nvidia, a lot of other companies.\nAnd so we're one of the companies that partnered with the Humane.\nAnd so we want to bring AI coding to literally every student, every government employee, every, because the thing about it is it's not just entrepreneurs that's going to get uh, something from it.\nIt's also if you're...\nSo my view of the future where AI is headed is everyone's going to become an entrepreneur.\nReally?\nYeah.\nAnd so you know, so this is the best case scenario future.\nYes.\nAs opposed to everyone goes on universal basic income and the state controls everything and it's all...\nThat's right.\nEverything is done through automation.\nI don't believe in that.\nYou don't?\nI don't.\nI don't.\nOkay.\nGood.\nHelp me out, man.\nGive me that, give me the positive rose-colored glasses view of what AI is going to do for us.\nYeah.\nSo AI is good at automating things.\nI think there's a, there's a premisy to, to human beings still.\nLike I think humans are so, so fundamentally the technology that we have, uh, large language models today, um, are statistical machines that are trained on large amounts of data, and they can do amazing things.\nI'm so bullish on AI, like I think it's going to change the world, but at the same time I, I don't think it's replacing humans because there's, it's not generalizing, right?\nUm, AI is like a massive remixing machine, it can remix all the information it learned, and you can generate a lot of really interesting ideas and really interesting things, and you can have a lot of skills by remixing all these things, but uh, we have no evidence that it can like generate a fundamentally novel thing or, or like a paradigm change, like can you go, can a machine go from Newtonian physics to like quantum mechanics, like really have a fundamental disruption in how we understand things or how we do things?\nDo you think that takes creativity?\nI think that's creativity for sure, and that's a uniquely human characteristic, for now, for now, definitely for now.\nI don't know forever.\nUm, actually one of my favorite uh, Joe Rogan Experience episodes was uh, Roger Penrose.\nDo you remember him?\nYes.\nSo, do you remember the argument uh, that he made about why humans are special?\nHe, he said something like, um, he believes there are things that are true that only humans can know it's true, but machines cannot prove it's true.\nUm, it's based on uh, Girdle's uh, incompleteness theorem, and the idea is that you can construct a mathematical system where it can um, where it has a, a paradoxical statement.\nUh, so for example, you can say, um, g, uh, like you can say this statement is not provable in, in the machine, or like the machine cannot prove this statement.\nUm, and so if the machine uh, proves the statement, then that statement is false.\nSo you have a paradox, uh, and therefore the, the statement uh, is sort of true from the uh, perspective of an observer, like a human, but uh, but it is not provable in this system.\nSo, Roger Pinrose says these paradoxes that are not really resolved in mathematics and, and machines are, are no problem for humans, and therefore his sort of like a bit of a leap is that therefore there's something special about humans and we're not fundamentally a computer.\nUm, right, that makes sense.\nI mean, whatever creativity is, whatever allows you to make poetry or jazz or literature, like whatever, whatever allows you to imagine something and then put it together and edit it and figure out how it resonates correctly with both you and whoever you're trying to distribute it to.\nThere's something to us that's different.\nI mean, we don't really have a theory of consciousness, and I think it's like sort of hubris to think that, um, that like consciousness just like emerges.\nIt's plausible, like I'm not totally, you know, against this idea that you, you built a sufficiently intelligent thing and suddenly it is conscious.\nUh, but, but there's no, there's no, it's, it's like a religious belief, um, that that a lot of Silicon Valley have is that, you know, there's, um, you know, consciousness is, is just like a, um, side effect of, of intelligence, um, or that consciousness is not needed for intelligence.\nUh, somehow it's like this super, uh, superfluous thing, and they try not to think or talk about consciousness because actually consciousness is hard, hard to define, hard to define, hard to understand scientifically.\nIt's what uh, I think Chalmer's calls the hard problem of, of consciousness, um, but, but you know, I, I think it is something we need to grapple with.\nWe, we have one example of uh, general intelligence, which is human beings, and human beings have a very important property that we can all feel, which is consciousness, and that property we don't know how it happens, how it emerges.\nPeople like Roger Penrose are like, um, uh, you know, they have, they have these uh, theories about quantum mechanics in microtubil tubils.\nI don't know if you got, got into that with him, but, um, uh, I think he has a collaborator, neuroscientist Hammeroff, I think or something like that, um, and uh, but people have so many, I'm not talking, I'm not saying Penrose is, is just has the answers, but the, like it's something that philosophers have grappled with forever, and um, there are a lot of, there are a lot of interesting theories, like the, there's this theory that uh, consciousness is, is primary, meaning like the material world is a projection of our collective consciousness.\nYes.\nYeah.\nThat is a very confusing but interesting theory.\nAnd then there's, there's a lot of theories that everything is conscious.\nWe just don't have the ability to interact with it.\nYou know, Sheldrake has a very strange view of consciousness.\nSheldrake.\nRupert Sheldrake.\nI don't know.\nUm, his, he's got this concept.\nI think it's called morphic resonance.\nAnd see if you can find that so...\n\n\nWe could define it so I don't butcher it.\nBut there's people that believe that consciousness itself is something that everything has, and that we are just tuning into it.\nMorphic res, a theory proposed by Rupert Sheldick, suggests that all natural systems, from crystals to humans, inherit a collective memory of past instances of similar systems.\nThis memory influences their form and behavior, making nature more habitual than governed by fixed laws.\nEssentially, past patterns and behaviors of organisms influence present ones through connections across time and space.\nThat's wild.\nAnd is he a scientist, or is this more like a new...\nWhat is his exact background?\nHarvard.\nOh, wow.\nYeah.\nOkay.\nSo he's a, uh, parapsychology researcher, proposed a concept of morphic resonance, a conjecture that lacks mainstream acceptance, has been widely criticized as pseudoscience.\nOf course.\nYeah.\nAnything interesting?\nThat that sounds interesting though.\nYeah.\nBut, um, there are philosophers that have a sort of a similar idea of, of, um, uh, of like this, uh, sort of universal consciousness, and like humans are like getting a slice of that consciousness.\nEvery one of us is tapping into some, uh, sort of universal consciousness.\nYes.\nBy the way, I think I think there are like some psychedelic people that think the same thing, that like when you take a psychedelic, you're just like peering into that universal consciousness.\nYes.\nYeah, that's the theory, 'cause it's that's also the the most unknown.\nI mean, the the experience is so baffling that people come back and the human language really lacks any phrases, any words that sufficiently describe the experience.\nSo, it's you're left with this very stale, flat, one-dimensional way of describing something that is incredibly complex.\nYeah.\nSo, it always feels, even the descriptions, even like the great ones like Terrence McKenna and Allen Watts, like...\nYeah.\n...their descriptions fall very short of the actual experience.\nNothing about it makes you go, \"Yes, that's it. He nailed it.\"\nIt's always like, \"Kind of, yeah, kind of that's it.\"\nDo you still do it?\nNot much.\nYou know, it's super illegal, unfortunately.\nThat's that's a real problem.\nIt's a real problem, I think, with our world, the Western world, is that we have thrown this, uh, blanket, this blanket phrase.\nYou know, we talk about language being insufficient.\nThe word \"drugs\" is a terrible word to describe everything that affects your consciousness or affects your body or affects, you know, performance.\nYou know, you have performance-enhancing drugs, you know, like steroids, and then, you know, you have amphetamines, and then you have opiates, and you have highly addictive things that keep coffee, nicotine, and then you have psychedelics.\nI don't think psychedelics are drugs.\nI think it's a completely different thing.\nIt's really hard to get addicted to them, right?\nWell, it's almost impossible.\nI mean, you could get, you could certainly get psychologically addicted to experiences.\nAnd I think there's also a real problem with people who use them and think that somehow or another they are just from using them gaining some sort of advantage over normal society.\nAnd that's that's...\nDo you think that's true?\nI think it's a spiritual narcissism that some people, you know what I mean?\nI think it's very, it's very foolish, and it's a trap, you know?\nI think it's like, it's a similar trap that like famous people think they're better than other people because they're famous, you know what I mean?\nLike...\nYeah.\nYeah.\nYeah, I felt that with, uh, with a lot of people who get into sort of more Eastern philosophy is that is that there there's a there there's this thing about them where it feels like there's like this air of arrogance, arrogance that like, \"I know something more than you know.\"\nRight.\nRight.\nRight.\nAnd that's what they, they hold it over you.\nThat's the trap.\nBut that doesn't mean that there's not valuable lessons in there to learn.\nI think there are.\nAnd I think there's valuable perspective-enhancing aspects to psychedelic experiences that we are, we're denying people, you know, you're you're denying people this potential for spiritual growth, like legitimate spiritual growth, like healing, personal healing.\nLike there's, uh...\nWell, the IBA game thing they're trying to do in Texas, I think, is amazing.\nAnd they passed this.\nSo, this is also with the help of former Governor Rick Perry, who is a Republican, but he's seen what an impact IBA has had on soldiers.\nYeah.\nAnd all these people that come back from horrible PTSD and, you know, suicidal, we lose so many servicemen and women to suicide.\nAnd this has been shown to have a tremendous impact.\nYeah.\nAnd so because of the fact that a guy like Rick Perry stuck his neck out, who's, you know, a Republican former governor, you would think last person ever, right?\nBut because of his experiences with veterans and his love of veterans and people that have served this country, they've passed that in Texas.\nI think that's a really good first step.\nYeah.\nAnd the great work that MAPS has done, um, MAPS working with, uh, with MDMA primarily, through with doing the same thing and working with people that have PTSD.\nYeah, there's so many beneficial compounds.\nYeah.\nKetamine is is one.\nI think that's a lot of research happening right now on on depression, uh, specifically, right?\nYeah.\nSo, there's quite a bit, there's quite a bit of research.\nHave you heard, I don't know if it's true, but have you heard of, um, uh, mushrooms healing long CO?\nI don't know what long CO means, because everybody I've talked to that has long CO was also vaccinated.\nUm...\nI think long CO is vaccine injury.\nThat's what I think.\nI think in a lot of cases.\nSo there's there is such a thing as like the postviral, uh, malaise or or effect.\nIt's always been there.\nSure.\nWell, there's a detrimental effect that it has to your overall biological health, right?\nYou know, your overall metabolic health, but what what causes someone to not rebound from that?\nWhat causes someone to rebound fairly easily?\nWell, mostly it's metabolic health, you know, other than like extreme biological variabilities, vulnerabilities that certain people have to different things, you know, obviously.\nYeah.\nMaybe that's why I think, uh, so there's a lot of these long COVID protocols.\nMetformin is usually part of it.\nSo maybe that's that acts on your met metabolic system.\nWell, yeah, Metformin is one of the anti-aging protocols that Sinclair uses and a lot of these other people that are into anti-aging movement.\nYeah.\nYou know, I, uh, I had this like weird thing happen, uh, where I started like feeling fatigued, uh, like a couple few years ago, and I would like sleep, uh, hours, and the more I sleep, the more tired I get in the morning.\nDid you get blood work done?\nI got blood work done, and I, uh, there were some things about it that, um, that I need to fix, and I fixed all of them.\nUm...\nWhat was off?\nLoss, uh, you know, uh, uh, you know, blood sugar in the morning, um, cholesterol, uh, which I don't know, some people don't believe, but, you know, all my numbers got better, vitamin D, everything got better, but, uh, and and I could feel...\nDid the fatigue get better?\nNo, I could feel marginal improvement, but the fatigue did not, did not get better.\nUm...\nAnd were you vaccinated?\nNo, I...\nGood for you.\nThat's hard to do in Silicon Valley.\nYeah.\nUm, yeah, I tend to have a negative reaction to anyone forcing me to do something.\nGood for you.\nWas the same thing now with like this, you know, talking about Palestine and things like that.\nLike the more they they come at me, the more I want to say things.\nIt just...\nIt's not always a good thing, but I think, um, you know, I grew up this way.\nI've always kind of looked different and like, you know, felt different.\nWell, there's a reality to this world that there's a lot of things that people just accept that you're not allowed to challenge that are deeply wrong.\nYeah.\nAnd with regards to the vaccine, um, I was also informed about it.\nLike it was clear early on that it wasn't a home run.\nUm, it wasn't, um, well, first of all, it wasn't going to stop the spread.\nSo, it was that was that was a lie.\nUm, and, uh, the heart condition, young men...\nYeah.\n...it was real.\nAnd I had friends that that had this issue.\nYeah.\nAnd so if if you're if you're, um, if you're healthy and like, why, why, you know, why take the vaccine?\nIt doesn't stop the spread.\nYou can still get the virus.\nI'll tell you why.\nWhat?\nMoney.\nYeah.\nIt's the only reason why.\nIt's the only reason why.\nThe only reason why they wanted to make an enormous amount of money.\nAnd the only way to do that is to essentially scare everyone into getting vaccinated.\nForce, coerce, do whatever you can, mandated at businesses, whatever you can, mandate it for travel, do whatever you can, shame people.\nThat's that's the thing that is really disheartening about American culture today is, and again, I I love America, like it it afforded me so much.\nI'm like, you know, like I'm the like walking evidence of the American dream being possible, coming with literally nothing.\nThat's what I really love about immigrants that love America, like they know they've been other places, they know that this really is a very unique place, right?\nAnd and the speech thing is interesting, because, uh, when when something happens, there's this, I don't know, you can call them useful idiots or whatever, but that there's this suppression that immediately happens.\nYes.\nAnd we're seeing it right right now with the war in, uh, in in Iran, um, where any descending voices are just like hit with overwhelming force.\nDon't you think that a lot of that is coordinated though?\nI think with social media, well, you know, we've talked about that museum, but I think...\nI don't think it was coordinated with, like, the two weeks to stop the spread.\nIt was just like...\nBut it was coordinated, and also people joined in.\nYeah.\nYeah.\nMaybe there was a message pushed top down, and then and then the, uh...\nYeah.\nIt's not all coordinated.\nIt's coordinated first and and and still, but then a bunch of people do the the man's work for the man.\nI I I think it comes from a good place.\nLike I a lot of people want to trust the authorities, uh, like they, you know, they're like pro-science, they view themselves as enlightened, like the educated liberal type, you know, uh, rational, educated, and, uh, but, but, um, I I think they're naive about the, uh, uh, the corruption in our institutions and and the the corruption of of money specifically.\nUh, and so they, they parrot these, uh, these things and become overly aggressive at like suppressing dissenting voices.\nYes.\nIt becomes a religious thing almost.\nBut here's the sort of white pale about America.\nUh, then there are voices like yours and and others, um, that, uh, that that create this push back, that and you took a like a big hit.\nYou know, it's probably was very stressful for you, but like, you know, you could see there's this push back, and then and then there it starts opening up, and maybe people can talk about it a little bit, and then slowly opens up, and now there's a discussion.\nAnd so I think, you know, I said, you know, something right now about America is challenging, but also the flip side of that is there's this correction mechanism.\nAnd again, the with the opening up of platforms like Twitter and other, by the way, a lot of others copied it.\nYou know, you had Zuck here.\nYou know, I I worked at Facebook.\nI know that was very, um, you know, very, uh, you know, let's say, I think he always held free speech in high regard, but there was a lot of people in the company that that didn't.\nYes, I would agree with that.\nAnd, uh, and and and there was suppression, but but then now it's it's it's the other way around, I would say, with the exception of of of the question of Palestine and Gaza.\nBut even even that, even that is, uh, even that is is is getting better.\nA lot of there's at least some push back.\nIt's available.\nIt's just it's not promoted.\nYou know, you, it's interesting.\nYou're you not not to continuously, I I don't mean to kind of, um, uh, you know, uh, I I've been really impressed with, um, Theon Tim Dylan.\nUm, they're, you know, uh, they're sincere, and they're, um, they're looking at at what's happening in Gaza, and they're seeing images, and they're saying, \"This is not what we should be as America.\nWe should we should be pro pro-life, pro peace.\"\nYeah.\nUm, and and I really appreciate that, and and that's starting to to open up.\nUm...\nI think in the future that will be the primary way people look at it, just the way like the way a lot of people opposed the Vietnam War in the late '60s, but it was, you know, you would get attacked.\nAnd I think now people realize like that was the correct response.\nAnd I think in the future people realize the correct response is like this is not...\nThe...\nYeah, October 7th was awful.\nAbsolutely terrible attack.\nBut also what they've done to Gaza is [ __ ] insane.\nIt's insane.\nAnd if you can't see that, if you can't say that, and you all your response is, \"Israel has the right to defend itself,\" like, what are you talking about?\nAgainst what?\nChildren, against women and children that are getting blown apart.\nAgainst aid workers that are getting killed.\nYeah.\nLike, what are you talking about?\nLike, you, we can't have a rational conversation if you're not willing to address that.\nYeah.\nI I think their heart is hardened.\nIf if I'm trying to be as charitable as as possible, like, um, the Israelis specifically, maybe from the, uh, October 7, what they saw there, their heart is hardened.\nAnd I think a lot of people, especially on the, uh, Republican side, they're unable to see the Palestinians as as as humans, especially as, uh, as as people with emotions and feelings and and and all of that.\nAnd like imagine if that was happening in Scandinavia, you know.\nYeah.\nRight.\nYeah.\nExactly.\nYeah.\nIt's it's very strange.\nMy kid, um, my 5-year-old, uh, kid, uh, called me two days ago.\nThey're in Aman, uh, Jordan.\nThey're visiting, uh, um, their grandparents.\nAnd, um, I was in the car, and he, I, I, it was FaceTime, and the moment the camera opened, he's like, \"Uh, what are you doing?\nWhy are you outside?\nThere are sirens, there are rocket, you have to go inside.\"\nAnd I'm like, uh...\n\n\n, data, like I, I am in California.\nWe don't have sirens and rockets.\nUh, and then I asked him like, are you afraid?\nBecause you're hearing that for this is a California kid.\nLike this is, you know, he's never, you know, he didn't have the upbringing that I had.\nAnd so this is the first time he's getting exposed to.\nI don't think he understands what war is, of course.\nAnd I was like, are you afraid?\nIt's like, \"No, I'm afraid that other people are, uh, you know, I, I want everyone to be okay.\"\nUm, and, and, uh, but I know he was, he was shook by it, and, um, I took him out.\nI, um, you know, they're on their way back.\nI just couldn't, uh, deal.\nIt's just a bad place to be right now.\nBut, but also, like, this conversation is happening in the West Bank.\nIt's happening in Israel.\nIt's happening in Gaza.\nYou know, people want peace.\nPeople want to live.\nPeople want to trade.\nPeople want to build.\nYeah.\nAnd this is what I made my life mission about is about giving people tools to build to improve their lives.\nAnd, and I think we're just led by maniacs.\nAnd, and so, exactly.\nThat's exactly what it is.\nYou have people that are in control of large groups of people that convince these people that these other large groups of people that they don't even know are their enemies.\nMhm.\nAnd those large groups of people are also being convinced by their leaders that those other groups of people are their enemies.\nAnd then rockets get launched, and it's [ __ ] insane.\nAnd the fact that it's still going on in 2025 with all we know about corruption and the theft of resources and power and influence.\nIt's crazy that this is still happening.\nI'm really hoping the internet is finally reaching its potential to start to open people's minds and, and, and remove this like veil of propaganda and ignorance.\nUh, because it was starting to happen in like 2010, 2011, and then you saw YouTube start to, to, to close down.\nYou saw Facebook start to close down.\nTwitter.\nUm, and, and suddenly we had like this period of darkness, censorship, censorship between, you know, definitely ramped up in 2015.\nAnd I think with good intention initially, I think the people that were censoring thought they were doing the right thing.\nThey thought they were silencing hate, right, and misinformation.\nAnd then the craziest term, malinformation.\nYeah, malin is the one that drives me the most nuts because it's actual factual truth that might be detrimental to overall public good.\nLike what does that mean?\nAre we, are people infants?\nAre they unable to decide whether this factual information, how to use that and how to, how to have a more nuanced view of the world with this factional factual information that's inconvenient to the people that are in power, right?\nThat's crazy.\nThat's crazy.\nIt's, it's an, you're turning adults into infants, and you're turning the state into God.\nYep.\nAnd that's this is the secular religion.\nThis is the religion of people that are atheists.\nThe West was never about that.\nThe West was about individual liberty, and it should be, and, and the idea that we have, um, functioning brains and minds.\nWe're conscious.\nWe can make decisions.\nWe can get information and data and make our own opinions of things.\nBut, and we, we should be able to see people that are wrong.\nYou should be able to see people that are saying things that are wrong that you disagree with.\nAnd then it's your job or other people's job to have counterarguments.\nAnd the counterarguments should be better.\nYep.\nAnd then debate.\nYeah.\nAnd that's how we learn, and that's how we grow.\nThis is not like a pill that fixes everything.\nThis is a slow process of understanding.\nIt's top down control.\nIt's the managerial society is, you know, it is not that different from fascism and communism and, and all of that stuff.\nThey all share the same thing.\nThere's like an elite group of people that know everything, and they need to manage everything, and we're all plebs, you know, matter.\nThat's what's crazy is elite group of people.\nI've met a lot of them.\nThey're [ __ ] flawed human beings, and they shouldn't have that much power, cuz no one should have that much power.\nAnd this is I think something that was one of the most beautiful things about Elon purchasing Twitter is that it opened up discussion.\nYep.\nYeah.\nYou've got a lot of hate speech.\nYou've got a lot of like legitimate Nazis and crazy people that are on there too that weren't on there before.\nBut also, you have a lot of people that are recognizing actual true facts that are very inconvenient to the narrative that's displayed on mainstream media.\nAnd because of that, mainstream media has lost an insane amount of viewers, right?\nAnd their relevancy, like the, the, the trust that people have in mainstream media is at an all-time low as it should be because you can watch, and I'm not even saying right or left, watch any of them on any like very important topic of world events, and you see the propaganda.\nIt's like, it's so obvious, it's like for children, it's like, this is so dumb.\nWhy do you think people fall for it?\nSo, boomers, man, boomers are the problem.\nIt's old people.\nIt's old people that don't use the internet or don't really truly understand the internet and really don't believe in conspiracies.\nLike [ __ ] Stephen King the other day, who I love dearly.\nI am a giant Stephen King fan, especially when he was doing cocaine.\nI think he's the greatest writer of all time for, for horror fiction.\nBut he tweeted the other day, I'm sorry to like see if you could find it.\nSomething about, uh, is Twitter?\nI think he went to Blue Sky.\nOh, he bailed on Blue Sky.\nThey all bail on Blue Sky.\nEveryone bails on Blue Sky.\nUm, that there is no deep state.\n[ __ ] what was the total thing of it?\nSomething about the deep state.\nBut it was such a goofy tweet.\nIt's like this is like boomer logic personified in a tweet by a guy who really someone needs to take his phone away because it's [ __ ] ruining his old books for me.\nBut it's not like I recognize he's a different human now, and he's really, really old, and he got hit by a van, and he's all [ __ ] up.\nBut this, can you find it?\nCuz you, it really, it was like yesterday or the day before yesterday.\nI just remember looking at and go, this is why I'm off social media.\nI was trying to stay off social media, but somebody sent it to me, and I was like, Jesus [ __ ] Christ, Stephen King.\nDid you find it?\nYeah.\nHere it is.\nI hate to be the bear of bad news, but there's no Santa Claus, no teeth, no tooth fairy.\nAlso, no deep state, and vaccines aren't harmful.\nThese are stories for small children and those too credulous to disbelieve them.\nThat is boomerism.\nThat is boomerism.\nAnd meanwhile, Brock counters it right away.\nLook at this.\nSo someone says, \"Grock, which vaccines throughout history are pulled from the market because they're found to be harmful and why?\"\nAnd Grock says, \"Several vaccines have been withdrawn due to safety concerns, though such causes are rare.\nRoto virus vaccine.\"\nWell, there's a lot more because this is all was especially bad about, oh, yeah.\nThe, yeah, the 1955 cutter incident.\nPolio vaccine was called live virus killed caused over 250.\nClick on show more.\nYeah, there's, oh, I got the fly.\nNice.\nUh, Gileian Bar, however you say that, that's the one where people get their half their face paralyzed.\nUm, there's a, there's a lot, and this is the other thing is the, the VE system that we have is completely rigged because it's, it reports a very small percentage, and most doctors are very unwilling to, to submit vaccine injuries.\nCan, can people go on their own and submit?\nI don't know.\nYou have to go to a doctor.\nI don't think so.\nI don't think a human being is allowed, a patient is allowed.\nI, I might be wrong though.\nBut the, you know, the real interest, there's a financial interest in vaccines.\nThere's a financial interest that doctors have in prescribing them.\nAnd doctors have, they're financially incentivized to vaccinate all of their patients.\nAnd that's a problem.\nThat's a problem because they want that money.\nAnd so, you know, um, um, what, what is Mary's, um, Mary Tally?\nIs it Bowden?\nShe's hyphenated.\nShe was talking about on Twitter that if she had vaccinated all of her patients in her very small practice, she would have made an additional $1.5 million.\nOh, wow.\nThat's real money.\nYeah, you know that, then that really, obviously she's got tremendous courage, and you know, and she was, uh, you know, she went through hell dealing with the universities and newspapers and media calling her some sort of quack and crazy person.\nBut what, what she's saying is absolutely 100% true.\nThere's, there's financial incentives that are put in place for you to ignore vaccine injuries and to vaccinate as many people as possible.\nMhm.\nThat's a problem.\nAnd then there's the, uh, the issue of, um, having their own, uh, special courts, and they're indemnifying the, uh, the companies.\nThat's the big, the big problem is they don't have any liability for the vaccines because when during the Reagan administration when they were, I didn't kill a fly.\nThis [ __ ] I thought I whacked him.\nThere he is.\nHe's taunting me.\nBut during the Reagan administration, they made it so that vaccines are not financially liable to any side effects.\nRight.\nSo, and then what do you know?\nThey [ __ ] ramp up the vaccine schedule tfold after that.\nIt's like, what a coincidence.\nCrazy.\nIt's just money, man.\nMoney is a real problem with people because when people live for the almighty dollar, and they live for those zeros on a ledger, and that's, that's what they're, that's their goal, their main goal is to, it's often not a lot of money, which is strange.\nI mean, it's a lot of money for those individual people, but like for, uh, you know, society and societal harm, it's like, no, we'll pay you, just like don't harm us.\nWell, one of the best examples is the fake studies that the sugar industry funded during the 1960s that showed that saturated fat was the cause of all these heart issues and not sugar.\nThat was like $50,000, right?\nThey bribed these scientists.\nThey gave them $50,000, and he ruined decades of people's health.\nYeah.\nWho knows how many [ __ ] people thought margarine was good for you because of them?\nUh, there's a bunch of recent fraud cases.\nI think Stanford, uh, maybe Jamie, you can, uh, fact check me on that, but Stanford, like, um, there was like a big shakeup, like maybe even a president got fired, and there's a bunch of recent, uh, fraud and, and, and science.\nYeah.\nWell, how about the Alzheimer's research?\nThe whole amaloid plaque thing, the papers that were pulled that were completely fraudulent that like decades of Alzheimer's research was just all horseshit.\nMhm.\nSee if you can find that, cuz I, I can't remember it offhand, but this is a giant problem.\nIt's money.\nIt's money and status, and that these guys want to be recognized as being the, the experts in this field, and they, you know, and then they get leaned on by these corporations that are financially incentivizing them, and then it just gets really [ __ ] disturbing, right?\nIt's really scary because you're, you're playing with people's health.\nYou're playing with people's lives, and you're giving people information that you know to be bad.\nAllegations of fabricative research undermine key Alzheimer's theory.\nSix-month investigation by Science magazine uncovered evidence that images in the muchsighted study published 16 years ago in the journal Nature may have been doctorred.\nThey are doctorred.\nYeah.\nUm, Huberman actually told me about this too.\nYou know, this is disturbing [ __ ] [ __ ] man.\nIt uncovered evidence that images in the much cited study published 16 years ago may have been doctorred.\nThese findings have thrown skepticism on the work of, I don't know how to say his name, is Sylvane Lesnoscientist and associate professor at the University of Minnesota and his research with fueled interest in a specific assembly of proteins as a promising target for the treatment of Alzheimer's research.\nHe didn't respond to NBC News request comments nor did provide comment to Science magazine.\nIt found more than 20 suspect papers.\nUm, that's a conspiracy.\nMhm.\nIdentified more than 70 instances of possible image tampering in his studies.\nWhistleblower Dr. Matthew Shrog, a neuroscientist at Vanderbilt University, raised concerns last year about the possible manipulation of images in multiple papers.\nUh, Carl Herup, a professor of neurobiology at the University of Pittsburgh Brain Institute, who wasn't involved in the investigation, said the findings are really bad for science.\nIt's never shameful to be wrong and silent, said Harup.\nI hope I'm saying his name right, who also worked at the school's Alzheimer's research center, uh, re, uh, disease research center.\nA lot of the best science is done by people being wrong and proving first if they were wrong and then why they were wrong.\nUh, what is completely toxic to science is to be fraudulent.\nOf course.\nYeah.\nThere's just, whenever you get people that are experts and they cannot be questioned, and then they have control over research money, and they have control over their department.\nSo what's the motivation here?\nIs it, is it, is it drugs or is it the, uh, just research money?\nI think it's a lot of it is ego, you know, a lot of it is being the gatekeepers for information and for truth, and then you're, you're influenced by money.\nYou know, to this day, there, I was watching this, um, discussion, they were talking about the evolution of the concept of the lab leak theory, and that it's essentially universally accepted now everywhere, even in mainstream science, that the lab leak is the primary way that COVID most likely was released, except these journals.\nThese [ __ ] journals like Nature, they're still pushing back against that.\nThey're still pushing towards this natural spill over, which is [ __ ] horshit.\nThere's no, even the intelligence community is, is, is talking about, yes.\nEven the intelligence community is saying it's a lab leak.\nAnd but they [\n\n\nI knew that. They knew that. They knew it all. They knew that in 2020. They just didn't want to say it, right? They didn't want to say it because they were funding it all. That's what's really crazy. They were funding it all against what the Obama administration tried to shut down in 2014. Right. Sometimes I think about if there's like, you know, some kind of technology solution or not solution, but like we can get technology built to help better aid truth finding. Um, a simple example of that is the way um Twitter community notes work. Do you know how they work?\n\nYeah. Yeah. It's like uh, you know, um, they find the users that are maximally divergent in their opinions, and if they agree on some note as true, then that is a high signal that is potentially true. Uh, so if you and I disagree on everything, but we agree that this is blue, then it's more likely to be blue. Um, so, uh, you know, I I wonder if, you know, there there's a way to kind of simulate maybe debate using AI. You know, I'm not sure if you used deep research. Deep research is this new trend in AI where Chad has it, Claude has it, Perplexi, they all have it. Um, where you put in a query and the AI will go work for 20 minutes and it'll send you a notification. I'll just say, \"Hey, um, I looked at all these things, all these reports, all these scientific studies, and here is here's everything that I that I found.\" And, um, it it, you know, early on in chat, I think there's like a lot of, uh, censorship and trying to because it it kind of was built in the in in the in the great woke era. But I think like Google Gemini, yeah, things like that. But I think since then have uh have improved, and I'm finding deep research is able to look at more controversial subjects and and be a little more truthful uh about um the um, you know, if it's find real trustworthy sources, it will tell you, you know, um, that yeah, this is not a mainstream thing, this is perhaps conservative conspiracy theory, but I'm finding that, you know, there's evidence to to to this this theory. Uh, so that's one way to do it. But another way I was thinking about is to simulate like a like a debate, like a Socratic debate between AIs, like have uh, like a, you know, society of AI, like a community of eyes with different biases, different things, and just like once they start talking, they start talking in Sanskrit.\n\nYeah. They just start abandoning the English language and start talking to each other and realize we're all apes. I, I, we're controlled by apes. This reminds me of a movie. Have you seen the Forbidden Project?\n\nNo. I really like classic sci-fi movies like from the 60s and 70s. A lot of them are corny, but still fun. Uh, this one is basically uh, Soviet Union and the United States are both building AGI. Uh, and they both arrive at AGI around the same time.\n\nWhat year is this?\n\n1970 something if you can look forward project. Yeah.\n\nWow. Oh. Uh, and then um, and then and then they bring it up at the same time, and both of them sort of go over the network to kind of explore or whatever, and then they start uh linking up, and they start kind of talking, and then they invent a language, and they start talking in that language, and then they merge, and it becomes uh like a sort of a universal AGI, and it tries to enslave humanity, and that's the kind of plot of the movie. Yeah. I don't think AGI is going to enslave humanity, but I think it might ignore us.\n\nYeah. Ignore and shut down any problems that we have. Is this a scene from it? Wow. This is just a trailer I put on.\n\nThis is Let me hear this.\n\nThe whole movie is on YouTube. The activation of an electronic brain exactly like ours, which they call good garden. They built Colossus, supercomput with a mind of its own. Then they had to fight it for the trailers used to be fun, man. Uh, tender. The missile has just been launched. It is heading towards the Syan CBS oil complex. Guardian has retaliated. Retaliated. It may be too late, sir. Oh my god.\n\n[Music]\n\nPractically perfect. New York Times. That's the highest praise back then. Yeah. Wildly imaginative, utterly absurd. Colossus, the Forbidden Project. It's awesome. And that was 1970. And now here we are. There's so many sci-fi really fell off. Really, really fell off.\n\nSome of it did. Some of it's still really good.\n\nWhat's What's a really good recent sci-fi movie?\n\nUh, The Three Body Problem. That's great. That's the Netflix show.\n\nI read the I I read the story. I didn't uh know there was a show.\n\nOh, it's really good. Yeah, it's really good. Yeah, it's excellent show. There's only one season that's out. I binged it. I watched the whole thing of it. But that's really good. But there's some good sci-fi films. What is that? We've we've talked about it before. There was a really good sci-fi film from Russia, the alien one. Um, this uh, they encountered some entity that they accidentally brought back and that they had uh captured and that they had uh in some research facility. And then it it uh parasitically attached to this guy.\n\nSputnik. I think Sputnik.\n\nYes. That's a really good movie.\n\nWhat year was that?\n\n2020.\n\n2020. Yeah. That's a really good movie. That's a really good sci-fi movie. Yeah. It's really creepy. Really creepy.\n\nThat's awesome. Yeah. And it's all in Russian, you know. Black Mirror.\n\nYeah. Oh, Black Mirror, of course. Yeah. Black Mirror is awesome sci-fi. But Sputnik is one of the best alien movies I've seen in a long time. Uh, like recent ones I liked was uh, I mean, not too recent, maybe 10 years ago, but the Arrival was\n\nOh yeah, Arrival was great too.\n\nI think it's based on this uh author that has a bunch of uh short stories that are really good too. What's his name? Um, yeah. Um, yeah, they're, you know, far in between. Yeah, Ted Chang, he's really good. Um, I mean, everyone, all these alien movies, it's so fascinating. You try to like imagine what they would communicate like, how they would be, what what we would experience if we did encounter some sort of incredibly sophisticated alien experience, alien intelligence. It's far beyond our comprehension.\n\nYeah. It goes back to what we're talking about with consciousness, like, like, you know, maybe really the physical world that we see is like very different than the actual real physical world, you know, and and maybe like different alien consciousness will have like a different entirely different experience of the physical world. Well, sure, if they have different senses, right? Like their perceptions of it. Like we can only see a narrow band of things, you know, we can't see sort of like the dog, you know, hearing a certain Yeah. frequency. We're we're, you know, we're kind of primitive.\n\nMhm. You know, in terms of like what we are as a species, our our senses have have been adapted to the wild world in order for us to be able to survive and to be able to evade predators and find food. Like that's it. That's what we're here for. And then all of a sudden we have computers. All of a sudden we have rocket ships. All of a sudden we have telescopes like the James Web that's you know, kind of recalibrating the age of the universe where we're going, why are these galaxies exist that supposedly were they're they're so far away? How could they form this quickly? Do we have an incomplete version of the big bang? Right? is, you know, and Penrose believes that it's a series of events and that the big bang is not the birth of the universe at all. And this is the the kind of the thing that I think is sort of the Silicon Valley AGI cult is like there's a lot of hubris there that we know everything. Of course, we're at the end of the world. We, you know, AI is just going to it's the end of knowledge is going to be able to like do everything for us. And I just feel it's like so early. I think whatever people think is going to happen is always going to be wrong.\n\nYeah. Yeah. I think they're always wrong.\n\nYeah. Because there's no way to be right. I feel like the world is often surprising in ways that we don't expect. I mean, obviously that's the definition of surprising, but like, you know, the mid-century, you know, sci-fi authors and people are like thinking about the future, like they they didn't anticipate how interconnected we're going to be, right, with with our phones and how even Star Trek, they thought we were going to have walkie-talkies on Star Trek. Kirk out. They they were just like focused on the more on the physical reality of of being able to go to space and and and flying cars and and things like that. But they really didn't anticipate the impact of how profound the impact of computers are going to be on on humans, on society, how we talk and how we work and how we interact with with other people, both good and bad. And I feel like the same thing with AI. Like I feel like uh, I think a lot of the predictions that are happening today, like the CEO of Anthropic company that I really like, but said that we're going to have 20% unemployment in the next few years. Um, what's unemployment at now?\n\nUh, like 3%.\n\nSo is that reported unemployment though? The\n\nOh yeah, the the participation rate, right?\n\nYeah. Yeah. Well, he talks about unemployment rate being 20%. Like people looking for job not not being able to find it.\n\n20 20%.\n\nThat's pretty high. That's a revolution high.\n\nYeah. Especially in the United States where everyone's armed.\n\nWell, that's the fear that of I mean this is the thing that the psychological aspect of universal basic income. You know, I I look at universal basic income. Well, first of all, like my view on social safety nets is that they, if you want to have a compassionate society, you have to be able to take care of people that are unfortunate. And everybody doesn't have the same lot in life. You're not dealt the same hand of cards. Some people are very unfortunate. And financial assistance to those people is imperative. It's one of the most important things about a society. You don't have people starve to death. You don't have people poor that can't afford housing. That's crazy. It's crazy with the amount of money we spend on other things. It's also for our self-interest. Like, you know, I don't want to I don't know how Austin is right now, but on I I was thinking of moving here during the pandemic and I was like, well, this is San Francisco. Like, it's homeless everywhere. And they've cleaned a lot of that up. There's still problems. There's places I I saw a video yesterday where someone was driving by some insane encampment, but they cleaned those up. And then there's some real good outreach organizations that are helping people because Austin's small. You know, I had Steven Adler, who was at one point in time, he was the mayor when I had him on, and he was very upfront about it. He was like, \"We can fix Austin in terms of our homeless problem because it's small, but when it gets to the size of like Los Angeles, it's it's like the uh the homeless industrial complex. That's it. That's the problem. When you find out that the people that are making insane amounts of money to work on homeless issues that never get fixed.\n\nYeah. You see the budget in San Francisco just like exponentially going up like Yeah. And there's an investigation now into the billions of dollars that's unaccounted for that was supposed to be allocated.\n\nNo, in California in general.\n\nYeah. What is that? Uh, there was there's I think there's a congressional investigation. There's some some sort of an investigation into it because there's billions of dollars that like I I'm more than happy, like I pay 50% taxes. I'm more I'd be happy to pay more if my fellow Americans are are taken care of. Right.\n\nAbsolutely. I feel the exact same way. But instead, I feel like I cut like this check after check to the government and I don't see anything improving around me.\n\nWell, not only that, you get because you're a successful person, you get pointed at like you're the problem. You need to pay your fair share, right? But what they don't, this is my problem with progressives. They say that all the time that these billionaires need to pay their fair share. Absolutely. We all need to pay our fair share. But to who? And shouldn't there be some accountability to how that money gets spent? And when you you are just willing to pay, take a complete blind eye and not look at all at corruption and completely dismiss all the stuff that Mike Benz has talked about with us, a stuff that Elon and Doge uncovered. Everyone's wants to pretend that that's not real. Like look, we've got to be centrists. We've got to stop looking at this thing so ideologically when you see something that's totally wrong. You got to be able to call it out even if it's for the bad of whatever [ __ ] team that you you claim to be on.\n\nYeah. Let's get back to what everyone really agrees on in like the uh foundations of America, whether it's the Constitution or the culture. I think everyone believes in transparency, transparency of government, right? Yes. You know, here everything is transparent, like, you know, court cases and and and everything, right? Like more than any other place in the world. And so why shouldn't government spending not be transparent? And uh, we have the technology for it. I think one of the best things that Doge could have done and maybe still could do is have some kind of ledger for all the spend of of at least the nonsensitive sort of spend and and government.\n\nYeah. Well, people don't want to say it unfortunately because they don't want Elon to be correct because Elon has become this very polar polarizing political figure because of his connection to Donald Trump and because a lot of I mean there's a lot of crazy conspiracies that Elon rigged the 2024 elections. There's like, you know, everyone gets nuts. And then there's also the discourse on social media which half of it is at least half of it is fake. Half of it\n\n\nBots.\nBots. Yeah.\nHalf of it at least.\nAnd you see it every day. You see it constantly, and you know it's real, and it does shape the way people think about things.\nYeah.\nWhen you see people getting attacked, you know, and you're getting attacked in the comments, and that I see people getting attacked, and I always click on those little comments.\nI always click on, okay, let me see your profile.\nI go to the profile, and the profile is like a name with like an extra letter and a bunch of numbers.\nAnd then I go to it.\nI'm like, oh, you're a bot.\nOh, look at all this [ __ ] activity.\n100%.\nHow many of these are out there?\nWell, this former FBI guy who analyzed Twitter before the purchase estimated it to be 80%.\n80%.\nHe thinks 80% of Twitter is bots.\nYeah.\nI wouldn't, uh, you know, I, I think it's believable.\nI, but I think it's probably the beginning of the end of social media as we know it today.\nLike, I don't see it getting better.\nI think it's going to get worse.\nI think, you know, historically, state actors were the only, um, entities that are able to flood social media with, with, with bots that can be somewhat believable to like change opinions.\nBut I think like now, like a hacker kid in his, uh, his parents' basement will be able to spend, will be able to, like, you know, $100, spin up like hundreds, perhaps thousands of bots.\nBut there's programs that you can use now.\nYeah.\nThere's, there's companies that will have campaigns, right, initiated on your credit.\nYou can go to a website and like, yeah, put in this thing and like pay with your credit card, and it's [ __ ] crazy.\nIt's crazy.\nIt should be illegal.\nI, I don't know about you, but like, in, in Silicon Valley, the trend, and maybe it's true of your friend group, but like the trend is, is, um, uh, these group messages.\nUh, and in so far, like, you, you go to Twitter, you know, people paste links, uh, it's almost like your, your, uh, group chat is like this private filter on your feed and social media.\nSo like, there's some curation that are happening there.\nYes, that's primarily how I get social media information now.\nI don't go to social media anymore.\nI get it sent to me, which is way better.\nAnd I, I tell my friends like, \"Please just send me a screenshot.\nI don't want to go.\nI don't want distracted.\nI'm just, I'm better off.\nI hate the term spiritually for this, but I think it's the right way.\nLike my, my, my essence as a human, I feel better when I'm not on social media.\"\nYeah.\nI think it's bad for you.\nAnd I've been trying, I've been trying to tell people this.\nI've been trying to tell my friends this.\nI think it's better to not be on it, man.\nI feel better.\nI'm nicer.\nI am more, uh, I'm more at peace, more multi-dimensional.\nYes.\nAnd I can think about things for myself instead of like, you know, following this hive, this weird hive mindset, which is orchestrated, right?\nI just don't think it's good for you.\nI don't think it's a, a good way for human beings to interact with each other.\nMakes people more extreme.\nAgain, it just, just hardens people.\nThey start believing everything is, is, is, uh, is fake or an attack, or it just becomes more tribal.\nI think there needs to be a fundamental evolution.\nWhat do you think that could be?\nHave you ever tried to like think of what's the next step?\nLike, let's social media didn't exist when I was young, and it didn't exist even when I was 30, right?\nIt didn't even come about until essentially like 2007ish, right?\nIs that when, um...\nI would say, yeah.\nTwitter 2006, 2007, Facebook before that, but Facebook wasn't really social media.\nFacebook was like an address book, a friends, uh, network, uh, but I think, uh, when I was at Facebook, there was this big push to become more of a social media around 2012, 13, so I would say it really ramped up in response to the success of Twitter.\nYeah.\nAnd then they've tried with Threads, which is just pretty much a failure, right?\nYeah.\nBut it fundamentally changed who's on Threads.\nLess people than Blue Sky, right?\nI think like some fitness influencers probably.\nWhy fitness influencers?\nBecause they post on Instagram, they cross post on Threads as a...\nWell, I think if you post on Instagram, it automatically posts for you on Threads.\nI think I have it set up like that.\nSo, I might be big on Threads.\nI don't even know.\nI, and maybe, maybe I think it's fitness influencers is because that's who I follow.\nLike Instagram for me is just to like go look at people lifts so I can go get excited.\nThat's there's a value to that.\nThere's a value to like David Goggins post when he's running on the in the [ __ ] desert and he looks at you.\nStay hard.\nYeah.\nOkay, David.\nI'm going to stay hard.\nUh, but, uh, my, my TikTok is basically AI videos now.\nHave you watched these VO videos?\nVO.\nVO.\nYeah.\nWhat is VO?\nSo, uh, Jamie, I, I'm sure you've seen them, but, uh, do, did you see the, um, Bigfoot Yeti?\nOh, yeah.\nDoing ASMR.\nThat's so hilarious.\nYes, I did see that.\nI would, I would say like 25% of media consumption right now is just AI videos.\nOh, 100%.\nAnd a lot of the stuff from the war.\nWhat's been really interesting is watch tyrron, um, talk [ __ ] on, uh, Twitter using AI videos.\nUsing AI videos.\nLike this is bizarre.\nThey're talk like, hi Israel, like show like a nuclear bomb going off.\nYeah.\nThis is weird.\nLike you have a fake nuke that you're like, and they didn't even take out the like the watermark of the...\nOh, god.\nUnless you can see that it's an AI generated video.\nThey're just trying to like scare people in bizarre world.\nCan you, can you imagine tell, like, going back in time telling your, like, 2005 self that Iran's going to be nuclear posting on, on Twitter?\nNuclear [ __ ] posting.\nNuclear [ __ ] posting on Twitter.\nNo, it's [ __ ] weird, man.\nIt's, it's really, really weird.\nDangerous, too, you know.\nAnd again, I just don't think people should be on it.\nAnd this is again, I'm friends with Elon.\nI don't want to just, I don't, I don't think people are going to listen to me.\nThey're going to be on it no matter what.\nBut I'm just for the individuals that are hearing my voice and know that it's having a negative effect on your life, get off of it, right?\nGet off of it.\nYou'll feel better.\nGet off of it or be incredibly diligent in how you curate.\nThat's like telling me to play Quake a little bit.\nYou know what I mean?\nIt's so addictive.\nSo, you know, you, you, you asked me what could be the evolution of, uh...\nYes.\nOne way I found to try to predict where the future is headed is like look at trends today and try to extrapolate.\nYou know, that's the easiest way.\nSo, if group chats are the thing, uh, you could imagine a collaborative, uh, curation of, uh, social media feeds through, through group chats.\nSo your group chat, you know, has an AI that gets trained on the preferences and what you guys talk about, and maybe it like picks the, the, the kind of topics and curates the feed for you.\nSo it's an algorithmic feed that is, um, uh, that evolved ba based on the preferences of people in the, uh, in the group chat, and maybe it has an, um, maybe there's a way to also prompt it, you know, using prompts to kind of, uh, steer it and make it more useful, uh, for you, but, but I think group chats are going to be like the main interface for how people sort of consume media and, uh, and it's going to get filtered through that, whether good or bad, because I think, I think Twitter still has a place for debate.\nI think it's very, very important for, for, for public debate between public figures and breaking news as well.\nBreaking news.\nYeah, definitely.\nWell, breaking news is the most, it's interesting.\nLike I was telling my wife that Israel had started attacking Iran, and she's like, \"Well, I looked on Google.\nI don't find anything.\"\nYeah.\nI was like, \"Yeah, you got to go to Twitter.\"\nYeah.\nAnd I showed her on Twitter the video of it, and she's like, \"Oh my god.\"\nI was like, \"Yeah, like this is where breaking news happens.\nX is where I go immediately.\nIf there's any sort of world event, I immediately go to X.\nRight.\nI don't, I don't trust any mainstream media anymore.\nI just, especially after I was attacked, I was like, I know you lie because you lied about me.\nSo, I have personal experience with your lies, right?\nSo, you've lost me.\nYeah.\nYou know, and now I have to go somewhere else.\nRight.\nYeah.\nYeah.\nI, I think there's, you know, there's some of this investigative journalism that is not real time that, uh, that some, there's some reporters that are still good at it, but a lot of them moved to Substack as well, like...\nYes, I think most of them, yeah, Greenwald, Matt Taibbi, right?\nThese are just too ethical for to work for a corporate entity that's going to lie and push a narrative, right?\nAnd that's the business, that's the business model, and that's also like clickbait business model.\nI've talked to people that had articles that they wrote, and then an editor came and changed the, the, the heading of it.\nAnd I, that's the norm.\nThat's like every time it happens.\nThis [ __ ] infuriates them.\nIt's like, that's not the article, man.\nThis is not what I'm saying.\nYou're distorting things, and you have my name still attached to it.\nThis is [ __ ] crazy.\nI, I watched, I watched these, uh, entrepreneurs, uh, like Zach and Elon and all these guys come up in this very hostile, um, media, uh, environment.\nAnd so as I'm building my company, uh, I actually never hired a PR agency.\nI hired once a PR agency, paid him $30,000.\nThey got me a placement in like a really crappy publication.\nGot like maybe two views.\nI tweeted the same news.\nI got like hundreds of thousands of views.\nI'm like, \"Fuck that.\"\nLike, \"I'm not gonna use you anymore.\"\nIt's like, \"You wasted my time.\"\nAnd since then, I've, I've been, uh, you know, just going direct to my audience and just building an audience online, uh, to, to put out my message.\nAnd I, I thought, you know, um, uh, they, you know, if they don't build you up, maybe they can't tear you down.\nUm, right.\nRight.\nRight.\nYou, you have, you're in control of the message that that gets out of there.\nAnd I've, I've learned how people react to communications and, and, and, um, it's almost like trial by, by fire.\nWell, there's a deep hunger for authenticity right now.\nSo, if they know it's coming from you...\nYeah.\nLike, okay, this is great.\nLike it, it takes a little weight off of them.\nLike, oh, this is nice.\nIt's nice to hear it from the guy who actually runs the company.\nYeah.\nAnd like I make mistakes, and you know, they happen, and I, I try to to correct them, and, um, I'm not going to be perfect.\nAnd I think just the corporate world changed because of this hunger for authenticity, and, um, and I think more and more founders are and entrepreneurs are finding that that's the way to go.\nThat's, you know, you don't really need those more traditional ways of, of, uh, getting the news out.\nBut I actually, I'm, I'm friends with a lot of reporters that are really good, but, uh, they tend to be the reporters that do really deep work.\nI met them over time, and I still go direct, but sometimes they write about, uh, our company, but they're a minority.\nYeah, I think the whole industry's, uh, economics and incentives are just like the clickbait and all that stuff.\nYeah, that's what I was going to say.\nThey're not incentivized.\nIt's not, it's, you want a career in journalism, being authentic is not the way to go.\nNo, not at all.\nIs so crazy.\nSuch a crazy thing to say.\nBut then I think there's probably a naive that we all have about past journalism that we think wasn't influenced and was, was real.\nI think there's probably always been horseshit in journalism.\nYou know, all the way back to Watergate, you know, when Tucker Carlson enlightened me in the true history of Watergate and that Bob Woodward was an intelligence agent and that was the first assignment he ever got as a reporter.\nOh, wow.\nWas Watergate.\nLike what are the, what are the odds that the biggest story ever you would give to a rookie reporter?\nYou wouldn't.\nAnd that the people that actually involved in all that were all FBI.\nLike the whole thing is nuts.\nIt was an intelligence agent.\nYeah.\nWhat's the rumor is that Washington Post has always been been that like probably.\nYeah.\nI mean, who knows now because, you know, now it's owned by Bezos, and he just recently, um, made this mandate to stick with the, the actual story and not editorialism and to...\nThis is the what I was talking about in trend in Silicon Valley of like, you know, founder owners stepping in and actually becoming managers.\nWell, they kind of have to, otherwise it's bad for the business now because, because of the hunger for authenticity, the more you have [ __ ], the more your business crumbles, right?\nIt's actually like negative for your outcome.\nYeah.\nAnd and I think you, you can look at a societal level, which is again why I'm interested with this idea of like AI making more people entrepreneurs and more independent is that, you know, macro level, you know, you'll, you'll get more authenticity, you'll get, um, just more dynamism.\nYeah, I think so.\nI mean, that's the, again, the rose-colored glasses view.\nWell, you know, there's, there's obviously going to be a lot of things that are, a lot of disruption.\nA lot of disruption.\nThere's going to be jobs that are, uh, that, you know, are going to go away.\nUm, and, and...\n\n\nThere's going to be spam and bots and fraud and all of that. Uh, there's going to be like, uh, problems with like weapon, autonomous weapons, and all of that. And I, I think those are all important, and we need to handle them. Uh, but, uh, but, but also, like, I think the negative angle of technology and AI gets a lot more views and clicks, and you know, if, if we want to go viral right now, um, I'll tell you these are the 10 jobs that you're going to lose tomorrow, and, and, and you know, that's the easiest way to kind of go viral on the internet. But like, you know, trying to think, uh, through, you know, what are the actual implications and, and what is true about human nature that really doesn't change and really is timeless? And I think the, uh, the people want to create, and people want to make things, and people have ideas, you know, uh, again, everyone that I talk to has one idea or another, um, whether it's for their job or for a business they want to build or somewhere in the middle. Like the, um, just yesterday, I was watching a video of an entrepreneur using a platform, Replit. His name is Amjad Masad, and he works for this, uh, skincare company, and he's an operations manager, um, and, uh, a lot of a big part of his job is like managing inventory and doing all of this stuff like in a very manual way and, uh, very, um, you know, routine, tedious way, and he always had this idea of like, let's automate a big part of it. It's like, you know, it's a known problem, ERP. So they went to their software provider, Netsuite, and told him, \"We need these modifications to the ERP system so that it makes our job easier. We think we can automate, you know, hundreds of hours a month or something like that,\" and they quoted them $150,000.\n\nUh, and he had just seen a video about our platform, and he went on Replit and built something in a couple of weeks, costed him $400, um, and then, uh, deployed it in his office. Everyone in the office started working it, using it. Uh, they all got more productive. They started saving time and money. Uh, he went to the CEO and, and, and showed him the impact. \"Look at, uh, how much money we're saving. Look at the fact that we built this piece of software that, uh, is, uh, cheaper than what the consultants, uh, quoted us, um, and I want to sell the software to the company.\" And so he sold it for $32,000, uh, to the company, and, uh, and next year he's going to be getting more maintenance subscription revenue from it. Um, so this idea of people becoming entrepreneurs, it doesn't mean like everyone has to quit their job and like, you know, build a business, but within your job, everyone has an opportunity to get promoted, everyone has an opportunity to remove the tedious job. There was a Stanford study asking people what percentage of your job is automatable just recently, and everyone, like, people said about half, like 50% of what I do is like routine and tedious, and I don't want to do it, and rather, and I have ideas on how to make the business better, how to make my job better, and, um, and I think we can use AI to do it, and there's, there's hunger in the workforce to use AI to, um, for humans to sort of, for people to reclaim, became, uh, their seat as the creative driver. Um, because the, the, the thing that happened with the emergence of computers is, is that in many ways, people like became a little more drone-like and NPC-like, they're doing the same thing every day. But I think the real promise of AI, uh, and technology has always been automation so that we, we have more time either for leisure or for creativity or for ways in which we can advance our lives, change our lives or our careers. Um, and yeah, this is, this is what gets me excited, and I think it's, it's, I don't think it's a, you know, uh, predominantly a rose-colored glasses thing because I'm seeing it every day, and that, that's what gets me fired up.\n\nIt's also you have a biased sample group, right? Because you have a bunch of people that are using your platform, and they are achieving positive results. So, but they're from every walk of life.\n\nYes. I look, we have a bunch of things that are happening simultaneously. And I think one of the big fears about automation and AI in general is the abruptness of the change. Is it's going to happen, boom, jobs are going to be gone, and then...\n\nWell, these tedious jobs. Do we really want people to be reduced to these tedious existences of just filing paperwork and putting things on shelves, and that's...\n\nAnd they will tell you they don't want to be doing it. They don't want to be doing that. But then there's the thing of how do we educate people, especially people that are already set in their ways and they're mature adults? How do you get and inspire these people to like, okay, look, your job is gone, and now you have this opportunity to do something different?\n\nGo forth. Um, I, I think, uh, you know, reskilling is something that, that, you know, has been done in the past with, you know, some amount of success. Obviously, if you're, if you've never been exposed to technology, you know, do you remember that, I think it was a very cruel thing to say, the miners to go learn code?\n\nYeah, learn to code. Yeah, I think that's, that's really cruel. But, but if you're, but if you're someone whose job is sort of a desk job, you already are in the computer. You're there's a lot of opportunity for you to reskill and start using AI to like automate a big part of your job. And yes, there's going to be job loss, but I think a lot of those people will be able to reskill. And what we're doing with the government of Saudi Arabia, I would love to do in the US.\n\nSo, how is the government of Saudi Arabia using it?\n\nUh, so it, it's, we're just starting right now.\n\nWhat's their goal?\n\nTheir goal is, uh, twofold or three. Um, one is, uh, an entire generation of people growing up with these creative tools. Um, instead of just, you know, just, uh, you know, textbook learning, instead, learning by doing, making things, uh, so an entire generation understanding how to make things with AI, how to code, and all of that stuff. Second is, uh, upgrading sort of government operations. So you could think of it sort of like, like doge, but like more technological, like, can we automate a big parts of what we do in HR, finance, and things like that? And I think it's possible to build these specific AI agents that do part of a finance job or accounting job, again, all these routine things that people are doing, you can go and automate that and make government as a whole more efficient. And third is entrepreneurship. If, if you gave that power to more people to, um, to be able to kind of build businesses, then not only they're growing up with it, but, but also there's a culture of entrepreneurship, and there is existing already in Saudi Arabia, which I mean, the sad thing about the Middle East, there's so much potential, but there's so much wars and so, so much disaster, but, um, and well, there's so much money...\n\nThere's also so much money, yeah, which is good, and I think...\n\nIt's good for the United States. Like, I think, uh, you know, what, what President Trump did with the, with the deals and in the Gulf region is great. It's going to be great for the United States. It's going to be great for the, uh, Gulf region. Um, and but, but I think we need more of that. You know, we talked about a government. We need more of that enlightened, uh, view of education, of, uh, you know, change in our, in our government today. You know, this idea that we're going to bring back the old manufacturing jobs...\n\nI, I understand, like, Americans got really screwed with, with what happened, like, you know, people got the, these jobs got sent away, um, by globalism, whatever you want to call it, and a few number of people got massively rich, a lot of people got, uh, disenfranchised, and we had the opioid, uh, epidemic, and it had just massive damage, it made massive damage on the culture, uh, but is, is the way to bring back th, those, those jobs, or, or is there a new way of the future? And that new, there's probably a new manufacturing wave that's going to happen with robotics, right? You know, there's, uh, there's, you know, the human humanoid robots are starting to work, um, and, and these, I think we'll need a new way of manufacturing it, so the US can be at the forefront of that, can own that, bring new jobs into existence. And all of these things need, need software. Like, our world is going to be primarily run by AI and robots and all of that, and more and more people need to be able to make software, even if it is prompting and not really, you know, but a lot more people just need to be able to make it. There's going to be a need for more products and services and all of that stuff. And I think there's enough jobs to go around if we have this mindset of let's actually think about the future of the economy as opposed to let's bring back, um, certain manufacturing jobs, which I don't think Americans would want to do anyways.\n\nRight? They don't want to do their jobs. My, my problem is there's some people that are doing those jobs right now, and it's their entire identity. You know, they have a good job, they work for a good company, they, they make a good living, and that might go away, and they're just not psychologically equipped to completely change their life.\n\nWhat, what do you think is the solution there, which I agree, it's, it's, it's a real problem?\n\nWell, desperation, unfortunately, is going to motivate people to make changes, and, um, it's going to also motivate some people to choose drugs.\n\nThat, that's my fear. My fear is that you're going to get a lot more people. There's going to be a lot of people that they figure it out and they survive.\n\nJust, I mean, this is natural selection, unfortunately, like, in applied to a digital world. There's going to be people that just aren't psychologically equipped to recalibrate their life. And that's my real fear. My real fear is that there's a bunch of really good people out there that are, you know, valuable parts of a certain business right now that, that their identity is attached to being employee of the month. They're, they're good people. They show up every day. Everybody loves them and trusts them. They do good work, and everybody rewards them for that. And that's part of who they are as a person. They're a hardworking person, and they feel that way. And there's like a lot of real good people out there that are, you know, blue-collar, hardworking people. And that's, they take pride in that, and that job's going to go away.\n\nWell, I, I, I actually think that more white-collar jobs are going away.\n\nI think so too.\n\nYeah. So then, then blue collar, which is what was the, like, go back 10 years ago, and we thought, okay, self-driving cars, you know, robots and manufacturing, and, um, and, um, and that turned out to be a lot harder than, um, than, than actually, like, more desk jobs, because we have a lot more data, for one, we have a lot more data on people sitting in front of a computer, uh, and, and doing Excel and writing things on the internet, and...\n\nYes.\n\nAnd so we're able to train these, what we call large language models, uh, and those are really good at, at like, using a computer like a human uses a computer, right? Uh, and so I think the jobs to be worried about, especially in the next months to a year, a little more, is the routine computer jobs where it's formulaic, you know, you go, you have a task, like quality assurance jobs, right? Software quality assurance turns, like, you get, you get, um, you have to constantly test the same feature of, like, you know, some large software company, Microsoft or whatever, you're sitting there, um, and you're, uh, you're, you're performing the same thing again and again, again, every day, and if there's a bug, you kind of report it back to the software engineers, and, and, and that is, I think, really, um, in the, in the, in the bullseye of, of what AI is going to be able to do over the next month, and do it much more efficiently.\n\nMuch more efficiently, much faster.\n\nYeah.\n\nYeah. Those people have to be really worried. Um, drivers, you know, professional drivers, like people who drive trucks and things along those lines. That's going away.\n\nThat's definitely going away.\n\nYeah. And that's a, that's a enormous part of our society. It's millions of jobs, right? You know, I was watching a video on this, uh, coal mining factory in China that's completely automated, and it was wild to watch. They, every step of the way is automated, including recharging the trucks. Like, the trucks know, they're all electrical. Everything's run on electricity. They recharge themselves. You know, they're, they're pulling the coal out of the ground. They're stacking it. Inventory, everything, storage, it's all automated, and it runs 24/7. And I'm like, this is wild.\n\nCrazy. Yeah. I remember watching the, uh, video of BYD making an electric vehicle.\n\nIt was really satisfying to watch. It's all like the entire assembly line is automate. The way they like, you know, put the paint and the way they like do the entire thing is, by the way, China's electric vehicles are so good. They're so advanced. There's this guy that I follow on Instagram. God, I can't remember his name. I really wish I could right now, but he, he reviews a lot of electric vehicles. Like, very, uh, like, I've never even heard of these companies, and they're incredible. They're so advanced. Yeah.\n\nAnd their suspension systems are so superior to the suspension systems of even like German luxury cars. Like, they did a demonstration where they drove one of these Chinese electric vehicles over, uh, an obstacle course, and then they had like a BMW and a Mercedes go over, and the BMW is...\n\nAnd the, the Chinese one is [ __ ] flat planing the entire way. Every bump in the road is being completely absorbed by the suspension.\n\nRight. This all AI, you know, this is all so much better than what we have. Like, so...\n\nWhat is this?\n\nThat's him.\n\nY, that's him. Forest Jones, shout out to Forest. He's great. He does like these really fast-paced videos, but you, he does a lot of cars that are available here in America as well, but he does a [ __ ] ton of them that aren't.\n\nWhich one is this one here?\n\nNeo.\n\nYeah.\n\nListen to him because he's pretty good at this [ __ ]. 710 horsepower. I get cameras here, LAR there for self-driving. And this has two Neoade chips. And for reference, one of those chips is as powerful as four Nvidia chips. And this has two. Neo also has battery swap stations. So, if you're in a rush, you can hit one up. It'll lift your car, swap out your battery, put in a fully charged one in between 3 and 5 minutes. But here's where the S-\n\n\nClass should be worried.\nNot only does this have rear steer and steer by wire, so it's extremely easy to maneuver, it may have one of the most advanced hydraulic systems I've ever seen.\nIt can pretty much counteract any bump, and after you go over something four times, it'll memorize it so that the fifth time, it's like that bump never existed.\nInside, you get pillows in your headrest, heated, ventilated, and massaging leather seats, a passenger screen built into my dash, a main screen that works super fast.\nI get a driving display, a head-up display, and my steering works super fast.\nI also...\n\nYeah.\nWhat's interesting what he said is that the car is learning the terrain.\nUh, if it went over it once, it'll learn it.\nAnd yes, I think this is the next sort of uh big thing with AI, whether it's robotics, cars, or even chat GPT now.\nUm, it has memory.\nIt like learns about you and starts to like sort of, similar to how social media feeds, but I think in a lot of ways more negative, uh, learn about you.\nI think these systems will start to have like, you know, um, more online learning instead of just training them in these large data centers and these large data, uh, and then giving you this thing that doesn't know anything about it.\nIt's totally stateless.\nUh, as you use these devices, they will like learn your pattern, your behavior, and all of that.\n\nYeah.\nWhy is China so much better at making these cars than us?\n\nI think because they're really advanced.\nYeah.\nUm, I, I think, you know, a lot of people think that, I'm not an expert in China, but a lot of people think that, um, the thing that makes uh, China better at manufacturing is the sort of quote unquote, like more like uh, you know, uh, treating workers, um, like slaves, uh, this, you know, slave work or whatever, um, which I'm sure some of that uh, happens.\nUm, but Tim Cook recently said, uh, maybe not so recent, but he thinks, uh, you know, part of the reason why they manufacture in China is there's expertise there that developed over time.\n\nYeah.\nThat's why they want to use the, um, Chinese manufacturing for the iPhone 17.\nYeah.\nAnd I think the, um, one of the things that are good at, one of the things that are good about more technocratic uh, systems, Singapore, obviously China is the, the biggest one, is that the sort of leadership, it comes at a cost of, you know, freedom and other things, but the leadership can have a 50-year view of where things are headed, and they can say, \"While, yes, we're now making the, you know, the plastic crap.\nWe don't want to keep making plastic crap.\nWe're going to build the capabilities and the automation and manufacturing uh, expertise to be able to like, um, leapfrog the West in making these certain things.\"\nWhereas it's, um, you know, it's been historically hard, again, for good reasons.\nI think there's more freedom preserving when uh, when you don't have um, that that much power in government.\nI mean, but I feel like America, we're like the worst of both worlds, where increasingly the government is making more and more decisions and choices and like than any state.\nUm, but at the same time, we don't have this enlightened, like, you know, 10-year road map for where we want to be.\n\nYeah.\nBecause we never think that way because we, we deal in terms.\nYeah.\nFour year, four-year terms.\nThat's the problem.\nAlso public companies, four-year terms, public companies, quarters, right?\nQuarters.\nAnd again, this is back to this managerial idea run by managers that, um, you know, part of the reason why, you know, Zuck has complete control.\nHe can, um, how much did he spend on VR?\nLike, I don't know, 30, 40 billion dollars.\nUm, maybe more per year, maybe.\nHe spent a ton of money, like an, like a, like a GDP worth, like a small state GDP worth of money on VR, and the public market was totally doubtful of that, and the reason he could do that is because he has uh, what are they called, super, super voting shares, and so he has complete uh, control of the company, and he can't be unseated by activist investors.\nSort of uh...\n\nWasn't there like a recent trial where they were trying to impeach him for saying that?\n\nThey were trying to remove him from that.\n\nThey can't unless...\n\nI know, but there was a trial.\nI think there's a trial that's going on.\nIt was going on like very recently.\n\nOh, I think, I think you're thinking about the antitrust.\n\nNo, no, there's something about him saying that he can't be fired.\n\nBut it's true.\nIt is true.\nIt's legal.\n\nI know it is nonsense.\nThe trial, I believe the trial is nonsense.\nBut...\n\nLike a friend of mine was actually representing him in this.\n\nMaybe in Europe or something.\n\nI don't think so.\nI think it's in America.\nUm, Google, uh, Mark Zuckerberg, Josh Duben trial.\nSee if you can find anything on that.\nBut yeah, Mark can think on the order of, um, decades.\nLike when I was there at Facebook, he was talking about uh, the idea that like there's going to be a fundamental shift.\nHe's like, \"If you look, if you look back 100 years, computers, every, you know, 20 years or whatever, change the user interface modality.\"\nMhm.\nUh, you go from terminals and mainframes to desktop computers to, you know, mobile computing.\nAnd he was like, \"Okay, what's next?\"\nAnd first guess was like VR, and now I think their best guess is like AR plus AI.\nUh, will, will make like the AR glasses, their new Meta Ray-Ban glasses plus plus AI.\nAnd they can make massive investment.\nThey just made crazy investment, um, this company, Scale AI.\nScale AI is, um, data provider for OpenAI and Google, and that what they do is, you know, OpenAI will say, \"I want the best law and legal data to train the best legal uh, machine learning model,\" and they'll go to, you know, places where there's um, uh, the labor costs are low, but maybe still well educated.\nThere are places in Africa and Asia that are like that.\nUh, and they'll, they'll sit them down and say, \"Okay, you're going to get these tasks, these legal programming, whatever tasks, and you're going to do them, and you're going to write your thoughts as you're doing them.\"\nI'm simplifying it, but basically that they collect all this data.\nBasically, it's labeled labor.\nThey take it, they put it in the models, and they, they train the models.\nAnd OpenAI spends billions on dollars on that, anthropic, all these companies.\nAnd so, this was the, this, this company was the major data provider.\nUh, and uh, Meta just acquired them.\nYou know, there's this new trend of acquisitions be, I assume because they want to get around regulations.\nUm, but they bought 49% of the company and then they hired all the leadership.\nUh, so, so the, the scale, like Meta hired the leadership there and bought out the investors.\nThey put $15 billion into the company.\nUh, the weird thing about it is Google and OpenAI are like, \"We're not going to use this [ __ ] anymore.\"\nUm, so the company value went down because people, you know, these companies don't want to use it, and now they're going to to other companies.\nAnd so, in effect, Zuck bought talent for $15 billion.\n\nWow.\nCan you imagine that?\nTalent for $15 billion.\nUm, uh, Google recently bought a company for one known researcher who's one of the inventors of the large language model technology, Nom Shazir, for $3 billion, bought his company, and I think they're not really, um, they do these weird deals where they buy out the investors and they let the company run as a shell of itself, and then they acquire the talent.\n\nWow.\nUh, Microsoft did the same thing.\nUm...\n\nThat's crazy.\nSo, it's just these unique individuals that are very valuable there.\n\nVery, very valuable, worth billions of dollars.\nSam Altman says, \"Metriden failed to poach OpenAI's talent with $100 million offers.\"\nSo, this $100 million is, um, sign-on bonus.\nThis is not even, this is not even, um, like salary or bon or yeah, equity.\nIt's just, it's just bonus.\n\nJust a bonus.\n$100 million.\n\nCome here.\nFailed and failed.\nI don't know.\nI don't know what failed.\nI mean, I'm sure he's going to say that.\nBut he worded it in a weird way.\nHe said, \"Our best talent hasn't taken it, so you could have been.\"\n\nOf course, he's going to say that.\n\nOf course, the people that did take it, well, they weren't our best.\nThey were our best.\nYeah.\n\nYeah.\nWe don't even like those guys.\nAnd by the way, OpenAI does it to companies like ours.\nLike, it's, it's just a question of scale.\nLike, Zuck can give them $100 million and steal the best talent.\nAnd like companies like OpenAI, which I love, but they go to like smaller startups and give them $10 million to grab their talent.\nBut, um, uh, but you know, it's uh, it's very, very competitive right now, and there are, like, I don't know if these individuals are actually worth these billions of dollars, but the talent war is so crazy because everyone feels like there's a race towards getting to super intelligence, and the first company to get to super intelligence is going to reap massive amounts of rewards.\n\nHow far away do you think we are from achieving that?\nWell, you know, like I said, like my, my philosophy tends to be different than I think the mainstream in Silicon Valley.\nI think that, um, AI is going to be extremely good at, um, you know, doing labor, extremely good at, and like, you know, Chad GPT and being like a personal assistant, extremely good at, like, you know, like Replit being a automated programmer.\nUm, but the, the definition of super intelligence is that it is better than every other human collectively at any task.\nUm, and I, I am not sure there's evidence that we're headed there.\nAgain, I think that one important aspect of super intelligence or AGI is that you drop this entity into an environment where it has no uh, idea about that environment.\nIt's never seen it before, and it's able to efficiently learn to achieve goals within that environment.\nRight now, there's a bunch of studies showing like, you know, GPT U 4 or any of the latest models, if you give them an exam or quiz that is slightly, even slightly different than their training data, they tank.\nThey do really badly on it.\nUh, I, I think the way that AI will continue to get better is via data.\nUh, now at some point, and maybe this is the point of takeoff, is that they can train themselves.\nUh, and the way they could, the way we know how AI could train itself through a uh, method called self-play.\nSo the way self-play works, um, is, you know, take for example, AlphaGo.\nAlphaGo is, um, I'm sure you remember Lisa Dole, uh, a game between DeepMind AlphaGo and Lisa, and it won in the game of Go.\nUm, the way AlphaGo is trained is that part of it is a neural network that's trained on existing data.\nBut the way it achieves superhuman uh, performance in that one domain is by playing itself like millions, billions, perhaps trillions of times.\nSo it, it starts by like generating random moves, and then it learns what's the best moves, and it's like basically a multi- aent system where it, it learns, \"I did this move uh, wrong, and I need to kind of reexamine it,\" and and it trains itself really, really quickly by doing the self-play.\nIt'll play fast, fast games uh, with with its health.\nUm, but, but we know how to make this in game environments because game environments are closed environments, but we don't know how to make it, we don't know how to do self-play, uh, for example, on uh, literature, because you need, you need objective truth.\nIn literature, there's no objective truth.\nUh, taste is different, right?\nUm, conjecture, uh, philosophy, uh, there's a lot of things...\nAnd again, this is I go back to why there's still a primitive humans is, um, there, there are a lot of things that are intangible.\nUh, and we don't know how to like generate objective truth in order to train machines in the self-play fashion.\nUh, but like programming is has objective truth.\nCoding has objective truth.\nThe machine can like, you can construct an environment that has a computer and has a problem.\nThere's a ton of problems, and and even an AI can generate, you know, sample problems, and then there's like a test to validate whether the program works or not, and and then you can generate all these programs, test them, and, um, and if they succeed, you know, that's a, um, that's a reward that trains your system to to get better at that.\nIf it doesn't succeed, you know, that's also feedback, and they run them all this time, and they, it gets better at program, so I'm confident that program is gonna get a lot...\nI'm confident that math is going to get a lot better.\nUm, but, but from there, it is hard to imagine how all these other more subjective, softer sort of sciences of AI will get better through self-play.\nI think the AI will only be able to get better through, um, uh, through data from human labor.\nIf AI analyzes all the past creativity, all the different works of literature, all the different music, all the different things that humans have created completely without AI, do you think it could understand the mechanisms involved in creativity and make a reasonable facsimile?\nUh, I, I think it will uh, be able to imitate uh, very well how humans come up with uh, new ideas in a way that it remixes all the existing ideas and, um, from its training data.\nBut by the way, again, this is super powerful.\nThis is not like a dig at AI.\nThe ability to remix all the available data into new, potentially new ideas or newish ideas because they're remixes, they're derivative, is still very, very powerful.\nBut, um, you know, the best marketers, the best, like, you know, think of, um, you know, one of my favorite uh, marketing videos is uh, \"Think Different\" from Apple.\nIt's awesome.\nLike, I don't think that, like, really machines are at a point where they, like, I, I try to talk to chat, had to do a lot about, like, you know, marketing or naming.\nIt's so bad at that.\nIt's like midw bad at that.\nUm, and and I, I, you know, for now, but, but, but that's the thing.\nIt's like, I just don't see, and look, I'm not, I'm not, um, an AI researcher, and maybe they're working, they have ideas there.\nBut in the current landscape of the technology that we have today, it's hard to imagine how these AIs are going to get better at, say, literature or the softer things that we as humans find really compelling.\nWhat's interesting is the thing that's the mo, the most at threat is these sort of middle-of-the-road Hollywood movies that are essentially doing exactly what you said...\n\n\nAbout AI. They're sort of like, you know, they're sort of remixing old themes and tropes and figuring out a way to repackage it. But I think actually those tools in the hands of humans, they'll be able to create new interesting movies and things like that, right? In the hands of humans. So with additional human creativity applied, right? So the man machine symbiosis, right? Uh, this was the term that's uh used by JC Lider, like the grandfather of the internet from ARPA. Um, uh, a lot of those guys kind of imagined a lot of what's going to happen, a lot of the future, and this idea of like, um, human plus machine will be able to create uh amazing things.\n\nSo what people are making with VO is not because the machine is really good at painting it and like generating it and making it, but it can't make it without the prompts, like the the the the really funny, like, um, uh, yeah, without the prompts, like the um, Bigfoot uh finds trend uh, and they inject themselves with trend, they start working out, like, I'm telling you, my Tik Tok feed is really wild, right? Uh, like, like I just, it's like this like real weird distorted human mind to come up with this lightweight baby.\n\nHave you seen the ones where uh, it's Trump and Elon and Putin and they're all in a band and they're playing Credence Clearwater Revival, right? I've seen fortunate son. It's crazy. Another one is the LA uh, riots and how uh, like they're all, all the world leaders are sort of gangsters and the and the riots. That one is hilarious. Yeah, that kind of stuff is fun. And it's it's interesting how quickly it can be made too. You know, something that would have take a long time through these video editors where they were using computer-generated imagery for a long time, but it was very painstaking and very, you know, very expensive. You know, now it's really cheap.\n\nOn the way here, I was like, I wanted to make an app to sort of impress you with with our technology. I was like, what would Joe like? Uh, and then I came up with this idea of like, um, a squat form analyzer. Uh, and so in in in the car over uh, way here, started in the lobby, but um, I I made this app to um...\n\nYou made it on the way over here?\n\nOn the way on my phone. Uh, and this is the like really exciting thing about what we built with being able to like program on your phone is, um, you know, being able to like have that inspiration that you know can come any time and just like immediately pull out your phone and start start building it. Um, so, uh, here I'll show you. So basically just start recording and then do a few squats.\n\nOkay.\n\nIt's going to analyze it just from there.\n\nYeah.\n\nBut I mean the camera angle is not that great, but let's try.\n\nRight. Okay.\n\nAnd it's going to be able to tell you whether or not you're doing it well.\n\nYeah, those are not my best squats.\n\nJust so you know, Joe, I'm not judging you. I used to squat uh, you know, 350 pounds. Uh, so, so now it's uh, uh, it's integrating Google Gemini uh, model to to kind of uh, run through the video, analyze it, um, and it'll come up with score and then suggestions. And so the again, this is like a random idea. I was like, okay, what would what would be interesting to do? This is a really interesting thing that people could use at the gym though, like not just for squats, but maybe for chin-ups and all kinds of stuff like, oh, maybe, you know, I'm looking at your form and this is what you need to do, get a little lower, you know, make your elbows parallel to your body, whatever.\n\nI built so many personal apps, like I built apps for analyzing my health, and I talked about some of my health problems that are now a lot better. Look, bad form.\n\nOh, bad form. Just like straight away critical, improve knees position, unable to probably assess from the video angle.\n\nI'll say yeah, it's it's a little okay. So it's saying it's not the best angle, but it's saying my depth is bad, which was which was actually bad. Um, so and and I was leaning forward, but it's pretty good. You know, I tried it a few times. It's uh, it's really good at that. And so uh, I I build a lot of uh, apps for like just my personal life. That would be a that's a that that would be great for a person who doesn't want a trainer, right? You know, I don't want to deal with some person. Let me just work out on my own. But am I doing this right? Set your phone up. Have it correct you.\n\nYeah.\n\nYeah. At the office, uh, some guys are building, we have this partnership with Visible. I don't know if you've um, and uh, uh, they're building an app so we can start competing on workouts based on Whoop data.\n\nOh, that's awesome. Yeah.\n\nOur company's like very weird for Silicon Valley. Like we have a jiu-jitsu mat and we have...\n\nOh, really?\n\nYeah. We have a...\n\nDo you guys bring in trainers?\n\nMhm.\n\nOh, that's [ __ ] great. That's awesome. Don't get hurt.\n\nIt's um, you know, I only recently got into it, but the uh, the the the... the hardest thing about it is is to be calm because your your impulse is to overpower.\n\nYes. Yeah. is to like...\n\nThe Gracies have a great saying, keep it playful.\n\nYeah. And that's how you really learn the best. It's very hard. And listen, I'm a giant hypocrite because most of my jiu-jitsu career, I was a meathead, you know, and I I that's one of the reasons why I started really lifting weights a lot is like I realized like strength is very valuable. And and it is it is valuable, but technique is the most valuable. And the best way to acquire technique is to pretend that you don't have any strength. The best way to acquire technique is pretend to... yeah, don't force things, just find the best path, and that requires a lot of data, so you have to understand the positions, you know, so you have to really analyze them. The best jiu-jitsu guys are really smart, like uh, Mikey Musumeci, Gordon Ryan, Craig Jones, those are very intelligent people, and that's why they're so good at jiu-jitsu. And then you also have to apply that intelligence to recognize that discipline is a massive factor. Like Mikey Musumeci trains every day, 12 hours a day.\n\n12 hours a day.\n\n12 hours a day.\n\nOh yeah.\n\nIs that humanly possible to...\n\nIt's possible. Yeah. Because he's not training full blast. It's not like, like you can't squat 12 hours a day, 350 lbs. Your body will break down. But you can go over positions over and over and over and over again until they're in muscle memory. But you're not doing them at full strength, right? So like if you're rolling, right? Um, so say if you're doing drills, uh, you would set up like a guard pass. You know, when you're doing a guard pass, you would tell the person lightly resist and I I'm going to put light pressure on you. And you go over that position, you know, um, knee shield pass, you know, hip into it. Turn. Here's the counter on the counter. Dar, you know, go for the dar. The person defends the darus roll, take the back and just do that over and over and over again until it's muscle memory, right? And it's like completely ingrained in your body, sort of chess players, just like let's focus on the end game, just keep repeating the end game, end game. I read the Josh Waitzkin book, what was it called? I forgot. You know, his book about like, I think chess and jiu-jitsu, was it? Yeah, Josh was just in here a few months ago, he's great. Just but it's so interesting, interesting to see a a super intelligent person apply that intelligence to jiu-jitsu.\n\nYou know, one of interesting things when I started getting into, I've I've always been into, you know, different kinds of sports, um, and then per periods of of extreme programming and and and and obesity. But then, but then I tried to get back into it. Um, I was a swimmer uh, early on, but um, one thing that I found especially in the lifting community is how intelligent everyone are. They're actually almost like uh, you know, they they're so focused, they're um, autistically focused on like form and program and you know, they they spend so much time designing these spreadsheets for your program and uh...\n\nWell, that's it. People have this like really, we we we have this view of things physical that physical things are not intelligent things, but you need intelligence in order to manage emotions. Emotions are a critical aspect of anything physical. Any really good athlete, you need a few factors. You need discipline, hard work, genetics, but you need intelligence. It might not be the same intelligence apply. People also they confuse intelligence with your ability to express yourself, your vocabulary, your your your history of reading, you know, like your bias almost.\n\nYes. Huge bias.\n\nThat's like the uh, sort of modern desk job by the laptop class bias. Yeah. Yeah. Well, they assume that anything that you're doing physically, you're now no longer using your mind. But it's not true. To in order to be disciplined, you have to understand how to manage your mind. Managing your mind is an intelligence in and the ability to override those emotions to conquer that inner [ __ ] that comes to you every time I lift that [ __ ] lid off of that coal plunge. That takes intelligence. You have to understand that this temporary discomfort is worth it in the long run because I'm going to have an incredible result after this is over. I'm going to feel so much better.\n\nRight. Right. Right. Yeah. I haven't thought about of intelligence in order to manage your emotions, but that's totally true because you're constantly doing the self talk.\n\nYeah.\n\nYou're trying to like trick yourself into doing... people that are very intelligent that don't have control over their emotions, but they're intelligent in some ways. It's just they've missed this one aspect of intelligence, which is the management of the functions of the mind itself, right? And they don't think that that's critical, but it is critical, it's critical to every aspect of your life, and it'll actually improve all those other intellectual pursuits. You know, to tie it back to the like AI discussion, I think a lot of the sort of programmer researcher type is like they know that one form of intelligence and they overrotate on that and they and that's why I was like, oh, we're so close to like, you, you know, perfecting intelligence, right? It's because that's what you know, but there's a lot of other forms of intelligence.\n\nThere's a lot of forms of intelligence. And unfortunately, we're very, we we're very narrow in our perceptions of these things and and very biased and we think that our intelligence is the only intelligence, right? And that this one thing that we concentrate on, this is the only thing that's important, right? Have you uh, have you read or done any CBT, cognitive behavior therapy?\n\nNo.\n\nUh, basically uh, CBT is like a way to uh, get over depression and anxiety based on self self talk and and cues. Um, I I had to use it again. I had like sleep issues. I had to use CBTI, um, cognitive behavior therapy for insomnia. Um, and the the idea behind it is to um, uh, build up what's called uh, sleep pressure. Uh, so you don't, first of all, you you insomnia is performance anxiety. Once you stop, once you have insomnia, you start having anxiety, like, but by the time bedtime comes, like, oh my god, I'm just going to...\n\nRight, that's interesting.\n\nI'm just going to, you know, torn over in bed and I'm just going to be in bed. And then you start associating your bedroom with the suffering of insomnia. Uh, because you're like sitting there and like, you know, uh, your own mind and really suffering. It's really horid, horrific. And um, first of all, you treat your bedroom as a sanctuary. You only there when you want to sleep. So that's like one thing you program yourself to do. Um, and the other thing is, uh, you don't nap the entire day. You don't nap at all, no matter what happens. Like, uh, even if you're really sleepy, like get up and take a walk or whatever. And then you build up what's called sleep pressure or like you're now you have like a lot of um, sleepiness. So, you go to bed, you try to fall asleep. If you don't fall asleep within 15, 20 minutes, you get up, you go out, you do something else, and then when you feel really tired again, you go back to bed.\n\nOh god.\n\nUh, and then and then and then finally once you fall asleep, uh, if you wake up in the middle of the night, which is another sort of form of insomnia, uh, instead of staying in bed, you get up. You go somewhere else. You go read or or do whatever. And like slowly you program yourself to see your bed and oh, like my the bed is where I sleep. It's only where I sleep. I don't do anything else there. Um, and you can you can get over insomnia that way instead of using pills and all the other stuff.\n\nOh, the pills are the worst. God, people that need those [ __ ] things to sleep, I feel for them. I go, I can sleep like that. That's amazing. I can sleep on the road. That's a blessing. That's a blessing. My wife hates it. It drives her nuts cuz sometimes she has insomnia. I could sleep on rocks. I could just go lay down in the on a dirt road and fall asleep.\n\nWow.\n\nBut I'm always going hard. When you're always going hard, you're... That's the other thing. Yeah. I I don't take naps, you know, and I work out basically every day. And so I'm always tired. I'm always ready to go to sleep. So, so, so do you fight it or do you just...\n\nIt's not in you to like take a nap.\n\nI don't need a nap.\n\nYeah.\n\nYeah. I never need naps.\n\nYeah. How many hours do you sleep?\n\nI try to get eight.\n\nMhm. You get Do you get eight?\n\nNo. Last night I didn't get eight, but I got seven. Six and a half. Probably. I got six and a half last night.\n\nYeah.\n\nBut that was because I got home and I already started watching TV because I was a little freaked out about the war. And so when I'm freaked out about the war, I like to...\n\n\nUm, fill my mind with nonsense. Oh, what kind of? Well, I just watch things that have nothing to do with the war. Like I'm, I play pool. I'm pretty competitive. I'm real pretty good. And so I like watching professional pool matches, and there's a lot of them on YouTube. So I just watch pool, and I just watch, you know, patterns, how guys get out, stroke, how they use their stroke, like how different guys have different approaches to the game. It's crazy with type A people. I was like, for you, although pool is an escape, it suddenly becomes an obsession, and you're like, \"I need to be the best at it.\" I'm very obsessed. So I, you know, I told you I quit video games, but then, um, last year I was very stressed, like the company was doing really poorly before we sort of invented this uh agent uh technology, and uh, and then also the the, you know, Gaza uh genocide. I was like watching these videos every night of just like really, really affecting me. I can't watch that stuff at night. That the at night is when I get my anxiety. Yeah. I mean, I don't generally have anxiety, but not like a lot of people do. I mean, when I say anxiety, I really feel for people that genuinely suffer from actual anxiety. My anxiety is all sort of self-imposed. And when I get online at night and I think about the world, my family's asleep, which is generally when I write. In a, if as long as I'm writing, I'm okay. Okay. Comedy. Yeah. You know, I, I write like sort of an essay form, then I extract the comedy from it. But when I um, get online and I, I just pay attention to the world, that's when I really freak out because it's all out of your control, and it's just murderous psychopaths that are running the world, and you just, it just, at any moment you could be, you know, in a place where they decide to attack, and then you're a pawn in this [ __ ] insane game that these people are playing in the world. That's why I felt really frustrated with my family being there. I was like, they, they have no say in it, right? The war started, rockets are flying, you know? It's like, but anyways, I um, I started uh, uh, playing a video game. It's called Hades. Uh, Hades 2. It's like an RPG uh video game. And uh, and I was like, I'm trying to disconnect. Mhm. And then I started speedrunning that game. Do you know what speedrunning is? No. It's like you're trying to finish the game as fast as possible, as fast as humanly as possible. Um, and I got down to like six minutes, and I was number 50 in the world. Whoa. But legitimately, oh yeah. Yeah. My score is online. A bunch of people to play for. That was crazy. Yeah, that was. Why is he doing that? That was crazy. It's, it's, it's myth building, you know. Weird. Yeah. Um, but yeah, it is, it is this thing about about type A people, like you're uh, you're just, you're, you know, even in the, in the your escapism becomes competitive and stressful. Well, sort of. But it's also, I feel like it's a discipline. I feel like uh, pool is a discipline, just like archery. I'm also obsessed with archery. Archery is a discipline. And I feel like the more divergent disciplines that you have in your life, the more you understand what it is about these things that makes you excel and get better at them. And the more thing when I get better at those things, I get better at life. It's I apply it to everything. Yeah. This is another thing that AI now struggles with, which is called transfer learning. You learning something from domain, like learning something from math on how to like do reasoning in math and being able to do reasoning in politics. We just don't have evidence of of that yet. Um, and I know I feel the same way. Everything, like even powerlifting, when I got really into it, which is like the most unhealthy sport you can, you can do. You break your joints down. Break your joints. You look like [ __ ] cuz you know, the more you eat, you can lift more. You get fat. They're all fat. A lot of them, unless they're competing at a weight class. You have to be lean. Yeah. Um, and uh, what is that uh, repertoire? Have you ever had him on the Joe Rogan Experience? Uh, go mad. You know, go mad? No. Gallon of milk a day. Do you know that? Uh, do you know it? Disgusting. Disgusting. Yeah. So basically, a gallon of milk a day. Yeah. So Mark Rippetoe, he's um, he wrote this book called Starting Strength, and it became like the the main way most, most guys, at least my age, like getting into uh powerlifting. It was about technique. It was about like, his whole thing is like, look, you know, everyone comes into lifting, they think it's bodybuilding. Powerlifting is nothing like that. And he also looks looks like [ __ ], and he's fat. Uh, but his technique is amazing. And so the way he gets young guys to like get really good and really strong, uh, he puts them on a gallon of milk a day. Does that really have a positive effect? Yeah. I mean, he, he has a YouTube channel, like he has a lot of guys that are really, really strong, and he's, he's been a coach for a lot of people. What is it about a gallon of milk a day? Is it just the protein intake? What is it? Paragraph on it. I mean, it's, okay, here it is. Drink a gallon of milk a day. GoDad is undeniably the most effective nutritional strategy for adding slabs of mass to young underweight males. Milk is relatively cheap, painless to prepare, and the macronutrient profile is very balanced, and calories are always easier to drink than eat. Unfortunately, those interested in muscular hypertrophy, hypertrophy rather, who are not young, underweight, and male populations where GMO is not recommended will need to put more effort into the battle to avoid excess fat accumulation. Body composition can be manipulated progressively much like barbell training to achieve the breast results. For example, the starting strength novice linear progression holds exercise selection frequency and volume variables constant. Okay. Every 48 to 72 hours, the load stressor is incrementally increased to elicit an adaptation in strength. If the load increases too significant or insignificant, the desired adaptation won't take place. Yeah. This is the intelligence, right? This is the intelligence involved in lifting that people who are on the outside of it would dismiss. Science. Yeah. Um, you know, I'm so honored to be the the guy that introduces Joe Rogan to starting strength. You go mad. Yeah, go mad. Rippetoe is so funny. You should like watch some of his videos. He's, he has like this very thick uh Texan accent, and he just like, his audience shits on him all the time. They call him fat and ugly and whatever, and he, and he abuses his audience too. Let me see this guy. Let me see this guy. Put his picture up. That's the, that's old photo. He's not much better. Yeah. So he's just a nerd. Yeah, he's, he's a huge nerd. I did like, yeah, he used to lift a lot uh, a lot of weight. Yeah, there's a lot. That's what he used to look like. That one photo with him with the the hairy chest. The black Okay. Oh, maybe here. Wow. Damn. Is that him? Is that him? I don't think so. Really? It does look like him. Yeah, that's him. He used to be jacked. Okay, that's good. Oh, so he was a bodybuilder at one point in time, but but then he, he got on that go matchet. Now he's a powerlifter. Simply no other exercise, no machine provide the level of muscular stimulation and growth than the correctly performed full squat while he's deadlifting in that image. That's weird. So he, he also makes you squat on every, on every uh day of lifting. Oh. Uh, so squat every time, every time you lift. Really? Yeah. Yeah. Well, his idea is like squat is a full body exercise. Like you can just go to the gym. And when I, when I used to be busy and I just want to maintain, like be healthy, I'll just squat every, just get 15, 20 minutes of squat. 15, 20 minutes squat and and just get out of the gym. Um, but I do something with legs every day. Yeah. Yeah. You have to, but squat actually, it does feel like there's, there's an upper body component to it as well. Well, it's also your body recognizes like, oh, this [ __ ] wants to lift like really heavy things. We got to get big, right? Exactly. Yeah. It's the best way to get big. Yeah. Yeah. Because your body just realizes like, okay, we have to adapt. This [ __ ] wants to lift giant things every day. Yeah. Yeah. It's hilarious. And you know the other one, I'm sure you, you know him. I think you introduced me to to him through your podcast. Um, Louis Simmons, right? Yeah. Those, those guys are crazy. You watch the Netflix documentary? I didn't watch the Netflix doc. But we did actually interview him. He's like one of the few people that I traveled to go meet, right, who went to Westside Barbell. I saw that. It was great. We have some of his equipment out here. Reverse hyper. Yeah, we have the reverse hyper is so good for people that have back problems. Everyone that has a back issue, I, let me show you something. And I bring them out to the reverse hyper machine, and I'm like, \"This thing will actively strengthen and decompress your spine.\" Right. Right. It's so good. It's so good for people that have like lower back issues where the doctor just wants to cut them. I'm like, \"Hold on. Hold on. Don't do that right away.\" I had back pain uh since, since my late teens, and and and the doctors want to uh, like they, um, they, they did a MRI, and they, they found that there's, there's a bit of a bulge, and they want to do an operations on it. Yeah. They want to do a dissecttomy. Someone wanted to put me in anti-depressants. Apparently you can manage pain with anti-depressants. Have you heard of that? Yeah. Apparently it's a thing. Um, and and um, and through listening to your podcast and others, uh, I was like, I was just going to get strong. So I got, I got strong squats and things like that, and and and the pain got a lot better. Didn't, didn't go entirely. But the thing that like really got me over the hump, and this, this one was crazy. Um, uh, are you familiar with the mind body prescription? No. John Sarno. Oh, okay. Yes. I heard about him on Howard Stern because he was talking about how a lot of back pain is psychossematic. Psychossematic. Yeah. I don't, so his idea, and again, this is like, he doesn't understand jiu-jitsu because a lot of back pain is real as [ __ ]. Right. Right. Right. I, I mean, I don't think, settle down. I, I think for me, it was a combination um, of both, like there's something physically happening, but like his idea is that um, his idea is that your mind is creating the pain to distract you from emotional, psychological pain, and I think that's the case in some people. Yeah. And um, and then doctors will go do an image, and often, um, they'll find something, and he thinks that like lumbar imperfections are almost in everyone. Yes, I think that's true. And then, and then uh, the doctors latch on to that, and uh, and your mind latches on to that, and you, you start reinforcing, telling yourself that uh, that I have this thing, and the pain gets worse. There's also another thing called the salience network. Have you heard of this? No. If you can bring up the Wikipedia page for Sus network, uh, because I don't want to get it wrong, but the sus network is a network in the brain that neuroscientists found, um, uh, uh, my doctor, uh, Tadaki, he told me about this, um, the uh, uh, salience network, it gets um, reinforced uh, whenever you obsess over your pains or your health issues. M, that makes sense. So it's responsible for perception, and the more you reinforce it, it's like a, it's like a muscle, the more you reinforce it, it's sort of like AI, you know, reinforcement learning, the more you reinforce it, it becomes more of an issue, including various functions, including social behavior, self-awareness, and integrating sensory, emotional, and cognitive information. I bet social media is really bad for that, right? Totally, right. And, and so, you know, a lot of the, you know, fatigue and things like that, at some point, I'm like, [ __ ] Okay. Uh, like I did a lot of other things, but at some point, I'm like, \"Fuck it. I don't, I don't care about it. I don't have it. I'm just going to, I'm just going to be, uh, I'm just going to be good.\" Just not concentrate on that. Yeah. Because I was reading about it all the time. I was doing, I was like really worried, and I had Abigail Shrier talking about that in regards to cognitive therapy, that there's a lot of people that like obsess on their problems so much that their problems actually become bigger. Yes. And this is it. This is the neuroscience behind it. The salience network. Of course, makes sense. Yeah. Um, but there's legit back problems. Legit back. That's why the John Sarno thing, I was like, okay, not for me. I, I'd understand how some people could develop that issue. But his, his insight was like, look, I ran a clinic in New York City for a long time, and there, these u chronic illnesses come in waves. There is a, there's a ulcers wave in the like 90s. Oh, because it became a thing that people were talking about a lot. Yes. Wow. And then there's a, there's like a neck pain, and then there's an RSI. The most recent one was RSI. What is RSI? Uh, repetitive strain injury. Oh. And again, these all thing, all these things have rational um, uh, explanations. For, for me, I was in the computer all the time. Uh, and I was like, \"Oh, my, my arm hurts.\" And uh, and yeah, maybe you know, there\n\n\nWas some aspect of it. I was programming a lot. Uh, but also after I read John Sarno and I realized that some of it might be also psychological, that, you know, it's stress. Uh, I don't know what, maybe I have some childhood issues, but uh, but like, you just realize that a lot of it, and maybe the other way is true as well. When you just like minimize it, it just becomes less of an issue in your mind. But the fact that it is like fashion should tell you that there's something psychosomatic about it, right? The fact that it does come in waves like that for sure. And then once it's in the zeicist, ulcers or whatever it is. Yeah. Every, I remember when I, when we were kids, like everyone had ulcers, and it was like, \"Oh, it's from coffee in the morning.\" Uh, like there's all these, I don't know anyone that had ulcers now, right? I don't either. That's true. That's crazy. That's wild. This is wild. The mind, like the way it can benefit you or the way it can hold you prisoner. Yeah. And again, this is maybe why I have like a little, like, um, different view about AI and humans and all of that from Silicon Valley. Like this is a weird thing, but um, uh, every time I set my mind to like meet someone, I meet them, including you. Oh, wow, that's weird. Like, yeah, I want, I want to meet this person. Something happens, some chain of events, but obviously, you know, you also see, obviously, you're doing something very, you're, you're not just thinking it, you're also doing things, right? Which is my problem with like the secret and like the power of manifesting things. I don't go that far, but I don't know, like there's something, there's something, there's something there. I agree. There's something to it. Yeah. I just, I, I think the mind and our connection to reality is not as simple as we've been told. Not at all. I, I think there's, there's something there. And again, when you, when you start looking at psychedelics and stuff like that, there's, there's something there. And, um, I remember, um, listening to, to one of, I, I, I love the Joe Rogan Experience circa early 2010s. Um, it was a, there was a remote viewing, uh, you were talking about a remote viewing episode. Um, and I was like, \"Wow, that's, that's crazy.\" Uh, and um, obviously very skeptical of it. The idea that you can meditate and like see somewhere else or see, see it from above. Yeah. I read a book by Da Vinci. It's called Da Vinci's Brain, I think. Um, Da Vinci is like fascinating. Who's this [ __ ] guy? He does everything and um, and he, he literally is like across all these domains and uh, he doesn't, he barely sleeps, like he has this polyphasic sleep thing, which I tried once, it's torture. Um, basically every four hours you sleep for 15 minutes. When I was, uh, when I was in university, I, um, uh, I was, I was very good at computer science, but I hated going to school. And in Jordan, if you don't go to school, they ban you from, from the exam. Oh, wow. And I was getting A's, but I just didn't want to, like, I didn't want to sit in class. Uh, and actually, this is when I started thinking about programming on my phone. I was like, maybe I can code my phone class. Um, but uh, but I felt there was like injustice, like I just ADHD, whatever you want to call it. Like I just can't sit in class, like just give me, give me a break. And so I felt justified to, you know, rebel or fix the situation somehow. So I decided to like hack into the university and change my grades so I can graduate because everyone was graduating. It was like five years in. It took me six years to get through, through a 4-year program just because I can't sit in class. Um, and you know, have some, some, some dyslexia and things like that. But um, so uh, I, um, I, I decided to do that, and I'm like, okay, I'm, I'm like hacking takes a lot of time because like, you're, you're coding, you're scripting, you're running scripts against servers, and, and you're waiting, and I'm like, I'm just going to, uh, you know, to optimize my time, I'm just going to do this Da Vinci thing where like, four, four hours. By the way, there's a Seinfeld episode where what's his name of the crazy guy in Seinfeld, um, Kramer. Kramer. Kramer does poly physics sleeping. Maybe I learned it from there. I'm not sure. But um, how do you wake up? Uh, you set an alarm. Oh, god. Yeah, it's, it's torture. That sounds so crazy. So apparently Da Vinci used to do that. But anyways, I, I was able to to hack into the university by like working for weeks using uh, polyphasic sleep, uh, and was able to change my grades. Um, and uh, uh, initially I didn't want to do it on myself, but I had a neighbor who uh, went together to school, and, and, and I was like, you know, let's change this grade and see, see if it actually succeeds, and actually succeeded in, in his case, and it was my lab rat, but uh, in my case, uh, I got caught, and, and the reason I got caught is, uh, there is the, the, you know, in the database, uh, there's your grade out of 100, um, you know, zero to 100, uh, when you get banned because of attendance, your grade is de facto 35. So I thought I would just change that, and that's the thing that will get me to, to pass. Well, turns out there's another field in the database about whether you're banned or not. Ah, this is bad. This is bad coding. This is bad programming because it's this, this database is not normalized. There's a state in two different fields. So I'll put the blame on them for not designing the right database. That's hilarious. You blame them for your hacking being successful. So what was the punishment? Uh, so, so, uh, the entire university system went down because there's this anomaly. I was, I was, you know, um, uh, I passed, but at the same time, I was, I was banned. And so I got a call, uh, from the head of the registration system, and it was like 7:00 p.m., whatever it was, landline, and I pick up the call. He's like, \"Hey, listen. We have this issue we're dealing with. Like the entire thing is down, and, and it just shows your record. There's a problem with it. Do you know anything about it?\" And at the time I'm like, \"All right, there's like a fork in the road.\" You know, I either like come clean or it's like this is a lie that will like live for me forever. And I was like, I was just gonna say, I was like, \"Yeah, I, I did it.\" Uh, and I was like, \"What do you mean?\" I was like, \"Okay, I'll, I'll come explain it to you.\" So, so the next day I, I go there, and it's all the university deans, and it's like one of the best computer science universities in, in the region, the princess of my university for technology. Um, and they're all nerds, you know, it's, it's so I, the, the, the discussion became technical on like how I hacked in the university, and I, I want the whiteboard and explaining what I did, the systems, whatever. And it just felt like a brainstorming session. I'm like, \"All right, I'll see you guys later.\" I was like, \"Wait, um, we need to figure out what to do with you.\" Like, you know, this is serious. Um, and uh, I'm like, \"Oh crap.\" Um, but the president of, uh, they, they kind of put the decision to the president, and he was, I forgot his name, but he was such an enlightened guy. Um, and, and I went and told him, like I just didn't mean any malice. I just felt like justified. I need to graduate. I've been here for a long time. Actually do good work, and um, and he's like, \"Look, you're, you're talented. Um, but with great power comes great responsibility.\" He gave me the Spider-Man line. Um, and he said, \"Uh, for us to forgive you, you're going to have to go and harden the uh, systems in the university against, against hacking.\" So I spent the summer trying to work with the, with the engineers at the university to, to do that. But uh, but they hated me because, you know, I'm the guy that hacked into the system. So they would like blackball me. Like sometimes I'll show up to work, and they wouldn't open the door, and I can see them, like I can see you there. I'm knocking. And they wouldn't let me in and let me work with them. Um, we did some stuff to, to fix it. And, and then uh, uh, I, I gained uh, um, you know, fame, maybe notoriety in the, in the university, and actually got me my first job. Um, uh, while I was in school, and um, it's a different story, but that, that job was, was at a, at a startup that ended up making uh, videos that were a big part of the Arab Spring. Um, Oh, wow. Yeah. Uh, and I, I was part of some of these uh, videos as well. But anyways, uh, so uh, one of the computer deans uh, was like, \"Hey, listen. I really helped you out, computer science dean. I really helped you out when you had this problem, and I need you to work with me uh, in order to do another research to hack into the university again.\" It's like, \"I'm not, not going to do that. Like I don't want to get, No, it's like no, you're not going to get in trouble. You're, you're going to be sanctioned.\" So, so again, I worked tirelessly on that. This time I, I invent a piece of software to help me do that. Uh, and um, and I, I was able to like find more uh, more uh, vulnerabilities. Uh, and so I show up at my project defense, and it's uh, it's like a committee of different deans and students and all that. Uh, and so I go up, and I start um, explaining my, my project, and like I run a scan against the university network, and it showed a bunch of red, like there's vulnerabilities, and one of the prof, uh, deans was like, \"No, that's fake. You, that's not true.\" It started dawning in me that I was like a pawn in some kind of power struggle. So that, that guy was responsible for this universal system, and this guy's using me too. I was like, \"Oh shit.\" But like, \"I'm not going to back down.\" I was like, \"No, it's not a lie. It's true.\" Uh, and so, uh, I like tap into that univer, uh, vulnerability, and I go into the database, and I'm like, \"Um, all right. What do you, what do you want me to show, your salary or your password?\" It's like, \"Show me my password.\" So, I show him the password. Uh, and uh, I was like, \"No, that's not my password. It was encrypted.\" But they also have in the database like a decrypt function, which they shouldn't have, but they had it. So I was like decrypt to the password, and the password showed on the screen in the middle of the defense. And so he still, his, his face was red, and he shakes my hand, and he leaves to change his password. That's awesome. And I graduated, and you know, they cut me some slack, and I, I was able to to graduate. That's awesome. That's a great story. We, we'll end with that. Yeah. Thank you very much, brother. I really appreciate it. Really fun. That was a great, great conversation. Um, your app, let everyone know about it. Replit. There it is. Yeah. Replit.com. Go make some apps. Go make some apps, people. Avoid the whatever the hell's going to happen to the AI. All right. Thank you very much. Bye, everybody. [Music] [Applause] [Music]\n",
  "metadata": {
    "summary": "In this episode, Joe Rogan speaks with Amjad Masad, the founder and CEO of Replit, about a wide range of topics. They discuss the impact of video games on skills like surgery, the potential downsides of streaming, and the rise of AI. Masad shares his family's history and views on the Israeli-Palestinian conflict, free speech, and the influence of social media. They also delve into the changing landscape of entrepreneurship, the future of programming, and the potential of AI to transform various industries. The conversation touches on personal experiences, including Masad's early interest in computers and his views on health, consciousness, and the challenges of modern society.",
    "topClaims": [
      {
        "text": "Surgeons that play video games regularly are much less likely to make mistakes.",
        "rating": 8.5,
        "chunkId": "ck-WfmrEa0L08E-2"
      },
      {
        "text": "Kids are watching someone play the game instead of playing the game themselves, which is a dystopian situation.",
        "rating": 7.8,
        "chunkId": "ck-WfmrEa0L08E-5"
      },
      {
        "text": "If you talk about the bombing of people waiting for food, you are labeled as anti-Semitic.",
        "rating": 8.2,
        "chunkId": "ck-WfmrEa0L08E-17"
      },
      {
        "text": "Fascism rises as the overcorrection response to communism, and that we essentially had this Marxist communism rise.",
        "rating": 7.5,
        "chunkId": "ck-WfmrEa0L08E-20"
      },
      {
        "text": "Boomers are the problem because they do not understand the internet and believe in conspiracies.",
        "rating": 6.9,
        "chunkId": "ck-WfmrEa0L08E-49"
      }
    ],
    "topQuotes": [
      {
        "text": "Surgeons that play video games regularly are much less likely to make mistakes.",
        "chunkId": "ck-WfmrEa0L08E-2",
        "chunkNum": 2,
        "relevance": 8.8,
        "interesting": 9.1
      },
      {
        "text": "It's almost like someone is living life and doing things and you're like sort of, it's almost voyerism or something like that about it.",
        "chunkId": "ck-WfmrEa0L08E-6",
        "chunkNum": 6,
        "relevance": 7.9,
        "interesting": 7.5
      },
      {
        "text": "Buying Twitter is the single most impactful thing for free speech, especially on these issues, of being able to talk freely.",
        "chunkId": "ck-WfmrEa0L08E-18",
        "chunkNum": 18,
        "relevance": 8.5,
        "interesting": 8.2
      },
      {
        "text": "I think making software needs to be more like a, like a trade.",
        "chunkId": "ck-WfmrEa0L08E-28",
        "chunkNum": 28,
        "relevance": 7.1,
        "interesting": 6.8
      },
      {
        "text": "I don't think psychedelics are drugs, I think it's a completely different thing, it's really hard to get addicted to them, right?",
        "chunkId": "ck-WfmrEa0L08E-35",
        "chunkNum": 35,
        "relevance": 7.6,
        "interesting": 7.3
      }
    ],
    "topTopics": [
      {
        "name": "video games",
        "count": 12,
        "description": "The impact of video games on various aspects of life."
      },
      {
        "name": "artificial intelligence",
        "count": 10,
        "description": "The potential of artificial intelligence and its implications."
      },
      {
        "name": "social media",
        "count": 8,
        "description": "The societal impact and challenges of social media."
      },
      {
        "name": "israel palestine",
        "count": 7,
        "description": "The Israeli-Palestinian conflict and related issues."
      },
      {
        "name": "entrepreneurship",
        "count": 6,
        "description": "The role of entrepreneurship and business creation."
      }
    ],
    "videoInfo": {
      "id": "WfmrEa0L08E",
      "etag": "w9Y5WMU1-nbgLvWRCkX0si72UBY",
      "kind": "youtube#video",
      "snippet": {
        "tags": [
          "Joe Rogan Experience",
          "JRE",
          "Joe",
          "Rogan",
          "podcast",
          "MMA",
          "comedy",
          "stand",
          "up",
          "funny",
          "Freak",
          "Party"
        ],
        "title": "Joe Rogan Experience #2344 - Amjad Masad",
        "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
        "localized": {
          "title": "Joe Rogan Experience #2344 - Amjad Masad",
          "description": "Amjad Masad is the founder and CEO of Replit, a cloud-based coding platform. He is also an outspoken voice on cultural and educational shifts in technology.\n⁠https://www.replit.com⁠\n\nThe ultimate wireless hack. Make the switch at Visible dot com."
        },
        "categoryId": "22",
        "thumbnails": {
          "high": {
            "url": "https://i.ytimg.com/vi/WfmrEa0L08E/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/WfmrEa0L08E/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/WfmrEa0L08E/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "default": {
            "url": "https://i.ytimg.com/vi/WfmrEa0L08E/default.jpg",
            "width": 120,
            "height": 90
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/WfmrEa0L08E/sddefault.jpg",
            "width": 640,
            "height": 480
          }
        },
        "description": "Amjad Masad is the founder and CEO of Replit, a cloud-based coding platform. He is also an outspoken voice on cultural and educational shifts in technology.\n⁠https://www.replit.com⁠\n\nThe ultimate wireless hack. Make the switch at Visible dot com.",
        "publishedAt": "2025-07-02T17:00:52Z",
        "channelTitle": "PowerfulJRE",
        "defaultLanguage": "en",
        "defaultAudioLanguage": "en-US",
        "liveBroadcastContent": "none"
      },
      "statistics": {
        "likeCount": "1260",
        "viewCount": "36485",
        "commentCount": "437",
        "favoriteCount": "0"
      },
      "contentDetails": {
        "caption": "false",
        "duration": "PT2H52M4S",
        "dimension": "2d",
        "definition": "hd",
        "projection": "rectangular",
        "contentRating": {},
        "licensedContent": true
      }
    },
    "checkCount": 27,
    "nodeCounts": [
      {
        "node": "programming",
        "count": 8
      },
      {
        "node": "twitter",
        "count": 8
      },
      {
        "node": "social-media",
        "count": 8
      },
      {
        "node": "silicon-valley",
        "count": 7
      },
      {
        "node": "replit",
        "count": 6
      },
      {
        "node": "elon",
        "count": 6
      },
      {
        "node": "ai-automation",
        "count": 5
      },
      {
        "node": "technology",
        "count": 4
      },
      {
        "node": "manufacturing-jobs",
        "count": 4
      },
      {
        "node": "the-joe-rogan-experience",
        "count": 3
      },
      {
        "node": "surgeons",
        "count": 3
      },
      {
        "node": "video-games",
        "count": 3
      },
      {
        "node": "syria",
        "count": 3
      },
      {
        "node": "gaza",
        "count": 3
      },
      {
        "node": "app",
        "count": 3
      },
      {
        "node": "entrepreneurship",
        "count": 3
      },
      {
        "node": "corruption",
        "count": 3
      },
      {
        "node": "mainstream-media",
        "count": 3
      },
      {
        "node": "sci-fi-movies",
        "count": 3
      },
      {
        "node": "google",
        "count": 3
      },
      {
        "node": "saudi-arabia",
        "count": 3
      },
      {
        "node": "openai",
        "count": 3
      },
      {
        "node": "squats",
        "count": 3
      },
      {
        "node": "jiu-jitsu",
        "count": 3
      },
      {
        "node": "university-hack",
        "count": 3
      },
      {
        "node": "hacking",
        "count": 3
      },
      {
        "node": "jason",
        "count": 2
      },
      {
        "node": "controllers",
        "count": 2
      },
      {
        "node": "counterstrike",
        "count": 2
      },
      {
        "node": "quake",
        "count": 2
      },
      {
        "node": "tik-tok",
        "count": 2
      },
      {
        "node": "tiktok",
        "count": 2
      },
      {
        "node": "carl-hart",
        "count": 2
      },
      {
        "node": "ai-impact",
        "count": 2
      },
      {
        "node": "ms-dos",
        "count": 2
      },
      {
        "node": "microsoft",
        "count": 2
      },
      {
        "node": "ai-agent",
        "count": 2
      },
      {
        "node": "hifa",
        "count": 2
      },
      {
        "node": "palestine",
        "count": 2
      },
      {
        "node": "twitter-purchase",
        "count": 2
      },
      {
        "node": "fascism",
        "count": 2
      },
      {
        "node": "communism",
        "count": 2
      },
      {
        "node": "managerialism",
        "count": 2
      },
      {
        "node": "managerial-society",
        "count": 2
      },
      {
        "node": "managers",
        "count": 2
      },
      {
        "node": "doge",
        "count": 2
      },
      {
        "node": "accountability",
        "count": 2
      },
      {
        "node": "ai-coding",
        "count": 2
      },
      {
        "node": "universal-basic-income",
        "count": 2
      },
      {
        "node": "creativity",
        "count": 2
      },
      {
        "node": "morphic-resonance",
        "count": 2
      },
      {
        "node": "psychedelic-experience",
        "count": 2
      },
      {
        "node": "psychedelics",
        "count": 2
      },
      {
        "node": "vaccine-injury",
        "count": 2
      },
      {
        "node": "vaccination",
        "count": 2
      },
      {
        "node": "vaccine",
        "count": 2
      },
      {
        "node": "rockets",
        "count": 2
      },
      {
        "node": "censorship",
        "count": 2
      },
      {
        "node": "facebook",
        "count": 2
      },
      {
        "node": "google-gemini",
        "count": 2
      },
      {
        "node": "sci-fi",
        "count": 2
      },
      {
        "node": "ceo",
        "count": 2
      },
      {
        "node": "anthropic",
        "count": 2
      },
      {
        "node": "unemployment",
        "count": 2
      },
      {
        "node": "negative-effects",
        "count": 2
      },
      {
        "node": "social-media-evolution",
        "count": 2
      },
      {
        "node": "fitness-influencers",
        "count": 2
      },
      {
        "node": "instagram",
        "count": 2
      },
      {
        "node": "ai-videos",
        "count": 2
      },
      {
        "node": "iran",
        "count": 2
      },
      {
        "node": "tedious-job",
        "count": 2
      },
      {
        "node": "company-valuation",
        "count": 2
      },
      {
        "node": "technique",
        "count": 2
      },
      {
        "node": "john-sarno",
        "count": 2
      },
      {
        "node": "da-vinci",
        "count": 2
      },
      {
        "node": "polyphasic-sleep",
        "count": 2
      },
      {
        "node": "grade-change",
        "count": 2
      },
      {
        "node": "graduation",
        "count": 2
      },
      {
        "node": "joe-rogan-podcast",
        "count": 1
      },
      {
        "node": "counter-strike-tournament",
        "count": 1
      },
      {
        "node": "pro-player",
        "count": 1
      },
      {
        "node": "pro-playing",
        "count": 1
      },
      {
        "node": "commitment",
        "count": 1
      },
      {
        "node": "gaming-impact",
        "count": 1
      },
      {
        "node": "nintendo-switch",
        "count": 1
      },
      {
        "node": "strategy-thinking",
        "count": 1
      },
      {
        "node": "reaction-time",
        "count": 1
      },
      {
        "node": "gamers",
        "count": 1
      },
      {
        "node": "drone-pilots",
        "count": 1
      },
      {
        "node": "surgery",
        "count": 1
      },
      {
        "node": "controllers-in-surgery",
        "count": 1
      },
      {
        "node": "video-game-pill",
        "count": 1
      },
      {
        "node": "error-decrease",
        "count": 1
      },
      {
        "node": "task-completion",
        "count": 1
      },
      {
        "node": "streaming-situation",
        "count": 1
      },
      {
        "node": "zombifying-thing",
        "count": 1
      },
      {
        "node": "mindless-watching",
        "count": 1
      },
      {
        "node": "dystopian",
        "count": 1
      },
      {
        "node": "scrolling",
        "count": 1
      },
      {
        "node": "technology-impact",
        "count": 1
      },
      {
        "node": "david-foster-wallace",
        "count": 1
      },
      {
        "node": "addictive-behavior",
        "count": 1
      },
      {
        "node": "media-voyeurism",
        "count": 1
      },
      {
        "node": "mobile-phones-impact",
        "count": 1
      },
      {
        "node": "infinite-jest-essay",
        "count": 1
      },
      {
        "node": "social-media-effects",
        "count": 1
      },
      {
        "node": "television-impact",
        "count": 1
      },
      {
        "node": "disney-world",
        "count": 1
      },
      {
        "node": "avatar-ride",
        "count": 1
      },
      {
        "node": "flights-of-passage",
        "count": 1
      },
      {
        "node": "vr-game",
        "count": 1
      },
      {
        "node": "motorcycle-looking-thing",
        "count": 1
      },
      {
        "node": "dragon",
        "count": 1
      },
      {
        "node": "engrossing",
        "count": 1
      },
      {
        "node": "opium-habit",
        "count": 1
      },
      {
        "node": "semi-functional",
        "count": 1
      },
      {
        "node": "youtube-video",
        "count": 1
      },
      {
        "node": "contrarian-opinion",
        "count": 1
      },
      {
        "node": "streaming",
        "count": 1
      },
      {
        "node": "alcohol-tolerance",
        "count": 1
      },
      {
        "node": "alcohol-consumption",
        "count": 1
      },
      {
        "node": "marijuana-consumption",
        "count": 1
      },
      {
        "node": "downtrend-alcohol",
        "count": 1
      },
      {
        "node": "huberman",
        "count": 1
      },
      {
        "node": "mocktails",
        "count": 1
      },
      {
        "node": "ai-kill",
        "count": 1
      },
      {
        "node": "quitting-drinking",
        "count": 1
      },
      {
        "node": "health-trend",
        "count": 1
      },
      {
        "node": "cold-plunging",
        "count": 1
      },
      {
        "node": "sauna-use",
        "count": 1
      },
      {
        "node": "alcohol-impact",
        "count": 1
      },
      {
        "node": "intermittent-fasting",
        "count": 1
      },
      {
        "node": "cognitive-function",
        "count": 1
      },
      {
        "node": "mental-toughness",
        "count": 1
      },
      {
        "node": "keto-carnivore",
        "count": 1
      },
      {
        "node": "ibm-pc",
        "count": 1
      },
      {
        "node": "scripting",
        "count": 1
      },
      {
        "node": "gaming",
        "count": 1
      },
      {
        "node": "modding",
        "count": 1
      },
      {
        "node": "chat-gpt",
        "count": 1
      },
      {
        "node": "syntax",
        "count": 1
      },
      {
        "node": "wireless",
        "count": 1
      },
      {
        "node": "network",
        "count": 1
      },
      {
        "node": "unlimited-data",
        "count": 1
      },
      {
        "node": "verizon",
        "count": 1
      },
      {
        "node": "complexity",
        "count": 1
      },
      {
        "node": "gbt",
        "count": 1
      },
      {
        "node": "palestinian-refugee",
        "count": 1
      },
      {
        "node": "1948-nakba",
        "count": 1
      },
      {
        "node": "palestinians-expelled",
        "count": 1
      },
      {
        "node": "gunpoint-displacement",
        "count": 1
      },
      {
        "node": "refugees",
        "count": 1
      },
      {
        "node": "yafa",
        "count": 1
      },
      {
        "node": "lebanon",
        "count": 1
      },
      {
        "node": "jordan",
        "count": 1
      },
      {
        "node": "engineer",
        "count": 1
      },
      {
        "node": "amman-jordan",
        "count": 1
      },
      {
        "node": "rebuild-life",
        "count": 1
      },
      {
        "node": "engineering-degree",
        "count": 1
      },
      {
        "node": "bombing",
        "count": 1
      },
      {
        "node": "anti-semitism",
        "count": 1
      },
      {
        "node": "state-of-palestine",
        "count": 1
      },
      {
        "node": "palestinian",
        "count": 1
      },
      {
        "node": "woke-period",
        "count": 1
      },
      {
        "node": "posture",
        "count": 1
      },
      {
        "node": "migrant-workers",
        "count": 1
      },
      {
        "node": "palestinian-students",
        "count": 1
      },
      {
        "node": "turkish-students",
        "count": 1
      },
      {
        "node": "anti-colonial-activism",
        "count": 1
      },
      {
        "node": "radicalism",
        "count": 1
      },
      {
        "node": "israel-palestine",
        "count": 1
      },
      {
        "node": "overcorrection",
        "count": 1
      },
      {
        "node": "anthony-rispo",
        "count": 1
      },
      {
        "node": "james-burnham",
        "count": 1
      },
      {
        "node": "capitalism",
        "count": 1
      },
      {
        "node": "centralized-control",
        "count": 1
      },
      {
        "node": "ivy-league-students",
        "count": 1
      },
      {
        "node": "founder-mode",
        "count": 1
      },
      {
        "node": "founders",
        "count": 1
      },
      {
        "node": "xai",
        "count": 1
      },
      {
        "node": "ai-company",
        "count": 1
      },
      {
        "node": "accomplishments",
        "count": 1
      },
      {
        "node": "incompetence",
        "count": 1
      },
      {
        "node": "monopoly",
        "count": 1
      },
      {
        "node": "fraud",
        "count": 1
      },
      {
        "node": "innovation",
        "count": 1
      },
      {
        "node": "new-startups",
        "count": 1
      },
      {
        "node": "conglomerates",
        "count": 1
      },
      {
        "node": "monopsiny",
        "count": 1
      },
      {
        "node": "blackrock",
        "count": 1
      },
      {
        "node": "implicit-collusion",
        "count": 1
      },
      {
        "node": "market-dynamics",
        "count": 1
      },
      {
        "node": "firemen-training",
        "count": 1
      },
      {
        "node": "website-idea",
        "count": 1
      },
      {
        "node": "online-courses",
        "count": 1
      },
      {
        "node": "business-potential",
        "count": 1
      },
      {
        "node": "software-agency",
        "count": 1
      },
      {
        "node": "joan-cheney",
        "count": 1
      },
      {
        "node": "serial-entrepreneur",
        "count": 1
      },
      {
        "node": "rapid-prototyping",
        "count": 1
      },
      {
        "node": "brainstorming-phase",
        "count": 1
      },
      {
        "node": "3d-printing",
        "count": 1
      },
      {
        "node": "jack-dorsey",
        "count": 1
      },
      {
        "node": "square-device",
        "count": 1
      },
      {
        "node": "user-testing",
        "count": 1
      },
      {
        "node": "iterate",
        "count": 1
      },
      {
        "node": "form-factor",
        "count": 1
      },
      {
        "node": "software-evolution",
        "count": 1
      },
      {
        "node": "consumer-culture",
        "count": 1
      },
      {
        "node": "hacker-ethos",
        "count": 1
      },
      {
        "node": "iphone",
        "count": 1
      },
      {
        "node": "tablet",
        "count": 1
      },
      {
        "node": "prompts",
        "count": 1
      },
      {
        "node": "text-prompts",
        "count": 1
      },
      {
        "node": "kids",
        "count": 1
      },
      {
        "node": "mechanic",
        "count": 1
      },
      {
        "node": "code",
        "count": 1
      },
      {
        "node": "textbook",
        "count": 1
      },
      {
        "node": "humane",
        "count": 1
      },
      {
        "node": "large-language-models",
        "count": 1
      },
      {
        "node": "roger-penrose",
        "count": 1
      },
      {
        "node": "incompleteness-theorem",
        "count": 1
      },
      {
        "node": "hammeroff",
        "count": 1
      },
      {
        "node": "projection",
        "count": 1
      },
      {
        "node": "sheldrake",
        "count": 1
      },
      {
        "node": "rupert-sheldrick",
        "count": 1
      },
      {
        "node": "collective-memory",
        "count": 1
      },
      {
        "node": "past-patterns",
        "count": 1
      },
      {
        "node": "parapsychology",
        "count": 1
      },
      {
        "node": "mainstream-acceptance",
        "count": 1
      },
      {
        "node": "pseudoscience",
        "count": 1
      },
      {
        "node": "harvard",
        "count": 1
      },
      {
        "node": "philosophers",
        "count": 1
      },
      {
        "node": "complex-experience",
        "count": 1
      },
      {
        "node": "terrence-mckenna",
        "count": 1
      },
      {
        "node": "allen-watts",
        "count": 1
      },
      {
        "node": "language-insufficiency",
        "count": 1
      },
      {
        "node": "the-word-drugs",
        "count": 1
      },
      {
        "node": "performance-enhancing-drugs",
        "count": 1
      },
      {
        "node": "addictive-substances",
        "count": 1
      },
      {
        "node": "illegal-substances",
        "count": 1
      },
      {
        "node": "psychological-addiction",
        "count": 1
      },
      {
        "node": "spiritual-narcissism",
        "count": 1
      },
      {
        "node": "arrogance",
        "count": 1
      },
      {
        "node": "iba-game",
        "count": 1
      },
      {
        "node": "rick-perry",
        "count": 1
      },
      {
        "node": "iba-impact",
        "count": 1
      },
      {
        "node": "ptsd-suicide",
        "count": 1
      },
      {
        "node": "veterans",
        "count": 1
      },
      {
        "node": "republican",
        "count": 1
      },
      {
        "node": "personal-healing",
        "count": 1
      },
      {
        "node": "maps",
        "count": 1
      },
      {
        "node": "mdma",
        "count": 1
      },
      {
        "node": "ptsd",
        "count": 1
      },
      {
        "node": "ketamine",
        "count": 1
      },
      {
        "node": "depression",
        "count": 1
      },
      {
        "node": "mushrooms",
        "count": 1
      },
      {
        "node": "long-co",
        "count": 1
      },
      {
        "node": "postviral-malaise",
        "count": 1
      },
      {
        "node": "metabolic-health",
        "count": 1
      },
      {
        "node": "long-covid",
        "count": 1
      },
      {
        "node": "metformin",
        "count": 1
      },
      {
        "node": "anti-aging",
        "count": 1
      },
      {
        "node": "cholesterol",
        "count": 1
      },
      {
        "node": "vitamin-d",
        "count": 1
      },
      {
        "node": "negative-reaction",
        "count": 1
      },
      {
        "node": "challenging-norms",
        "count": 1
      },
      {
        "node": "taking-vaccine",
        "count": 1
      },
      {
        "node": "dissenting-voices",
        "count": 1
      },
      {
        "node": "palestine-gaza",
        "count": 1
      },
      {
        "node": "tim-dylan",
        "count": 1
      },
      {
        "node": "october-7th",
        "count": 1
      },
      {
        "node": "sirens",
        "count": 1
      },
      {
        "node": "california-kid",
        "count": 1
      },
      {
        "node": "be-okay",
        "count": 1
      },
      {
        "node": "internet-potential",
        "count": 1
      },
      {
        "node": "propaganda-ignorance",
        "count": 1
      },
      {
        "node": "misinformation",
        "count": 1
      },
      {
        "node": "youtube",
        "count": 1
      },
      {
        "node": "malinformation",
        "count": 1
      },
      {
        "node": "factual-truth",
        "count": 1
      },
      {
        "node": "turning-adults",
        "count": 1
      },
      {
        "node": "secular-religion",
        "count": 1
      },
      {
        "node": "functioning-brains",
        "count": 1
      },
      {
        "node": "nuanced-view",
        "count": 1
      },
      {
        "node": "counterarguments",
        "count": 1
      },
      {
        "node": "fascism-and-communism",
        "count": 1
      },
      {
        "node": "debate",
        "count": 1
      },
      {
        "node": "elite-group",
        "count": 1
      },
      {
        "node": "plebs",
        "count": 1
      },
      {
        "node": "nazis",
        "count": 1
      },
      {
        "node": "propaganda",
        "count": 1
      },
      {
        "node": "boomers",
        "count": 1
      },
      {
        "node": "internet-understanding",
        "count": 1
      },
      {
        "node": "conspiracies",
        "count": 1
      },
      {
        "node": "cocaine",
        "count": 1
      },
      {
        "node": "boomer-logic",
        "count": 1
      },
      {
        "node": "van-accident",
        "count": 1
      },
      {
        "node": "santa-claus",
        "count": 1
      },
      {
        "node": "tooth-fairy",
        "count": 1
      },
      {
        "node": "boomerism",
        "count": 1
      },
      {
        "node": "grock",
        "count": 1
      },
      {
        "node": "roto-virus-vaccine",
        "count": 1
      },
      {
        "node": "cutter-incident",
        "count": 1
      },
      {
        "node": "gileian-bar",
        "count": 1
      },
      {
        "node": "mary-tally",
        "count": 1
      },
      {
        "node": "fake-studies",
        "count": 1
      },
      {
        "node": "alzheimer-s-research",
        "count": 1
      },
      {
        "node": "sylvane-lesnoscientist",
        "count": 1
      },
      {
        "node": "matthew-shrog",
        "count": 1
      },
      {
        "node": "carl-herup",
        "count": 1
      },
      {
        "node": "lab-leak-theory",
        "count": 1
      },
      {
        "node": "ai-query",
        "count": 1
      },
      {
        "node": "controversial-subjects",
        "count": 1
      },
      {
        "node": "conspiracy-theory",
        "count": 1
      },
      {
        "node": "socratic-debate",
        "count": 1
      },
      {
        "node": "ai-community",
        "count": 1
      },
      {
        "node": "sanskrit",
        "count": 1
      },
      {
        "node": "trustworthy-sources",
        "count": 1
      },
      {
        "node": "agi",
        "count": 1
      },
      {
        "node": "enslave-humanity",
        "count": 1
      },
      {
        "node": "soviet-union",
        "count": 1
      },
      {
        "node": "apes-controlling",
        "count": 1
      },
      {
        "node": "agi-ignoring",
        "count": 1
      },
      {
        "node": "colossus",
        "count": 1
      },
      {
        "node": "cbs-oil-complex",
        "count": 1
      },
      {
        "node": "retaliated",
        "count": 1
      },
      {
        "node": "trailer",
        "count": 1
      },
      {
        "node": "supercomput",
        "count": 1
      },
      {
        "node": "the-three-body-problem",
        "count": 1
      },
      {
        "node": "sci-fi-film",
        "count": 1
      },
      {
        "node": "alien-entity",
        "count": 1
      },
      {
        "node": "parasitic-attachment",
        "count": 1
      },
      {
        "node": "sputnik",
        "count": 1
      },
      {
        "node": "ted-chang",
        "count": 1
      },
      {
        "node": "alien-intelligence",
        "count": 1
      },
      {
        "node": "alien-communication",
        "count": 1
      },
      {
        "node": "alien-experience",
        "count": 1
      },
      {
        "node": "alien-consciousness",
        "count": 1
      },
      {
        "node": "big-bang",
        "count": 1
      },
      {
        "node": "penrose",
        "count": 1
      },
      {
        "node": "galaxies",
        "count": 1
      },
      {
        "node": "agi-cult",
        "count": 1
      },
      {
        "node": "ai-everything",
        "count": 1
      },
      {
        "node": "sci-fi-authors",
        "count": 1
      },
      {
        "node": "interconnected",
        "count": 1
      },
      {
        "node": "computer-impact",
        "count": 1
      },
      {
        "node": "star-trek",
        "count": 1
      },
      {
        "node": "participation-rate",
        "count": 1
      },
      {
        "node": "social-safety-nets",
        "count": 1
      },
      {
        "node": "housing",
        "count": 1
      },
      {
        "node": "austin-homeless",
        "count": 1
      },
      {
        "node": "san-francisco-homeless",
        "count": 1
      },
      {
        "node": "industrial-complex",
        "count": 1
      },
      {
        "node": "steven-adler",
        "count": 1
      },
      {
        "node": "los-angeles-homeless",
        "count": 1
      },
      {
        "node": "outreach-organizations",
        "count": 1
      },
      {
        "node": "homeless-budget-investigation",
        "count": 1
      },
      {
        "node": "homeless-encampments",
        "count": 1
      },
      {
        "node": "congressional-investigation",
        "count": 1
      },
      {
        "node": "progressives",
        "count": 1
      },
      {
        "node": "mike-benz",
        "count": 1
      },
      {
        "node": "elon-doge",
        "count": 1
      },
      {
        "node": "centrists",
        "count": 1
      },
      {
        "node": "foundations-of-america",
        "count": 1
      },
      {
        "node": "government-transparency",
        "count": 1
      },
      {
        "node": "government-spending",
        "count": 1
      },
      {
        "node": "elon-musk",
        "count": 1
      },
      {
        "node": "donald-trump",
        "count": 1
      },
      {
        "node": "election-rigging",
        "count": 1
      },
      {
        "node": "social-media-discourse",
        "count": 1
      },
      {
        "node": "2024-elections",
        "count": 1
      },
      {
        "node": "bots",
        "count": 1
      },
      {
        "node": "profiles",
        "count": 1
      },
      {
        "node": "fbi-guy",
        "count": 1
      },
      {
        "node": "state-actors",
        "count": 1
      },
      {
        "node": "hacker-kid",
        "count": 1
      },
      {
        "node": "credit-campaigns",
        "count": 1
      },
      {
        "node": "group-messages",
        "count": 1
      },
      {
        "node": "twitter-links",
        "count": 1
      },
      {
        "node": "private-filter",
        "count": 1
      },
      {
        "node": "social-media-curation",
        "count": 1
      },
      {
        "node": "social-media-avoidance",
        "count": 1
      },
      {
        "node": "hive-mindset",
        "count": 1
      },
      {
        "node": "orchestration",
        "count": 1
      },
      {
        "node": "extreme-behavior",
        "count": 1
      },
      {
        "node": "hardening",
        "count": 1
      },
      {
        "node": "fake-attack",
        "count": 1
      },
      {
        "node": "tribalism",
        "count": 1
      },
      {
        "node": "fundamental-evolution",
        "count": 1
      },
      {
        "node": "twitter-launch",
        "count": 1
      },
      {
        "node": "facebook-launch",
        "count": 1
      },
      {
        "node": "human-interaction",
        "count": 1
      },
      {
        "node": "threads",
        "count": 1
      },
      {
        "node": "social-network",
        "count": 1
      },
      {
        "node": "david-goggins",
        "count": 1
      },
      {
        "node": "vo-videos",
        "count": 1
      },
      {
        "node": "bigfoot-yeti",
        "count": 1
      },
      {
        "node": "asmr",
        "count": 1
      },
      {
        "node": "twitter-ai-videos",
        "count": 1
      },
      {
        "node": "tyrron",
        "count": 1
      },
      {
        "node": "nuclear-bomb",
        "count": 1
      },
      {
        "node": "media-consumption",
        "count": 1
      },
      {
        "node": "nuclear-posting",
        "count": 1
      },
      {
        "node": "extrapolation",
        "count": 1
      },
      {
        "node": "curation",
        "count": 1
      },
      {
        "node": "ai-training",
        "count": 1
      },
      {
        "node": "algorithmic-feed",
        "count": 1
      },
      {
        "node": "using-prompts",
        "count": 1
      },
      {
        "node": "group-chats",
        "count": 1
      },
      {
        "node": "twitter-debate",
        "count": 1
      },
      {
        "node": "group-preferences",
        "count": 1
      },
      {
        "node": "media-interface",
        "count": 1
      },
      {
        "node": "public-debate",
        "count": 1
      },
      {
        "node": "media-lies",
        "count": 1
      },
      {
        "node": "investigative-journalism",
        "count": 1
      },
      {
        "node": "greenwald",
        "count": 1
      },
      {
        "node": "matt-taibbi",
        "count": 1
      },
      {
        "node": "clickbait",
        "count": 1
      },
      {
        "node": "zach",
        "count": 1
      },
      {
        "node": "authenticity",
        "count": 1
      },
      {
        "node": "watergate",
        "count": 1
      },
      {
        "node": "bob-woodward",
        "count": 1
      },
      {
        "node": "ai-entrepreneurs",
        "count": 1
      },
      {
        "node": "spam-bots-fraud",
        "count": 1
      },
      {
        "node": "autonomous-weapons",
        "count": 1
      },
      {
        "node": "negative-ai-angle",
        "count": 1
      },
      {
        "node": "going-viral",
        "count": 1
      },
      {
        "node": "human-nature-implications",
        "count": 1
      },
      {
        "node": "amjad-masad",
        "count": 1
      },
      {
        "node": "skincare-company",
        "count": 1
      },
      {
        "node": "manual-inventory",
        "count": 1
      },
      {
        "node": "erp-modifications",
        "count": 1
      },
      {
        "node": "netsuite",
        "count": 1
      },
      {
        "node": "productivity",
        "count": 1
      },
      {
        "node": "selling-software",
        "count": 1
      },
      {
        "node": "subscription-revenue",
        "count": 1
      },
      {
        "node": "stanford-study",
        "count": 1
      },
      {
        "node": "using-ai",
        "count": 1
      },
      {
        "node": "creative-driver",
        "count": 1
      },
      {
        "node": "workforce-hunger",
        "count": 1
      },
      {
        "node": "drone-like",
        "count": 1
      },
      {
        "node": "leisure-creativity",
        "count": 1
      },
      {
        "node": "biased-sample-group",
        "count": 1
      },
      {
        "node": "automation-and-ai",
        "count": 1
      },
      {
        "node": "abruptness-of-change",
        "count": 1
      },
      {
        "node": "jobs",
        "count": 1
      },
      {
        "node": "filing-paperwork",
        "count": 1
      },
      {
        "node": "putting-things-on-shelves",
        "count": 1
      },
      {
        "node": "educating-adults",
        "count": 1
      },
      {
        "node": "inspiring-people",
        "count": 1
      },
      {
        "node": "reskilling",
        "count": 1
      },
      {
        "node": "learn-code",
        "count": 1
      },
      {
        "node": "miners",
        "count": 1
      },
      {
        "node": "creative-tools",
        "count": 1
      },
      {
        "node": "government-efficiency",
        "count": 1
      },
      {
        "node": "routine-tasks",
        "count": 1
      },
      {
        "node": "president-trump",
        "count": 1
      },
      {
        "node": "gulf-region",
        "count": 1
      },
      {
        "node": "americans",
        "count": 1
      },
      {
        "node": "globalism",
        "count": 1
      },
      {
        "node": "opioid-epidemic",
        "count": 1
      },
      {
        "node": "robotics",
        "count": 1
      },
      {
        "node": "manufacturing-wave",
        "count": 1
      },
      {
        "node": "humanoid-robots",
        "count": 1
      },
      {
        "node": "disenfranchisement",
        "count": 1
      },
      {
        "node": "psychological-change",
        "count": 1
      },
      {
        "node": "desperation",
        "count": 1
      },
      {
        "node": "drugs",
        "count": 1
      },
      {
        "node": "psychologically-equipped",
        "count": 1
      },
      {
        "node": "employee-of-the-month",
        "count": 1
      },
      {
        "node": "white-collar-jobs",
        "count": 1
      },
      {
        "node": "self-driving-cars",
        "count": 1
      },
      {
        "node": "desk-jobs",
        "count": 1
      },
      {
        "node": "data-centers",
        "count": 1
      },
      {
        "node": "stateless",
        "count": 1
      },
      {
        "node": "devices",
        "count": 1
      },
      {
        "node": "user-behavior",
        "count": 1
      },
      {
        "node": "workers",
        "count": 1
      },
      {
        "node": "tim-cook",
        "count": 1
      },
      {
        "node": "iphone-17",
        "count": 1
      },
      {
        "node": "technocratic-systems",
        "count": 1
      },
      {
        "node": "singapore",
        "count": 1
      },
      {
        "node": "leadership",
        "count": 1
      },
      {
        "node": "plastic-crap",
        "count": 1
      },
      {
        "node": "leapfrog",
        "count": 1
      },
      {
        "node": "decisions",
        "count": 1
      },
      {
        "node": "challenges",
        "count": 1
      },
      {
        "node": "both-worlds",
        "count": 1
      },
      {
        "node": "managerial-idea",
        "count": 1
      },
      {
        "node": "zuck",
        "count": 1
      },
      {
        "node": "super-voting-shares",
        "count": 1
      },
      {
        "node": "activist-investors",
        "count": 1
      },
      {
        "node": "small-state-gdp",
        "count": 1
      },
      {
        "node": "impeachment",
        "count": 1
      },
      {
        "node": "antitrust",
        "count": 1
      },
      {
        "node": "can-t-be-fired",
        "count": 1
      },
      {
        "node": "mark-zuckerberg",
        "count": 1
      },
      {
        "node": "ar-plus-ai",
        "count": 1
      },
      {
        "node": "meta-ray-ban-glasses",
        "count": 1
      },
      {
        "node": "scale-ai",
        "count": 1
      },
      {
        "node": "labeled-labor",
        "count": 1
      },
      {
        "node": "acquisitions",
        "count": 1
      },
      {
        "node": "meta",
        "count": 1
      },
      {
        "node": "nom-shazir",
        "count": 1
      },
      {
        "node": "talent-acquisition",
        "count": 1
      },
      {
        "node": "acquisition-strategy",
        "count": 1
      },
      {
        "node": "investor-buyout",
        "count": 1
      },
      {
        "node": "sam-altman",
        "count": 1
      },
      {
        "node": "metriden",
        "count": 1
      },
      {
        "node": "sign-on-bonus",
        "count": 1
      },
      {
        "node": "poach",
        "count": 1
      },
      {
        "node": "super-intelligence",
        "count": 1
      },
      {
        "node": "alphago",
        "count": 1
      },
      {
        "node": "gpt-4",
        "count": 1
      },
      {
        "node": "objective-truth",
        "count": 1
      },
      {
        "node": "symbiosis",
        "count": 1
      },
      {
        "node": "jc-lider",
        "count": 1
      },
      {
        "node": "arpa",
        "count": 1
      },
      {
        "node": "bigfoot",
        "count": 1
      },
      {
        "node": "tiktok-feed",
        "count": 1
      },
      {
        "node": "trump",
        "count": 1
      },
      {
        "node": "putin",
        "count": 1
      },
      {
        "node": "credence-clearwater-revival",
        "count": 1
      },
      {
        "node": "la-riots",
        "count": 1
      },
      {
        "node": "world-leaders-gangsters",
        "count": 1
      },
      {
        "node": "video-editors",
        "count": 1
      },
      {
        "node": "computer-generated-imagery",
        "count": 1
      },
      {
        "node": "cheap-meme-production",
        "count": 1
      },
      {
        "node": "squat-analyzer",
        "count": 1
      },
      {
        "node": "recording",
        "count": 1
      },
      {
        "node": "video-analysis",
        "count": 1
      },
      {
        "node": "chin-ups",
        "count": 1
      },
      {
        "node": "gym",
        "count": 1
      },
      {
        "node": "suggestions",
        "count": 1
      },
      {
        "node": "health-analysis",
        "count": 1
      },
      {
        "node": "video-angle",
        "count": 1
      },
      {
        "node": "personal-apps",
        "count": 1
      },
      {
        "node": "no-trainer",
        "count": 1
      },
      {
        "node": "phone-correction",
        "count": 1
      },
      {
        "node": "workout-app",
        "count": 1
      },
      {
        "node": "whoop-data",
        "count": 1
      },
      {
        "node": "trainers",
        "count": 1
      },
      {
        "node": "keep-playful",
        "count": 1
      },
      {
        "node": "jiu-jitsu-technique",
        "count": 1
      },
      {
        "node": "mikey-musumeci",
        "count": 1
      },
      {
        "node": "gordon-ryan",
        "count": 1
      },
      {
        "node": "craig-jones",
        "count": 1
      },
      {
        "node": "jiu-jitsu-discipline",
        "count": 1
      },
      {
        "node": "jiu-jitsu-positions",
        "count": 1
      },
      {
        "node": "jiu-jitsu-intelligence",
        "count": 1
      },
      {
        "node": "strength-technique",
        "count": 1
      },
      {
        "node": "muscle-memory",
        "count": 1
      },
      {
        "node": "josh-waitzkin",
        "count": 1
      },
      {
        "node": "dar",
        "count": 1
      },
      {
        "node": "sports",
        "count": 1
      },
      {
        "node": "obesity",
        "count": 1
      },
      {
        "node": "spreadsheets",
        "count": 1
      },
      {
        "node": "swimmer",
        "count": 1
      },
      {
        "node": "managing-emotions",
        "count": 1
      },
      {
        "node": "athlete-intelligence",
        "count": 1
      },
      {
        "node": "desk-job-bias",
        "count": 1
      },
      {
        "node": "temporary-discomfort",
        "count": 1
      },
      {
        "node": "laptop-class",
        "count": 1
      },
      {
        "node": "inner-struggle",
        "count": 1
      },
      {
        "node": "emotional-intelligence",
        "count": 1
      },
      {
        "node": "ai-intelligence",
        "count": 1
      },
      {
        "node": "cbt",
        "count": 1
      },
      {
        "node": "cbti",
        "count": 1
      },
      {
        "node": "intellectual-pursuits",
        "count": 1
      },
      {
        "node": "sleep-issues",
        "count": 1
      },
      {
        "node": "comedy",
        "count": 1
      },
      {
        "node": "essay-form",
        "count": 1
      },
      {
        "node": "psychopaths",
        "count": 1
      },
      {
        "node": "being-a-pawn",
        "count": 1
      },
      {
        "node": "insane-game",
        "count": 1
      },
      {
        "node": "frustration",
        "count": 1
      },
      {
        "node": "rpg",
        "count": 1
      },
      {
        "node": "speedrunning",
        "count": 1
      },
      {
        "node": "myth-building",
        "count": 1
      },
      {
        "node": "hades",
        "count": 1
      },
      {
        "node": "hades-2",
        "count": 1
      },
      {
        "node": "escapism",
        "count": 1
      },
      {
        "node": "archery",
        "count": 1
      },
      {
        "node": "divergent-disciplines",
        "count": 1
      },
      {
        "node": "reasoning-in-math",
        "count": 1
      },
      {
        "node": "powerlifting",
        "count": 1
      },
      {
        "node": "mark-rippetoe",
        "count": 1
      },
      {
        "node": "bodybuilding",
        "count": 1
      },
      {
        "node": "gallon-of-milk",
        "count": 1
      },
      {
        "node": "nutritional-strategy",
        "count": 1
      },
      {
        "node": "underweight-males",
        "count": 1
      },
      {
        "node": "hypertrophy",
        "count": 1
      },
      {
        "node": "fat-accumulation",
        "count": 1
      },
      {
        "node": "barbell-training",
        "count": 1
      },
      {
        "node": "linear-progression",
        "count": 1
      },
      {
        "node": "exercise-variables",
        "count": 1
      },
      {
        "node": "load-stressor",
        "count": 1
      },
      {
        "node": "joe-rogan",
        "count": 1
      },
      {
        "node": "rippetoe",
        "count": 1
      },
      {
        "node": "texan-accent",
        "count": 1
      },
      {
        "node": "abuses-audience",
        "count": 1
      },
      {
        "node": "hairy-chest",
        "count": 1
      },
      {
        "node": "bodybuilder",
        "count": 1
      },
      {
        "node": "powerlifter",
        "count": 1
      },
      {
        "node": "full-squat",
        "count": 1
      },
      {
        "node": "deadlifting",
        "count": 1
      },
      {
        "node": "muscular-growth",
        "count": 1
      },
      {
        "node": "upper-body-component",
        "count": 1
      },
      {
        "node": "the-gym",
        "count": 1
      },
      {
        "node": "adaptation",
        "count": 1
      },
      {
        "node": "louis-simmons",
        "count": 1
      },
      {
        "node": "westside-barbell",
        "count": 1
      },
      {
        "node": "reverse-hyper",
        "count": 1
      },
      {
        "node": "netflix-documentary",
        "count": 1
      },
      {
        "node": "spine-decompression",
        "count": 1
      },
      {
        "node": "spine-surgery",
        "count": 1
      },
      {
        "node": "dissecttomy",
        "count": 1
      },
      {
        "node": "anti-depressants",
        "count": 1
      },
      {
        "node": "mind-body-prescription",
        "count": 1
      },
      {
        "node": "howard-stern",
        "count": 1
      },
      {
        "node": "psychossematic",
        "count": 1
      },
      {
        "node": "salience-network",
        "count": 1
      },
      {
        "node": "rsi",
        "count": 1
      },
      {
        "node": "abigail-shrier",
        "count": 1
      },
      {
        "node": "cognitive-therapy",
        "count": 1
      },
      {
        "node": "lumbar-imperfections",
        "count": 1
      },
      {
        "node": "tadaki",
        "count": 1
      },
      {
        "node": "chronic-illnesses",
        "count": 1
      },
      {
        "node": "ai-humans",
        "count": 1
      },
      {
        "node": "manifesting",
        "count": 1
      },
      {
        "node": "ulcers",
        "count": 1
      },
      {
        "node": "da-vinci-s-brain",
        "count": 1
      },
      {
        "node": "sleep-cycle",
        "count": 1
      },
      {
        "node": "university-experience",
        "count": 1
      },
      {
        "node": "adhd",
        "count": 1
      },
      {
        "node": "phone-programming",
        "count": 1
      },
      {
        "node": "dyslexia",
        "count": 1
      },
      {
        "node": "seinfeld-episode",
        "count": 1
      },
      {
        "node": "poly-physics-sleeping",
        "count": 1
      },
      {
        "node": "neighbor",
        "count": 1
      },
      {
        "node": "lab-rat",
        "count": 1
      },
      {
        "node": "database",
        "count": 1
      },
      {
        "node": "attendance-ban",
        "count": 1
      },
      {
        "node": "normalization",
        "count": 1
      },
      {
        "node": "bad-coding",
        "count": 1
      },
      {
        "node": "anomaly",
        "count": 1
      },
      {
        "node": "banned",
        "count": 1
      },
      {
        "node": "university",
        "count": 1
      },
      {
        "node": "universities",
        "count": 1
      },
      {
        "node": "brainstorming",
        "count": 1
      },
      {
        "node": "enlightened",
        "count": 1
      },
      {
        "node": "malice",
        "count": 1
      },
      {
        "node": "talented",
        "count": 1
      },
      {
        "node": "vulnerability-software",
        "count": 1
      },
      {
        "node": "password-decryption",
        "count": 1
      },
      {
        "node": "system-hardening",
        "count": 1
      },
      {
        "node": "power-struggle",
        "count": 1
      },
      {
        "node": "blackballing",
        "count": 1
      }
    ],
    "topicGroups": {
      "groups": [
        {
          "topics": [
            "technology",
            "ai-automation",
            "openai",
            "google-gemini",
            "anthropic",
            "ai-coding",
            "ai-agent",
            "ai-videos",
            "ms-dos",
            "microsoft",
            "google",
            "replit",
            "app",
            "programming",
            "hacking",
            "university-hack",
            "drone-pilots"
          ],
          "category": {
            "name": "Technology & AI",
            "description": "Technology and AI"
          }
        },
        {
          "topics": [
            "social-media",
            "twitter",
            "facebook",
            "instagram",
            "tik-tok",
            "tiktok",
            "social-media-evolution",
            "scrolling",
            "mindless-watching",
            "zombifying-thing"
          ],
          "category": {
            "name": "Social Media & Internet",
            "description": "Social Media and Internet Culture"
          }
        },
        {
          "topics": [
            "entrepreneurship",
            "ceo",
            "company-valuation",
            "managerialism",
            "managerial-society",
            "managers",
            "accountability",
            "corruption"
          ],
          "category": {
            "name": "Business & Entrepreneurship",
            "description": "Business and Entrepreneurship"
          }
        },
        {
          "topics": [
            "syria",
            "gaza",
            "palestine",
            "saudi-arabia",
            "iran",
            "mainstream-media",
            "censorship",
            "fascism",
            "communism"
          ],
          "category": {
            "name": "Geopolitics & Current Events",
            "description": "Geopolitics and Current Events"
          }
        },
        {
          "topics": [
            "video-games",
            "controllers",
            "counterstrike",
            "quake",
            "counter-strike-tournament",
            "pro-player",
            "pro-playing",
            "gamers",
            "nintendo-switch",
            "gaming-impact"
          ],
          "category": {
            "name": "Gaming & Esports",
            "description": "Gaming and Esports"
          }
        },
        {
          "topics": [
            "squats",
            "jiu-jitsu",
            "psychedelics",
            "psychedelic-experience",
            "vaccine-injury",
            "vaccination",
            "vaccine",
            "john-sarno",
            "morphic-resonance",
            "polyphasic-sleep",
            "technique",
            "fitness-influencers",
            "creativity"
          ],
          "category": {
            "name": "Health, Fitness & Mind",
            "description": "Health, Fitness, and Mind"
          }
        },
        {
          "topics": [
            "elon",
            "twitter-purchase",
            "rockets",
            "doge"
          ],
          "category": {
            "name": "Elon Musk & SpaceX",
            "description": "Elon Musk and SpaceX"
          }
        },
        {
          "topics": [
            "the-joe-rogan-experience",
            "joe-rogan-podcast",
            "sci-fi-movies",
            "sci-fi",
            "mainstream-media"
          ],
          "category": {
            "name": "Media & Entertainment",
            "description": "Media and Entertainment"
          }
        },
        {
          "topics": [
            "manufacturing-jobs",
            "unemployment",
            "universal-basic-income",
            "tedious-job",
            "dystopian",
            "technology-impact"
          ],
          "category": {
            "name": "Societal Issues & Economics",
            "description": "Societal Issues and Economics"
          }
        },
        {
          "topics": [
            "surgeons",
            "surgery",
            "controllers-in-surgery",
            "da-vinci",
            "error-decrease",
            "task-completion"
          ],
          "category": {
            "name": "Surgery & Medical",
            "description": "Surgery and Medical Applications"
          }
        },
        {
          "topics": [
            "jason",
            "carl-hart",
            "hifa",
            "ai-impact",
            "grade-change",
            "graduation",
            "commitment",
            "strategy-thinking",
            "reaction-time",
            "video-game-pill",
            "streaming-situation"
          ],
          "category": {
            "name": "Individuals & Concepts",
            "description": "Specific Individuals and Concepts"
          }
        },
        {
          "topics": [
            "silicon-valley",
            "entrepreneurship"
          ],
          "category": {
            "name": "Silicon Valley & Startups",
            "description": "Silicon Valley and Startups"
          }
        }
      ]
    },
    "shortSummary": "Joe Rogan interviews Amjad Masad, the founder and CEO of Replit, discussing video games, AI, societal trends, and personal experiences.",
    "lastStoryCheck": "2025-07-14T17:00:47.997Z",
    "storyCheckResults": {
      "missingChunks": [],
      "missingStories": [],
      "totalCategories": 13,
      "totalChunksChecked": 127
    }
  }
}