{
  "id": "ljqm4jVfcG4",
  "title": "Joe Rogan Experience #2343 - Joe Pistone",
  "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
  "publishedAt": "2025-07-01T17:01:09.000Z",
  "cleanText": "Joe Rogan podcast. Check it out.\nThe Joe Rogan Experience.\nTrain by day. Joe Rogan podcast by night. All day show. Nice to meet you.\nMy pleasure.\nYou always wear sunglasses. Is that to hide your identity still? Force a habit?\nActually, it's, I have to see number one. But where I reside now, uh, my neighbors have no idea that they're living next to Donnie Brasco. So,\nWell, you have a very distinct voice.\nYeah, I know.\nI don't want to ask where you live, but you know, what a wild life you've had, sir.\nWell, pretty much. Yeah. Yeah. Uh, never expected to go like that, but it uh, it took off. So when you first started working, it was with the FBI, correct?\nWell, I was with Naval Intelligence uh for three years and then uh I always wanted to be in law enforcement.\nUh, and I was working in Philadelphia actually and uh you do a lot of work with the FBI because you know on the uh government installations, government uh bases. So, I became friendly with some FBI agents and uh I figured if I, you know, when I get up when I finish this uh tour with NIS, um, I'm going to go into law enforcement, so I might as well try to for the best and the best of, you know, the FBI.\nAnd so, how does that lead to you infiltrating the mafia?\nWell, you know, I didn't I didn't infiltrate the mafia right from the get-go. You know, it uh look, I grew up in uh in Patterson, New Jersey. I grew up in an all Italian neighborhood. Uh knew wise guys, went to high school with sons of wise guys. And when you're in a neighborhood, you know, you know, you know who the wise guys are. You hang out at the, you're they let you hang out at the social clubs because you know you're a neighborhood kid. They know it. So, I knew the streets. Um, so when I went into the FBI, I was, you know, I was street smart basically, Joe. That's what it comes down to, you know. Uh and uh my first assignments were bank robberies, fugitives, gambling cases, and uh I started uh doing some uh little undercover work uh on gambling cases cuz back then the FBI was big into into gambling uh interstate gambling cases.\nSo what was your first undercover work?\nFirst was uh infiltrating a um a gambling house in uh Jacksonville, Florida. Actually, that's what was my first office.\nWhat kind of gambling were they doing?\nUh craps. Uh I had a regular casino going and uh you know, I felt comfortable around that stuff because I grew up with that stuff. You know, I grew up uh uh like I say, in the neighborhood, crap games, card games. It wasn't, wasn't anything new to me. And being around gangsters was not like uh intimidating because I was around gangsters growing up. So, uh I didn't have any problem, you know, getting into these games uh and identifying the major players uh and who was running them. And that's basically what it was.\nSo, when you do this, did you have to testify in court with these guys?\nYeah. Later on after the case goes down, but most of these guys plead guilty. So you never go to trial.\nOh, because uh you know it, it wasn't where they were facing you know 15, 20 years. You know they might get a year or two years and then you know uh get some time knocked off their sentences. So most of it uh they plead and so you never have to appear in a court. So, but was there an issue with you being discovered and then getting found out and worrying about your safety afterwards?\nWell, not too much with these cases. No, not too much with those cases. And then I worked a lot of stolen art, buying, you know, uh, buying stolen art, buying stocks and bonds, swag, stuff like that.\nSo, for how many years did you do stuff like that before you started being undercover in the mob?\nUh let's see, probably uh four or five years. Yeah. Yeah.\nSo you slowly sort of got acclimated with being undercover. You do a bunch of cases and then how do they approach you?\nWell, what happened was is that uh I'm working out in New York, the New York office of the FBI, and there's a there's a big case in uh in Tampa, Florida. They have a case going on uh guys that were uh stealing uh automobiles, high-priced automobiles. In other words, uh you go to them and you say, \"Hey, I want a Cadillac.\"\nOkay. What color you want? All right. What model you want? And then they they'd go out and hook it. So they had uh they grabbed one of the guys uh and they they flipped him and uh they grabbed his son and uh they said, \"Hey, look, you know, you help us and we'll we'll cut your son a break.\"\nHe said, \"Okay.\"\nSo he said, \"Look, uh we want to put an undercover agent in with this crew. They operated all up and down the east coast from Baltimore all the way down to Florida. And uh the guy that uh was running it was a what we call a half-ass wise guy out of out of Baltimore.\nSo he says, \"All right.\" So he introduces me to this guy and uh as a car thief, but before uh he introduced me, I said, \"Look, I got to know how to steal cars.\"\nSo he gave me uh about a week's lesson on how to steal cars, how to hook cars, hot wire. This is like what year was this?\nThis was in 19, let's see, 1970, maybe 73, 74.\nSo you essentially just pop in the ignition.\nPop in the ignition. Um, crossing wires.\nCrossing wires. Uh and some cars had alarm systems. Taught me how to get under the car, uh, disarm the alarm system, how to use a slim jim to get in the door, and then how to uh uh how to pop the ignition. Uh, and once I learned, you know, I figured I can do that. Then he introduced me and I got in with this crew. There was a crew of about, he was running like five or six guys.\nAnd uh, I did that for a year and a half. Stole cars. Um, stole uh tractor trailers. I knew how to drive, I knew how to drive uh uh tractor trailers cuz I did that in college during the summertime. I drove a tractor trailer uh during the summer.\nSo you take the cars, load them on a tractor trailer.\nNo, we just stole the cars and I bring them to you.\nOh, okay.\nBut I mean we stole uh rigs, too.\nOh, I see.\nBecause we were dealing with companies, too.\nGot it. You know, these guys that own some trucking companies, they\nBut you, so you have to trust this guy though to get you inside, right? You have to trust this guy to not [ __ ] this up and say, \"Hey, this is a car thief.\"\nExactly.\nThat's got to be hair-raising.\nWell, it is because, you know, the guy's an informant and and he's already in trouble.\nHe's in trouble. Uh but he was in, he, his basic reason for for getting me in was he wanted to get his son out of trouble.\nSo, you know, we, we had him by the short hairs there that uh hey, you know, if this goes good, your son is free. We're going to, we're going to, we're going to cut your son free. So, that's what happened. So, I did that for a year and a half and um, um, I get back to New York, we, we, they make the arrest. Uh I went to trial in that case, but that case was in uh in Florida. Uh, and uh, a funny story on that case is uh, if you want to hear it, we, we had uh, I hooked one, hooked a Mercedes and delivered to this guy and uh, go to his house and he wasn't home but his wife was there. So I said, \"Hey, you know, I'm delivering this car for your husband.\" And she says, \"Oh, okay.\nUh, you give her the keys and cuz he had already paid and so me and the other guy we leave. Fast forwarding out to court, I'm going, I'm sitting in the uh outside the court getting ready to testify and there's this lady.\nUh, she looked familiar. It was two, two ladies and uh, so uh, she walks up to me. She says, \"Uh, aren't you Donnie?\" I said, \"Yeah.\"\nShe said, \"Uh, you delivered a car to my house, right?\" I said, \"Yeah.\" He said, \"We know my husband's on trial now.\" I said, \"Yeah, I know. I'm going in to testify.\"\nShe says, \"After he goes to jail, you want to go to dinner, dirty lady.\" I said, \"No thanks.\nShe might poison you.\"\nYeah. So, I get back to New York and uh, uh, I had a real great supervisor up there.\nWas she hot?\nI can't remember.\nJoe was so long ago.\nI would have remembered that part.\nIf she was, I would have remembered.\nYeah, you probably would have remembered.\nSo, uh, I get back to New York and I had a real good supervisor named Guy Bara.\nWas an Italian guy from uh from the Bronx, good street agent. Um, and uh he was a supervisor of the truck hijacking squad. And back in the day, they were hijacking and all these hijackings were orchestrated by the mafia. And uh they were probably doing, you know, eight to 10 hijackings a day, which was big-time money because they were pharmaceuticals, uh high value, uh food items like lobsters, coffee, you know, you're talking about the 40-foot trailer, so you're talking a lot of money. But they were all run by the mafia.\nSo he uh I get back to New York. I get to New York and uh he says, \"Hey, I'm thinking about doing this undercover operation uh seeing if you know we can get something going with these uh these truck hijackings.\"\nSo the idea was, you know, nobody had ever infiltrated the mafia before. You know, actually the mafia had had some informants in with them, but nobody had actually gotten in.\nSo, the idea was, let's, let's try to hit the fences.\nFences are the, you know, the guys that sell the goods, sell the swag and sell the goods.\nSo, you know, you need to have a profession. I mean, nobody's going to do anything with you without a profession. And it has to be one that's attractive to them. And plus in the government, you're, if you're going to go undercover, your profession can't be one of violence. So who's not violent? Jewel thief.\nSo I figure, okay, I'll go in as a jewel thief. Well, if you're going to go in as a jewel thief, what do you have to know?\nYou got to know diamonds and precious gems, right?\nAll right. So, I went to, I went to school. I went to diamond school.\nDiamond and precious gem school.\nOh, so you have to be able to identify, use a lens.\nWell, that's how you're going to get, that's how you're going to get caught. Right. Right. Right.\nIs if you get into conversation, you don't know what the hell you're talking about.\nRight. Right. How long is the school for?\nI went, I think for a couple months until I got, you know, where I was comfortable. Now, take it another step further. If you're a jewel thief, what else you have to know? You got to know how to get in places, right?\nSo, pick locks.\nI had to learn how to pick locks, right?\nWhat else you got to know?\nCrack safes.\nYou got to know about safes.\nYeah.\nYou got to know about alarm systems.\nSo, I had my guys, when I say my guys, our guys, you know, our tech guys school me on lock picking, different types of safes and alarm systems. So all that took a few months before I felt comfortable, you know, and then uh I went out and on this operation, we didn't do anything with contacts.\nEverything I did, I did under Donnie Brasco. I was, I rented an apartment.\nI bought a car, uh, utilities, you know, phones, everything.\nEverything as a, as a citizen in quotes, Donnie Brasco, they get you a social security number and the whole deal, social security, everything. But, you know, I don't want to get into how they do that, but you know, nothing could be at that time. They, they couldn't, they, they couldn't uh uncover anything.\nSo once I got my apartment, I bought a car, I had all that set up. Uh, and again, you have to know the mafia. You have to know New York City. Uh, you don't just walk into a place, you know, and say, \"Hey, you know, I'm a jewel thief, right?\nDoesn't work that way.\nYou got to, you got to get seen. You got to be around.\" Uh, so I moved out of my residence. Uh, of course my family wasn't, wasn't in uh in New York anyway, but I had to move into my apartment.\nUh, and we had certain bars and restaurants that we knew these fences and wise guys hung out in. And the idea was just go in, get my face seen, and hopefully get into conversation with somebody.\nUh, how do you go and get your facing?\nYou just show up by yourself?\nJust show up.\nIs that suspicious though? A guy shows up by himself, not from the neighborhood?\nNo. Well, that's the thing. And see, because I couldn't say, \"Hey, I'm from Brooklyn. I'm from Manhattan. I'm from the Bronx.\" Because these guys have the contacts everywhere, right?\nSo, it was up to me if I got into conversation with anybody.\nMy story was and then again you have to, you have to, you have to know your\n\n\nOkay. And the enemy was the mafia. So you have to know about the mafia. You have to know if you do get into conversation with these guys and they're they're trying to check you out. What's your backstory? Where you from?\n\nMy background was I was an orphan.\n\nOkay. And I moved between Florida and California.\n\nWhy an orphan? Because then I wouldn't have to produce a mother and a father. Cuz again, if I was lucky enough to get in, they'd say, \"Well, where are your parents at?\" Right? Uh I couldn't have any siblings that I knew of, right? I couldn't have been married, so I couldn't have an ex-wife or anything because I would have had to produce somebody, right? So, my backstory was I was an orphan.\n\nTo back it up, we found an orphanage that had burnt down and all the records were destroyed. So, they couldn't they couldn't check that. I mean, these are all things that that if you're going to send somebody into an undercover operation that is uh deep cover and remember I had no informant bringing me in. This was a this had to be a cold entree.\n\nSo, I hung around maybe five, six months. That's all I did. And that's another thing, too. It's a seven day a week job cuz if they see you Monday to Friday and then they don't see you Saturday and Sunday, where the hell are you Saturday and Sunday, right? So, it's seven days a week. It was seven days a week.\n\nDid you have a family at the time?\n\nI did. Yeah. But they they lived they lived across country at the time.\n\nThat had to be crazy difficult for them.\n\nVery difficult. It was. It was. Yeah. Uh so uh so you just kind of just hang around restaurants, bars.\n\nYeah. And my only conversation with anybody was is uh what I'll have to drink and what I'll have to eat. That's And I'm not a drinker. I never was a drinker. So uh and you know for young undercovers, you don't have to be a drinker and you don't have to do [ __ ] that you know that you think gangsters do. Uh my my extent of drinking was and it still is is a half a bottle of beer and maybe a glass of red wine. That's it. And I never I never uh went outside those boundaries because that's that that's me. I didn't do it right.\n\nSo, I used to go to this one place and uh actually this place wasn't too far from my uh my apartment up in uh Yorkville and uh wise guys wouldn't come in there, I don't remember if it was Wednesdays or Thursdays, I I don't remember, with their girlfriends for dinner.\n\nAnd uh I always would sit at the bar, you know, never talked to the bartender other than what do you want? What do you want to eat? What do you want to drink? Uh so one night I go in there and and uh the wise guys are there. Uh one of the girlfriends, but there's one guy missing. But the the girl that he was always with was there. So I'm at the bar and uh I guess she gets up, she goes to the lady's room, she comes by and she says hello. And I just said hello.\n\nNow again, knowing your enemy, know how they operate. So the first thing I do is I call a bartender over. Right now I know his name, but I don't call him by his name because I was never introduced to him. So I just said, \"Sir, would you, you know, I said, \"I want to go on record.\" That's a mob term. \"I want to go on record.\" I didn't ask that young lady to stop and say hello. And he just nods and that's it. Well, fast forward, this happens like three or four different times. And uh they're in there, she's in there, he's not there. About the fourth time, the same thing. You know, she would come over and and I would call him over. So, finally he says, \"Hey.\" He said, \"Uh, if you want to talk to her, go ahead.\" Her boyfriend went bye-bye.\n\nHe didn't go to Disneyland, Joe.\n\nRight.\n\nHe got whacked.\n\nThey whacked him. So, I said, \"No, I don't have any I don't have any uh any interest.\" So, now what does this guy know? He knows that I'm a street guy, right? So he um uh now he comes over to me and now we start talking. All right, talking about baseball, talking about how screwed up New York City is at the time. Uh and uh finally he says, \"Hey, my name is Charlie.\" I said, \"My name is Donnie.\" Now that's another thing. These guys don't introduce themselves like normal people, you know, like, \"Hey, my name is Joe Rogan.\" or hey my name is Donnie Brasco. It's nickname or first name. So that's another notch with him that this kid knows something.\n\nSo a couple uh couple of weeks maybe go by and then one night he says, \"Hey, you'd like to gamble?\" I said, \"Sure, why not?\" He said, \"When I bang up here, I'm going to go to I'm going to go to an all night uh game.\" He said, \"You want to come?\" I said, \"Yeah.\"\n\nSo he close up the joint with him and uh takes me to a a game and obviously it's run by the wise guys. You know, they got a whole casino set up and uh doesn't introduce me to anybody, but uh I'm okay because I'm with him. All right.\n\nSo now this is a couple more weeks maybe. So now I I figured now and he don't ask me what I do and I don't say anything about jewelry. So but now I figure now I got to try to set set the hook. So I come in one night and I got a packet of diamonds. All right. So, I put him on a bar and I say, \"Hey, Charlie, I need X amount of money for this envelope.\" I don't tell him what's in it. I just said, \"I need X amount of money.\" But I give him a street price where he can make him, you know, make money himself. So, he he uh he takes it, says, \"Okay.\" Puts it under the bar. Couple weeks go by. I don't ask him about it. He don't ask me, but you know, we're I'm still hanging around with him. He comes in one night, puts an envelope on the bar, and he said, \"Donnie, somebody left this for you.\" I said, \"Okay.\" I put it in my sport coat pocket. Get back to my apartment and there's the money in it, right? So now, what does he know? He knows I'm a I'm a thief because I'm giving him diamonds. I'm not asking them at uh prices for Tiffany prices. Right now, we get to the the the game and he intro, you know, he introduces me as Don the Jeweler.\n\nSo, he introduces me to this Colombo guy. Guy's name was Jilly. So, uh Jilly said, \"Hey, you know, Don, where you from?\" I said, \"Well, you know, I uh hung around in uh hung around Summit Florida, hung around, you know, California. Uh I said, you know, uh just just move around a lot.\" He said, \"Well, why don't you come out to my place? I'm out in Brooklyn.\" And I said, \"Yeah, okay.\" So I go out there and I go out to his club and he has a a store, you know, all swag and uh so he was at the Clumbos.\n\nSo I started hanging out there with the Clumbos and I got in with him and got in with his crew. Uh did some stuff with them, you know, because you got to do something otherwise, right? If you ain't producing, if you ain't producing, you ain't worth it, you like what kind of what's the first thing you have to do with them?\n\nWell, they had uh they did some hijacking and uh you know unloaded some trucks for them and different things. Uh so that went on with the with the Columbos and I was getting I was getting good information with these guys. Uh that went on for a couple months and uh finally I get to the club one day and uh there's two guys there that I didn't know. So he introduces introduces them to me as Frankie and Paty. He said, \"Donnie, you know Frankie Paty?\" Okay. Uh as it turns out, they just got out of the can. They were part of Jill's crew. Uh, one of the guys was a maid guy. Maid guy is a guy that's been officially inducted in into a particular mafia family. And these guys were with the Colombos. One uh I think Paty was a made guy and Frankie Frankie was an associate. All right. But they had just gotten out of the can. So they're looking to set up scores because, you know, they've been away for a few years.\n\nSo Jilly tells him, you know, hey, Donny's, you know, Donniey's a good thief and he knows he knows uh he knows alarms, he knows locks, he knows safes. So they had a couple uh uh scores lined up. So we go out case this place and I tell them, \"Hey, I I can't bypass that alarm.\" Because you know if you say you can do everything, nobody can do everything no matter how good you are. So I said no. I said I can't defeat that alarm. Okay.\n\nFew few few days later they got another one set up and uh it's a safe. We get in. I said you got to blow this safe. You know you you'll wake up the whole neighborhood, you know. Okay. So now this this pisses them off. So couple days later, I get to the club and Jill, he says, \"Donnie, let's let's take a walk and talk.\" I said, \"Okay.\" So we walk and we're talking. That's what a walk and talk is. You're walking on the street and you're talking because they don't think, you know, they don't think the FBI or anybody can hear you. I said, \"What's the matter, Jill?\" He said, \"Well, he said, \"You know, I told I told Frankie uh and and Fancy what, you know, what a great thief you are, and he and they're pissed off because, you know, Py's pissed off because you turned down uh you turned down the the two scores. I said, \"What do you want me to tell you, Jillian?\" I couldn't bypass the alarm. I'm honest with you, and I don't want to blow a safe that, you know, you got to blow blow blow.\n\nSo he said, \"Well, they want to have a sit down.\" I said, \"Okay.\" So we go back in the club and then they have a back room. So we go in the back room, sit down. They lock the door and uh Paty pulls pulls out pulls out a 38, lays it on the table and said, \"Donnie, if you don't convince me that uh you're as good a thief as Jill says you are, the only way you're going out of this room is rolled up in that rug.\"\n\nOh boy.\n\nOh boy. So, it's crazy what goes through your head. So, I look at the rug. I said to myself, I hope it's [ __ ] Persian. If I'm going to go out of here, I might as well go out in the $50,000 rug. So, we're in there and and uh\n\nWhere you from, Donnie? Now, you know, in these situations, you want to be on the offense. You don't want to be on the defense. But I can't really disrespect him because he's a made guy. And you know, if you know anything about the mob, you you can't disrespect the main guy in front of other people. So I said, \"Hey, look, you know, I'm an orphan. I'm not from here. I've traveled the country. You know, well, tell us some people that you stole with.\" I said, \"No disrespect, but I'm not giving you any names of people that I stole with.\" I said, \"Why would I do that? Why would I give up anybody that I that I did scores with? Right?\n\nSo, this goes on and on and on. After about 4 hours, finally Jill says, \"Hey, Donniey's been with us for for months now. We know what he can do. It's over. It's over.\" I said, \"Okay, now I got a problem.\" The problem is they just called me out. So in their world, I can't go shake their hand because it's why isn't Donnie pissed off, right? My only recourse here is is some kind of physical recourse. But I can't do I can't do anything to Paty because he's the main guy. I can't touch him. And that's that's one of the rules of the mafia. You don't lay your hands on a made guy. It'll get you killed. It'll get you killed. So, the only guy you can hit is Frankie. He's not a made guy. So, we get up, start to walk out, and I call [ __ ] Frankie.\n\nOh, Jesus. But that's the only thing that that's going to save me because otherwise it's why isn't Donnie pissed off, right? So now I'm\n\nWas Frankie questioning you too?\n\nYeah. Oh yeah. Yeah. But he's not a made guy, right? So he's fair game, boy. So I hit him. He goes down now. Passy's jumping on me and he\n\n\nHe's punching the hell out. But I can't. You can't hit him back. I can't hit him back. I can just protect myself. But I figured, well, you hit me once, I hit Frankie twice. So it went on. So then finally they broke it up. But now I know I can't stay around here. I can't stay with these guys because it, you know, you can't get into an altercation with made guys and yeah, and have it come out.\n\nSo after, after we're everything settled down, I'd say to Jilly, \"Jilly, let's take a walk and talk.\" So we do. We get outside. I said, \"Jilly, look, no disrespect to you, you know.\" I said, \"But I can't, I can't come around here anymore.\" I said, \"Because you know how it's going to end.\" He said, \"Yeah, Donnie, I realize that.\" He said, \"Uh, but you know, no real feelings between you and me.\" I said, \"Okay.\"\n\nSo, at the card game, I, I was introduced to a Bonanno guy by the name of Tony Mirror. I had never done anything with him, but I was introduced to him. So, I go back, uh, I go back with Charlie, you know, to the card games and, uh, I start siding up to, to this Mirror, who is a complete psycho case, a complete [ __ ] psycho case, which I find out later on. He's a big Broly guy. And, uh, um, he says, \"Uh, you know, why don't you come downtown?\" I said, \"Yeah, okay.\" So, he was from Little Italy, and, uh, that's where, uh, he hung out. He had a bus stop lunchonet down a little lately, but he was psycho. So I started hanging out with him at my first Bonanno guy that, that brings me around. Uh, so we're out one night and, uh, he was shaking down nightclubs and, uh, I was helping them. When I say help and I was with them, you know, shakedown owners and at, at nightclubs and stuff. So, uh, it's about 3:00 or 4:00 in the morning one morning and we go to a diner for breakfast and, uh, the eggs come out cold. So he starts berating the waitress and there's other, you know, we were with, we were with other wise guys and stuff. So I said, \"Tony,\" I said, \"you know, I said, she's only doing her job. I said, why, you, why you taking it out on her, you know, she's here 4:00 in the morning waitressing.\" So he tore the [ __ ] out of me. He tore into me in front of everybody, but I really can't go back at him. But I have to let them know that, you know, uh, I'm not, I'm not a pushover and, you, you know, so the next day, now this guy, I, as I, as I had gotten to know him, I, I had seen him in action and so the next day I, I told him, I said, \"Tony,\" and nobody else is around, so it's, it's my word on his. I said, \"Don't ever talk to me like that again in front of people.\" I said, \"Cuz I'll [ __ ] stab you.\" I said, \"You won't even know it's coming.\" I said, \"Don't ever embarrass me like that and call me those names in front of other people.\" And he was like, \"So, uh, but he introduced me to, kept introducing me to, uh, other Bonannos and then he introduced.\"\n\nSo, even after that? Yeah. After that, so after that, did you get his respect by saying stab him? I don't think people realize how disgusting the data collection industry really is. Experts say that data brokers already have an estimated 1,000 data points on every person with an online presence. That includes your name, credit history, medical history, who your friends and family are, and your current location. Imagine if it were just some guy in his mom's basement collecting all this info about you. It's [ __ ] gross and scary, right? But there's a way to stop these creepy data brokers from invading your privacy, and that's with a product called ExpressVPN. ExpressVPN is an app that hides your IP address and reroutes all your online activity through a secure encrypted tunnel, so any third-party trying to harvest your information can go kick rocks. ExpressVPN can also help you access content from all around the world. There are titles that streaming services like Netflix aren't showing you just because of where you live. With ExpressVPN, you can change your location up to 105 countries, unlocking thousands of extra titles. And right now, you can get four extra months free if you tap the banner or go to expressvpn.com/rogan. That's expressvpn.com/rogan. And if you're watching on YouTube, you can get your four free months by scanning the QR code on screen or by clicking the link in the description.\n\nYeah. Oh, yeah. Yeah. Yeah. Cuz he knew that, you know, he knew that I, I wasn't bullshitting him. I mean, you know, he just beat me down in front of other people. I mean, not, not physically, but, you know, just calling me, you know, and, uh, because I was standing up for this waitress, but that was, that was him. So he introduces me to a guy by the name of Lefty Rogerio, another made guy in the Bonannos from, uh, downtown Nicobacher Village. They all lived in Nicobacher Village and, uh, he introduces me to Lefty. So now Mirror had just gotten out of the can. Now they send him back, right? So he goes back to the can. He was a big, he was a, a big money maker for the Bonannos in dope. He was a big, uh, narcotics guy for the Bonannos. Uh, but he had violated his parole, so they sent him back. So I started hanging out with Rogerio. Uh, and, uh, what Meera never did and what Rogerio did is, uh, uh, his captain was a guy by the name of Mike Sabella. And, uh, once I got, once Rio got to know me a little better, he brings me to Mike Sabella, who's the captain of the crew. And, uh, he, he said to Mike, uh, \"I'm going on record that Donnie's with me,\" and that's what you do when you're a made guy. You have an associate. You go to your captain and you, and you go on the record. So now nobody else could, could [ __ ] with you. Nobody else could take you. Mirror never did that. Even though I, I spent a lot of time with Mirror, he never went to his captain and said, \"I'm going on record that Donnie's with me.\" So, I get to know, I get to know Rogerio pretty good. Uh, start doing stuff with, with.\n\nSo, all told, how much time are you undercover now? Now, this is probably, uh, uh, going over a year. Wow. Yeah. Over a year now. Yeah. Yeah. No, you were reporting to anybody during this time. Do you have to go back to the FBI? Never. Once I stepped out of the office, I never went back to the office. I had, I had. What you have is a contact agent, Joe. And that's somebody that you, if you have a problem, you call him and he helps you solve it. So you're totally on your own. You're on your own. I had no surveillance because, you know, you're in New York City, right? You're working seven days a week. You know, my day would go from maybe, uh, 11:00 in the morning to maybe 3:00, 4:00 o'clock the next morning, seven days a week. So, you know, your only lifeline is, is the phone to this, to your contact agent. Yeah. Wow. And, uh, so I'm doing a lot of stuff like that with, with, and I'm, I'm gaining all kind of intelligence though, you know, uh, identifying made guys, identifying guys in other families that are made.\n\nAre you writing this stuff down or you just keep it all in your head? No, in your head. And what I do is, I, I would regurgitate it over the telephone to my contact guy and he would reduce it, uh, to paper. Yeah. Because like, uh, you know, these guys would come to my apartment. I, I couldn't take the shot of, you know, and I, I didn't wear a wire with these guys, you know, very seldom did I have a wire on. Most of my recordings, uh, are on the telephone. Uh, I wore wire a couple times when I knew I was going to get a contract to, to kill people. Uh, and when I, I had the feeling, uh, that I was going to be told about hits and what I did was I had a mini, mini cassette recorder that I bought at, um, what's that? Radio Shack. Radio Shack. Oh, wow. You know, and I just put it in my, uh, I just put it in my, uh, sport pocket. You got to be real worried about getting caught with that. Yeah. But at least, you know, nobody's tapping, you know, because if once you get in with these guys, when you meet him for the day, they all hug each other and they kiss each other on both cheeks. You know, if they kiss you on the lips, then you're done. You know that that's the last [ __ ] day you're going to be there. Um, so yeah, so I didn't make, I, I didn't make many body recordings, uh, because you're always and, uh, that they're very touchy-feely guys, you know, right? I mean, when I was, I was with Mirror one time and, uh, uh, we stop, he said, \"Hey, pull over, Donnie.\" I pull over and he tears my, he tears my, uh, my car, the dashboard apart. Now if you saw the movie, that was, they had Lefty do that, but that was in the real life, that was Tony Mirror. I mean, you know, so I couldn't have my car wired, right? Um, does he suspecting you or suspect in somebody else when he's tearing your dash apart? Well, it's, it's, well, I'm new, you know. I'm, you know, nobody could go to anybody and say that they knew some, that, that they knew Donnie, right? You know, so that's how they, that's how they, um, uh, check you out, you know, cuz they had no other way of checking me out, really. Uh, so I, you know, hanging with Rogerio, doing stuff with him. Uh, and, uh, now we come to a point where I'm really in with, with the Bonannos. I mean, uh, they're, they're starting to talk, they would talk business with me there, you know, uh, and they felt comfortable with me because again, reverting back to my, my early years growing up, you know, hanging out in, in at the, at the social clubs in the neighborhood, you know, I knew that if you don't have any interest in, in a conversation, walk away from it. And that's what I did with these guys is, uh, if they started to talk about something, I would get up and walk away because it puts in their mind, you know, Downy's not really interested. You know what I'm saying? It's not, he doesn't want to get into our real business. Uh, so that made them trust me more. That made them trust. You knew the protocol. Yeah, I knew right. I knew the protocol. Exactly. So, um, now what happens, uh, uh, is that, um, the FBI, FBI had an operation going in Milwaukee, undercover operation against the Milwaukee family, right? It's a BRA family who's connected to Chicago. Now, this gives you, this will give you a little hint how the mob works. So, they're not really good, not really going anywhere. All right. They had a vending machine company set up. And, uh, the undercover was a undercover, uh, actually that I knew, which is because I had a, I have a, I had a rule. If I didn't know you, I don't care if you're an FBI agent or not. I'm not introducing you. I'm not vouching for you cuz I don't know if you're any [ __ ] good or not, right? You know, so they reach out to me and they say, \"Hey, uh, uh, we got an operation going in Milwaukee.\" Yeah. And, uh, this is what it is. We got a vending machine company. We got, we got trucks. We got, uh, uh, we got a warehouse. We got machines. But we're not getting anywhere. You know, the undercover. Who's the undercover? Tai Cobb. That was his. Yeah, that, that was the agent's real name. is, is, uh, I said, \"Ty's the undercover.\" They said, \"Yeah.\" I said, \"Okay, now you can, now I'll listen to you because I know Tai and I had did done undercover work in Chicago, uh, together.\" I said, \"Okay.\" So, I'm talking, you know, I said, \"Well, tell Ty to call me. I want to talk to Ty.\" So, he said, he, he tells me what, what's going on. He said, \"You know, I'm going to all these bars and restaurants and they won't take my machines because the mob, it's all the mob's machines.\" I said, \"All right.\" So, I said, \"Well, what's the plan?\" \"Well, maybe you can bring the Bonannos out here and we can get a sit down with the ballastaries.\" I said, \"Well, let me, let me see.\" So, I went with Jerio one day and, uh, I just, uh, I dropped a, \"Hey, left. You know, I got a call the other day from a guy that I, that I used to steal artwork with down in Baltimore and he's out in, uh, Milwaukee.\" He said, \"What the [ __ ] he doing in Milwaukee?\" I says, \"He's got a vending machine company and he wants me to come out and help him.\" He says, \"Is he crazy?\" He said, \"They'll blow him up out there.\" He says, \"He can't do a vending machine business out there. That's the mob.\" I said,\n\n\n&quot;Well, he doesn't know. He doesn't know anything about the mob.&quot;\nWe drop it.\nCouple days later,\nI says, &quot;I left this guy call me again. He needs help.&quot;\nHe said, &quot;Donnie, what do you what do you think?&quot; He said, &quot;You can't just go out there.&quot;\nAnd then he looks at me. He said, &quot;This guy got any money?&quot;\nI said, &quot;I don't know. Let me ask him.&quot;\nI said, &quot;I'll call him tonight and find out if he's got any money.&quot;\nSo, I called Tai.\nHe was going by the name of Tony.\nAnd I said, &quot;Uh, hey Tony.&quot;\nHe said, I said, &quot;Lefty wants to know if you got any money.&quot;\nHe said, &quot;All right.&quot; He said, &quot;Tell him I got 200,000 in the bank and you know, I got I got a warehouse full of machines. I got everything set up.&quot; I said, &quot;Okay.&quot;\nSo, I go back to Lefty. He's told me he's got 200,000 in the bank and he's got this big warehouse set up.\nHe says, &quot;All right.&quot; He said, &quot;Let me talk to Mike.&quot; Now, Mike Sabella is the captain, right?\nSo, Mike said, &quot;All right.&quot; He said, &quot;You and Lefty go out there. Just sit down with him and make sure that he has what he says he has. Don't tell anybody you're going.&quot; I said, &quot;Okay.&quot;\nSo,\nThe first thing is call Tony and tell him to send us airplane tickets because, you know, the wise guys are they're not spending their own money. So, the FBI, you know, Tony gets us two plane tickets. Me and Lefty fly out there and uh he takes us to the warehouse and he's, you know, they got a they got the whole operation going on.\nAnd uh\nLefty said, &quot;Okay.&quot; So, we go back and report back to Mike and he said, &quot;Okay.&quot; He says, &quot;Now, here's the story. Tony's been with the Bonanno for 10 years. He's been an associate of ours for 10 years because that's what he has to tell Chicago and Milwaukee.&quot; Because if they just say, &quot;Donnie just met this guy.&quot; They're going to say, &quot;Well, he's not with you. You didn't claim him. So, we'll take the whole business.&quot;\nRight?\nSo, here's the way it works. Now, we go to our consigliary, the consigliary, the Bonanno. All right. Guy by the name of Bobby Badart.\nYou know why they called him Bobby Badart?\nBecause he had a bad heart.\nA bad heart. Easy, right?\nSo, he goes and uh\nBobby Badart now has to call Chicago, right?\nAnd tell Chicago that, hey, we got a guy that's been with us for 10 years.\nHe's settled now in Milwaukee. He's been in Milwaukee for a couple years and he wants to go into the business and he has machines and everything and we'd like to have a sit down with Bellastr, the boss of Milwaukee. Okay.\nChicago now calls Bellastr's consigary and relates the whole story to him.\nSo now we got to wait and see if he wants to have the sitdown.\nA week or so goes by, Chicago calls back and said, &quot;Okay, he'll have a meet with you guys. Who's coming out?&quot; Well, be Lefty Rogerio and Donnie Brasco. Now, lefties are made guys. So, you know, uh, so they say, &quot;Okay, come on out. Check into this hotel and wait for a phone call.&quot;\nAll right. So, me and Lefty fly out, check into this hotel and uh we wait about three or four days just hanging around the hotel. We can't go anywhere because we can't miss the phone call.\nSo we get the phone call. He says, &quot;Okay, come to uh Snug's restaurant. Such and such a day, such and such a time. It's Ballastur's restaurant. He owns a hotel and it's a restaurant in his hotel.&quot;\nSo me, Lefty, and Tony, the other undercover, we go there.\nAnd now if you know the mob joke, you you don't get to sit down with a boss unless you're another boss. You know what I mean? Guys made guys that are just made guys in other families don't get to sit down with a boss.\nSo now who's there is is Busteri the boss, his underboss, his casigliary and his two sons who are both lawyers, right?\nSo we have a big spread where and why do you want to be here?\nWell, you know, Tony's been with us this now Lefty's doing all the talking because he's the main guy.\nTony's been with us for 10 years, you know, him and him and Donnie. Uh they did a lot of uh art theft together and stuff and they've all they've both been with us. Uh and Tony Tony thought he, you know, he could get the he get the um uh business going with with the machines and stuff.\nSo after this whole dinner, probably about five or six hours, they said, &quot;Okay, we'll get back to you.&quot;\nAll right.\nSo a couple days later, they called, &quot;Why don't you have dinner at my house?&quot;\nA [ __ ] boss is inviting us to dinner at his house. It doesn't happen if you know the world of the mafia.\nGives us the address.\nMe, Lefty, and Tony. And Lefty's like, &quot;You got to know wise guys, right?&quot;\nLefty's like, &quot;We're going to the dinner at a mob boss's house.&quot; At his house.\nHe's like, you know, I mean, we know it's a big deal, but to a wise guy, it's a big [ __ ] deal, too.\nSo, we go to his house and he's right on the lake. He has a big big table, you know, like you see in the movies, and got the maze uh serving us. And he said, &quot;Okay.&quot; He said, &quot;Uh, we'll go in partners. We're be 50/50 partners. Tony does all the work. You know, we'll tell you where to go to uh to put your machines in. They'll take your machines.&quot;\nSo now, what do we just do? We just married two mafia families together.\nBonanno and the Bellisaries through Chicago. at first marrying two mafia families to do business together, right? Me and left to go back to New York.\nEverything's going good.\nUh Tony's meeting with the Suns cuz that's who they said, &quot;You meet me with my sons.&quot; All right.\nUh after a few months, nothing. They stopped meeting with them. Don't know why they won't take his calls, nothing.\nUh, so I tell I said, &quot;Lefty, they they don't they're not responding.&quot;\nWhat do you mean they're not responding?\nI said, &quot;They're not taking his calls anymore.&quot;\nHe said, &quot;Well, what do you do? Try to, you know,&quot; I said, &quot;Tony.&quot; I said, &quot;Lefty, this guy's not like that.&quot;\nMake a long story short,\nTony had been a cop in a city outside of Milwaukee after he got out of the Marine Corps before he went into the bureau. And somehow they found out there was a leak somewhere.\nBut they don't they don't tell we find this out later that this is how they they don't tell this to Lefty which save my ass cuz I I vouch for Tony.\nRight.\nRight.\nSo we're trying to get in touch with Chicago. Chicago's not, you know, Chicago say we don't know why they why they stopped, you know, we don't have any idea.\nSo that goes now. That's I got that hanging on me, right?\nYeah.\nSo Lefty sends me to to Milwaukee. Go, you know, go find out uh go search for this guy and blah blah blah blah.\nAnd you know, I come up with a story, left, you know, I found this car. It was in the parking lot. I mean, it's in the uh parking lot of the uh airport.\nUh then when I went back, it was gone.\nUh so I go and they said, &quot;Oh, the cops towed it.&quot; You know, it's all [ __ ] of course, but I got to cover, you know, what happened to this guy.\nSo now we got to go tell Mike Sabella, our captain, because you know, our money source dried up. So we go sit down with Mike.\nThis is hard to believe, but and he's ripping, right?\nYou know, my punishment was what?\nI couldn't go to the Christmas party.\nThat's it. That's it. I mean, he was he was ripped, but he banned me from the Christmas party because you introduced him to the cop.\nWell, he didn't know he was a cop because, right, because, you know, the operation just shut down and so the the the money stopped wasn't coming in anymore, right? And they don't tell you why.\nNo. No.\nSo I said, &quot;Well, if that's the best that could happen, I don't go to the Christmas party, you know, cuz each crew has a, you know, they have their own party and shit.&quot; You know, so I'm saying to myself, &quot;My god, this is this is what I'm\nSo they don't suspect you at all?&quot;\nNo. No.\nHow do How do they not suspect you? How do they not question you?\nWell, I had been with them so many I have been with them now, you know, Joe, over two years now, right? And you know, so but I'm always on edge because I I don't know why aren't the Ballast telling Rogerio, right?\nUnless they're too embarrassed.\nYou know what I mean?\nRight.\nI don't I don't know to this day.\nWell, I mean, after we found out that Yeah. Yeah. To this day, I have no idea why they didn't tell him.\nAnd what ever happened to Tony?\nOh, we just shut the operation down.\nThey just shut it down, you know. Uh, so I'm I'm going on again. Uh, we're going on. Uh,\nnice cup.\nYou want it? You can have it.\nNo, thank you. I got some swag coming for you.\nAll right.\nYeah. Yeah. Yeah.\nWell, I got swag, too. You can have one of them JR cup.\nBut, I mean, I got a lot of Donnie Brasco swag that I'm going to mail to you. It was supposed to be at the hotel.\nIt it never made it. So, but this has to be hair raising.\nIt is because now I'm like and and Lefty said, you know, now he's he's grilling me again about my relationship with with Tony, right? Uh, and but I got to stick to the story, you know. Um, so, uh, so I I I kind of squared things squared things around with him and because I, you know, um, and Mike. So now what happens is that, um, uh, at the time Karma Galante was the boss of the Bonanno. All right.\nAnd uh they kill Galente.\nThey whack him.\nAll right. Because there's there's kind of a beef within the family and and uh one side didn't like Galente. So they they whack him. Mike Zabella now was associated with Galente. So they tell Mike, &quot;Mike, either step down or we're going to we're going to whack you too.&quot;\nSo he gives up his captainship and just becomes a regular soldier again. Right?\nSo one of the uh originators, when I say originators, uh instigators, whatever, uh is a guy by the name of Sunny Black Naplano.\nHe was out in Brooklyn.\nSo they put me and remember we were with Mike Sabella. So they put me and Lefty now with under Sunny Black. They make Sunny Black becomes a captain. They put me and Lefty under Sunny Black out in Brooklyn.\nSo that's who we report to every day.\nAnd what you you know you have to you have to check in with your captain every day. So every day uh me and Lefty would report out that uh the motion lounge uh on Graham and Wither Street in Brooklyn because he's hey's our new captain.\nUh so uh and and again you know the the intelligence information I'm gathering is like no other that anybody else can get because you know informants are going to give you all this stuff and I'm I'm meeting different people again. I'm meeting people from uh different families through these guys.\nSo, I'm rocking out there in in uh in Brooklyn uh under Sunny Black and I get another call.\nUh they want to the headquarters wants to talk to you about what?\nWell, we got an undercover operation going in Tampa, Florida.\nYeah.\nWe want to see if you can bring your bananas in. I says, &quot;Hey, wait a minute. Wait a minute. Wait, wait, wait. I just went through this in Milwaukee.&quot;\nWell, supervisor wants to talk to you. I knew the supervisor. Supervisor is a good guy.\nUh, so I called him. I said, &quot;Tony, what's up?&quot;\nHe said, &quot;We got a nightclub and uh it's pretty, you know, it's pretty good, but we can't get into Santo Trappanti. And maybe, you know, maybe you can\n\n\n\"Do the same thing you did in Milwaukee.\"\nI said, \"I don't know, man.\" I said, \"If I do it, number one, who's the undercovers?\"\nBecause they had two undercovers running a nightclub, and they said, \"Uh, well, one of them is, uh, an agent by the name of Sal Mary, Steve.\"\nI said, \"Okay.\" I said, \"He's I know Steve. I did undercover work with him, too.\" I said, \"I got no problem with Steve.\" And they gave me the other guy. And the other guy I knew, but I didn't I never worked with him. I said, \"But as long as Steve is involved, I'll see what I can do, but I don't know how long it's going to take. So, you got to just let me think about this.\" All right? Because I don't want to come up, you know, I'm not coming up with a story. Hey, I I got a call from a guy that I used to [ __ ] a thieve with.\nRight. Right. Right.\nSo, I figure, okay,\nAfter a while, I Okay, here's what we'll do. We used to go to Miami a lot. When I say we, I'm talking about me, Lefty, the wise guys. We'd fly to Miami for a a long weekend. We had a hotel down there that uh put us on down the arm, right? Give us a sweets and stuff and stay for the weekend.\nSo I says, \"Okay, here's what we'll do. The next time we go to Miami, right, you guys go down there and uh we're we'll whenever we go to a restaurant, I'll let you know what restaurant we're going to go to.\" And you guys just happened to be in a restaurant and you you uh uh Steve Salary who was going by Chico.\nI said Chico just happens to notice me and comes over to the table and hey Donnie how you been?\nSo it's like a bump, right? It's not like\nRight. Right. Right.\nSo that's what we did.\nSo, we're out at this restaurant and uh we set that deal up and Chico comes over and Donnie, hey, I haven't seen you in years. How you doing? Oh, good. What are you doing down here? Well, we got a nightclub.\nYou got a nightclub? Where?\nIt's uh outside of Tampa. Up in Tampa, Florida. No kidding. How long you been down there? Uh I don't know, three, four years. You know, what are you doing? Not that it's a nice club. Why don't you come by? Now that you know, again, you talking about a nightclub and you know, so everything is is dollar signs.\nSo I said, \"Life, you want to take a ride up one day?\"\nHe said, \"Yeah.\" So when they leave, he says, \"You know these guys?\" I said, \"Well, I know Chico.\" I said, \"I don't know the other guy.\" I said, \"But you know, Chico, he's he was a good he was a good thief, you know.\" I said, \"I haven't seen him in a while. I haven't seen him in like maybe five years, but he's always was, you know, he's always a good thief.\"\nSo, uh, he said, \"All right,\" he said, \"Let's take a ride up.\" So, we take a ride up and it's a nice nice nightclub. It's on like five acres. They got tennis courts. We hang out.\nlot of lot of business you know\nuh it was open from\nuh I don't know\n9:00 to all it was want you know open all night\nso\nhe said nice place he said uh we have to tell Sunny about it when we go back to when we go back to Brooklyn\nOkay. So, we go back to Brooklyn and uh tell Sunny about it. Now, you know, now I'm like in my fourth year with these guys.\nWow.\nSo, uh we go back to Brooklyn and uh tell Sunny left. Hey, uh we ran into one of Donny's old friends. Boy, they got a nice club. Oh, yeah.\nWell, maybe we'll go down to see it.\nSo we go down and they see a lot of potential. Uh but now we they can't operate anything illegal because Santo Trafficante owns Florida.\nSo now we got to go through the same routine.\nAll right.\nthe consigliary has to call Trafocanty's guy and say, \"Hey, we got, you know, uh, one of our guys has a club down there who has been with us for, you know, Chico has been had to be with the Bonanno again for five, six years, excuse me.\"\nSo we go through that same routine and uh finally uh you know that this takes a while. It's not like overnight.\nSo we go through the routine and he says okay his guy says all right uh Santa will meet you at such and such a hotel on such and such a day.\nget to meet another [ __ ] boss of a Florida.\nMe and Sunny meet him.\nWe actually Oh, no. The first time we met him was at at a restaurant in uh uh right outside of Tampa, that the Greek fishing village. Um\nI've drawn a blank, but at any rate, we meet him in a restaurant and uh actually it was Papis's restaurant. That was the name of it. And uh Sunny had never met him before, but you know, they go through all the nicities and uh Sunny tells him, you know, we got a nightclub and we want to start running gambling out of it, you know.\nSo\nhe says, \"Okay, I'll I'll meet you. I'll come up and look at it. I'll meet you.\"\nSo, I I don't know if we met him the next week or the next couple weeks. We meet him again. Now, this time it's in a hotel room. Uh he comes to Sunny's hotel room. Um and uh sets everything up, right? Forms the marriage again. Now, this is the second time we married two [ __ ] mafia families together. So, he uh he said, \"All right.\" He said, \"You want to do a casino night?\" \"Yeah.\" He said, \"I'm going to send my two guys up.\"\nOkay.\nCouple days later, two guys come up from Miami.\nCard sharks.\nI sat in the hotel with these room guys, uh, Joe, and they were marking all the decks of cards.\nI could not after they get done. I had no idea how they mark these cards.\nThey were for black jackets. Not right.\nHad craps tables. The dice were dice were fixed. I mean, like everything was, you know, so we set the club up uh and uh uh we're advertising uh casino night for the veterans of foreign war. We even had a certificate and everything, right?\nWe're paying off somebody in the sheriff's department to protect us. Well, we got the the game going and uh doing pretty good. Doing pretty good.\nAnd uh\nplace is jammed.\nSo what happens is that uh all of a sudden a knock on the door, one of the door men's lies and he comes to me. He said, \"Donnie, there's a bunch of sheriff's deputies outside.\"\nWhoa. So right away I get on the phone. I can't get I can't get our contact in the sheriff's department. He's not answering his phone. And then we had just paid him that day.\nAll right.\nSo\nI said, \"All right, clear all the money off the tables.\" So we get all the money off the tables and put chips back on the tables.\nUh I said, \"All right, let them in because we had the we had the certificate, we had everything.\nAnd what we had done was every so often we collect the money and we stash it in the furnace room, right? There was a lot of money stashed. What we had was an oldtime one-armed bandit. All right. The thing had to be a hundred years old. Nobody ever put money in it. It was just there.\nSo they they come in and they they they don't see any money.\nOne of the one of the deputies puts a I don't know nickel dime, pulls a handle, and what do you think happens? He [ __ ] wins.\nYou're running a gambling operation.\nSaid nobody's ever played that thing, right? Well, they wrecked the joint.\nThey wrecked. We all get arrested.\nWhy did he Why did he get arrested?\nBecause it I don't understand.\nIt was a gambling charge. They arrest us. Oh, because but why? Because of the one armed bandit.\nBecause they won and they said that that's that was gambling.\nOh, nobody even knew there was any money in it or anything. It was just there as a decoration.\nOh boy.\nYou know, it was it was an antique.\nSo, they just use it as an excuse.\nYeah.\njust use an excuse because we were the we were the the mafia guineies from from New York, right?\nThat's what we were, right? So they throw us in a can and uh just for the one-armed bandit.\nYeah.\nThey never find the money.\nUh we didn't, but somebody did.\nOh boy.\nSomebody did.\nHow much money?\nUh there was over 30 grand that that I know that was stashed.\nSo they swiped that.\nWell, I don't know.\nSomebody did.\nProbably.\nSomebody did.\nYeah.\nSo, we had Traffic Kanty's lawyer, one of He gave us a I don't know who it was. So, we called the lawyer and he gets us out of the can the next day. Uh, and now now I'm in another [ __ ] bind because now we got busted. And we did, you know, we were paying the guy off.\nAnd what happened to the guy you paid off?\nHe committed suicide later on.\nOh, how uh convenient.\nYeah. Yeah.\nDid he really commit suicide?\nYeah, he did really because uh when uh he got a subpoena.\nOh, he knew they were coming for him.\nYeah. Yeah. Yeah.\nOh, so that uh that kind of uh screwed that thing up.\nAnd uh uh but you know I you know Sunny knew that uh uh that we were paying the guy off and everything. So you know it was just a hazards of doing business hazards of doing business as a mob you know. But when we got back to the club like I say the the statue was gone with the money. Somebody took it. Uh and so we go back to New York and uh again now there's another beef in the in the Bonanno family cuz after they whack Galente uh they make uh Rusty Restelli the boss of the family but Rusty's in a can. He's in a can. So Sunny Black is is running the family along with u another Kappo.\nAnd then there's a Sicilian faction of the Bonanno family and they're running their they're running their faction.\nAll right.\nNow, there's a faction of three capos that are against Rusty Restelli and they're against Sunny and the other Kappos.\nSo now there's more friction in the Bonannos.\nSo, uh, in order to solve this, they, uh, uh, they call a sitdown. Sunny Black, the guys on his side, the capos on his side. Uh, call a sit down for the other the other three capos to straighten this out.\nWell, the deal is when these other three capos get to the sitdown, they're going to whack them.\nOh, yeah. they're going to whack him.\nSo, uh, I was supposed to be in on that, but they cut they cut me out at the last minute. I was supposed to be in on the hit, but they cut me out the last minute. And then they I was supposed to be on the cleanup crew, but they cut me out at the, you know, at the at the last minute.\nWhy' they cut you out?\nI don't know. I don't know. I don't know.\nbecause I wasn't told until after, you know, right?\nSo, they whacked these three guys and uh the next day Sunny calls me into the club and he he said uh uh Bruno never showed up. That was the fourth guy that would uh one of the capos in Delano, his son uh was supposed to come and he he didn't show. So he gave me the contract to kill him. So he said, \"We think he's in Florida.\" So he sends me to Florida to look for him, but he wasn't he wasn't down there. And the deal was that if I did find him, I'd call the FBI and they would snatch him and we'd stage a hit or if they found them, you know, we do the reverse. They they'd stage a hit, but we never found them.\nSo now all this time I never carried a gun.\nI never carried a gun in this whole operation.\nReally?\nYeah.\nWas that unusual?\nNo, because these guys don't carry guns on a daily basis. The mob, you know, mafia guys.\nThey don't?\nNo.\nNo. Because they're always getting roused by the cops.\nGot it.\nRight. The only time they carry a piece is when they're going to go go do some work, right?\nYou know. Uh, so did you see guys get killed?\nNo,\nI don't believe you.\nSo, that was the sneakiest no I've ever heard in my life.\nSo, we we uh Let's move on. We Yeah, let's move on.\nWe um um\nYou made me lose my train of thought, Joe.\nSorry. Sorry.\nNo. So, uh, we're in the club. So, I get the contract for Bruno, but obviously I can't find him. Bureau can't find him.\nDid anybody ever find him?\nYeah. Yeah.\nYeah. So, what happens is we're in a club one day in the motion lounge. And, uh, Sunny gets a phone call and he says, \"Hey, Donnie.\" He\n\n\nSaid, \"Um, uh, we think Bruno's at such a place.\" Uh, and uh, but it was, it wasn't, it was bad info. It was bad info. So, I was asked, \"Well, what would you do if he was there?\" I said, \"I hate to say, but Bruno probably was a dead man.\" And, well, how could you say that? Well, because when you're given a contract, it's your responsibility that guy gets killed. And if you refuse the contract, you get killed. You're going to get whacked. So, would you have had to do it? Well, if you found them, I could have given some to one of the other guys to do it, but it's my responsibility, right? You know, and my whole look, my mindset in Undercover is I'm not dying for a gangster, right? I'll die for a citizen. I'll take a beating for a citizen, but not for a gangster. Uh, you know, that's he's going to get whacked either way. He's going to go either way, right? You know, so I'll take my shot with the government, you know. Uh, it's, it's, you know, it's not the, it's not, you know, a lot of people can't deal with that, but I get it, you know, uh, so it's the job, that's the job, you know. I mean, look, I'm there to put you in jail. I'm not, I'm not there to get you killed. I'm not there to kill you. I'm there to arrest you and and try to, you know, hopefully send you to jail. But I'm not going to die for you. Right. I'm not put, you know. So, it's a situation where your back is against the wall. Yeah. Exactly. Got it. So, uh, but I, but you know, that, that didn't happen. Did they ever find him? Yeah. Yeah. They found him. Um, they found him actually, I don't know if it was a year or so later. I'm not too sure. But yeah, he, he, he eventually got arrested. Yeah. He was a coke, you know, he used coke. So, um, sloppy. Yeah. So, now, you know, now with the war going on, the bureau decides that, uh, well, we got to, we got to shut the operation down. Uh, so those hits took place on May 5th. So, and prior to that, I had a sit down with Sunny Black and he said, \"Donnie,\" he said, \"U, the books on the, the books on the mafia are opening up in, in December.\" He said, \"And I already proposed you for membership into the Bonanno family. So, you're going to, you're going to get inducted into the family in December,\" he said. So, I congratulated him, thanked him, kissed him on both cheeks, you know. Uh, so you were going to be a made guy. Yeah, I was going to be a made guy. Yeah. How attractive is that life when you're in it? Oh, forget it. Must be so much fun. Yeah. Part of the problem, right? So, no. Waking up every day to think is today the day I go to jail or today I get whacked. No. I, I didn't, uh, Joe, I didn't find it that [ __ ] attractive, believe me. I mean, it's all right. They flash, they cash, you know, uh, you walk into a restaurant, they know who you are, you know, you get the, you get the VIP treatment. You get the VIP treatment. You don't order off the menu, you know. Yeah. Uh, you know, so there's perks. There's those perks, but you know, too scary. I didn't want to wake up every day saying, \"Do I go to jail or do I get whacked today?\" That's, that's their mindset. It's, it's crazy. It is crazy. It's crazy. But I've talked to guys in that life and they love it. Yeah. That's what's crazy about it. Yeah. Yeah. They go, I, I know guys that uh, became uh, informants and you know, uh, they wish they could go back. I say, you know, uh, no, I, I, I, I wouldn't want, you know, but that is a problem with guys who do undercover work, right? Yeah. Some of them, some of them fall in love with it. Yeah. They fall in love with the undercover aspect. And I think, I think the reason that that I was successful in all my cases and that I'm still 98% sane is I didn't fall in love with it. And I grew up on the streets. You know what I'm saying, right? I mean that I grew up in that environment and I was never attracted to it as a kid, right? You know, right? Uh, did you ever run the risk of running into someone that you knew who knew you as Joe Stone? Yeah. Did you see the movie? I did, but I don't remember. In the airport. Oh, that's right. With the lawyer. Oh, that's right. Yeah. That's so, that really happened. Yeah. How did that go down? Well, I saw, you know, we saw made eye contact and, you know, and I just clocked them. Oh, wow. And Sunny says, \"Donnie, why'd you do that?\" I said, \"Sunny, guys, he's looking at my prick. What do you want me to do?\" Oh, you know. Uh, but no, I never got attracted to, to the life uh, other than as a job. And I, and, and I think another reason too, Joe, where a lot of undercovers go wrong, uh, is they think they have to act like gangsters. They change their personalities, right? And you can't be a in the daytime and b at night, right? I never changed my personality, right? You know, uh, and a, and a lot of undercovers are extroverts, and I'm the exception to that rule when I'm really an introvert. Uh, so you didn't need the attention. I didn't need the attention. Thrive on it. Uh, I don't, you know, um, and I never changed my, my, my values. Like I, like I've mentioned before, I'm not a drinker. I never was a drinker. Uh, I worked in bars as bartender, you know, during, during my college years when I got out. Uh, and I wasn't going to become a drinker just because I just because I was working undercover, you know. I mean, I had guys say, \"Donnie, you never finish a beer because I can't. I only can drink half a bottle of beer. That's all I can drink. Probably lucky. Probably. Yeah. Or you know, you never have more than one glass of wine. That's all I, that's all I can ingest is one glass. And see, too many undercovers think, \"Oh, all, all bad guys are drinkers. All bad.\" You know, Donnie, you ever, I never do drugs. The coke is a real problem with guys who go undercover, right? Yeah. Cuz they have to do it with everybody. Well, you know, they think they do. They think they do. I mean, I was in the, in a nightclub in Miami and the guy offers me coke and I slapped his hand. You know, [ __ ] Coke is all over the place. And I said, \"Don't ever offer me that shit.\" I said, \"I make money off of that. I don't put that stuff in my body. I go to the gym every day. Why would I, why would I do that shit?\" I said, \"To me, it's a money maker.\" See, but too many young undercovers think, \"Oh, you know, I got to drink, right? You know, I got to do this, I got to do that, I got to act tough, right? You, you don't have to. All you do is you have to be yourself. That's all. That way, you don't have to ever change it up. That's exactly right. You never have to change. You never get caught yourself. And you don't have to act tough. You don't have to talk tough. You just got to back up what you say and that's it. Never say anything that you can't back up. And that was always my motto, you know. I never promised anything that I couldn't do. I never let anybody back me against the wall, you know. Uh, and I never got into anybody's face to make myself look tough, right? You know, I mean, and that's where a lot of young undercovers go wrong that, that they think, you know, they watch too much television. Be honest. Be honest with you. They uh, The only time I, the only time I, I screwed up. I, I tell you, we're in Miami. All right. And um, I'm in another undercover's car. So it might have been, it might have been Chico. I, I don't remember. So there's the three bad guys, you know, and he had his car wired up. So, we're riding by and, and it's a strip club and it said 20, 22 naked dancing girls and I said 44 nipples. That's all I said. Well, that came out at trial [Music] by the defense attorney and I had to explain why I was such an expert on female nipples. That's just simple math. But what I'm saying is, you know, so somebody remembered you saying that? Well, it was on the tape. On the tape. On the tape. So, they were trying to use that against you. Yeah. I was, you know, my, it was my character was, you know, was questioned. Uh, but, you know, it goes back to what I say is, is that I would not normally say that, right? You know what I mean? Right. Right. Right. Right. Uh, it was just a dumb statement, but it's always going to come back to bite you in the ass. Right. Right. Right. I got you. So, yeah. You just got caught up in it. Yeah. Yeah. So, so what happened when they opened up the books? Well, they closed the case down. So, I got him to, I got him to postpone it till July cuz we had one more meeting with Traffic Cany set up. So, I, I got him to postpone it until after that meeting, but I couldn't get him to, to wait until after I got inducted into the, into the family. They wouldn't wait. Wow. So they, they closed the operation July 27th. Uh, yeah. Yeah. And uh, six years undercover, seven years of testifying. Wow. But I was lucky enough that uh, after that case I did, I did undercover work overseas. I did undercover work for Scotland Yard. Oh, really? Yeah. What did you do over there? They have one case and so uh, they had two Scotland Yard uh, detectives who I knew. I, I did a lot of work with their undercover unit and uh, so they were into uh, the Chinese triads and there's stuff I can't disclose, but they, they were um, they were manufacturing credit cards. And I won't, I won't say which, which companies. Uh, and you can bang them out for like 50,000 before before they were discovered because they had, they had the numbers. Yeah. I knew a guy did that. Yeah. They had the legit numbers. Yeah. That's back when they had like the carbons, right? Yeah. So, Scotland Yard was, was trying to get to, to the location in another country, right, where they were actually everything was going down. So they were meeting with the number two triad in London. So they said, \"Hey, look, our guy from New York, mafia guy from New York, who's the money man wants to have a sit down with you.\" He says, \"Okay.\" So I fly over to London. And I knew these yard guys cuz I had done other stuff with them. So they introduced me to the uh, supervisor of the serious crime squad. He was the guy that was uh, running, running this case. So I would break his chops. You know, you can't, they don't carry guns or anything. You know, even the undercovers don't, they don't, they don't carry guns. So I uh, I'm sitting down with them and I said, \"Hey, uh, I said, you know, I got my gun, but I didn't bring any bullets. You got any bullets?\" The guy goes apeshit. He said, \"You can't cry.\" I said, \"Calm down. I'm just breaking your chops.\" Right? So then he says to me, \"What are you wearing to this meeting?\" I said, \"I'm wearing slacks, sport coat, and a shirt.\" He said, \"No, no, you got to wear a suit.\" I said, \"Why do I have to wear a suit?\" He said, \"Because all these triad guys wear suits all the time.\" I said, \"What's that got to do with me?\" He said, \"No, no, you got to wear a suit.\" I said, \"Well, I don't have a suit.\" I said, \"I'm telling you, I got slacks, a sport coat, dress shirts, and that's what I'm wearing.\" So he turns the, he turns to the uh, the undercover guy from Scotland Yard and he turns around, opens his safe, pulls out money, says, \"Go buy him a suit.\" I said, \"You're going to buy me a suit?\" He said, \"Yeah.\" I said, \"What do I do with the suit when I'm done with it?\" He says, \"You keep it.\"\n\n\nI said, \"All right.\"\n\nSo me and Graham, we go, I buy two suits, one for me and one for Graham, right? So we go to the meeting and I'm wearing his suit. So there's me, the two Scotland Yard guy undercover guys, and the triad. So now, before we go to the meeting, the supervisors tell me, \"Look, you can't insult this guy. You got to be nice to him because he's a number two guy.\"\n\nSo I says, \"Hey, look,\" I said, \"I don't tell you how to run your serious crime crime squad. Don't tell me how to work undercover.\" I says, \"Whatever you need, I'll get.\" I said, \"Well, don't tell me how to do it.\" So, he's all nervous.\n\nSo, we're in a resort. They rented a suite, a big suite in a resort, and they're next door. So they got the suite where we are. They got it wired, audio video, right? So we go in and we're sitting there and we get through all the niceties with the triad. So the guy keeps interrupting me.\n\nSo finally he says, \"Hey Chin,\" I said, \"why do your sentences always start in the middle of mine.\" And he looks at me and you can hear this dead silence, right? Then he says, \"Oh, Mr. Joe.\" I was going by Joe Marino at the time. He said, \"Oh, Mr. Joe, I apologize. I'm sorry. I'm sorry.\"\n\nGraham tells me, he says, \"When you said that, he thought the supervisor was going to have a heart attack.\" He said, \"He just blew it. He just blew it. It's over.\"\n\nAfter that, the guy gave us everything. The location of the factory, the whole McGill.\n\nDo you feel like you had to do that to have his respect?\n\nOf course. I mean, I'm a mob guy. What do I know about the triads?\n\nRight. You know what I mean? Right. So, if I would have let him keep stepping on me, right? I've been out of character.\n\nYeah. Right. You know, so yeah, that had to be scary.\n\nYeah. Well, the triads are, you know, they're scary.\n\nYeah, they are. They are. And he was the number two. And I give these guys credit. I mean, he got to the number two guy, but they couldn't get, you know, right? So, but what a life.\n\nYeah. How do you stay calm in these situations?\n\nI just stay who I am. You know, I get that Sicilian in me and you know, uh, you go at it when you have to, and if you, if you don't, you know, uh, if you don't, it probably seems off.\n\nYeah. Yeah. So, but that's got to be just nerve-wracking.\n\nI, you know, it is because you, what's nerve-wracking is you always have to be on, right? You know, you can never be off. You never relax.\n\nNo. I mean, and I mean, not many guys could say that they had sitdowns with two mafia bosses of different families, right?\n\nI used to stay at Sunny Black's apartment with him in Brooklyn, and this guy was running the Bonanno family. He was one of the top caps in the Bonanno family. But the different Sunny, I don't know how many hits he had on. Now, all these guys I dealt with, don't forget, all these guys had hits under their belt. These weren't, these weren't novice guys. I mean, they all had, you know, five, six, 10, 15 hits under their belt, you know.\n\nUh, I mean, I got into a fight one time in a bar with Tony Mirror. Uh, I mean, me and him against three guys. Um, and I mean, he grabbed a beer bottle, broke it on the bar and just boom, raked the guy's face, you know.\n\nNow there's another guy, you know, I always brings up the young undercovers is that this was probably the meanest guy I ever met. I mean, flat out mean. You know, these other guys were mean, you know, because they kill people. But I mean, he was just a mean guy. The other guys, the other gangsters didn't like him.\n\nI never saw him. I never saw him overindulge in any liquor. Never. Never. And he would stab you as soon as look at you. And after that incident, I told you when I had to go around with him, I always made sure I was an arm's length away from him.\n\nWhat was his name?\n\nTony Mirror.\n\nOh, okay. Yeah, that was him.\n\nThey, now, after it was over and they found out who I was, they killed Mirror. His own nephew killed him, actually.\n\nWow. Because he introduced me to all the Bonannos.\n\nWow. Yeah. Lefty was on his way to get killed, but the FBI picked it up on the wire tap, so they snatched him. You know, surveillance team snatched him off the street.\n\nUh, they killed Sunny Black. Sunny Black got killed.\n\nYeah, he got killed. Yeah. So all the people that had let you in, the Yeah.\n\nYeah. Tell you how Sunny Black got killed. You talk about a gangster.\n\nAll right. When it came out that I was an under, you know, undercover in the beginning, the mob didn't believe I was an FBI undercover agent, they thought the FBI had kidnapped me and was trying to turn me because we, you know, we picked it up on the wire taps and informants. But once it, you know, once their lawyers told them, hey, he really is an undercover agent.\n\nSo Sunny Black gets a call. You got to go to a sit down. So he walks into the motion lounge. He had, he had a diamond ring. Takes off his diamond ring. All right. Takes his money out of his pocket, takes his all his keys except his car keys, puts them on the counter, says to a bartender, \"I just got called to a sit down. I'm probably not coming back.\"\n\nIs that a gangster?\n\nWow. Calls his, calls his girlfriend. And this is how we found this out. Calls his girlfriend and tells her the same thing.\n\nSo what happens is that uh, uh, after they find his body and everything, uh, his girlfriend calls the FBI and she says, \"Uh, I'd like to, I'd like to um, have a meeting with Donnie Bras.\" And I said, \"Why?\" He said, \"Because I got something to tell him that that uh, Sunny Black uh,\" she called him Sunny. She didn't call him Sunny Black. She said that Sunny wanted me to give him a message.\n\nThey said, \"Okay.\" So they fly her down to DC and myself and the agents, the other agents go out to a restaurant and she said, \"Uh, Sunny wanted me to tell you, this is what happened.\" She said, \"This is what happened. He got called to a sit down and he goes into the motion lounge, gives his ring, his money, his car keys to the bartender and tells a bartender, you know, uh, I got called to sit down and I'm probably not coming back. And then he calls me and he, he says her name and he said, \"Uh, if I don't come back,\" he said, \"I want you to get in touch with Donnie and tell him I loved him.\"\n\nWhoa. And he was just better than we were. I don't hold anything against him.\n\nWow. Is that a gangster or what?\n\nThat's a guy that's living that life, huh?\n\nWow. Is that a gangster?\n\nThat's crazy. How did that make you feel?\n\nWell, it, it, it kind of threw me for a loop. I mean, I had a good relationship with him. And like I said, I didn't want to see anybody get killed, you know? Even Mirror, I didn't want to see him get killed. I mean, although I, I might have done it myself. I mean, he was that guy was just plain mean, but you know, that's not my job. My job is to gather evidence, bring you to trial, and hopefully you're convicted.\n\nRight. Um, but uh, yeah, Sunny was Sunny, you know, the difference me and Sunny, we could sit just like we're having this conversation. He wasn't 24/7 gangster. You know what I mean?\n\nYeah. We'd break chops. We'd break balls.\n\nwith Jurio was 24/7 gangster.\n\nI couldn't, I liked him because he was a great cook. He, he was man, I'll tell you Joe cook. But you, you always, there was always something, you know, he was digging for, you know. But like Sunny, I look, I'm staying over at the main capo in the family, one of the two main capos in the family's apartment. He'd get up in the morning. We, I sleep on his couch. We'd get up in the morning. He'd go, \"Here's a guy that's running a goddamn Bonanno family. He'd go out to get coffee and hard rolls and butter and bring him back and me and him would sit there in our shorts and watch cartoons on television.\"\n\nI tell that to, I tell that to the guys at the FBI and they say, \"No, I, I'm telling you this is, you know.\" And then he had a weight bench in his apartment. And back in the day, I, I used to lift pretty good, you know. I mean, you can't tell me now. Of course, I'm old now, but uh, and I was, I was pretty good at hand wrestling. I mean, arm wrestling, right? And he could never beat me. And he was built like you. I mean, he, he was built, right? He's about your size and everything and big arms like you got, but he could never beat me in arm wrestling. And I don't know what it was if I, you know. So one day he says to me, \"Donnie,\" he said, \"I'm going to beat you today in arm wrestling.\" I said, \"Sunny, you'd never beat me.\" Why today?\n\nI'm going to beat you. I said, \"Okay.\" So the day goes on. So then he says, \"All right, let's go.\" Right. We're going on. He spits in my eye. Boom. He said, \"I told you I beat you.\"\n\nUh, but I mean, that's the kind of guy he was, right? You know, uh, and I couldn't get mad at him, right? You know, uh, but with Lefty, you couldn't, you couldn't joke around like that, right? You know, I mean, he was, he was, he was something else, man. He, uh, he couldn't stand, he couldn't stand air conditioning.\n\nReally? Never. We'd be in the car in Miami, the windows would be up and he'd be smoking English ovals with no air conditioner.\n\nJeez. And I'm dying. I'm, I'm dying. I put the window down. Donnie put that window up. I put, I turn, he turned the air conditioning off. He couldn't stand air conditioning.\n\nWhy?\n\nI don't know. I don't know. He had cancer. Maybe it was, I don't know.\n\nOh, he had cancer at the time while he's smoking with the windows rolled up.\n\nYeah, but he had been cured of that, you know. He had been, he had testicle cancer years before. Uh, he had eventually died of lung cancer and he used to smoke English ovals.\n\nWe go in the hotel room and we always had a big suite. So, you know, we didn't have different rooms. We'd have a suite with two bedrooms. Uh, he turned the air off. He turned the air off.\n\nSo, you know, you have to do things to keep your sanity sometimes, right? So, we're down in Miami. So, I figured, son of a, I'm going to get you today, right? So I said, \"Left, I got to go to the, I got to go to the head. I'm going up to the room.\" I go up. I take the cover off the air conditioning. I crank it where you could hang meat in there, right? And I put the cover back on. And I, I, I put a thing in there. So, you know, if you move the thing back up there, we get upstairs. I mean, it was freezing.\n\nSo, we get in that room. We get in that suite and he's like, \"Donnie, turn that air conditioning off.\" So, I go over there and I said, \"Left, I don't know. Something's wrong. I don't know.\" He said, \"Call the front desk, get maintenance up here.\" So, I pick up the phone, but I don't, I make believe I'm talking. I said, \"Yeah, this is room so and so, and our air conditioner is broke. Could you send somebody up?\" But I'm not talking to anybody because I want him, I want him to freeze as long as he could freeze.\n\nSo he's, after a while. Did you call that? I said, \"Left, you saw me call, call him again.\" And I do the same thing. And now he's calling me Joe. Every name in the book. It's your fault. You did this. You broke it. I said, \"Left, I didn't do a thing. I don't know nothing about air conditioning.\" Right.\n\nSo finally after about a half an hour, I do, now I call and I\n\n\nSay, hey, our air conditioner, and so they send somebody up, and then the guy takes, \"Okay, there it is.\" But he blamed me, but you know, but that's how you keep your sanity sometimes, you know, God. But, uh, what is it like to experience all that and then see it in a movie? Like, what is it like to see a guy like Johnny Depp play you in a movie? Oh, God, what an experience that was. Has to be so weird. It was. And you know Johnny Depp? Yeah, I know him. I love that boy. He's a great guy. I could cry. I'm telling you. I mean, what he's done for my family. Excuse me. It's all right. He's a sweetheart of a guy, like genuinely. I've hung, I've hung out with him a few times at the comedy store. Yeah, in LA. Very, very nice guy. I love him. He loved my wife. Yeah. He, um, he just flew in in January to have dinner with my whole family and my grandkids, flew in from Spain, and my wife couldn't make the dinner. So the next day, he went and spent almost 5 hours with her. Yeah. And then she passed away a little while after that. Yeah. He's a great guy. He really is. I mean, he's genuine. Is genuine is, and it's odd. It's odd for a movie star. Yeah. You know, I meet movie stars, and I always have this wall up because I always feel like, okay, I'm just going to talk to some [ __ ] person. You know what I mean? Like, I've met a bunch of them, and they're not really there. Yeah. Exactly. Exactly. But when you meet one and they're really there, it's amazing. You know, like, you realize, oh, they're just human beings who are in this very unusual position. Yeah. Where they're incredibly famous, and, you know, they're, they're famous in a very weird way. They're famous for pretending to be other people. Yeah. In acting and films, and you know, you know them so well as, you know, a [ __ ] pirate or whatever. I mean, you met in '96 and have stayed friends up until... Wow. Up until now, and he has stayed friends with my girls, my grandkids that he, you know, uh, that he knew since they were, you know. Yeah. And now as adults, I mean, he takes, he takes phone calls from my one granddaughter. Yeah. Yeah, he's a genuinely good guy. Before his trial was going on, I had a conversation with him for half an hour on the phone in Hawaii. I was in Hawaii drinking margaritas in a lounge chair. And my friend Doug, Doug Stanhope, calls me up. He's like, \"Hey, Johnny wants to talk to you.\" And me and Johnny were on the phone for like a [ __ ] half an hour. Yeah. I used, I used to keep in contact with him when he was in trial. What a crazy trial. Yeah. But that trial showed you who he really is. Who he really is and who she really is, too. Yeah. And it just shows you, you know, I didn't know her. You're lucky. I tell you a funny story is that... Do you know Vanessa? No. This is when... Excuse me. Well, I mean, I met Johnny. He was first going out with, uh, Kate Moss. And, uh, they all love my wife. So, uh, then he was, uh, one day he calls me, and he says, \"Hey, I'm, I'm going to be in Joe Stone Crab. I'm going to be in Miami.\" He said, \"Meet us at Jones Stone Crab.\" I said, \"Okay.\" So me and my wife go down there, and, uh, this Johnny, his father, his father's a great guy. You know his father? No, his father's a great guy, too. Really good guy. And I had met his father during the shooting in the movie and everything, right? We hung out. So, uh, he introduces us to Vanessa, right? You know, you know who she is, right? His ex. Who's Vanessa? Uh, Perisci. She's the French, uh, singer. That's the one who his kids are by. Yes. Is X. Yeah. Yeah. Yeah. So now my wife wouldn't, when she ate, she would not touch anything. She had to eat with a knife and fork, you know, a rail miggon, right? Irish. So, you know, you had Joe Stone Crab. What are you going to do? You got to eat. You know, you got, you got to break him. You got to touch him. So Vanessa says, \"Uh, Maggie, you don't like them?\" She says, \"Oh, I like them, but I don't, I don't like to touch them.\" She broke all the claws, everything. Took all the meat out so my wife could eat him. With a fork. With a fork. I said, \"Only you could do that, you know, only you could get somebody to, you know, but, uh...\" How long did you know him before he played you in the movie? I didn't, I didn't. You didn't know him at all? No, I mean, I... Did you get to meet him before he played you? I mean... Oh, yeah. Yeah, we met, um, I guess we met maybe three or four months before we start shooting. Did you want to talk to you about the life? And, yeah, I spent time with him. And what's amazing about him, uh, Joe was at... He just, it's like a sponge, you know, like, we would just go out, go to dinner, go to lunch, hang out, and the next thing you know, he's talking like me. He has the same rhythms. Uh, every once in a while, I clear my throat. He's clearing his... He was walking. We were on set one day, and my mother happened to be on set, and Johnny's walking away, and she's calling me. Wow. Because the way he walked, the way he had that little [ __ ] and... Yeah. I mean, he's, he's, he's just amazing, you know, and he, he doesn't like prod about stuff. He just absorbs it. Yeah. Yeah. Yeah. He's something. But I've stayed in touch. I stayed friends with the Chrissy, your sister. You said you, the whole family, basically. How strange was it to watch the finished product, to watch this version of your life, of your story? Yeah, it was. It was. Now, for you and your audiences, I just want you to know in that movie, I never slap my wife in real life. Why'd they add that in there? Ask the director. Damn, those [ __ ]. Ask the... Because that wasn't in the script. Oh, Jesus Christ. Ask the director. I almost went, I went [ __ ]. Yeah. When I... And you know, it's funny because Johnny used to pick me up every morning to go to work. All right. And here's the kind of guy, I tell you kind of guy. We'd stop at a bodega, and he'd run in and get, get the coffee and and hard rolls. I said, \"No, I'll go in.\" I mean, I mean, you know, to get to just the regular guy. Yeah. And I, that, that day was kind of like... wasn't himself on the ride in, and then I saw them rehearsing that scene. I went, I went, I went ballistic, man. I went ballistic. But you know, you, you know, you know that the director's the captain of that ship. You know, they always have to do something like that. They always have to add some [ __ ] that didn't really happen. It drives me nuts. Yep. So, but what are you going to do? Yeah. So, how, after the case is closed, what is life like for you? Like, how do you... I mean, you had to be worried about your life. Yeah. Well, what happened is, once they found out the, the, the commission put a $500,000 contract on me. Uh, and the New York office of the FBI went to every boss and told them they better not think of, you know, trying to cash in on that, you know. Um, so, uh, I was working out of, out of Washington and out of Quantico, and, um, families moved. I think we got like five or six moves since then. You know, you try to back everything, right? Uh, the bureau was good about that. Uh, but you know, what, what's in the back of your mind is, is not the legitimate, legitimate gangster. You know, it's some cowboy that thinks, hey, you know, God, there's not... get on their good side. There's Donnie Brasco. You know, if I take him out, we're in, right? Which... And I don't think anybody was going to pay anybody 500,000. You think, you think the mob is, they don't use their own money for, you know, for squat. So, yeah, but, um, that's the only thing that you worry about is, you know, some cowboy, you know. Um... How long was it before you stopped worrying about that? Well, you never really do. I mean, you know, even to this day. Yeah. Yeah, you know, uh, because there's always somebody that thinks they're, you know, they're going to be famous about doing something, right? You know that, you know, right? So, uh, but it was, it was more prevalent back in the, you know, back in the day, you know, as you know, most of my guys now are... I don't know any of them that are alive, actually. Did you keep in touch with any of those guys? No. No. No. My, my whole thing in undercover, Joe, was I never arrested anybody that I worked against. My whole thing was, I did the undercover. You make the arrest, I'll see him in court. I'll see him in court. Yeah. Yeah. Uh, it would funny, you know, you always sit down with the, after the case is over, you sit down with the, the profilers and everything, and they say, \"Well, we think this guy will turn this guy.\" Not one of my guys, when I say my guys, ever became an informant. Really? Never. Wow. The, uh, one of the, the prosecutors in Milwaukee, he said, he said, \"I think we should go talk to Roger Jerryio.\" I said, \"Are you [ __ ] crazy?\" I said, \"You walk in there and mention my name, he'll go crazy.\" He said, \"Exactly what happened.\" Exactly what happened. Yeah. Yeah. They... He did 15. He did 15. Never cracked. The only reason they let him out was, uh, uh, he had, uh, they found out he had, I don't know if it was gum cancer or whatever. And then he had one lung taken out, and then he had cancer in the other lung. So he had like three or four months to live. So he was such a pain in the ass in the for the department of corrections that, uh, they let him out. He died at home. Yeah. Wow. But he didn't crack. Of course, Sunny... Sunny had a shot. He... He said no. No. None of them. None of them. They tried to turn all of them. Huh. Yeah. Yeah. They all went to the can. They all did like 15, 20 years. Yeah, wild. Wild is right. I mean, now, soon as they, soon as they put the last click on the handcuffs, they're all, they all want to talk. All right. Now, yeah. Now, yeah. Yeah. Yeah. I mean, they all, they all got hits under their belt, but soon as they put those cuffs on them, you know, some of the guys, they do their time, but eventually they turn. None, none of those guys became snitches. What do you think happened to this, the culture of the mob where these guys started snitching? They didn't want to do the time. I mean, some of them did time, some of them did seven, eight years, you know, but then I think when they still, when they kept getting beat over the head, you know, they figured what good is, and you know, what the, the culture of the mob has changed to, uh... I, I found near the end, um, these guys didn't, to the old-timers, this was like their, their life, you... They were really committed to it. It was the younger guys. It's, it's, it's a me generation, just like normal citizens. They want it now, right? They don't want to... I mean, I don't know, like the old-timers, they could, they could cultivate politicians. They could cultivate, uh, law enforcement. These guys today, you know, that they can't cultivate politicians and judges like the old-timers did, you know, and drugs, drugs is a big, uh, big downfall of the mob because now the guys start, some of them start using it. Well, it's also, you can't keep secrets anymore. No, it's the only secrets when one guy's alive. Yeah. I mean, especially with cell phones. Yeah. Internet. Yeah. Yeah. And that's surveillance. Surveillance is so easy now. Everything you do is surveilled. Every phone call you make, you're on camera all day long. I read a pl... I read somewhere or heard where the average individual is on a camera over 500 times a day. Just walking around wherever you go. Yeah. And then your phone's listening to everything you say. Everything. Yeah. And everybody has a phone. Everybody. Yeah. Everybody today. And that, and that's what's tough in undercover today is, is building your legend because it's, it's hard to do 100% backstopping, right? How can you, uh... with the internet, right? Also, Google image search. Bam. Put your face up there. Oh, that's that guy. Exactly. Yeah. Instantly. Uh, so I don't know. I mean, how much of the mob even exists now? It's still there, but you know, they're, they don't control what they did. They don't control every all label. You know, when I was in it, they controlled everything. I mean, they controlled unions. They controlled every bit of Vegas. Vegas. They controlled every bit of, uh, commodity that that ran. In fact, when I was in it, they still had the skim out of Vegas and Bellastr.\n\n\nHad offered me with Lefty.\nHe had offered me, uh, the job of running the skim from there to Kansas City.\nWow.\nYeah.\nYeah.\nI mean, that's how tight I was with the Bonanno that, you know, that was before the thing went south, you know.\nThat's so crazy that you got in that deep.\nYeah.\nWere you the deepest that anybody had ever infiltrated the mafia?\nYeah.\nYeah.\nAnd everybody else that that went in, you know, they had in they had an informant.\nI had no informant.\nYou just made your way in slowly.\nYeah.\nWow.\nAnd I wasn't I wasn't a mark, you know, where I I didn't have all this money, right?\nYou know what I mean?\nRight.\nWhere they could exploit you.\nYeah.\nYeah.\nRight.\nSo, you know, uh, yeah.\nCrazy life, Joe.\nYeah, it was.\nWhen you look back on it now, does it seem real?\nMust seem insane.\nWell, you know, sometimes I think I can't believe I did that, right?\nThat's what I mean.\nYeah.\nYeah.\nUm, and then other times that, you know, I say as as deep as I got, I could have done more.\nLike how?\nWell, I mean, if I if I would have got made.\nRight.\nRight.\nRight.\nDo you wish they had gotten you made?\nOnly because I had spent so much time.\nI spent six years, you know, and then to cap it off with getting inducted.\nAnd not only that, think of the feather in the cap of the FBI, right?\nYeah.\nThe mafia inducted one of our own, you know.\nI mean, that would have really kicked their ass.\nYeah.\nBut, you know, uh, it's funny that you think back and that's the thing that you wish.\nYeah.\nYou know, it's kind of crazy.\nYeah.\nBut still in all, I mean, you know, it's like it's the ultimate [ __ ] you.\nYeah.\nRight.\nYeah.\nYeah.\nI mean, you [ __ ] I mean, I we pretty much decimated them anyway.\nYeah.\nYou know, uh, but it is kind of crazy when you think about the chokehold that the mob had and then it's kind of nothing.\nNothing moved in this country without them getting a cut of it.\nWow.\nIt's crazy.\nAll right.\nDid that all come about because of uh prohibition?\nIs that when it all started?\nIs that when they really got a stranglehold in this country?\nYeah.\nYeah.\nIsn't that crazy?\nPretty much.\nYeah.\nBecause that's exactly what's happening right now with the cartels.\nYeah.\nIt's the same [ __ ] thing.\nYeah.\nAnd it's like we never learn.\nNo.\nNo.\nYeah.\nIt's um, history repeats itself, right?\nYeah.\nYeah.\nYeah.\nWell, you know, uh, I think our problem is we don't we don't study our enemy.\nRemember remember what I said before, any anybody I went against, I always knew I always knew who they were.\nI wanted to know your structure.\nI wanted to know how you treated each other.\nUh, I want to know all the crimes you're involved in.\nUh, I want to know if you're how violent you are and who your violence is against, you know.\nUh, I want to know your history, how you became what you are as far as an criminal organization.\nAnd we don't do that.\nI mean, uh, I'm talking about as a whole, you know.\nU, you know, I don't want to get into politics, but you know, you got to study your enemy.\nYou got to know your enemy.\nThe art of war, right?\nYes.\nThe art of war.\nAnd I I tell all my in any undercover classes, you got to read that book, The Art of War, because it it was written thousands of years ago, but it's it'll serve you today.\nYeah.\nYeah.\nIt's kind of crazy when you think that people don't change that much over time.\nNo.\nHuman nature is still the same.\nYep.\nAnd the same strategies apply.\nYep.\nYeah, it's nuts.\nAnd you know, and like I said before, the only thing that's changed in Undercover is building your legend because of the internet, right?\nNothing else has changed.\nYou now it's got to be almost impossible.\nYou ingratiate yourself the same way.\nYeah.\nYou know, you do all that [ __ ] the same way.\nWell, especially if someone had any kind of social media before they got in the bureau.\nYeah.\nOr or become a cop.\nMhm.\nYeah.\nYeah.\nYeah.\nI mean, everybody's kind of ratted on themselves.\nYep.\nYep.\nIt's nuts.\nYeah.\nBut but there's other ways they catch people now, obviously, with all the surveillance.\nDid you make a bunch of notes?\nNo, I just wanted to.\nDid you make sure you covered everything?\nI just wanted to uh mention uh my uh my grandkids set me up with an Instagram and they said, \"Make sure you mention the Do they run it?\"\nYeah.\nYeah.\nYeah.\nI Joe, forget it.\nI just about can turn my phone.\nI'll be honest with you.\nAnd uh, the real Donnie Brasco.\nAnd then uh, a cameo page.\nYou have a cameo page.\nAre you sending people cameos?\nJoe Pistone.\nYou just go into Joe Pistone.\nUh, yeah.\nThe real Donnie Brasco.\nHow do you spend your time these days?\nThere it is.\nThe real Donnie Brasco.\nYeah.\nThat's that's that's from January, Joe, when he's when he flew in for the dinner.\nYeah.\nYeah.\nThat's great.\nYeah.\nYeah.\nWell, I'm kind of I'm kind of right now, um, I'm writing I got another book uh writing on the Bonanno and uh [Music] spent time with um helping out with that Southern California gang conference I mentioned.\nUh, it's really, you know, like I said, I've been with them for 14 years.\nActually been doing it 12.\nOne year COVID and one year I was sick.\nUh, and uh, these guys are these coppers that run it.\nThey all do it on their own time.\nThere's no uh administrative nobody gets paid really.\nNobody gets paid.\nThey do it all on their own time.\nAnd uh, the conference usually gets between 7 and 800 people uh at each conference.\nAnd like I say, it's held uh once a year.\nUh, it's held in San Diego, but it's the Southern California Gang Conference.\nYeah.\nAnd if anybody's interested, you have to be a you have to be a police officer or in law enforcement.\nYou be Department of Corrections.\nTheir their uh email is is uh scgc.incquirygmail.com.\nGo on and get information about it or if they want to attend it, you know, that's that that's how you can sign up.\nOkay.\nUh, and they have great speakers every year.\nUh, and uh, yeah, I uh uh and uh some of my merchandise.\nUh, you can see I have a a shirt here.\nIt says uh Southern California Gang Conference, Donnie Brasco.\nWe sell these shirts.\nI give 100% to the uh to the organization.\nI don't don't keep any.\nAnd uh uh the mugs we sell and stuff.\nI I donate my books.\nI I uh sign books there and I give all the money to the organization.\nI don't I don't take anything either because these uh police officers don't take any, you know, their time is donated.\nSo yeah, it's, you know, who's there to help you when your when your spouse or your, you know, one of the other dies in the line of duty.\nSo, uh, yeah.\nSo, you were telling me before the show that all that money gets donated to the spouses of people who were killed in the line of duty.\nYes, sir.\nYeah.\nYeah.\nYeah.\nYou know, that help them get started after.\nThat's awesome.\nYeah.\nYeah.\nAnd it's great conference.\nLike I said, they they get between 7 and 800 uh either police officer, Department of Corrections, you know, anybody that's in the law enforcement is eligible to attend it.\nAnd it's a week.\nIt's in San Diego.\nYeah.\nYeah.\nWell, Joe, thank you very much for being here.\nI really appreciate it.\nWhat a crazy life you've had.\nThank you.\nThank you.\nI'm I'm really excited uh uh to get the invite and my uh my grandkids were Whoa, you're going on Joe Rogan.\nThey all love you, man.\nWell, tell them I said thank you.\nThey all love you.\nYeah.\nAnd thank you for being here.\nWell, my pleasure.\nIt was my pleasure, too.\nThank you very much.\nThank you.\nThank you.\nAll right.\nAll right.\nBye, everybody.\n[Music]\n[Applause]\n[Music]\n",
  "metadata": {
    "summary": "Joe Rogan interviews Joseph D. Pistone, the former FBI agent who went undercover as Donnie Brasco to infiltrate the Bonanno and Colombo crime families. Pistone details his early career, including his time in Naval Intelligence and initial undercover assignments involving gambling and car theft. He recounts the challenges of maintaining his cover, the importance of building trust, and the high-stakes situations he faced, including threats and violence. Pistone also discusses the evolution of the mafia, the impact of technology on undercover work, and his ongoing work as a law enforcement consultant. The episode also touches on his relationship with Johnny Depp, who portrayed him in the movie, and the lasting impact of his undercover work.",
    "topClaims": [
      {
        "text": "Donnie was threatened with being rolled up in a rug if he didn't prove himself as a thief to Paty.",
        "rating": 8.5,
        "chunkId": "ck-ljqm4jVfcG4-23"
      },
      {
        "text": "The culture of the mob has changed, with younger members prioritizing immediate gratification over long-term commitment.",
        "rating": 7.8,
        "chunkId": "ck-ljqm4jVfcG4-77"
      },
      {
        "text": "The speaker expresses a desire to have been inducted into the mafia, viewing it as a significant achievement.",
        "rating": 7.5,
        "chunkId": "ck-ljqm4jVfcG4-80"
      },
      {
        "text": "The speaker claims that a scene depicting him slapping his wife was added to a movie without being in the original script.",
        "rating": 7.2,
        "chunkId": "ck-ljqm4jVfcG4-75"
      }
    ],
    "topQuotes": [
      {
        "text": "Donnie, if you don't convince me that uh you're as good a thief as Jill says you are, the only way you're going out of this room is rolled up in that rug.",
        "chunkId": "ck-ljqm4jVfcG4-23",
        "chunkNum": 23,
        "relevance": 9.5,
        "interesting": 9.1
      },
      {
        "text": "I think the reason that that I was successful in all my cases and that I'm still 98% sane is I didn't fall in love with it.",
        "chunkId": "ck-ljqm4jVfcG4-55",
        "chunkNum": 55,
        "relevance": 8.9,
        "interesting": 8.8
      },
      {
        "text": "The only time they carry a piece is when they're going to go go do some work, right?",
        "chunkId": "ck-ljqm4jVfcG4-53",
        "chunkNum": 53,
        "relevance": 8.7,
        "interesting": 8.5
      },
      {
        "text": "Do you wish they had gotten you made? Only because I had spent so much time.",
        "chunkId": "ck-ljqm4jVfcG4-80",
        "chunkNum": 80,
        "relevance": 8.1,
        "interesting": 7.9
      }
    ],
    "topTopics": [
      {
        "name": "donnie brasco",
        "count": 22,
        "description": "Donnie Brasco's undercover operations"
      },
      {
        "name": "bonanno family",
        "count": 18,
        "description": "The Bonanno crime family"
      },
      {
        "name": "undercover work",
        "count": 15,
        "description": "Undercover work in the mafia"
      },
      {
        "name": "johnny depp",
        "count": 12,
        "description": "Johnny Depp's portrayal of Donnie Brasco"
      },
      {
        "name": "mob culture",
        "count": 10,
        "description": "The changing mob culture"
      }
    ],
    "videoInfo": {
      "id": "ljqm4jVfcG4",
      "etag": "Hs22w7eH2kukiwOqiF76rP2nglk",
      "kind": "youtube#video",
      "snippet": {
        "tags": [
          "Joe Rogan Experience",
          "JRE",
          "Joe",
          "Rogan",
          "podcast",
          "MMA",
          "comedy",
          "stand",
          "up",
          "funny",
          "Freak",
          "Party"
        ],
        "title": "Joe Rogan Experience #2343 - Joe Pistone",
        "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
        "localized": {
          "title": "Joe Rogan Experience #2343 - Joe Pistone",
          "description": "Joseph D. Pistone is a retired FBI agent who, under the cover identity Donnie Brasco, infiltrated the Bonanno and Colombo crime families, leading to the conviction of over 100 mafia members. Today, he is a law enforcement consultant specializing in organized crime.\n\nGo to https://ExpressVPN.com/ROGANYT to get 4 months free!"
        },
        "categoryId": "22",
        "thumbnails": {
          "high": {
            "url": "https://i.ytimg.com/vi/ljqm4jVfcG4/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/ljqm4jVfcG4/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/ljqm4jVfcG4/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "default": {
            "url": "https://i.ytimg.com/vi/ljqm4jVfcG4/default.jpg",
            "width": 120,
            "height": 90
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/ljqm4jVfcG4/sddefault.jpg",
            "width": 640,
            "height": 480
          }
        },
        "description": "Joseph D. Pistone is a retired FBI agent who, under the cover identity Donnie Brasco, infiltrated the Bonanno and Colombo crime families, leading to the conviction of over 100 mafia members. Today, he is a law enforcement consultant specializing in organized crime.\n\nGo to https://ExpressVPN.com/ROGANYT to get 4 months free!",
        "publishedAt": "2025-07-01T17:01:09Z",
        "channelTitle": "PowerfulJRE",
        "defaultLanguage": "en",
        "defaultAudioLanguage": "en-US",
        "liveBroadcastContent": "none"
      },
      "statistics": {
        "likeCount": "8483",
        "viewCount": "316405",
        "commentCount": "2034",
        "favoriteCount": "0"
      },
      "contentDetails": {
        "caption": "false",
        "duration": "PT2H20M44S",
        "dimension": "2d",
        "definition": "hd",
        "projection": "rectangular",
        "contentRating": {},
        "licensedContent": true
      }
    },
    "checkCount": 27,
    "nodeCounts": [
      {
        "node": "donnie",
        "count": 13
      },
      {
        "node": "mafia",
        "count": 11
      },
      {
        "node": "undercover",
        "count": 11
      },
      {
        "node": "fbi",
        "count": 10
      },
      {
        "node": "tony",
        "count": 9
      },
      {
        "node": "bonanno",
        "count": 8
      },
      {
        "node": "lefty",
        "count": 8
      },
      {
        "node": "donnie-brasco",
        "count": 7
      },
      {
        "node": "wise-guys",
        "count": 5
      },
      {
        "node": "undercover-work",
        "count": 4
      },
      {
        "node": "florida",
        "count": 4
      },
      {
        "node": "informant",
        "count": 4
      },
      {
        "node": "jewel-thief",
        "count": 4
      },
      {
        "node": "jilly",
        "count": 4
      },
      {
        "node": "frankie",
        "count": 4
      },
      {
        "node": "milwaukee",
        "count": 4
      },
      {
        "node": "miami",
        "count": 4
      },
      {
        "node": "air-conditioning",
        "count": 4
      },
      {
        "node": "gangsters",
        "count": 3
      },
      {
        "node": "brooklyn",
        "count": 3
      },
      {
        "node": "charlie",
        "count": 3
      },
      {
        "node": "rogerio",
        "count": 3
      },
      {
        "node": "mike-sabella",
        "count": 3
      },
      {
        "node": "surveillance",
        "count": 3
      },
      {
        "node": "capos",
        "count": 3
      },
      {
        "node": "bruno",
        "count": 3
      },
      {
        "node": "triad",
        "count": 3
      },
      {
        "node": "supervisor",
        "count": 3
      },
      {
        "node": "law-enforcement",
        "count": 2
      },
      {
        "node": "social-clubs",
        "count": 2
      },
      {
        "node": "gambling-cases",
        "count": 2
      },
      {
        "node": "swag",
        "count": 2
      },
      {
        "node": "tampa-florida",
        "count": 2
      },
      {
        "node": "pop-ignition",
        "count": 2
      },
      {
        "node": "alarm-systems",
        "count": 2
      },
      {
        "node": "bronx",
        "count": 2
      },
      {
        "node": "hijacking",
        "count": 2
      },
      {
        "node": "undercover-operation",
        "count": 2
      },
      {
        "node": "fences",
        "count": 2
      },
      {
        "node": "bartender",
        "count": 2
      },
      {
        "node": "joe-rogan",
        "count": 2
      },
      {
        "node": "gambling",
        "count": 2
      },
      {
        "node": "paty",
        "count": 2
      },
      {
        "node": "waitressing",
        "count": 2
      },
      {
        "node": "expressvpn",
        "count": 2
      },
      {
        "node": "lefty-rogerio",
        "count": 2
      },
      {
        "node": "made-guys",
        "count": 2
      },
      {
        "node": "ballastur",
        "count": 2
      },
      {
        "node": "mob-boss",
        "count": 2
      },
      {
        "node": "machines",
        "count": 2
      },
      {
        "node": "mafia-families",
        "count": 2
      },
      {
        "node": "bureau",
        "count": 2
      },
      {
        "node": "whack",
        "count": 2
      },
      {
        "node": "galente",
        "count": 2
      },
      {
        "node": "bonanno-family",
        "count": 2
      },
      {
        "node": "induction",
        "count": 2
      },
      {
        "node": "graham",
        "count": 2
      },
      {
        "node": "english-ovals",
        "count": 2
      },
      {
        "node": "cancer",
        "count": 2
      },
      {
        "node": "hotel-suite",
        "count": 2
      },
      {
        "node": "johnny-depp",
        "count": 2
      },
      {
        "node": "movie-star",
        "count": 2
      },
      {
        "node": "johnny",
        "count": 2
      },
      {
        "node": "joe-rogan-podcast",
        "count": 1
      },
      {
        "node": "joe-rogan-experience",
        "count": 1
      },
      {
        "node": "sunglasses",
        "count": 1
      },
      {
        "node": "patterson-new-jersey",
        "count": 1
      },
      {
        "node": "infiltrating",
        "count": 1
      },
      {
        "node": "jacksonville-florida",
        "count": 1
      },
      {
        "node": "craps",
        "count": 1
      },
      {
        "node": "bank-robberies",
        "count": 1
      },
      {
        "node": "fugitives",
        "count": 1
      },
      {
        "node": "major-players",
        "count": 1
      },
      {
        "node": "testify-in-court",
        "count": 1
      },
      {
        "node": "plead-guilty",
        "count": 1
      },
      {
        "node": "stocks-and-bonds",
        "count": 1
      },
      {
        "node": "safety-concerns",
        "count": 1
      },
      {
        "node": "automobiles",
        "count": 1
      },
      {
        "node": "cadillac",
        "count": 1
      },
      {
        "node": "flipping",
        "count": 1
      },
      {
        "node": "undercover-agent",
        "count": 1
      },
      {
        "node": "baltimore",
        "count": 1
      },
      {
        "node": "steal-cars",
        "count": 1
      },
      {
        "node": "hook-cars",
        "count": 1
      },
      {
        "node": "slim-jim",
        "count": 1
      },
      {
        "node": "tractor-trailers",
        "count": 1
      },
      {
        "node": "trucking-companies",
        "count": 1
      },
      {
        "node": "informant-s-son",
        "count": 1
      },
      {
        "node": "trusting",
        "count": 1
      },
      {
        "node": "mercedes-delivery",
        "count": 1
      },
      {
        "node": "guy-bara",
        "count": 1
      },
      {
        "node": "pharmaceuticals",
        "count": 1
      },
      {
        "node": "lobsters",
        "count": 1
      },
      {
        "node": "truck-hijackings",
        "count": 1
      },
      {
        "node": "precious-gems",
        "count": 1
      },
      {
        "node": "diamond-school",
        "count": 1
      },
      {
        "node": "use-a-lens",
        "count": 1
      },
      {
        "node": "pick-locks",
        "count": 1
      },
      {
        "node": "crack-safes",
        "count": 1
      },
      {
        "node": "tech-guys",
        "count": 1
      },
      {
        "node": "manhattan",
        "count": 1
      },
      {
        "node": "backstory",
        "count": 1
      },
      {
        "node": "orphan",
        "count": 1
      },
      {
        "node": "orphanage-records",
        "count": 1
      },
      {
        "node": "cold-entree",
        "count": 1
      },
      {
        "node": "difficulty",
        "count": 1
      },
      {
        "node": "restaurants",
        "count": 1
      },
      {
        "node": "boundaries",
        "count": 1
      },
      {
        "node": "yorkville",
        "count": 1
      },
      {
        "node": "lady-s-room",
        "count": 1
      },
      {
        "node": "girlfriends",
        "count": 1
      },
      {
        "node": "relationship",
        "count": 1
      },
      {
        "node": "boyfriend",
        "count": 1
      },
      {
        "node": "disneyland",
        "count": 1
      },
      {
        "node": "whacked",
        "count": 1
      },
      {
        "node": "baseball",
        "count": 1
      },
      {
        "node": "diamonds",
        "count": 1
      },
      {
        "node": "set-the-hook",
        "count": 1
      },
      {
        "node": "tiffany-prices",
        "count": 1
      },
      {
        "node": "colombo",
        "count": 1
      },
      {
        "node": "clumbos",
        "count": 1
      },
      {
        "node": "casing",
        "count": 1
      },
      {
        "node": "rug",
        "count": 1
      },
      {
        "node": "scores",
        "count": 1
      },
      {
        "node": "passy",
        "count": 1
      },
      {
        "node": "tony-mirror",
        "count": 1
      },
      {
        "node": "shakedown",
        "count": 1
      },
      {
        "node": "pushover",
        "count": 1
      },
      {
        "node": "embarrass",
        "count": 1
      },
      {
        "node": "data-brokers",
        "count": 1
      },
      {
        "node": "ip-address",
        "count": 1
      },
      {
        "node": "encrypted-tunnel",
        "count": 1
      },
      {
        "node": "privacy-invasion",
        "count": 1
      },
      {
        "node": "netflix",
        "count": 1
      },
      {
        "node": "location-change",
        "count": 1
      },
      {
        "node": "expressvpn-com-rogan",
        "count": 1
      },
      {
        "node": "youtube",
        "count": 1
      },
      {
        "node": "qr-code",
        "count": 1
      },
      {
        "node": "geo-restricted-content",
        "count": 1
      },
      {
        "node": "nicobacher-village",
        "count": 1
      },
      {
        "node": "narcotics",
        "count": 1
      },
      {
        "node": "dope",
        "count": 1
      },
      {
        "node": "parole-violation",
        "count": 1
      },
      {
        "node": "meera",
        "count": 1
      },
      {
        "node": "associate",
        "count": 1
      },
      {
        "node": "other-families",
        "count": 1
      },
      {
        "node": "regurgitate",
        "count": 1
      },
      {
        "node": "reduce-to-paper",
        "count": 1
      },
      {
        "node": "recordings",
        "count": 1
      },
      {
        "node": "cassette-recorder",
        "count": 1
      },
      {
        "node": "radio-shack",
        "count": 1
      },
      {
        "node": "tapping",
        "count": 1
      },
      {
        "node": "hits",
        "count": 1
      },
      {
        "node": "hugging",
        "count": 1
      },
      {
        "node": "kissing",
        "count": 1
      },
      {
        "node": "these-guys",
        "count": 1
      },
      {
        "node": "body-recordings",
        "count": 1
      },
      {
        "node": "touchy-feely",
        "count": 1
      },
      {
        "node": "dashboard-apart",
        "count": 1
      },
      {
        "node": "movie",
        "count": 1
      },
      {
        "node": "car-wired",
        "count": 1
      },
      {
        "node": "suspecting",
        "count": 1
      },
      {
        "node": "checking-out",
        "count": 1
      },
      {
        "node": "fbi-operation",
        "count": 1
      },
      {
        "node": "vending-machine-company",
        "count": 1
      },
      {
        "node": "milwaukee-family",
        "count": 1
      },
      {
        "node": "tai-cobb",
        "count": 1
      },
      {
        "node": "ballastaries",
        "count": 1
      },
      {
        "node": "snug-s-restaurant",
        "count": 1
      },
      {
        "node": "busteri",
        "count": 1
      },
      {
        "node": "underboss",
        "count": 1
      },
      {
        "node": "casigliary",
        "count": 1
      },
      {
        "node": "art-theft",
        "count": 1
      },
      {
        "node": "boss",
        "count": 1
      },
      {
        "node": "suns-meeting",
        "count": 1
      },
      {
        "node": "bellisaries",
        "count": 1
      },
      {
        "node": "partners",
        "count": 1
      },
      {
        "node": "marine-corps",
        "count": 1
      },
      {
        "node": "leak",
        "count": 1
      },
      {
        "node": "airport",
        "count": 1
      },
      {
        "node": "towed",
        "count": 1
      },
      {
        "node": "the-cop",
        "count": 1
      },
      {
        "node": "jr-cup",
        "count": 1
      },
      {
        "node": "mike",
        "count": 1
      },
      {
        "node": "karma-galante",
        "count": 1
      },
      {
        "node": "sunny-black-naplano",
        "count": 1
      },
      {
        "node": "graham-wither-street",
        "count": 1
      },
      {
        "node": "santo-trappanti",
        "count": 1
      },
      {
        "node": "casino-night",
        "count": 1
      },
      {
        "node": "card-marking",
        "count": 1
      },
      {
        "node": "craps-tables",
        "count": 1
      },
      {
        "node": "veterans",
        "count": 1
      },
      {
        "node": "card-sharks",
        "count": 1
      },
      {
        "node": "black-jackets",
        "count": 1
      },
      {
        "node": "bribery",
        "count": 1
      },
      {
        "node": "sheriff-s-department",
        "count": 1
      },
      {
        "node": "doormen",
        "count": 1
      },
      {
        "node": "chips",
        "count": 1
      },
      {
        "node": "certificate",
        "count": 1
      },
      {
        "node": "furnace-room",
        "count": 1
      },
      {
        "node": "one-armed-bandit",
        "count": 1
      },
      {
        "node": "gambling-charge",
        "count": 1
      },
      {
        "node": "deputies",
        "count": 1
      },
      {
        "node": "winning",
        "count": 1
      },
      {
        "node": "antique",
        "count": 1
      },
      {
        "node": "bandit",
        "count": 1
      },
      {
        "node": "30-grand",
        "count": 1
      },
      {
        "node": "traffic-kanty-lawyer",
        "count": 1
      },
      {
        "node": "suicide",
        "count": 1
      },
      {
        "node": "subpoena",
        "count": 1
      },
      {
        "node": "hazards-of-business",
        "count": 1
      },
      {
        "node": "being-busted",
        "count": 1
      },
      {
        "node": "rusty-restelli",
        "count": 1
      },
      {
        "node": "sicilian-faction",
        "count": 1
      },
      {
        "node": "friction",
        "count": 1
      },
      {
        "node": "kappo",
        "count": 1
      },
      {
        "node": "sitdown",
        "count": 1
      },
      {
        "node": "cleanup-crew",
        "count": 1
      },
      {
        "node": "delano",
        "count": 1
      },
      {
        "node": "guys",
        "count": 1
      },
      {
        "node": "motion-lounge",
        "count": 1
      },
      {
        "node": "cocaine-use",
        "count": 1
      },
      {
        "node": "mafia-life",
        "count": 1
      },
      {
        "node": "going-to-jail",
        "count": 1
      },
      {
        "node": "personal-values",
        "count": 1
      },
      {
        "node": "money-maker",
        "count": 1
      },
      {
        "node": "young-undercovers",
        "count": 1
      },
      {
        "node": "my-motto",
        "count": 1
      },
      {
        "node": "strip-club",
        "count": 1
      },
      {
        "node": "chico",
        "count": 1
      },
      {
        "node": "nipples",
        "count": 1
      },
      {
        "node": "bad-guys",
        "count": 1
      },
      {
        "node": "defense-attorney",
        "count": 1
      },
      {
        "node": "female-nipples",
        "count": 1
      },
      {
        "node": "tape",
        "count": 1
      },
      {
        "node": "postpone",
        "count": 1
      },
      {
        "node": "traffic-cany-meeting",
        "count": 1
      },
      {
        "node": "chinese-triads",
        "count": 1
      },
      {
        "node": "credit-cards",
        "count": 1
      },
      {
        "node": "testifying",
        "count": 1
      },
      {
        "node": "mafia-guy",
        "count": 1
      },
      {
        "node": "crime-squad",
        "count": 1
      },
      {
        "node": "breaking-chops",
        "count": 1
      },
      {
        "node": "bullets",
        "count": 1
      },
      {
        "node": "apeshit",
        "count": 1
      },
      {
        "node": "slacks",
        "count": 1
      },
      {
        "node": "dress-shirts",
        "count": 1
      },
      {
        "node": "triad-guys",
        "count": 1
      },
      {
        "node": "suits",
        "count": 1
      },
      {
        "node": "resort",
        "count": 1
      },
      {
        "node": "suite",
        "count": 1
      },
      {
        "node": "joe-marino",
        "count": 1
      },
      {
        "node": "factory",
        "count": 1
      },
      {
        "node": "mcgill",
        "count": 1
      },
      {
        "node": "audio-video",
        "count": 1
      },
      {
        "node": "arm-wrestling",
        "count": 1
      },
      {
        "node": "cartoons",
        "count": 1
      },
      {
        "node": "lifting-weights",
        "count": 1
      },
      {
        "node": "spits",
        "count": 1
      },
      {
        "node": "testicle-cancer",
        "count": 1
      },
      {
        "node": "lung-cancer",
        "count": 1
      },
      {
        "node": "keep-sanity",
        "count": 1
      },
      {
        "node": "maintenance",
        "count": 1
      },
      {
        "node": "phone-call",
        "count": 1
      },
      {
        "node": "freezing",
        "count": 1
      },
      {
        "node": "movie-experience",
        "count": 1
      },
      {
        "node": "comedy-store",
        "count": 1
      },
      {
        "node": "acting-films",
        "count": 1
      },
      {
        "node": "hawaii",
        "count": 1
      },
      {
        "node": "doug-stanhope",
        "count": 1
      },
      {
        "node": "pretending",
        "count": 1
      },
      {
        "node": "friendship",
        "count": 1
      },
      {
        "node": "kate-moss",
        "count": 1
      },
      {
        "node": "joe-stone-crab",
        "count": 1
      },
      {
        "node": "vanessa",
        "count": 1
      },
      {
        "node": "perisci",
        "count": 1
      },
      {
        "node": "rail-miggon",
        "count": 1
      },
      {
        "node": "maggie",
        "count": 1
      },
      {
        "node": "fork",
        "count": 1
      },
      {
        "node": "rhythms",
        "count": 1
      },
      {
        "node": "chrissy",
        "count": 1
      },
      {
        "node": "sponge",
        "count": 1
      },
      {
        "node": "director",
        "count": 1
      },
      {
        "node": "script",
        "count": 1
      },
      {
        "node": "colleagues",
        "count": 1
      },
      {
        "node": "profilers",
        "count": 1
      },
      {
        "node": "roger-jerryio",
        "count": 1
      },
      {
        "node": "corrections",
        "count": 1
      },
      {
        "node": "snitching",
        "count": 1
      },
      {
        "node": "drugs",
        "count": 1
      },
      {
        "node": "old-timers",
        "count": 1
      },
      {
        "node": "handcuffs",
        "count": 1
      },
      {
        "node": "cell-phones",
        "count": 1
      },
      {
        "node": "internet",
        "count": 1
      },
      {
        "node": "google-image-search",
        "count": 1
      },
      {
        "node": "unions",
        "count": 1
      },
      {
        "node": "vegas",
        "count": 1
      },
      {
        "node": "skim",
        "count": 1
      },
      {
        "node": "running-the-skim",
        "count": 1
      },
      {
        "node": "infiltrated-the-mafia",
        "count": 1
      },
      {
        "node": "kansas-city",
        "count": 1
      },
      {
        "node": "feather-in-the-cap",
        "count": 1
      },
      {
        "node": "chokehold",
        "count": 1
      },
      {
        "node": "decimated",
        "count": 1
      },
      {
        "node": "cartels",
        "count": 1
      },
      {
        "node": "ingratiate",
        "count": 1
      },
      {
        "node": "social-media",
        "count": 1
      },
      {
        "node": "the-bureau",
        "count": 1
      },
      {
        "node": "same-strategies",
        "count": 1
      },
      {
        "node": "joe-pistone",
        "count": 1
      },
      {
        "node": "southern-california-gang-conference",
        "count": 1
      },
      {
        "node": "instagram",
        "count": 1
      },
      {
        "node": "cameo-page",
        "count": 1
      },
      {
        "node": "coppers",
        "count": 1
      }
    ],
    "topicGroups": {
      "groups": [
        {
          "topics": [
            "donnie",
            "mafia",
            "tony",
            "bonanno",
            "lefty",
            "donnie-brasco",
            "wise-guys",
            "gangsters",
            "capos",
            "bruno",
            "mob-boss",
            "galente",
            "bonanno-family",
            "made-guys",
            "whack",
            "mafia-families"
          ],
          "category": {
            "name": "Mafia and Organized Crime",
            "description": "Topics related to the Mafia and organized crime."
          }
        },
        {
          "topics": [
            "undercover",
            "fbi",
            "undercover-work",
            "informant",
            "surveillance",
            "law-enforcement",
            "bureau",
            "infiltrating",
            "undercover-agent"
          ],
          "category": {
            "name": "Law Enforcement and Investigations",
            "description": "Topics related to law enforcement and investigations."
          }
        },
        {
          "topics": [
            "donnie",
            "tony",
            "lefty",
            "jilly",
            "frankie",
            "charlie",
            "rogerio",
            "mike-sabella",
            "joe-rogan",
            "johnny-depp",
            "johnny",
            "guy-bara",
            "lefty-rogerio"
          ],
          "category": {
            "name": "People",
            "description": "Topics related to specific people mentioned."
          }
        },
        {
          "topics": [
            "florida",
            "miami",
            "milwaukee",
            "brooklyn",
            "bronx",
            "tampa-florida",
            "patterson-new-jersey",
            "jacksonville-florida",
            "baltimore"
          ],
          "category": {
            "name": "Locations",
            "description": "Topics related to locations."
          }
        },
        {
          "topics": [
            "jewel-thief",
            "gambling-cases",
            "hijacking",
            "gambling",
            "bank-robberies",
            "steal-cars",
            "truck-hijackings",
            "crack-safes",
            "fences",
            "trucking-companies"
          ],
          "category": {
            "name": "Criminal Activities",
            "description": "Topics related to criminal activities."
          }
        },
        {
          "topics": [
            "joe-rogan",
            "joe-rogan-podcast",
            "joe-rogan-experience"
          ],
          "category": {
            "name": "Joe Rogan Experience",
            "description": "Topics related to the Joe Rogan Experience podcast."
          }
        },
        {
          "topics": [
            "bonanno",
            "bonanno-family"
          ],
          "category": {
            "name": "Bonanno Family",
            "description": "Topics related to the Bonanno crime family."
          }
        },
        {
          "topics": [
            "informant",
            "informant-s-son"
          ],
          "category": {
            "name": "Informants",
            "description": "Topics related to being an informant."
          }
        },
        {
          "topics": [
            "johnny-depp",
            "movie-star"
          ],
          "category": {
            "name": "Movie Industry",
            "description": "Topics related to the movie industry."
          }
        },
        {
          "topics": [
            "alarm-systems",
            "tech-guys"
          ],
          "category": {
            "name": "Technology",
            "description": "Topics related to the use of technology."
          }
        },
        {
          "topics": [
            "stocks-and-bonds",
            "flipping"
          ],
          "category": {
            "name": "Business and Finance",
            "description": "Topics related to business and finance."
          }
        },
        {
          "topics": [
            "automobiles",
            "cadillac",
            "mercedes-delivery",
            "tractor-trailers"
          ],
          "category": {
            "name": "Vehicles",
            "description": "Topics related to the use of vehicles."
          }
        },
        {
          "topics": [
            "pharmaceuticals"
          ],
          "category": {
            "name": "Drugs",
            "description": "Topics related to the use of drugs."
          }
        },
        {
          "topics": [
            "safety-concerns"
          ],
          "category": {
            "name": "Security",
            "description": "Topics related to the use of security."
          }
        },
        {
          "topics": [
            "craps"
          ],
          "category": {
            "name": "Gambling",
            "description": "Topics related to the use of gambling."
          }
        },
        {
          "topics": [
            "swag",
            "sunglasses"
          ],
          "category": {
            "name": "Swag",
            "description": "Topics related to the use of swag."
          }
        },
        {
          "topics": [
            "lobsters"
          ],
          "category": {
            "name": "Food",
            "description": "Topics related to the use of food."
          }
        },
        {
          "topics": [
            "precious-gems",
            "diamond-school"
          ],
          "category": {
            "name": "Gems",
            "description": "Topics related to the use of gems."
          }
        },
        {
          "topics": [
            "pick-locks",
            "use-a-lens"
          ],
          "category": {
            "name": "Tools",
            "description": "Topics related to the use of tools."
          }
        },
        {
          "topics": [
            "bartender"
          ],
          "category": {
            "name": "Alcohol",
            "description": "Topics related to the use of alcohol."
          }
        },
        {
          "topics": [
            "gambling"
          ],
          "category": {
            "name": "Money",
            "description": "Topics related to the use of money."
          }
        },
        {
          "topics": [
            "trusting"
          ],
          "category": {
            "name": "Trust",
            "description": "Topics related to the use of trust."
          }
        },
        {
          "topics": [
            "testify-in-court",
            "plead-guilty"
          ],
          "category": {
            "name": "Law",
            "description": "Topics related to the use of the law."
          }
        },
        {
          "topics": [
            "expressvpn"
          ],
          "category": {
            "name": "Internet",
            "description": "Topics related to the use of the internet."
          }
        },
        {
          "topics": [
            "cancer"
          ],
          "category": {
            "name": "Body",
            "description": "Topics related to the use of the body."
          }
        },
        {
          "topics": [
            "hotel-suite"
          ],
          "category": {
            "name": "Hotel",
            "description": "Topics related to the use of the hotel."
          }
        },
        {
          "topics": [
            "triad"
          ],
          "category": {
            "name": "Triad",
            "description": "Topics related to the use of the triad."
          }
        },
        {
          "topics": [
            "induction"
          ],
          "category": {
            "name": "Induction",
            "description": "Topics related to the use of the induction."
          }
        },
        {
          "topics": [
            "english-ovals"
          ],
          "category": {
            "name": "English",
            "description": "Topics related to the use of the english."
          }
        },
        {
          "topics": [
            "waitressing"
          ],
          "category": {
            "name": "Waitressing",
            "description": "Topics related to the use of the waitressing."
          }
        },
        {
          "topics": [
            "supervisor"
          ],
          "category": {
            "name": "Supervisor",
            "description": "Topics related to the use of the supervisor."
          }
        },
        {
          "topics": [
            "social-clubs"
          ],
          "category": {
            "name": "Social Clubs",
            "description": "Topics related to the use of the social clubs."
          }
        },
        {
          "topics": [
            "pop-ignition"
          ],
          "category": {
            "name": "Pop Ignition",
            "description": "Topics related to the use of the pop ignition."
          }
        },
        {
          "topics": [
            "ballastur"
          ],
          "category": {
            "name": "Ballastur",
            "description": "Topics related to the use of the ballastur."
          }
        },
        {
          "topics": [
            "slim-jim"
          ],
          "category": {
            "name": "Slim Jim",
            "description": "Topics related to the use of the slim jim."
          }
        },
        {
          "topics": [
            "hook-cars"
          ],
          "category": {
            "name": "Hook Cars",
            "description": "Topics related to the use of the hook cars."
          }
        },
        {
          "topics": [
            "major-players"
          ],
          "category": {
            "name": "Major Players",
            "description": "Topics related to the use of the major players."
          }
        },
        {
          "topics": [
            "fugitives"
          ],
          "category": {
            "name": "Fugitives",
            "description": "Topics related to the use of the fugitives."
          }
        },
        {
          "topics": [
            "graham"
          ],
          "category": {
            "name": "Graham",
            "description": "Topics related to the use of the graham."
          }
        },
        {
          "topics": [
            "air-conditioning"
          ],
          "category": {
            "name": "Air Conditioning",
            "description": "Topics related to the use of the air conditioning."
          }
        },
        {
          "topics": [
            "paty"
          ],
          "category": {
            "name": "Paty",
            "description": "Topics related to the use of the paty."
          }
        }
      ]
    },
    "shortSummary": "In this episode of the Joe Rogan Experience, Joe Pistone, also known as Donnie Brasco, discusses his undercover work infiltrating the Bonanno and Colombo crime families.",
    "lastStoryCheck": "2025-07-14T17:20:59.085Z",
    "storyCheckResults": {
      "missingChunks": [],
      "missingStories": [],
      "totalCategories": 21,
      "totalChunksChecked": 84
    }
  }
}