{
  "id": "PsMH1-Bbqr0",
  "title": "Joe Rogan Experience #2338 - Beth Shapiro",
  "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
  "publishedAt": "2025-06-17T17:00:25.000Z",
  "cleanText": "Joe Rogan podcast. Check it out. The Joe Rogan Experience. Train by day. Joe Rogan podcast by night. All day.\n\nHello, Beth.\n\nHello. This is very great to see you again. I am pleased to be here. It's been really interesting getting to talk to you and communicating with you and all the stuff that you guys have done at Colossal Biosciences has been insane. So, why don't just tell everybody what your background is and what you do? I'm a scientist. I work in a crazy field called ancient DNA, sometimes called paleogenomics. It means we go out into the world, we dig [ __ ] up, and we extract DNA from it. And what is fantastic about that is it's being a modern-day explorer. I get to go somewhere, I get to find out something new that completely rewrites what we thought we knew, and it's brilliant. And I get to fight with people a lot. And because I love to fight, I recently quit my academic job and moved to become the Chief Science Officer at Colossal, the company that has just made those direwolves.\n\nWhy do you like to fight with people? Oh, I don't really like to fight with people. I just felt like it was the right thing to say at this minute. I end up fighting with people though, not because I want to, but because I feel like I have to defend what I think is the way that we should be doing science. Well, it's certainly a controversial subject and you guys are certainly groundbreakers. So, whenever there's a controversial subject and people are groundbreakers, you're without doubt going to get a lot of pushback and a lot of people that just want attention, a lot of people that are angry that you're getting attention. It's there's a lot of stuff going on.\n\nYeah, there's a big I think in academia in particular, there's this big scarcity mindset and this leads people to be kind of negative about everything. Well, that's going to be too hard. If I say that that's good, then that means that the thing that I want to do probably isn't going to get that money. Or if you get attention, that means I can't get attention. And it leads to this negativity that I think stifles innovation. There's a lot of gatekeeping, too. You know, we talked about that recently. There's a lot of people that want to be the only people that are allowed to either discuss or work on things. Yeah. I've spent my whole life working on this. Therefore, I am the only expert. And if anybody says something that disagrees with what I believe to be true, they're just wrong. I'm not even going to think about it. They're just wrong. It's unfortunate. But fortunately, we live in a very unique time where you can do podcasts and podcasts get extraordinary amounts of attention. And so I think that's also one of the reasons why people push back so much as well. It's because they they don't like that. They don't like that there's this unique distribution network. Yeah, there are going to be people there are going to be colleagues of mine that are angry with me that I have come here to talk to you and that is part of the problem. Yeah, it just seems kind of silly, you know, but the subject without all that stuff, the subject is absolutely fascinating.\n\nSo, how did you get started in this? Like what did you initially want to do when you first started your career? I actually started in broadcast journalism. I really I was in high school. I was convinced that I wanted to work in broadcast journalism. I got a job working at the local TV station. I grew up in Rome, Georgia, northwest corner of Georgia. And I got a job with the TV station where I was first operating the camera and helping people write copy. And then I got to be on air. I auditioned for a spot in the morning where I would do local cutins on headline news in the like 24 and 54 after the hour. But I had to wake up really early in the morning and go to work. I was in high school. go to work, write the script, go on TV, learn to read the teleprompter. It was pretty fun and eventually got and I was convinced that this is what I wanted to do with my career. I went to the University of Georgia. They have a fantastic broadcast journalism school. I started off as the news director at one of the local radio stations. And this job, let's just say, wasn't particularly compatible with being a freshman in college. There was there were mornings when I was locked out of the bathroom, but I had only been asleep for one and a half hours after being out for too late at night doing things that I shouldn't have been doing because I was underage, right? And had to go to work to write the news and then be on this broadcast radio station. It was terrible. Anyway, how did I move from there to science? I took this uh took this amazing class. It's similar to a class that I ended up teaching at UC Santa Cruz recently where um it was a field geology and archaeology program and we started off on the east coast. We learned about rocks and how to identify minerals and then we drove across the country and slept outside in national parks and learned about the history of North America, the geological history, the human history, everything while being there in person. drove up the west coast, drove back around the country. It was nine weeks. And I thought to myself while I was there, this is the story that I want to tell. I I want to show how people have changed this landscape over and over and over again and about the opportunities that we have to be able to become more creative controllers of this landscape. So, I thought I'll get a degree in science because my I know how to do broadcast journalism. You know, the the ignorance of somebody who thinks they're an expert in something, right? I know how to do that. So, I'll just do this other thing. Um, and that's that's the history of it. I just kind of got sucked into being the scientist.\n\nI've written a couple of popular books, which is still me trying to reach back out. I want to be a communicator, but I also want to be a scientist because it's so much fun. So, you just followed your fascination, which is the best advice anyone could ever get. Yeah. Yes. How did I pick a field working in ancient DNA? This is something I had no idea about. I ended up not getting the scholarship that I wanted to get and not getting into the university that I wanted to get into, but wandering around the halls of the university that I did get into. And I met this guy called Alan Cooper who was one of the few people in the world at the time, this was the late 1990s, who'd set up the special kind of lab that you need to be able to extract DNA from bones. So, this DNA is in terrible condition. So, we have to have a a purpose-built clean room to make sure that we don't spit in something or drop an eyelash in something because then your DNA, which is in great condition, will be the thing that we amplify. So, we had one of these labs and I thought, well, that's kind of cool because I was interested in geology. I was interested in human history. Maybe I can use this as a way of telling stories that haven't been told before or rewriting the stories that we keep telling. This was a time where we were learning a lot about human history and human ancestry and there was a lot more to be learned. And so I thought this would be cool, but I wasn't sure. And Allan said, um, well, you know, it'd be cool. This would be fun. Plus, if you join my lab, you can go to Siberia. And I was in. I was like, yeah, sure. That that's that's the deal for me. I'll go to Siberia.\n\nWhoa. So, you got sent to Siberia. That's usually what they do to you in the Soviet Union when you're bad.\n\nYeah. Well, I mean, I have had several not amazing experiences in Siberia, but overall, it's been it's been fun. I've been a couple of times. Uh, yeah.\n\nWhat time of year did you go?\n\nSummer.\n\nWow.\n\nYeah. So, the first time I went, it was for a meeting. Uh, and I spent some time in Moscow first as a guest of one of my Russian collaborators. And then we went out to this meeting in Yakutsk. And we got a on a boat. What I learned about Siberia is that everything goes wrong. There's no bit of infrastructure that functions the way it's supposed to function. And I learned that initially. We ended up on this boat that was 2 hours late. It was warm and hot. And there are so many mosquitoes.\n\nI was going to ask you about that. I've heard the mosquitoes are insane.\n\nSo crazy. Like one of the times I was out in Taima, the north central Taimir peninsula, and we had brought with us this weird tent that we'd set up so that we could go inside and take the masks, take the masks off of our face because you always have to wear a hood otherwise you'll be breathing mosquitoes. And we were going outside and playing this game where we would just clap our hands in front of our face and then count how many you killed. And one time I killed something like 35 mosquitoes in one clap. And it's just awful. It's It's miserable.\n\nSo they're trying to sting you through your clothes.\n\nThey're just Yeah.\n\nAnd they're big too, right?\n\nWell, it depends the time of year. And early in the season they're really big and you can catch them fast and then they get different species come out that are smaller and smaller and toward the end of the season they're really tiny. Once I was up in the north of Alaska on the Ickpikpuck River, we were floating down the river looking for mammoth bones and tusks and things like that. And um it had been windy for the first few days, so it was fine. And I was this was my first time out in the field actually. It was northern Alaska. And I was like, \"These mosquitoes, people keep telling me there's mosquitoes. They're full of [ __ ] There's no mosquitoes out here.\" Right? The wind is blowing. Then the wind dies down and then it's like, \"Oh fuck.\" Like this is awful. There was a moose that was ahead of us for a while and this poor animal. We were following the river and he would every few steps he would just totally submerge his body in this frozen water and then come back up like the mosquitoes are just Yeah. something else.\n\nI've only been to Anchorage. Uh well, I've been to a couple spots of uh Alaska, but I was in Anchorage and when I was there, it was the summertime. We were salmon fishing, my friend Ari and I. And we got bug repellent because we heard you got to spray mosquito spray. We stepped out of the car. The moment we opened up the car door, there was a cloud of mosquitoes. We're shrieking like little girls were like, \"Ah!\" Like, \"What the hell?\" It was It was I'd never experienced anything like it in my life. Like, where'd they come from? Right. You don't expect it. There was nothing there. Like, it did wasn't like we saw a cloud of mosquitoes, but we opened up. There was an impossible amount of mosquitoes. They got into the car. It's terrible. In Time, I remember we would walk along the grass, this tall grass with little flowers in it. Exactly the kind of place you could imagine mammoths roaming and being like the kings of the universe there. But as you were walking, you would kick up the grass and they would just emerge off of the off of the needles of grass. It was just really awful.\n\nWell, they're so aggressive because they only have like three months to live. Yeah. And I learned actually because I was curious about this. How do they survive if there are so few red blood? Because mosquitoes mostly they take a they only take a it's only the females that take a blood meal and they only take a blood meal when they're making a eggs or making a brood. They take it to reproduce otherwise they feed on nectar. So how do these how does so many mosquitoes survive in the Arctic if there's so few animals there? And it turns out those mosquitoes are adapted to this climate and they don't need a blood meal to reproduce but they do better if they get one. So they're after you but they don't need you.\n\nWhoa. Kind of makes it worse, right?\n\nWhoa. It's it it really is fascinating how aggressive they are. Yeah. Because if you know Texas has mosquitoes, but they can live all year round, so they're kind of chill. They're not that worried about you. My boss was so funny, too. Alan Cooper, the guy I went to work with, he was all, \"Oh, I'm going to just wear this natural mosquito repellent, and you don't need any of the stuff that actually has poisons in it. Look at me at my natural.\" And we're out there, and the the wind dries down, the mosquitoes come, and I'm with my de. I'm like, you know, your natural repellent. He's going, \"Sh, do you did you bring the de?\"\n\nLike, yeah. Yeah. Yeah. You give up on that natural stuff real quick. I was watching a documentary where they're using pine pitch. There's a Have you ever seen Wernner Herszog's film uh Happy People, Life in the Tiger? It's really good. It's really fascinating. He follows these people that live on the Tiger River in Siberia.\n\nCool.\n\nAnd it's all these subsistence people that are like fishing and trapping and they're living in these little cabins and they bring dogs with them everywhere. They travel around on snowmobiles. really. Well, it's what what's amazing about it is the title is happy people. They're all happy. That's what's so weird. It's like these people have a very hard life, but yet they're always smiling and they're having a good time and you know, living this subsistence lifestyle somehow or another is like very fulfilling at like a I don't want to say a genetic level, but like an internal level. Like there's something about it that like this makes sense. Whereas society like today, I don't think it makes sense because I think we, you know, you're a geneticist, you understand genes. We essentially have the same genes that people lived 10,000 years ago had. Right. Very different world. Right. Right. And we're not really designed for this world, right?\n\nWell, you can see that in the increased rates of obesity, increased rates of diabetes. We're not also depression, anxiety, all that stuff. And this is what happy people's kind of all\n\n\nAbout. I mean, Warner Herszog is this, you know, he's brilliant, and so he's narrating this whole thing, too. You kind of get this understanding of his appreciation for these people that are living this very basic life. Yeah. But are very happy. Yeah. It's impressive. When we were up there in time, we'd flown for a couple days in this really awful Russian helicopter that took off the third time it tried to because, you know, infrastructure doesn't work in Siberia. It was a repeated theme from you got in a Siberian helicopter at a place. It was in it was an MI8, and it was it was in a place called Hatanga, which is where we were based while we were trying to get out into into and they kept loading all of our gear into this, and it's mostly these massive gas tanks, and you load all the gear into the gas tanks, and then all of the people. We had a dog, Pasha, who was with us, who did not want to get in that helicopter. I think the dog was the smartest person in our expedition in our expedition team. But they would load us up, and they would try to start the helicopter, and it wouldn't start, and they would unload us. We would go back to the places we were staying, and then they would tinker with it and fix it. Anyway, we we flew out. We got in the helicopter finally. We got up into the air, and then the Russian and French leaders of our expedition team decided that they were going to celebrate finally having taken off in this helicopter by smoking. Right. We're sitting on the gas tanks, right? In this helicopter that we already think, right? Fortunately, the helicopter had some missing windows. So, you know, there was Oh, boy. There was air flow. It was fine. No, this was insane. This whole this this particular expedition was particularly insane compared to other things.\n\nAlso in the I'm going to get to the story and eventually, but also in in part of this, we were traveling forever out into this part of the time where they had predicted that we would be able to find mammoth bones and woolly rhino bones and all the bones of the animals we're interested in. And so we're flying out there, and we start to land, and I'm thinking, great, we're there. I get out of this crazy firebomb in the air that I'm in. We're going to We land. No, no, we did not get off. Instead, we picked up a random family that had been out there on their own. Parents, a child. Yeah, it was two parents and a child. And they had a backpack with their gear and a massive cooler, right? That's what they had. No words. They're French. They speak French to the team that's there. People are conver having a conversation in Russian. And then we take off again. And I'm thinking, was that planned to pick these people up or were they trapped? I think it was planned. Just there was a lack of communication, but whatever. The helicopter took off twice, and then it landed, and everybody unloaded, and we set up the the the tent, the camp. And we discovered over the course of the next few days, you know, we built these cool boats, the Zodiacs, you blow them up, and you bring out the outboard, and you put them on the lake, and we're looking around, and we discovered that we had landed in a place where we were going to be for six weeks that had been glaciated during the last ice age, which meant that our chances of finding what we wanted were really small. Oh no. You know, it was devastating. And the the Russian we had a cook with us. The Russian cooks had brought um medical ethanol because it weighed less per unit of alcohol than vodka, which they would normally bring on the helicopter. So they brought medical ethanol to drink. And whoa. Well, you know, you can only take so much stuff with you because it weighs less than alcohol. That's a crazy decision. Well, you know, they they decided it was safe. Anyway, by 3 days in, it's 24-hour sunlight. We're at 72 degrees latitude. Did you try it? Um, the medical ethanol. I tried the medical ethanol. I mean, obviously, right?\n\nYou water it down with a little bit of river water, and you have it with your freshly caught fish that you've filleted, and Yeah, it's great. Yeah, we had fish and rice for the whole time. That was So, you had to catch your food. We had to catch our food. Yes. Luckily, it's probably a lot of fish up there. fish and there were some geese and some ducks that they would try to shoot while we were on our zodiacs normally without telling us that they were about to shoot. It was a very logistic. So you just hear boom, and then the thing would or you'd be sitting there looking at something, and suddenly the Zodiac would take off because whoever was in charge had seen something he wanted to shoot at in the distance.\n\nAnyway, I don't know why I'm telling this story. It's because it's fun. It's a fun story. So we were there. were there for I don't know, maybe it was two or three days looking around, and it was about 2 o'clock in the morning, the we were inside this little tent that we built so that we could eat in it, sort of the kitchen tent where we were, and it was a big mesh tent to keep the mosquitoes out, so we didn't have to have everything, and everybody is just staring off into the distance glumbly. The medical ethanol was gone, you know, everybody was sober. We were going to be for the next five weeks. We were going to be stuck in this place where we weren't be able to find what we were, and then all of a sudden these three dudes show up outside of our tent with machine guns, right? And I'm thinking, everybody's thinking, \"What the fuck?\" Like, we just flew forever in a helicopter over nothing at all. Nothing except for this French family that we picked up randomly along the way. And everybody's looking around, and there's this real moment of what the hell are we going to do? And then the guy who was the expedition leader recognizes these two dudes, and he's like, \"Oh, friends. Oh, good to see blah blah blah.\" And we're I'm thinking what's going to happen when they realize we don't have any more vodka, medical ethanol, right? That's and it turns out that they are they were um members of the Dolgon community, which is an actual family of subsistence people that still live up on the time air. They heard reindeer, and they had seen the helicopter and had wondered what we were up to and just set out over the landscape that they normally live on to try to find us. Wow. Yeah. Pretty cool, actually. That's cool. So, did you hang out with those people? Well, we did. They were disappointed that we didn't have any any alcohol, obviously. This episode is brought to you by Whoop. The all-new Whoop is here. The only wearable that turns your health and fitness data into personalized guidance. Now 7% smaller with more than 14 days of battery life. Whatever you're training for, the insights you get from Whoop will totally change the way you rest, train, and show up every day. Now, Whoop includes heart screener with on-demand ECG readings so you can check in on your heart anytime and share results with your health care provider. This also includes Healthspan, a new feature that demystifies the aging process and shows how your daily habits impact your pace of aging, as well as hormonal insights for personalized guidance throughout your cycle or pregnancy. It's the only wearable that gives you a truly comprehensive view of your body, designed to help you improve your performance, longevity, and overall health. Join now at join whoop.com/jre. That's join.whop.com/jre.\n\nThat's a theme. It's a theme. It was Russia, so it's a fair theme. And but the French couple, this is just you're not going to believe me when I say this, right? Okay. The French couple said, \"I got this.\" And they get up, and they go back to their little tent area that they'd set up in the middle of nowhere, and they bring back their cooler, and they open it up, and inside is cheese like a massive guda and a massive bree like why I don't know. I don't know. Right. But they had cheese, and so we cut the cheese and shared the cheese with our Doggon friends, and they were happy. And the next day we took them back with the Zodiacs to their to their community. And you know what was most amazing about this experience and it it everything about it was cool. We saw these people that were living in these tiny little huts in part of the world where it goes to 40 below, and it doesn't matter if it's Fahrenheit or Celsius because they cross at that level, right? 40 below and during the winter for months and dark, and they're hurting reindeer, and they're living in these tiny little things that they cut in half during the winter so that half of it is used for heating and half of it is used for the family to live in. Everything that they own is on these things on skids that the reindeer drag across the tundra across the perafrost in in the snow or in the summer trying to find the land for the animals to graze. And this is how they live. And that was the only time in that experience where I could take off the headnet because the mosquitoes didn't care about me around those animals. Really, it was really impressive. They only wanted to attack the animals. They were after the animals, and they really left us alone. But probably because that's their natural source. Yeah. More natural than there's more of them there. I mean, I don't know. Maybe they're larger, but it's it was they're probably accustomed to it, right? They also like for thousands of years they've probably been just feeding off of reindeer. Yeah. I think about that though. But I think about those poor that poor moose from Alaska who was also clearly bothered by the mosquitoes. I imagine the reindeer were as well. But and it was it was pretty cool. Were these people riding the reindeer? They did ride them. In fact, I got to they put me up there and showed me how I could ride the reindeer. Is this their place? Yeah. Wow. Wow. So you were in this area? Yes. Yeah, I was there during the summer though. So it wasn't there wasn't snow on the ground. It was all just a very grassy wet super wet grassy. And the the moisture in the ground is probably why there are so many mosquitoes. It is so fascinating to me that people will live like this generation after generation after generation. Yeah. And the fact that you can somehow these are one of the weird animals caribou are that you can herd. Yeah. And people ride them and milk them. Yeah. Yeah. And then occasionally whack one. Yeah. I mean they're great, right? This is animals are have always been a really great storage mechanism. And that's one of the hypotheses about animal domestication. Why did this take place? If we had plants, but there are going to be years where there's plenty to eat and years where there's not enough to eat. But if you in those years where there's plenty, if you store some of that nutrition in animals, then in the years where there's less, you can eat those animals. So, it's a very safe way of storing what you can grow. That's a fascinating way to look at it, storing. I just want to know how they ever figured out how to herd those reindeer. Like, what did you do? Like how did who was the first person to figure out how to get them all to stay together, right? I think that about a lot of domestic animals. Like who was the I also think that about milk? Like who was the first person who decided I can have a go at that, you know? I mean, they're probably starving. They probably I mean, they must have tried everything. I mean, that's how we found out what mushrooms are edible, right? Because a large percentage of them will just kill you immediately. But people are so desperate for anything. Yeah. Some of them are trying to tell you though by being like bright red or bright purple and saying Right. Right. Right. But we're dumb. So we're like, \"Bright red. I'll lick that.\" Yeah. It might be an apple.\n\nThat's confusing. Some bright red things are delicious and really good for you. Wow. So these people that live up there, what what was their history like? Have they been living up there? Those particular individuals have. Yeah. But I think they're they have a long history. The the culture has a long history there. And I mean, we're still I think we're still learning about how humans have dispersed around the world and how they got to be the places where they are today. But I really think it's impressive that there are people who are hanging on to that culture. Absolutely. And really able to, you know, they're they're trying now to relearn their native languages because during the communist era, they were all forced to learn Russian and speak Russian the same way as everyone else. But um even up there. Even up there. Wow. like they sent an emissary to say, \"Guys, it's time to speak the mother tongue.\" Maybe they had to go to the squares like you see in Yakutsk and and all these other places where they have the big squares with the speakers on the top where they would go for the daily admonishings or whatever from the Communist Party. Who knows? Wow. What a weird way to live. It's just it's it's so fascinating that there's pockets of these humans that live like this all over the world. Obviously the the people in the Amazon, the unconted tribes of the world. It's just so interesting and we have so much to learn from them. Yeah. I think and it would be I mean obviously that's such a cool job how getting to go and actually try to communicate with people who haven't been talked to before. But you kind of don't want to because you don't want to ruin that if you Right. Isn't that an interesting perspective? Because I don't want to live like that. Like I don't want to live in the Amazon with a leaf over my private parts. But we assume they even for a week like nope don't want to do it. There's so many things out there that'll eat you and there's so many bugs that can kill you and snakes that could kill you. It's like uh I'd like rather watch a video, right? David Atenboroough documentary. I don't want to go there. I have a good friend who lives there, Paul Rosalie. He goes there all the time. He's been on the podcast a few times and he lives in the Amazon and\n\n\nHis whole thing is, uh, he's there protecting the rainforest.\nAnd what they do is they take these people that are, they're just poor people that have no options, and they're loggers.\nAnd so he pays them more money to protect the rainforest.\nSo they get to quit the logging job and then protect the rainforest.\nAnd then through funding, they buy up parcels of land and protect and save it.\nBut he's had some gnarly encounters with uncontacted people where at one point in time they realized they were actually being hunted, and they barely escaped with their life.\nHoly [ __ ]!\nYeah, you start hearing weird noises in the bushes, and then you realize, like, \"Oh boy, these are people, like, we're being stalked right now by the most sophisticated hunting animal out there.\"\nYes.\nBy the... not only that, I would imagine at the stage that these people are at, they've been living there for thousands and thousands of years.\nThey probably have incredible perception, incredible senses because they have to, right?\nThey probably knew these people were coming a long time ago.\nThey pro, you know, they probably heard the boat coming down the river.\nThey prepared.\nThey got ready.\nThey know where all the paths are.\nThey know which way the people would go.\nLike, you're utterly helpless.\nHow did he get out of this?\nThey got out just in time, just in time.\nThey just escaped.\nYeah.\nBut one of his friends, one of the people that he was working with, did not.\nHe, they would have these gifts, like, so they would take these rafts and to try to make contact with these people.\nThey would float these rafts towards them filled with food, and they were doing this as like a peace gesture.\nAnd this guy had done this several times, and then one time he didn't come back, and they found him full of arrows.\nWow.\nYeah.\nThey just killed him.\nThey just decided, you know, maybe they had a bad experience with some other person from some other Westerner, and they decided, you know, we're done.\nBut they're rightly terrified of humans because when these, uh, people that come in that want to extract resources, whether it's the loggers or whether whatever it is, if there's some minerals or anything else they find there, they just kill everybody.\nIt's there's horrific human rights violations that occur there where these, they just hire the worst people in the world to go in and wipe out these tribes because these tribes are resisting them taking over this land.\nWe have a history of this.\nYeah, we do.\nWe have a deep history, which is really fascinating about the Amazon in particular because, you know, we've had a bunch of conversations on, uh, one of them recently with Luke Caverns, where we went over the LiDAR discoveries of these sophisticated grids and all the stuff that's in the Amazon, where they really thought that this was just rainforest forever, and then slowly over time they realized, \"No, there was like a huge civilization here of millions of people.\"\nSo these people that are the uncontacted people, I mean, I wonder how many of them were like the preppers of the Amazon world from, you know, 4,000 years ago or whatever it was, right?\nOr it wasn't even that long ago that the Percy Fawcett...\nPercy Fawcett, right?\nThat's his name.\nThe guy who... one of... one of the guys who... that's he's the main character in that book, *The Lost City of Z*.\nHe's one of the people that went there.\nWhen they fir... when the first settlers went there, or when the first explorers went there, they talked about these incredible, like, sophisticated civilizations, and then people went back a hundred years, and there was none of that.\nSo they thought that they had just made it up.\nIt turns out the first people probably gave these folks horrible diseases, and it wiped out millions of people, and then the jungle just consumed whatever structures and houses and stuff that they had, and all that's left is these grids that you could see when you fly over in LiDAR.\nYeah, it's so cool.\nYou can see those when you're flying over any part of the world, really.\nI, I noticed it recently.\nI was flying over Europe, and you can see the old trellises from old, you know, I don't know how old, but it's just so cool how we can see remnants of civilizations, and it just makes you think what happened.\nLike, this is some of the coolest mysteries.\nThat's what's so cool about working in ancient DNA, too, is we can just go to places, get DNA from stuff, and learn something that we never knew before.\nIt was fun.\nSo you get interested in DNA, you go to Siberia, all that jazz.\nHow do you get started working with a company like Colossal Biosciences?\nHow does that take place?\nAll of us working in Ancient DNA, we are constantly answering the same question from the media, which is, \"When are we going to bring dinosaurs back to life?\"\nCuz *Jurassic Park*.\nYeah.\nWell, and great.\nWe're so simple for one great movie, and everybody's like, \"When's that going to happen?\"\nAnd people say... people actually say that my field, um, was spawned by *Jurassic Park*.\nThe whole idea that we could get DNA stuff, that's not true.\nIt was actually the other way around.\nAnd Michael Crichton, when he wrote the book that became the movie, he credited a lab at Berkeley, Alan Wilson's group, the extinct species study group, which was the first group to show that you could get DNA in something after it died.\nThat was actually from a quagga, which is a type of zebra.\nThey had a cool name.\nYeah.\nRight.\nWell, in in in Dutch in South Africa, they actually say the qua.\nOo, even better.\nYeah.\nIt's better that way, but yeah, it's kind of bad for the microphone, probably.\nGross.\nUm, I think it's the sound they're supposed to make, right?\nOh, so they sound like that.\nI don't know.\nWho knows?\nAnyway, they showed that you could get DNA from this skin.\nAnd everybody was like, \"That is the coolest thing that I've heard in a long time.\"\nUm, that must mean we can bring dinosaurs back to life.\nAnd everybody started racing to get the oldest and coolest DNA.\nAnd so there were papers in the best journals of science that never published anything that's wrong ever, ever, that said, \"Look, here's dinosaur DNA, and look, here's DNA from a mascine aged leaf, and look, here's this,\" and all of it is crap.\nWe now know, in fact, the first dinosaur DNA sequences that were published, um, if you took them at the time and you typed them into the internet and you compared them to the earliest of the what is today this big repository of all DNA sequences of everything that's ever been sequenced, what came back was a close match to a bird.\nUm, we now know, because there's more DNA sequences there, that it was a chicken, an exact match to a chicken.\nAnd some investigative work found that the excavation team who'd been working on those bones had fried chicken for lunch every day.\nSo, it's chicken contamination.\nYeah, it was like greasy fingers on your dinosaur fossils.\nAnd look, now we have ancient DNA.\nThat is hilarious.\nThat's how little they knew about DNA.\nAnd what year was this around?\nThat would be the early '90s.\nThe early 90s.\nAnd when was DNA first discovered?\nWell, the idea of DNA is much older than that, but it, it was really, um, the idea... what... what really helped this field along was the invention of PCR.\nIt's an acronym for polymerase chain reaction.\nIt's a way of... Carrie Mullis, who discovered the idea of PCR while he was high on a road trip, right?\nOn LSD.\nYeah, that's right.\nYeah, we should all do LSD, I think, because clearly you have your best ideas when you're high, right?\nSome people have great ideas.\nSome people go kooky, you know.\nSome people lose their marbles and never come back.\nYeah.\nI think I probably would not have good ideas on LSD, but I'm willing to give it a shot.\nWell, I like your scientific exploration mind.\nA good scientist always wants to know.\nYou never know.\nMaybe there's a breakthrough waiting behind that little piece of paper.\nProbably not.\nBut probably not.\nYou never know.\nAnyway, he discovered a way to photocopy DNA to make lots of copies of the same thing, which then made it possible to learn the sequence using the technologies of the day.\nAnd that was what made it possible, really, for ancient DNA to take off was this ability to to photo... because there's... when an animal dies or plant dies, the DNA in the cell starts to get chopped up into smaller and smaller pieces by things like UV, right?\nWe go out in the sun, we put sunscreen on, and that stops the UV from breaking our DNA.\nBut it's not terrible to get some sunlight.\nAs you probably just saw, there was an article out saying, \"Hey dummies, you know, we need some sunlight in order to make vitamin D.\"\nBut we have a repair mechanism so that when your DNA breaks, it doesn't stay that way.\nWe evolved this mechan, but once you're dead, you no longer have the energy for that to work.\nAnd so these these damaged parts of DNA accumulate.\nAnd also things like bacteria and microbes get in there and chew up the DNA to recycle the animal to the next generation or plant or whatever.\nAnd so the DNA that we get in an old thing like a mammoth bone is really short fragments, like maybe 30 or 40 or 50 letters of DNA long.\nIn comparison, if I were to take a swab from my cheek and sequence that, I could get strings that are hundreds of millions of letters long.\nThis is living DNA.\nSo ancient DNA is in really crap condition.\nAnd it's also mixed with stuff.\nSo, if I extract DNA from a mammoth, I'll get some mammoth DNA, but I'll get a lot of those microbes that are in there chewing up DNA.\nI'll probably get some of my DNA because I touched that mammoth bone.\nGet DNA from whoever else touched that thing.\nThis has been a real problem in archaeology because we're trying to get DNA from humans, but we're humans, and so we touch these things, and then, you know, I don't know if it's my DNA or if that thing's DNA, right?\nThis episode is brought to you by The Farmer's Dog.\nIf you're anything like me, you love your dog.\nYou want what's best for your furry pal.\nBut figuring out what that is can be a real headache.\nThere's a lot of misinformation out there, especially around dog food.\nTake kibble for example.\nAlmost everyone has probably fed their dog kibble at some point.\nBut if you do a little digging, you may find out how ultrarocessed it is.\nLuckily, there's a better option for you out there: real food from people who care about what goes into your dog's body.\nLike The Farmer's Dog, they make fresh food that's so simple.\nNo magical or miracle recipes, just meat and vegetables, lightly cooked, complete and balanced for your dog's needs.\nAnd it's all developed by board-certified nutritionists with the same safety standards as our food.\nWhen you make the switch, you'll see a massive impact.\nIt can help your dogs be healthier, happier, and more energetic.\nAnd unlike kibble, which comes in a giant bag with vague serving suggestions, The Farmer's Dog food is delivered in packs portioned for your dog.\nIt makes it easy to help them maintain their ideal weight, which is one of the biggest predictors of a longer, healthier life.\nLook, no one, dog or human, should be eating overly processed foods for every meal.\nAnd it doesn't matter how old your dog is, it's always a great time to start investing in their health and happiness.\nSo try The Farmer's Dog today.\nYou can get 50% off your first box of fresh, healthy food at thefarmersdog.com/rogan.\nPlus, you get free shipping.\nJust go to thefarmersdog.com/rogan.\nTap the banner or visit this episode's page to learn more.\nOffer applicable for new customers only.\nEven just breathing on it, right?\nYeah.\nOr or dropping an eyelash.\nWhen in my lab at Santa Cruz and in ancient DNA labs around the world, we have these really s... It's like working in a virus lab where you're scared of everything, but we turn turn it around.\nSo rather than having the air being sucked in, we're kind of trying to push the air out.\nUm, we don't want any air coming in.\nUm, we're we're not... we wear these suits where it looks like we're terrified, you know, with a face mask and hairnet, and we're totally covered, and we bleach everything.\nIt's not because we're afraid of those bones.\nWe're afraid that we're going to get our DNA in that bone, and then we're not going to be able to do course.\nYeah.\nSo, it took that, um, and be the ability to amplify those tiny little pieces of DNA for us to really figure out that we could get DNA out of things.\nFor a long time, people thought we were never going to get DNA out of Neanderthal bones because of this problem.\nYou know, we we touch a bone, we're just going to get human DNA, and we're never going to be able to know the difference.\nBut then with PCR and with the ability to work in these clean labs and distinguish, we eventually got whole in the tall genomes, which I think is probably one of the crowning achievements of my field, ancient DNA.\nSvante Pääbo won the Nobel Prize a few years ago for this.\nWhat did they extracted from?\nBones.\nUm, different bones.\nThe the very first Neanderthal genome sequence was actually a mixture of several bones because, you know, there wasn't very much DNA in any of them, and they were able to pull it together.\nActually, my husband who was on part of that team who put together the first Neanderthal genome sequence.\nWow.\nYeah, it was cool.\nUm, that's really cool.\nBut then they, uh, the Denisovans, the Denisova people, that was just a tiny little piece of a finger bone that they had no idea was going to belong to a totally new species of human, right?\nAnd they were able to get a really high coverage whole genome out of this tiny little finger bone that totally rewrote what we thought we knew about evolutionary history.\nAnd that's pretty recently, right?\nYeah.\nYeah.\nWithin the last decade.\nJamie and I were... we did a podcast recently.\nWe were talking about the big head people.\nWhat are they called again?\nJuliani or something.\nJulian's.\nI've seen this.\nThis is really recent.\nSuper recent.\nIt was like December of 2020 before they released this paper.\nYeah, it was super cool, and it just highlights how much we don't know, right?\nHow every... especially in paleoanthropology, and this is a field where, you know, people will take like... yeah, jewelerin... jeweleris lost species of humans with an abnormally large skull which lived alongside *Homo sapiens*.\nSo they died off somewhere... they lived in China between 300,000 and 50,000 years ago.\nYeah.\n\n\nAnd so if they were able to breed with humans, they probably did. And they probably bred with Neanderthals, and they probably bred with Denisovans because, you know, that's what we do. Wild stuff.\nYeah. Yeah. And then of course, the Hobbit people, the island of Flores people. Yeah. Flores, the little tiny. No one has still been able to get DNA from those samples. No, but I mean, so it's just bones. Someday it'll happen. We've tried. Um, Beth Shapiro's team has tried. A lot of people have attempted. It's just they're too degraded. They're from a hot place. All of those things that degrade DNA, they it happens faster and faster. That makes sense. Yeah. Um, there's probably a lot more to be discovered too. So much they only really found it out of one location, right?\nYes. Yeah. And one thing that um people have tested, actually, this again was work that my husband did, was whether the people who live there today, the Rampasa people, are related to them, and they're not. It seems like because they're small as well, and the question is, is there something weird about them? This is actually really cool. It was a really cool result. Um, there are It's hard to know exactly what bits of changes in your DNA code for making you big or small, but clearly it's not just one thing because there's not just people my size and people normal size. I'm only 5 ft tall, right? It's we have a big spectrum of so there's lots of different genes that are involved with this, but we we kind of have an idea of where those genes are in a genome and what they might be. And with these people who are all small, the idea, the hypothesis was that there was some new thing in their DNA that led to them being small. But it wasn't. They just are at the extreme of all the things we already know. Is it just island dwarfism? It's just, you know, small population on an island.\nYeah. Different alleles go to fixation. And yes, I mean, weird things happen on islands. Things like this. Elephants even. Elephants dwarfed. Yeah. But dodos. Dodos got bigger. And so do lizards. They dwarf or they get bigger. They get bigger. Yeah, like the Komodo.\nOh, yeah. That's one of the scariest animals. Creepiest animals. I I can't I'm so embarrassed to tell you how many times I've watched videos of them eating large animals whole, like cattle. Yeah, they eat sheep and monkeys. It's horrific. Why do we watch that? I don't know. You're like, is this going to happen? You know, you open up Instagram like, oh no. You see this poor goat and you see this slobbery. You can't help. You're like, I'm like, I'm going to watch. They're so gross. Their mouth is filled with botulism, and is that what kills them? The botulism? I think there's a venom as well. They think there's a lot of toxins in their mouth, and I think there's also a venom. I think they used to think it was just poison, just just botulism and just various bacteria. But now I believe they think it's a venom. I watched another horrible video where they would bite this buffalo. They just bite its hind quarters and then follow it while this the the venom is slowly like taking its running its toll through the body, and then eventually the poor buffalo gets to the point where it can't move, and they start eating it alive. I think I've seen that one. I do think I've seen that one. Nature is so rough.\nSo brutal to Komodo Island? No chance. Really? No. I remember um Sharon Stone's husband, I believe he was either a journalist or someone who owned a newspaper or something like that, and they went to see the Komodo dragons at the zoo. I think it was in San Francisco, and they took their shoes off when they enter into this Komodo dragon area to like not contaminate. And apparently, he had white socks on, and they decided that his foot looked delicious, and they bit him. Yeah. Yeah. It bit him. I don't know what happened with that. This was, you know, an ex-husband of hers back in the dis.\nMaybe that's what she planned. The ex I don't think she did. I think it was just one of those things where this guy just didn't know what he was getting into and shouldn't have had white socks on. Or it just it's just doing what a Komodo dragon does and biting whatever it can. I wouldn't have thought white socks.\nHere it is. Bronstein underwent surgery to reattach several thousand severed tendons and severed tendons hand to rebuild his big toe that was crushed by the dragon's jaws. Oh, it's just messing up. Yeah, it's just missing his face. Oh. Oh, tendons and Okay. Oh, he So, he was done was able to pry open the reptile's mouth and escape through a small feeding door in the cage while the zookeeper distracted the dragon. Oh my god. Wait, he was in the feeding cage? Yeah. Whoopsies.\nOh, they mistook his his white tennis shoes. That's what it was. It wasn't socks. So, this story is old. This story is from They had him take it off. It was his shoe. Oh, they had him remove his white sock. Yeah. Oh, it's a shoeless foot.\nOh, so they thought that his tennis shoes would look like the rats. Um, so they told him, \"Take your shoes off so they don't look like the rats.\" Instead, it looks like flesh. Oh my. Sorry. This This sounds like someone did a dumb thing. Like this is absolutely a lot of dumb things. What year was this, Jamie? uh 2001. Yeah.\nWell, bad decisions, bad outcomes. Yeah. Yeah. No, I'm not going to Komodo Island or in the feeding cage at a bad place. No, no. I'm not going to any of those places. No, no, no, no, no, no. I get it. I like I know what they are. I I can watch them through the cage. I'm good. I don't need the additional thrill. Right.\nBut there are places where there are big things like dodos that are amazing and probably not going to kill you. So sure, there's some stuff that won't kill you, like giraffes. Giraffes. I've been told that a giraffe is the dumbest animal that really Yeah. I I didn't know this, and I wouldn't have suspected it because they're so gorgeous, and you wouldn't think that something that gorgeous would be so dumb. But I have friends who Matt James, who's the Chief Animal Officer at Colossal, he's worked with at lots of different zoos throughout his career. And he's told me that there are multiple occasions where he has had to save a giraffe from accidentally killing itself because it's so dumb. Wow. Well, they're so kind that they let babies feed him.\nOh, really? Yeah. You know, just there's nothing going on. When my kids were little, you you could go to the San Diego Zoo, and you would give them lettuce, and little babies are allowed to hold up like a 2-year-old can hold up their arm, and this enormous tongue comes wrapping around that piece of lettuce, and they giggle and every but they trust them so much that they let little kids feed them. Like they set it up so people can feed these, and they seem so calm, doile. Yeah. Like they're just happy they're not getting eaten by lions.\nSounds a little dangerous to me though. If they're if they are genuinely stupid, will they accidentally at some point take that baby's hand? And then they have huge strong necks, right? Oh, yeah. They fight each other with their necks.\nSays they're kind of smart. Oh, really? But this is I don't know. The ability to make inferences based on statistical information has so far been tested only on animals having large brains in relation to their body size, like primates and parrots. They tested giraffes, despite having a smaller relative brain size, can rely on relative frequencies to predict sampling outcomes. They presented them with two transparent containers filled with different quantities of highly liked food and less preferred food. The experimenter covertly drew one piece of food from each container and let the giraffes choose between the two options. In the first task, we varied the quantity and relative frequency of the highly liked and less preferred food pieces. In the second task, we inserted a physical barrier in both containers. So, giraffes only had to take into account the upper part of the container when predicting the outcome. In both tasks, giraffe successfully selected the container more likely to provide highly liked food, integrating physical information to correctly predict sampling information. Huh. I I mean, cool. But I also trust a person who has tried to keep giraffes from killing themselves by doing dumb things to tell me that a giraffe isn't always making the best decisions. Perhaps they're intelligent for the environment they belong in. I'm sure that's true. I mean, otherwise, that's how evolution works. Yeah. But when you put them in the zoo, they're like, \"Look, grab all our food. What's there's a wire I can get my neck stuck in.\" You know, like a a kid that never leaves his parents' basement and plays Call of Duty till he's 35. You know, probably doesn't have like the best social intelligence. Probably not the probably going to be pretty awkward when you get him out in the wild. Probably. Yes. It's probably same thing with giraffes. Yeah.\nDid you hear that, James? Talking to my 15-year-old. Oh.\nPlay a lot of video games. They're very addictive. It's a real problem. And they're going to get worse. They're going to get way better, you know, as uh science makes things more and more addictive. Yeah. One of the things they're really good at, these designers and algorithms. Oh, yeah. But they're just so good at making games that are just incredibly compelling and fun. Yeah. Oh, so fun. Way more fun than going outside and getting bullied. Yeah. You know, that's the problem. And you know, you could be a badass in Call of Duty. All you're doing is sitting there.\nOr War Thunder. That's the game that my son is into. War Thunder. I don't know about that one. What's that one? It's about like planes and things that you build and then fight. I don't know. It's Yeah, pretty crazy stuff. Yeah, just imagine if you could take one of those Denisovans and show them that.\nThat is an interesting question. What would we do if we could bring a Neanderthal or a Denisovan back? De-extinct one of them. We are not doing that at Colossal. They're humans. We cannot ask them for consent to do this. We're not working on on them. You won't. But China's like, \"Tell me more.\"\nMaybe I think it's a bad idea, but if they do, I would like There's a lot of people that think bringing dire wolves back is a bad idea. Well, I mean, what did you think of the direwolves? Well, uh, fortunately, after the last podcast I did with Ben, I did actually get to go visit them, and I was blown away. It's extraordinary. It's so wild. I mean, it's one thing to see them in photographs, but it's another thing to be close to them where you're you're outside. There's no fence between you and them, and you look in their eyes, you're like, \"That is a different animal.\" That is a totally different I've seen wolves before. That is a totally different animal than I've never seen a wolf in the wild, though. I did. Well, I saw one, but it was like running across the road at a distance and it was dusk. Yeah, it was that was in Alberta. There's a lot of wolves up there. But that I've never seen I've never like looked in one's eyes, and it's like these aren't even that old, right? You know, they they were more than six months old, but they were almost 100 pounds already. Yeah. And they have this look in their eye like and you can see they're bigger. They're more muscular. And you see that that coat, the direwolf coat that it's extraordinary. The mane that they have. It's very it's it's really incredible. And then there's the little female, Kesi. Yes. She's adorable. And she is like a puppy right now. Did you were able to hold her? She's adorable. Yes. She nibbles on your fingers. She's a She's a little thing, but she's, you know, one day going to be 140 lbs. You can't get anywhere near her, right? Which is really crazy. Yeah. I'm glad you got to see the boys before. They were probably already a little bit standoffish. Yeah. Especially compared to Kazy. Yeah, they're standoffish. They they they get fairly close though within like 20 ft of you checking you out. They pee all over the place, you know, marking their territory. But it's just so strange to see an animal in the flesh that didn't exist uh you know for 10,000 years. It's amazing. I was there for Klesy's birth, and I people were asking me afterward, how did that feel? And I just you can't even describe it know this moment when she was born and then she screamed. She had this this cry this scream. I have it on my phone actually. I can play it for you. But it was just such a I don't know. It's it it it's this awe this um and I think this is one of the best things about the the extinction work and the species preservation work that Colossal is doing is that we live in such a crazy time. People don't often have an opportunity to feel genuine awe about something. And this is one of the things that people get about going out, going hunting, go get out and, you know, going and spending time in the woods or going and experiencing something that they wouldn't normally experience is is this this way to feel genuine wonder and excitement and enthusiasm and Kesi's birth. I wasn't there for the birth of the boys. I was in the UK at a conference and it was very sad and I had COVID and I was asleep and trying to recover. And the next morning I woke up and there were like 150 text messages on my phone from Ben going, \"What the [ __ ] are you doing? Where are you? Why are you not responding?\" And I'm like, \"Oh my god, I've missed this moment.\" So I made sure that I was there present for for Klesia. And I'm glad I was cuz what a what an\n\n\nAmazing. I'm glad you got to see them. I'm glad I got to see them, too. It's really a crazy experience. I felt very fortunate just to be in their presence and also very conflicted by it all. Like, this is so odd. Like, is this the beginning? Like, are we going to bring back everything? Like, would is that a good thing? Are things supposed to go extinct? Are we supposed to just bring back everything that's ever lived? At what point do we draw the line? You know, all these thoughts in my head, like, why are human beings the deciders of what lives and dies? Like, what are we do? We have an arrogance because of our relative intellect that we think that we should be able to make these kind of decisions and not understand the comprehensive effect that it has on the entire ecosystem. And we know what happens with invasive species. When invasive species come into new territories, they destroy everything. It's like Florida is amazing example of that, right? Florida is so crazy. It is. I mean, it is Florida. Yeah. You know, I mean, like, when you think of Florida, you think like Florida man. So the only state that you can say like the name of the state and then a man and everybody's like, \"What did he do?\" You know, like, but that's Florida ecologically. Yeah. Like the entire center of it, the Everglades, is infested with Burmese pythons. Yeah. Did you see that? There's a competition every year to go out and kill as many as they can. And there's a monetary reward for people who kill. I think it's the most or maybe the biggest. There's some something like this. And even that's not going to put a dent in. No, it doesn't at all. People kill and in during this competition, they kill hundreds, maybe thousands of these snakes, and it doesn't even touch them. Like, there's an estimate of a half a million. They think there might be a half a million there. And there's a guy that's been on this podcast for, he calls himself Python cowboy. He's uh, quite a character. And didn't he give us a head? We got a head laying around here, right? You got it over there. That python head. Um, but that dude, he has been catching them. He uses dogs. The dogs find where the nests are. And the video of these things, you know, you're pulling out this 15, 16, 17. I think he's got as big as like 18-foot-long snake. Wow. They're hundreds of pounds. They're enormous. They swallowed the deer. They eat alligators. They're eating alligators. Thank goodness, 'cause alligators are doing great. Like, that's one thing I don't mind them doing. We need to We need something that's haunting alligators. That's another problem in Florida. It's infested with alligators. And they used to be on the endangered species list. When I lived there, they were on the endangered species list. One of the class of 1967, right? The first species to be officially listed. Why did they list them? And how because they were almost gone at that point. How did they do that? Like, I can't imagine that you could do that now. That you could get them to the point of extinction now because they're so hard to find and they're everywhere. Maybe it was I don't I don't want to say they're so hard to find, but I mean, when they get in the water, Yeah. You know, like, you're not going to get all of them, like, how are you killing all of them? I was, you know, there's a show, I don't know where it's on, but it's a show that's called Florida Man. I was watching it on a flight the other day and seriously, and it goes through interactions with that Florida men have, and one of them is about a dude who was kind of lost in his life and he climbed over a fence that he shouldn't have climbed over and went for a swim in a lake and then had an alligator bit off his arm and that is the that's the story that's that particular, oh, I saw that guy in the news, that's the guy that like he had to walk like for a whole day with like one arm. I don't know. I remember there was a guy who what I I mean, I don't know. There's probably hundreds of stories like this, but in this video, and I was trying to sleep, so I'm probably wrong. In this video, he laid on the side of the lake, like probably bleeding to death, when an alligator that was in the shape of his mom, I think, came up to him and told him he had to get his ass up and move or he was going to die. And he was like, \"Okay, mom, I'll do that.\" It was I don't know. Oh, boy. He was probably not sober, I imagine. It was blood loss at that point. He was sure. And then also whatever contributed to making him climb that fence in the first place. I won't play the video, but there you go. Is that the dude? I mean, this is this is not the show she's watching is on Netflix, I think. This is a similar thing that did happen a month ago. Here's the video of it. The one that was the show that was about see, I don't want to see this dude lose his arm. The show was about something that happened years ago. If enough go for them to be able to make it, but yeah. I mean, how many people in Florida? Yeah. Right. I mean, it's Florida. They are huge. Yeah. Now they're in Georgia, too, right? Oh, they're in Texas. Yeah, Texas. They're here. Yeah, they they they find them and the golf courses in Florida. Like, good luck playing golf out there. Are you crazy? You're playing golf in Jurassic Park. There's I'm sure you've seen the videos. There's one amazing video of this huge alligator. It's like a 14-footer and it's walking across this golf course and it looks like a dinosaur because it's not walking like with its dragging its belly on the ground like they sometimes do. It's kind of puffed up. There it is. Look at that. Holy Oh my god. That's wild. That is so big. Look at the size of that thing. And you're out there playing golf. You're like, you see that guy and you know that they can run fast. Yeah. They run like 30 miles an hour. Yeah. And they run. Look at this dork. This dork can't run 10 miles an hour. Florida man. Yeah. That's totally a Florida man. Let me give me a selfie for the Facebook. He's get right up on that thing. And you know there's a lot of them there too. I mean, they say that pretty much any undisturbed body of water likely has an alligator in it now. So, what ate them? That's a good question. What? Back in the day, they probably just ate each other. You know, they cannibalize each other. Maybe they're going to do that, too. I mean, I'm sure they probably do. They probably have to at a certain point in time. And what are the snakes going to eat? Snakes have wiped out 90% of the mammals in the Everglades. And they're terrible for birds, too. Oh, yeah. For everything. Ground nesting birds, anything. Anything they get a hold of. I mean, and if there's a half a million of them, that is a killing population of extraordinary proportions. I mean, half a million things that could eat a deer, you know, they they there's no skunks left. There's everything. Raccoons, they're all gone. Yeah. Everything's missing. But this is exactly why we need these technologies that we're trying to develop at Colossal Biosciences. You know, we're we're we're sounds like a sales pitch, species preservation company. It is a sales pitch. But birds, it when I ever think about birds, I think of this, right? We know that there are things that we can do to help mammals to adapt to rapid changes in their habitat, right? We we can do things like um like the uh Florida panthers. You know, one of the things that we did to save Florida panthers from becoming extinct was we introduced panthers from Texas, which are the closest genetically and geographically to Florida panthers. They were probably connected at some point until humans created stuff that meant that they couldn't go back and forth. And when Texas panthers were introduced in the mid 1990s, that population recovered. They stopped. They had a um a disorder called crypto orchidism where their testicles wouldn't descend or only one would descend. They had all sorts of heart problems. They because there's a small breeding population because there were very few of them. And so no genetic diversity. The choice was to mate with your family. That's it.\nRight? And things want to survive, so they do. So you get these highly inbred populations and people fixed it by moving an animal from one population to another, introducing new genetic diversity. It's called genetic rescue, right? And that's a great way of bringing diversity back into a population. It's what we're trying to do with our red wolf project. So red wolves are one of the most endangered wolf species in the world. They're the only endemic American wolf and they are nearly extinct. There's a successful captive breeding program and a few years ago uh some of the people that we work with at Colossal, a woman called Bridget Bonhold, who's at Princeton, who's a friend of mine, she was working and discovered because people were sending her photos. See, this is why you have to pay attention to people who you think might be crazy when they send you pictures of things, you know, look at this cool crazy thing that I think I found, you shouldn't just discount it. I mean, I'm the person who has tested insulation that somebody told me Bigfoot peed on and participated in it because if it's real, I want to be the person who finds it. Right. Right. Yeah. So, Bridget says, \"This guy who lives down in the the the coast of Louisiana, sent her a picture of an animal that she's like, \"That is not a wolf and it is not a coyote and I don't know what it is and it's crazy.\" And she looked at it and she goes, \"Yeah, it's it's not it's something else. It's something in between those.\" And so she tested it and found that it has a ton of DNA ancestry from red wolves. And they're hybridized a little bit with coyotes, but all red wolves are hybridized a little bit with coyotes. Canids are always hybridizing with each other. We know that because you know there are wolves that are black because black gene for wolves got into the wolf population because a domestic dog had his way with a wolf in heat, right? That's how that alil got into that population. So we know canids do this all the time and she was like this is so cool because this captive breeding population was established with just a few founder individuals and the team working with them are doing a great job trying to maximize genetic diversity by picking who is going to pair with who to keep all that diversity there but it's still just a few individuals. So they are going to lose genetic diversity. It's just how it works. But if we can bring other individuals in from this population, that's a way of concentrating more diversity, better able to pick which parts are redwolf, either by breeding individuals or by editing their DNA, which is technology that we developed on the path to direwolf, right? Um, and we can actually help this population to survive. So there there are ways that we can do this for for mammals that are going to have really amazing consequences for the way we can protect biodiversity. Well, that's fascinating for things like red wolves and things like that. But what you know what do you like when you think of like the python problem in Florida? I heard the worst idea. The worst idea they were talking about introducing honey badgers. Honey badgers, 'cause they eat snakes. I mean, I don't know if this was a serious idea because we have never as a species, humans introduced a thing to try to control a thing and that thing that we introduced just went horribly wrong. We've never done that before, right? Australia. Right. Australia's a wreck. They have a terrible feral cat problem. Yeah. Yeah. And in in Hawaii, they have these giant African land snails that Oh, yeah. I heard of those. Yeah. That they introduced this thing called a a rosy wolf snail that they were going to get to eat the giant African land snails, but instead the rosy wolf snail prefers the taste of native endemic Hawaiian snails. And so the rosy wolf snail is leaving the giant snails alone. They're and they're big. Have you seen one of those? I don't think I have. A giant African land snail. It's worth looking at it. Did they come over on cargo ships or something? I think we I think people introduced them for some reason that I can't what it Yeah. So we have a good history of doing this kind of thing for giant esargo. Whoa. Right. Whoa. Are can they eat those? Are those delicious? I think people can eat them probably. But they eat everything from all of the vegetation to the other snails. Eyes of that to plaster, you know, that they'll eat their way through infrastructure that people have built. Yeah. Oh, great. Yeah. Oh, great. Yeah. So, we introduce these little things, rosy wolf snails, to try to control them, but instead they're killing all the the endemic snails. So, we never learn. Yeah. I hope they don't bring honey badgers to Florida, but I I you know, I don't even know if this article I was reading was a serious article, but it was just like that sounds like something that someone would, 'cause you know they have they're really good at killing snakes. Like that's what they like to do. They kill cobras and they have an unbelievably resilient body. Like they can tolerate getting bit by lions. I mean they're freaks. They're really weird animals like honey badgers and they just really cute, right? I remember when my kids were little watching the wild cats. There was a wild cats episode about honey badges. How they were all cute when they were babies because they were hiding in camouflage. Yeah. Yeah. Maybe when they're babies are cute. They're pretty ferocious. Yeah. Yeah. There's a lot of Wolverine. Wolverine. Yeah. Yeah. Very similar to Wolverines. Yeah. Like I think they're all in the same family, right? Yeah. There he is. Look at that face. I think they look very Look at that face. Just big old deadly snake. And that's his lunch. And they get bit all the time and they just like they get sick, pass out for a couple minutes, and then recover and kill a\n\n\nSnake. That's amazing. Yeah, they're ferocious little animals. So, have people been able to understand better antivenom properties from studying them? That's a really good. Look at that face. Yeah. Oh my god, he looks vicious. That is such a crazy animal. That pattern on the coat is really beautiful. Oh, they're wild looking. They're wild looking. I just hope they don't bring them into Florida because it sounds like someone's going to do it, you know, like that. It sounds like a Florida idea. Have you heard about the hippo solution in the early 20th century? No. So this is a great sort of American history story because, you know, this is our country is replete with people with brilliant ideas, right? And in the early 20th century, when the land in the west was not doing so well, been overgrazed, there were too many cattle, and there was this thing called the meat question. It was the thing of the day, the meat question. People were talking about how are we going to survive? There's not enough cattle. Um, how maybe we're going to have to eat our dogs. And at the same time, there was a problem in the Mississippi and other places where the, I think it was the World Fair people had brought New Orleans, who was the host city of the, I think in Japan, they brought New Orleans this um water hyacinth, this water little tiny beautiful flower to as a gift, and they loved it, and so they planted it everywhere, and it just grew like absolute crazy and was choking up the river, like ships couldn't get through because of this like matted river. People were like putting oil on it to get it to sink and trying to light it on fire, and nothing would happen. And this team of people that included a congressman from Louisiana came up with a solution for both problems at once. And that was that they were going to import hippos from Africa into Louisiana. Yeah. To live on the bayou. They would eat the plant, this water hyacinth thing, and then we could eat them. And that was going to be the perfect solution to both of these problems. Yeah. How did that get stopped? It was an accident. So, it was actually a fun story. You should look it up and read the whole story because it involved these two guys. Um, one of them was the guy who was the inspiration for the Boy Scouts of America, and another guy was like a con man who had worked as a pimp and a journalist and all these other things. And they had actually been employed during the Boer Wars to kill each other, but they came together on part of this congressman's team. The scout thought it was a great idea. He wanted people to bring in all sorts of animals from Africa and put them in national parks so that people would want to go to national parks because they could hunt them, and they could, and that would, you know, have more reason for people to want to support the idea of national parks at the time, which is great, like, you know, this utility of nature. It seems weird compared to how we think of it now, but I think this is really, it's really important, and it was a really important part of the way we got conservation legislation in the US. So he was excited about this. And then the congressman, when he was pulling together the team of people that he wanted to be on his side for this, he went to a show that this other guy, the sort of conman, traveling salesman, pimp, escape artist dude, was having about how he was an intrepid explorer. And he was like, \"That guy is an expert as well. He can also be on my team.\" And they testified in front of Congress, and they asked questions like, um, you know, \"How do you know that they're safe? How do you know that they're tame?\" This con man, he was like, \"Well, you know, um, there's plenty of evidence that you can even feed them from a baby's bottle with no evidence whatsoever.\" Right? Just everybody was like, \"Yeah, awesome.\" Even the New York Times was completely behind it. They published an editorial talking about, they called hippos lake cow bacon. Yeah. What year was this? This is the early 20th century. 1910.\nWow.\nLake cow bacon. Yeah. Everybody was like, \"This is it. This is what's going to solve the problem. Teddy Roosevelt was behind it, too. Teddy Roosevelt was behind it. Yeah. It was a bill all the way in Congress. It just didn't pass. Yeah. Well, it didn't, it didn't go up for a vote. How the US almost became a nation of hippo ranchers. Oh my god. Yeah. Failed House bill sought to increase the availability of low-cost meat by importing the hippopotamus that would be killed to make lake cow bacon. Yeah. It's brilliant. This is, I mean, this is such a. It's so funny, but it, it's not fair to call it failed because it didn't fail. It never came up for a vote. So they had testified in front of Congress too late for it to come up to a vote that year, and then just other [ __ ] happened, and people stopped paying attention. That's it. It just went away. Wow. Yeah. So near miss on the hippos. Well, they kill more people in Africa than any other mammal, right? Yeah. Yeah. Well, and now we know that they're good at becoming invasive. You saw there's hippos that live now in Colombia because of Pablo Escobar. Nobody knew what to do with them. Yeah. And they started off with just a handful of them, and now there's like dozens of them down there. And yes, what are they doing about that? Um, nothing. I think they keep rounding them up and putting them back on his property. Like, what can you do sometimes? How much property did he have up there? I don't know the answer to that. Yeah.\nIt's so crazy that you just have hippos, and then they just get loose, and now Colombia has hippos.\nHe took them there on purpose though, just like we wanted to bring them here. Can you imagine how bad that would be though? And I mean, well, that's the wild boars in the United States. That's William Randolph Hearst. William Randolph Hearst wanted wild pigs on his property. And so he imported them from, I think, from, I don't remember, it was Russia or somewhere in Europe. And then these wild pigs have now populated all through California. I mean, they're, they're all over the place now. Yeah, that's crazy. We did have wild pigs around the US at some point. Probably not the same thing, right? Weren't there wild pigs? There was also. That's a good question. I think they came over on boats with explorers, you know, and um, William Randolph Hearst. They all, the ones around like the Northern California area, I think all of those are the remnants of the William Randolph Hearst pigs. Yeah, they think we don't see them in Alaska, Yukon, where we find all these big, you know, stashes of bones coming out of permafrost. So, it's probably not that they came over like that. We find bison and horses and mostly bison. Like, where did the wild boars emanate from? Like, what's their original country of origin? I think, well, I have a friend who works on domestication of pigs, and they've published a bunch of different papers that are always contradicting each other. He gave a hilarious talk at a meeting I was at last week about how he keeps saying something different as a way of, you know, keeping to publish more papers. He, he was just being nice about how he's open to changing his mind with new data, which I think is a valued trait in a scientist. But yeah, so Southeast Asia or around Asia, I think is the origin or at least the domestication, and normally things are domesticated around where they were native. Well, they're the weirdest animal, right? Because the domestic ones will become, they change. They morph when they go feral really quickly. I think it's like they start within like six weeks. I mean, this is the way evolution works, right? You know, something has a particular suite of traits. I'm reading the testimony of the, when this was going on. This is the guy who presented this and the hippo thing. He's talking about pigs right here where they were going to bring them from northern Manchuria because of. Oh, were they the most delicious pigs? They're also talking about bringing in rhinos. I think they did bring in camels in like 1853. Oh, well, we had camels. There were North American camels that were here during the ice age. This is a bad test or something. This is all. This is like. This is 1853. They're talking about bringing antelopes in, and they asked like, are they easily tamed or domesticated? He's like, they're very easily tamed. That's Irwin. So, this is a guy who worked for um, the, I guess what became the USDA, but he was in charge of apples, but he was really dedicated to trying to solve this meat problem, and he saw importing African animals and animals from other places as the real solution to this. Yeah. Well, they've definitely done that in Texas. Texas is overrun with African animals. Well, all the private ranches, they're filled with elands and nilgai and the beast, and we used to have so many cool animals here that all went extinct at the end of the ice age. So why not? I mean, we had mammoths. Why shouldn't we have elephants? I know. But isn't it weird? But it's again, that's the same argument. Like, you're bringing an invasive species. Is it invasive though if it used to live here? Well, it's invasive in a sense that the wolves that are in Colorado right now that are eating all the cattle are kind of invasive.\nYeah. I mean, right. They're not invasive 'cause they do live. I mean, there are wolves actually just have moved into the San Juans. I think, I think documented like natural migration as opposed to the reintroduction. I think there was something I read about that yesterday. But the wolves that they've introduced to like outside of Aspen in particular, I have a friend who has a ranch out there, and I posted about it on Instagram. He actually sent me some more pictures yesterday. Uh, and I was going to post about it, but so much crazy stuff was happening in LA. I'm like, this is not the time to talk about like wolf problems, right? But the, they, they're just killing calves and eating their liver. this. They're not even that hungry. They're just eating the tasty parts and leaving these calves alone. And these people are on a 24-hour run ragged, you know, they, these, they have these teams of guys that have to patrol the area 24 hours a day to try to scare off the wolves, and they, they're not allowed to shoot them, and you know, they spent millions of dollars bringing them there, and they're just eating cattle. Yeah, I imagine it's really devastating to see something like that happening and know that somebody else made this decision and that you who actually experience it weren't. I mean, I, I imagine the people who voted for that, I, I wonder what, what they imagined. Well, it's ballot box biology, right? You get a bunch of people that live in the cities that don't have a lot of experience in in nature and wild ecosystems, and then you introduce this idea, we're going to bring wolves back to their native habitat. Oh, that sounds amazing. What they're not telling you is like this. What this rancher told me is that first of all, the original wolves that were introduced into Colorado were wolves that were taken from Oregon because these wolves were preying on cattle. Oh. So they had. So they already had a taste for. Exactly. And they already had habits. And so then they brought them into Colorado where they start praying on cattle. And so then they moved them from this area where they were praying on cattle and put them outside of Aspen where they pray on cattle. Start praying on cattle. It's, it's just stupid. And it's again, it's not biologists. It's not their idea. It's ballot box biology. And it's all being instigated by the uh, Colorado governor. Yeah. It's so important to actually talk to wildlife biologists and ecologists. I mean, we can see from Yellowstone how important having this keystone predator is in ecosystems where they can be and where there is space for them. But the land is not the same as everywhere as it is in Yellowstone. We need to be able to make, you know, I, when I was at Santa Cruz, I taught um, an introductory biology class for non-majors where my goal was to give the students tools to be able to think on their own, which is harder than you might imagine. Um, and their midterm exam was a debate, and the topic of the debate was that wolves should be introduced into California. Why not New York City? Let's go. Put them everywhere they used to be. I mean, this is where it gets silly. It's like when you're dealing with people that have cattle ranches, and this is their entire livelihood, and all they're doing now is just compensating them for the calves that get killed, and then so you have less output every year. So it's like the whole thing is crazy. They were already on their way to do a natural migration into Colorado, and it would have been different wolves. Yes, it would have been different size wolves too, because I think there's also like some of the wolves that are being introduced, u, they're introduced from British Columbia or they're being, you know, introduced from Alberta or somewhere up there, like, I think that was the ones that came into Yellowstone, like the Yellowstone thing is cool, right? There's, it's been a few decades now, people have kind of like come to this sort of equilibrium, you know, there was people recognized that there was an overpopulation of elk for sure. I mean, they, they used to have these hunting seasons where they would hunt them in the snow in the winter because there were so many of them. They wanted you to just be able to pick them out and just, just shoot them for meat because they really didn't have the resources because they didn't have the apex predators because a lion can only eat so many of them. So, mountain lions weren't really putting the dent in the population that a pack of intelligent hunting cooperative animals like wolves could do. So, they brought it back, and it's, you know, it's relatively successful. They've knocked the population of elk down more than 40%. But wow, that's probably good. Yeah. I mean, not for the people that hunt elk. They're really mad. But, you know, wolves are cool. It's cool to have them around. But Montana is very different than Aspen, right? It's very different, and you're in the mountains of Montana, and you see a wolf versus in someone's\n\n\nCattle ranch in Aspen, right? This, like, this is stupid. Like, why did you do this? But what's interesting, this class that I took, so be it, was a debate that I taught. Sorry, it was a debate, and what I made them do was assume roles of a rancher, a politician, a conservationist, and I had several different roles. Then, I randomly assigned whether they were pro or con, and they had a couple of weeks to figure out what their debate was going to be. I took a vote before the debate, and as you might expect for 18-year-olds in California, you say at the beginning, \"Should wolves be introduced?\" 100% yes. Right. Right. They do this debate, and I did it four years in a row, and every year after they had to do this, after they had to put themselves in somebody else's shoes and think about it from their perspective, it would shift, and the majority of people would be like, \"Yeah, no, it's a bad idea.\"\n\nI think if you give people the tools to be able to think, they can imagine themselves in a different scenario, and we need to do that. We need to be arming people with thoughtfulness rather than jumping to a conclusion. Yeah. And also, ballot box biology. It's like if you, but everybody's gonna vote. So, right. But you shouldn't be able to vote on things that you're not educated in. It's like if you allow people to vote on things that have tremendous consequences to the ecosystem, like a reintroduction of an apex predator, and they don't understand those consequences. They just have this very utopian idea of what it means to bring back wolves. Look, I love them. I think they're amazing animals. It's just like putting them in, you know, Calabasas is probably not the best idea, right? Putting them where people live, they're going to eat pets. They're gonna, they're going to eat a lot of things that are penned up, whether they're sheep or goats or whatever, whatever people have that they can get out easily. They're not going to chase down a herd of elk. That's hard. Well, they're biology, right? They're not. They're making decisions on where they can find their next meal.\n\nWe're, we're not planning on re-wilding direwolves, just to put that out there. I like that. Plus, you've met Klesi. I, I don't think she would be. I bet she will in a couple of years. Yeah, maybe. So, yeah. But right now, in a couple of years, she'll freak you out. She kind of freaks me out already when you look at her, but his eyes are so intense. They're so intense. You know, when you look into a predator's eyes, there's something about it. It's like you realize like, \"Oh my god, I'm like a water balloon. I'm so,\" you know, we're just like so weak and soft. And yeah, we've been putting together, not because we're, we're not going to release them. The next step for their lives is to study them and see, you know, how they're changed by their DNA being modified. Measure things like their gene expression, their growth, their health span, their lifespan. Learn the consequences of the work that we're doing. Learn how they interact with the habitat. Introduce Klesi to her brothers and the, the next animals that we make into that pack to make a small pack, but they will stay on that secure, expansive ecological preserve that you were. Yes. And you're not going to let them breed.\n\nNo, the plan is not to let them breed. How will you prevent them from breeding? Well, at the, at the moment, they're separated, but we'll probably use a subcutaneous, you know, you can put a, an, an, an hormonal contraceptive. Yes. Um, right. There's been some ideas of, of maybe. So, we don't want to castrate them, which would obviously be a way to stop it, but, um, because we want them to be able to reach their full size because we want to know what that would be, and we want them to be able to have the hormones to be able to do that. So, um, but they will be controlled. They're, they're, you know, we track them. There's cameras on them all the time. There's three separate layers of fencing to keep them in. We know exactly where they are. They, they couldn't get a splinter without a camera somewhere seeing it. And we know exactly what's going on with them. Um, so yeah, we, we'll... that sounds like a scene in Jurassic Park. We, we have a totally understanding that scene. Yes. Don't worry, we have cameras upon cameras. Oh, I was... Do I sound like the scientist? I kind of do, actually. I was in Maitius working. I'm a scientist. You don't. Jeff Goldblum was the scientist that got... I'm Henry Woo, right? I'm the chief scientist, right? So I, I'm a good guy for now. Right. Right. But he becomes a bad guy in the future, right? So, I'm looking forward to my evil transition. I'm not... We're not making d... We're not making dinosaurs, but you know, there were other cool animals that we have DNA for. We have, um... I, I heard you talking about the, the American cheetah. And so, I have, we have two high-quality genome sequences from American cheetah. Wow. We want them back to, to help with our, with our population problems.\n\nSo, let's, let's get to the criticisms because there's people that are saying that these are not direwolves. That what you've done is just manipulate the DNA of a grey wolf. They are direwolves because we have manipulated the DNA of grey wolves. We, we took direwolf genome sequences from animals, one animal that lived 72,000 years ago and one animal that lived 13,000 years ago, and we lined them up next to each other and figured out what it is that makes a direwolf a direwolf. And then we used the tools of genome engineering to bring those traits back in Romulus, Remus, and Klesi, that are three direwolves that are alive now. Um, and that has created these animals that you saw that are bigger and they're stronger and they have that direwolf coat. And that's a cool thing, too. That coat, the light coat color that you see, was something that we absolutely could not have known without the ancient DNA because no one has ever seen a direwolf. When we published a paper before I joined Colossal Biosciences many years ago that was about direwolf evolution, um, we had a paleo artist reconstruct what direwolves look like, and they made them red and or reddish brown, and that's because so many other animals seem to be ready brown, like mammoths are, Neanderthals seem to have had red hair, and so we thought, \"Sure, why not?\" We didn't know because we hadn't sequenced the part of their genome that we could use to see what color their coats were. But both of these two animals that we had higher coverage DNA from had, had gene variance in genes that are associated with pigmentation, how our coats, the, the hair color and eye color and things like that that suggested they had light-colored coats. And so we thought, \"That's cool. We'll have that as one of our key direwolf traits that we're bringing back.\"\n\nIs it possible that it's like other wolves where there's a variation, but you would only sequence the DNA of ones that had white? It's possible. Yeah. And I'm, I'm sure there were different colors, but it's interesting to me that two animals that lived so far apart from each other in time and geography would both have this light color coat. So maybe it wasn't that every direwolf had a light coat, but it must have been a predominant color in the population. What was the environment in which they lived? So if they lived 13,000 years ago, you're talking about the ice age, right? Do you think that that's why they had white hair? It's possible. Both of these animals were from the northern part of their range where it would have been colder. Um, they did live through previous interglacial periods 125,000 years ago. It was as warm as it is today or even warmer with predicted to be no ice at the poles. And also, we know direwolves were really common around the La Brea Tar Pits in Los Angeles. We haven't been able to get any DNA out of anything from La Brea. That would be an amazing discovery. The tar just destroys everything. Don't know if it destroys it or if it gets into the bone in a way that we can't get the DNA out. So somehow inhibiting the recover of, of the DNA. We'll get there. I mean, it someday we'll, we'll figure it out, and that's going to open up a lot of really cool... It kind of makes sense that, like, polar bears having that white color would... a polar bears actually have... it's clear, right? Yeah. They have their hair is long and, and it's clear in the end. That's why polar bears and... have you seen those pictures of bears in zoos where they look... polar bears in zoos where they look green? No. They get covered in moss. The... It grows in the, the hair is hollow. Whoa. And so if they're too wet and not cold enough, they can turn this like weird... Oh, they have mold inside their hair. Oh, wow.\n\nBut it just makes sense that them being that color would have an evolutionary advantage for hunting 'cause you're in something that's completely white. Yeah. And you don't see like a grizzly bear. You'd see like, \"Oh, look at that dark blob.\" Yeah. That's moving towards us. We did some work in my academic lab where we discovered that polar bears and brown bears hybridize with each other. Um, this is one of those funny stories about academia with a scarcity mindset there where we pub... we submit a grant proposal and we say, \"Hey, we have this really cool observation that polar bears and brown bears hybridized during the last ice age when they overlap with each other,\" and it gets rejected because they're like, \"That's dumb. We know that doesn't happen.\" And then we found another hybrid polar bear from the previous interglacial. And then there's evidence that they're hybridizing today. Go out and do this. Yeah. So whenever they overlap geographically, they breed. But what's interesting about this is that we always find the hybrids living like brown bears. Even though it's probably that the mom is a polar bear because a brown bear boy will wake up, you know, from hibernation and go out onto polar bear territory to scavenge for food. And a polar bear female is an induced ovulator. Um, whereas brown bear females are seasonal. So a, a polar bear female will ovulate in the presence of a male. So the male comes up to her and will mate her. The, the other way around. If a polar bear bear brown male had encountered a brown bear female, he's probably more likely to eat her than to mate her. Right. Oh, wow. And so, but that's weird then. So why do we always find the hybrids living with brown bears instead of living with polar bears? And the polar bear biologists who we've worked with, I've worked a lot time with Ian Stirling, who's a fantastic polar bear biologist from Canadian Wildlife, and he, his hypothesis is straightforward that they can't successfully hunt seals if they don't have that white fur. Ah, completely makes sense. It does, right? 'Cause they, they have that ability to swim, and they dive under the water, and they're also like really clever and how they use those ice shelves and swim from one ice shelf to another. Yeah. But they hide in... I mean, they even have those things where they cover their nose, the, with their hand, the black nose with their hand because the black nose... I know it's insane, right? Biology is cool. It is cool. It's cool like to think of like how they became successful doing that way. Who figured that out? How do they have the self-awareness to know that the end of their nose is dark and that other animals can see it? But they also hybridize just given the chance to do so, right? They'll, because biology doesn't recognize species concepts, right? Biology doesn't care that that animal's called a brown bear by us and that animal's called a polar bear. They run into each other. They're like, \"Cool.\" Just like our Neanderthal ancestors, right? Are those hybrids are, are they, are they fertile? Can, can they have babies? Yeah. This is actually how we discovered it because we found that the place where brown bears hybridized with polar bears during the last ice age was probably the ABC islands off the coast of Alaska because the ice was that far south at the peak of the last ice age. And brown bear boys would move onto the islands as the habitat got better where they encountered these populations of polar bears that had been stranded there as the ice receded pretty much. And so they hybridized there. And all brown bears in North America today have ancestry from that admixture with polar bears. Geez. Wow. That's so fascinating. Yeah. It's just like how we all have ancestry from mixing with Neanderthals. And is that from the German zoo because there's a, a couple of bears at it. I really looks like a hybrid, doesn't it? Yeah. It looks like there's a lot of traits of both of them. Yeah. It's impressive. Bears are some of the most fascinating animals ever. Paws. Yeah.\n\nIt's just an incredible animal. Um, so that's it's really... I'm really glad you said it that way that nature doesn't know that there's a polar bear and a brown bear. Why would it? Right. It's just our definitions. Is this part of the problem with the criticism of this science is that we are being very specific about what we're calling these things based on our own definitions that we've all agreed upon. Yeah. But that the true nature of genes is that there's this like proliferation and fluctuation and all these animals breed with each other, and it's like, it's kind of that, but it's also that we haven't agreed, right? So there's this group of academic scientists who are trying to say, trying to grasp so tightly to this very precise definition of a species as having to do with DNA, how much DNA matches something else. But that is, and it's interesting. I think the reason that we keep having this conversation is because it's genuinely interesting to talk about species concepts. We have come up with, you know, dozens of different species concepts, and they're all for a particular purpose. You know, if I am wanting to have a conversation about dinosaur fossils or anything that's a fossil, I'm going to use the morphological species concept because that's all I've got. I'm gonna compare the shape of this bone with the shape of this bone. And if they're similar enough to my trained eye, I'm gonna call that a, a species. I saw you had a Bison priscus. I'm going to say skull out there. This is that's from the, from, that's from the boneyard.\n\n\nYeah. Step bison. Yeah. Step bison. Bison priscus\nor bison crassicornis, bison\noccidentalis, bison aliscansis, bison. I\ncould go on forever. You know, this is\nwhere the naming of bison was like sport\nin the, you know, 18th, 19th century, mostly\n19th century. Did you go to the bone lab,\nthe boneyard? I haven't. I've been to his.\nI didn't go with Ben, but I've been\nworking up in that part of the world for\n30 years. We, we spend a lot of time\nworking at gold mines outside of Dawson\nCity. Have you been to Dawson City?\nNo. It's amazing. Like, it's an old-timey\ngold town. Dirt roads, wooden sidewalks.\nLike, the buildings are all crooked\nbecause the fire burned at one\nend, and it melts the permafrost\nunderneath, and it goes. It's where I\nlearned what you're supposed to do when\na fight breaks out in the bar that\nyou've gone into. What are you supposed\nto do? Grab your beer. Back up. Right.\nNo. Get out of there. Otherwise, your\nbeer's going to get knocked over. I'm\nnot leaving. You're not leaving when a\nfight breaks out, not in Dawson City.\nThere's mosquitoes outside. No, it's, I\nwould tell you to leave.\nIt's a weird place. They, unless they're\nwomen. Women fighting don't scare me as\nmuch as men fighting. But then women can\npull out guns. That's true. But this is, it's\nCanada, so less likely for that to\nhappen than in Alaska. But this is, there\nhave been weird things happen there. And\nyou know, there's, um, you go out to the\nbars in Dawson City. I'm, why am I\ntelling these stories? This is\nridiculous. You go to the bars in Dawson\nCity, and they still have this thing\nwhere there's the bell. And if you ring\nthe bell, the person who's ringing the bell\nis buying a round for everybody who's in\nthe bar, and you learn after you've been\nthere for a while that a person is only\nringing that bell because he wants the\nright to talk to everybody who's in\nthere because he wants to fight with\nsomebody, right? This is somebody who's\nlike a diamond driller who's just got\npaid in cash for the first time, and he's\nlike, \"Now I want to [ __ ] somebody up.\"\nRight? So he comes in, really that's\nwhat they want to do when they get paid,\nrings a bell, and then goes from table to\ntable sitting around with people, and we,\nthe like nerdy scientist paleo\ngeneticists sitting in the corner are\ntrying to just be super nice Canadians,\nlike talking to these people, like, I\ndon't want to fight, you know, and he's\njust looking to fight with someone, just\nyeah, just looking to fight, boy. Yeah, it's\na weird part of the world. It's, it's, it's\na fun place to work, but anyway, I, I\ndigress. There's gold mines like that,\nlike the site outside Fairbanks that are\nsuper productive like this, and every one\nof the miners out there has like this\ncool collection. Not any nearly as cool\nas his, but, but because he's got so much\nland, they've been collecting it for\nsuch a long time. Um, and I heard these\nthose great stories about how he donated\nmaterial to the American Museum. Well,\nit was previous owners of his property,\nright? Uh, cuz. Right. That's the case,\nright? And they dumped it in the East\nRiver. And so they denied dumping it in\nthe East River. So then they hired these\nguys to go and dive for it. And John\nReeves told everybody where it was. I\ndon't know if he hired him or just told\nhim, but so these guys, uh, dove into the\nEast River. They found step bison,\nbones, jaw fragments, all sorts of\ndifferent. Do you know what I think is\ngreat about that story? I really like\nit, right? Because I'm sure it's true\nbecause they have so much of that\nmaterial at the American Museum. When I\nstarted working on bison, and I've\nworked on bison for 30 years, right?\nWhen I started working on bison, getting\nback to the species concept, I was\ntrying to figure out if the DNA mapped\nto these species names. And they've got\na fantastic collection at the AM&H, but\na lot of it is crap. You know, there's\nso much bone there, broken pieces or\nother pieces, and you get to the point\nwhere you're like, \"What the hell am I\ngoing to do with this?\" Now, they\nshouldn't have dumped it in the river.\nObviously, that's dumb. But he is going\nto get the last laugh. He won't know\nbecause he'll be long dead. But in\n10,000 years, when the paleontologists\nof the future are looking in that river,\nthey're going to be like, \"What the\nfuck?\" Right? Cuz there's like tons of\nit out there, apparently. What happened\nhere? They found, what is that guy's\nname? Dirty Water Dawn, is that his\nname? This one guy who's one of the\ndivers, he's found multiple pieces.\nYeah, I'm sure it's there. Like, and\nthey probably didn't mean anything\nterrible by it. They were just, who\nknows? Those people aren't even around\nanymore. I think this was in the 20s,\nwasn't it? Probably around the 50s. That\nwas when the most of the collection came\nfrom. There was a ton of gold mining\nactivity in the 50s and 60s around\nFairbanks. So, what they have found on\nJohn's property that's so spectacular is\nthat it's really only a few acres that\nhe's getting all this stuff from, which\nmakes you question like how did all\nthese animals die off in mass in this\nvery small area. Yeah. Where you, you've\ngot warehouses filled with bones and\ntusks and. Yeah. Near Dawson, in it's\ncalled the Klondike region, you have\nthis really fine glacial silt, and that\nsettles in different places in, in\ndifferent quantities, and it settles\nreally quickly. So you get this really\nfast, thick buildup of this really fine\nsilt that preserves the bones really\nwell. So when we go, the gold miners are\nthey're plaster mining. So they're\ntaking these high-pressure water hoses\nand washing away this frozen dirt. Then\nthey let it thaw for a bit, and then they\nwash away the next layer. They're trying\nto get to the gold-bearing gravel that's\nunderneath. But while they're doing\nthat, literally thousands, tens of\nthousands of bones come out of there.\nAnd in some places there's it's more\nrich, more intense than others, but it's\nthere. I've taken students up there, and\nthey're all, you know, mopey because of\nthe mosquitoes, and, you know, they're\nmopey because they're 19, and they're\nlike, \"Oh, we're never gonna find\nanything.\" They jump out of the trucks,\nand they're like, \"Holy [ __ ] is that a\nmammoth tooth?\" Like, \"Yeah, that's a\nmammoth tooth.\" Yeah. Yeah. Is that what\nyou brought? That's what I brought you.\nYeah. This is a. It's a fossil. This is\nfrom South Carolina. But wow. That's\nfrom South Carolina, and it's a fossil.\nYou can see it's a fossil. I know they\nmake knife handles out of this stuff,\nwhich seems to me it's kind of gross.\nYeah, that has, um, oh, it has your logo\non it. Of course, it's branded. It's\ncolossal, you know. Um. Yeah, it's our\nlogo. Wow. But yeah, mammoths. It. Do you\nknow the story about, um, our founding\nfathers and mammoths? No.\nYeah. So, Thomas Jefferson was obsessed\nwith mammoths. Yeah. How did he even\nknow about them? So they were, there were,\nit's probably mastodons because it was\nthese teeth that were melting out of the\nsalt lakes and things like that in, in\nthe part of the United States. But he\nwas, he was obsessed with them. He was\ngetting his friends to to mail him teeth\nthat he was finding. And he was, um, this\nis, this is a funny story. Let me see if\nI can get it right. You should look this\nup too because it's hilarious. Um, how\nmammoths made America great before, and\nnow when we bring our mammoth back,\nwe're going to do it again. So, uh,\nthere was a guy in, in France who was\nwriting a series of books. He was like\nCompon,\nI think, was his name. I'm terrible with\nFrench, so I probably did it wrong, but\nhe was writing a series of books and\nabout natural history. And the fifth, I\nthink, of his books was called, uh, the\ntheory of American degeneracy, and when\nit was essentially about how all\nAmerican animals were more [ __ ] than\nanimals from everywhere else in the\nworld. And it was during the war of\nindependence. And so it was really\npopular to hate on American stuff,\nright? Really. And so, so he couldn't\nhave pissed off Thomas Jefferson more if\nhe'd tried. He didn't know anything\nabout Thomas Jefferson. He was busy\nfighting with Lanaeus. And Lanaeus was\nbusy classifying things. And this guy\nwas like, there's no more than 200\nspecies of animals anywhere. So why\nwould you bother with that sort of\nacademic silliness rather than think\nabout like how the animals got this way\nin the first place? In his mind, like\ndiscovering why American animals were so\n[ __ ] was the right way to be spending\nyour time as a natural historian. But\nthis pissed Teddy Roosevelt off. And so\nhe was trying to figure out how he could\nprove to this guy that American animals\nwere actually better, bigger. So he was\ngetting his friends to compile lists of\nthings about like how American bears are\nbigger than European bears. American\nwolves are bigger than European wolves.\nThat it isn't that, you know, you come to\nAmerica like this guy said, and you get,\nyou suddenly get weaker and your blood\ngets watery. That was what he thought.\nThat's what he, and it was really, it was\na bestseller, apparently. That's\nincredible. So they thought like living\nunder oppression was really good for\nyou.\nIt's like strength training. They were\nprobably imagining, I guess when people\ncame over, they did, there were new\ndiseases. They probably did get sick, and\nso there was probably something in it.\nBut so Jefferson went so far as he had,\num, he had a moose sent to this guy's\nhouse on his doorstep, but it was like\npartly rotten when he'd gotten there, and\nsomebody put the wrong, you know,\nantlers on its head. It was just like\nreally dumb. But his, his main feature\nwas mammoths that he knew that this\nanimal, he didn't think they were extinct\nat the time, and nobody really knew about\nthe idea of extinction. He was convinced\nthat Louis and Clark were going to\nfind them, that people were going to\nfind these mammoths still there. That\nwas going to prove. Isn't that\nincredible when you just think that just\na few hundred years ago that was the\npinnacle of science? That was like the\npeak of understanding of all the species\nthat were still alive. We really didn't\nknow. What I don't understand about this\nis how a person who is a scientist can\nlook at how everything has changed in a\ncouple hundred years or in 20 years when\nit comes to genetics and still say, \"Oh,\nwe know everything.\" Like, I'm right.\nLike I think it's what you were saying\nearlier. It's a famine mentality. Yeah.\nIt's just weak people's minds. There's,\nand there's weak human beings out there.\nThe way they think is a very weak way of\nthinking, and they want all the attention\nfor themselves, and they're very\negotistical, and it's also very supported\nby academia. There's a lot of [ __ ]\ninfighting in academia. It's really\ngross. Late 18th century, the idea of\nextinction was only just beginning to be\npopularized by some thinkers. George\nKovier. His Kovier. Yeah. Jefferson\nwasn't among the believers. In a\npre-Darwinian age, extinction was a\nviolation of religious ideals. God would\nnot let animals go extinct and secular\nideas. The balance of nature could never\nbe so significantly upset. So for\nJefferson in particular, extinction was\njust an unusual theory. It's fine. The\nbones exist, he wrote. Therefore, the\nanimal has existed. The mo movements of\nnature are in a never-ending circle.\nWell, that would, that's the real\nquestion. Like, there have been animals\nthat went extinct and then came back,\nright? The direwolf, right? But that was\nbecause of you guys. Wasn't there like a\nbird that they thought was extinct and\nthen returned? Then they didn't go\nextinct, right? Right. Like sort of like\nthe Tasmanian tiger. They just became or\nBigfoot. Oh, no. Tasmanian tiger was\ndefinitely real. But some scene, but\nBigfoot was real. It was\nGigantoopythecus. They think that that\nwas real. But Giganopycus is really old,\nright? But and but and would have\nchanged until today. I mean, I told you\nI have tested. People send me all kind\nof crazy things. The, the insulation was\nwas one of my favorites. This is\nsomething that I got while I was still\ndoing my PhD. People would send us all\nsorts of crazy things. They sent you\ninsulation. They said it's Bigfoot fur.\nYeah. It was from a guy somewhere. No,\nno, no, no, no. They didn't say it was\nfur. No, it was better than that. It was\nYeah. He, um, it was from somewhere in the\nCarolinas. I can't remember where. And\nhe'd sent a letter, and it was a\nhandwritten letter on his personal\nstationary which had a naked girl\ndancing around a pole, which gave him\nobviously more credibility.\nThat's his stationary. He's emailing you\nfrom his strip club. It was, it was a\nwritten letter. A letter from his strip\nclub. Sorry. Everything's an email to me\nnow. It's a while ago. And he sent, um, a\ncouple of cutings of insulation from his\nbasement telling me that the family of\nBigfoots that lived in his basement he\nhad seen urinating on this insulation.\nAnd so if I was going to get Bigfoot\nDNA, it was going to be from, from that\ninsulation. Oh boy. Did you test it? Of\ncourse I did. You really did? What? I\nwould tested him for meth. I said, I'll\ntest something. Let me, let me find out\nwhat you're doing, dude. You're Bigfoot\npeas in your basement. I didn't, I didn't\nget any Gigantopithecus DNA. It was,\nthere was some human DNA on it. So what\nwas the year that Gigantopithecus we\nbelieve went extinct? Like, so the bones\nwere found in an apothecary shop in\nChina in the early 20th century, right?\nI don't, I don't actually know. Um, I\nthink\nmillions of years old. I think the story\nis that an anthropologist was in an\napothecary shop in China and found the\nbones. I think this was in, I think it\nwas in the early 20th century. And I\nthink he said, \"Uh, where'd you get\nthis?\" Like he's got giant primate\n\n\nTeeth. And they, they took him to the place, and they found jawbones that indicated it was bipedal. And then they started like digging and discovering. I don't think they have a full skeleton.\n\nOh, it's so cool. Well, most things from paleoanthropology are, you know, I'm going to rewrite human history because I found a partial jawbone with three born teeth. Here's the problem, right? Um, you could tell me whether this is correct. Most things will never be fossils. Right. Right. So, we don't even know how many species existed and never left a fossil, right? Because fossils are hard to make, right? So, we're essentially getting the tiniest little bits of information, and we're trying to piece together this understanding of millions and millions and millions of years of creatures on this earth. And to do so arrogantly seems so crazy, right? To be arrogant about something that has, just by the nature of its existence, how do you find it? It's a very limited resource, right?\n\nThis is one of the super fun things about ancient DNA, right? So, I think, I don't know, remember who it was who said this, but um, we don't have any idea if your bone, you paleoanthropologists, if your bone has descendants, but I know that my DNA has ancestors. So, I can learn a ton by sequencing the DNA from the people that are around. And if I am lucky enough to get it from these bones that I know is real about human history and paleoanthropologists and archaeologists in the beginning of ancient DNA hated it because it was going in and going, \"Oh no, turns out you were wrong about that.\" Yeah. Oh, Neanderthals and humans didn't interbreed. Oh, turns out you were wrong about that. Oh, I remember them teaching us that in high school based on what data though? I know. But that's the thing is they taught it so arrogantly. Did people breed with Neanderthals? Nope. That was impossible that they would say it so arrogantly. This is just high school teachers, and now we know that they did, and we've been able to learn so many cool things about humans from studying this Neanderthal genome.\n\nI, I mean, I know people get hung up on DNA and how you need lots of DNA to define a species, but we have been able now to look. I think one of the coolest things that we've learned from the Neanderthal genome is that we all know that we have somewhere between, you know, two and 5% Neanderthal DNA in our genomes. We kind of get that now. You can get your DNA tested at one of these DNA testing places, and they'll even tell you how much Neanderthal you are. So you can have a competition with your brother and your cousins, right? I'm more Neanderthal than you. I'm amazing. Have you seen my forehead?\n\nLess well-known though is that we all have a different two to 5% Neanderthal DNA. And if you were to go around the world and collect all of the Neanderthal DNA sequences that are in people alive today, we could put together like 93% of the Neanderthal genome. Wow. That's cool, right? So that's crazy. Two questions then. Are they actually extinct? If we can put together 93% of their genome by pulling together people who are alive today, that's just a, you know, fun philosophical question. Second is, what the hell is going on in that other 7%, right? And if we want to know what it is that makes us human, that's where we look, right? That's where we ask what are the mutations that arose since we split from Neanderthals that if a baby got that part of the Neanderthal DNA, it didn't survive. It couldn't make it as a human. That is the bit that is important to define us. We've actually been able to narrow that down. There's less than a hundred genes, we think less than a hundred mutations in genes now that have evolved since that split that most people that are alive today have. And that is what makes us human.\n\nI think I, I'm still fixated on what you said earlier because I think it's so important that we decided what these animals were. We gave them these very specific names, right? And that genes in nature, they don't care what we're saying. They, it doesn't, there's this weird thing that's happening from the time we were proto-hominids to what we are today. It makes sense though. We, we want to have a conversation, right? And if we want to talk about something, we have to call it something, right? Australopithecus, right? So, we have species concepts that we designed that allow us to have a conversation and know what we're talking about. So, when I talk about and I call this fossil a name, you and I know that we're having that same conversation. If I am in charge of delineating species because I'm trying to figure out which uh, which agency has, you know, is going to care to care for this endangered species, I might use geography to figure out what one species is and what another species is. The species concept that we learn when we take our introductory biology course is a species concept that was developed in the middle part of the 20th century called the biological species concept, which says you're a species if you can breed and if your offspring are fertile, right? But we know that lots of things violate that. Brown bears and polar bears, we just talked about how they're hybrids. Humans and Neanderthals violate that. Um, cattle and bison violate that to a way less of an extent than we thought that they did.\n\nThis is actually a cool story that I, that I do. You know what a buffalo is? Yes. Yeah. Yeah. Is it the female cow and the male bison or vice versa? No. A buffalo is a breed of hybrid that is 5/8 cattle and 3/8 bison that is supposedly has better meat. Do they do it on purpose? Yes. It was one of these breeds that they tried to make. But does it work both ways? Does it work with a male bison and a female cow or a male bull and a female bison? Does it work both ways? Barely works at all. Oh, do they do it artificially or do they have them party together? No, this No, they just lied. Oh, yes. It's fake. It's not real. Oh my goodness. So, I've always, I've spent a lot of time being interested in this sort of admixture history, and so I was interested in brown bears and polar bears and humans in the ends and and what is it that suddenly makes a species not able to breed with another species? What is it that causes that sort of last wall to go up and then suddenly you're the biological species? Yeah. What exactly is it? Can we figure it out? And so I wanted to look at these different species pairs. And we knew about buffalo because people have, you know, buffalo ranches that you, there's a buffalo of the week. You should look that up because because this is going to be like there's a buffalo of the week competition where you see these animals. Anyway, so people in the early 20th century decided that they wanted to make hybrid cattle and bison because they wanted animals that were as robust in the North American prairies as bison, but as tame and easy to deal with as cattle. They started breeding them together and we're just like, this isn't working. You know, this is really hard. When we get the F1s, that's first generation hybrids, often it's only the females and they're not reproductive. You know, there's problems here. We can't, can't do this. And um, because the Yeah. And and so then people kept trying to do it because they really wanted to do this. And then there was this guy called uh, I can't remember the name of the person who actually did it, uh, who claimed that he had been able to create this animal that was 3/8 bison and 5/8s cattle. And he sold his animal to a guy called Bud Basolo in California who created this herd of 5,000 buffalo. And it was announced with great fanfare like front pages of newspapers. He sold one animal to a farmer in Canada for $2.5 million in 1975. It's still the most expensive single animal that has ever been sold, right? $2 and a half million in 1975 for this animal. And so we have this thing. I was like, we're going to sample them. We were working with uh, collaborators from the USDA. We were reaching out to people um, reaching out to ranches and saying, \"Can we have a piece of your piece of some of your stuff?\" And they were like, \"Not sure about research on this.\" And so we started buying tongues because if you buy steak, you just get the same animal over and over again, but they all have one tongue. So you can just buy tongues and then you get lots of different animals. We sequence their genomes, and then we got from the USDA their expired sperm straws that they have for the animals that they, they give away to start your beef thing. We sequence their genomes as well, including this $2 and a half million dollar 1975 individual. And we've done a lot of work on bison and cattle throughout the last, you know, 30 years of my life. And so we have this big plot that shows bison on one side and cattle on the other. And we had made a hybrid so we could sequence their genomes. He wasn't born. It was an aborted animal because, you know, it's very hard to make a hybrid. He fell right in between them in the middle where you would expect them to be. So now we know exactly where we think our buffalo should be. You know, they're 5/8 cattle, 3/8 bison. They should fall out closer to cattle, but still up here. And so you plot them, and they're all just cattle 100%. They're just cattle. It was fake.\n\nSo did they use like Highland cattle or something like that that have those crazy furs? There's some evidence that they used zebu. So it's a, that's a different type of cattle. It's the one that came from Asia. They have them in Brazil because they have a hump. So it makes it look a little bit more like bison. Oh. But if you look at it, if you look at the pictures of the buffalo of the week, you look at them and you're like, \"Yeah, those are cattle. Let me see a buffalo.\"\n\nJamie, when I did the beef of the week, I was went down a weird path, so I just kind of Oh, boy. Wrong websites. No, I just didn't, it didn't seem like I was on the same path.\n\nWhen was this all discovered that these are just cattle? Oh, just look up buffalo, and then you look at historic buffalo. You can see the pictures of historic buffalo.\n\nYeah. When was it discovered that that these are just cattle? Um, we just published the paper like a few months ago. Oh, no. So, this poor dude from 1975 that spent 2 million bucks. Yeah. And he sold it back to Pollo for some of the money getting back. I mean, I think there was a thing going on there. So, these people are out here still selling buffalo. Like, it's real. Like, this is a website, and they're hybrid with something. They're mixed with a little bit of zebu. Um, some of them have a little bit of bison in them, but this is a, they're just cows. Yeah. Interesting. Yeah. I talked to Steve Vanella about this. I know that he's, he's a friend of He was like, \"That's hilarious.\" It is hilarious. It's very funny. It does look different than a regular cow, though. A little bit. I mean, they were trying to do that, right? And we can, we can engineer everything. It doesn't, a Chihuahua looks different from a Great Dane, but their DNA has a lot the same.\n\nSo, in 1975, how much of an understanding of this stuff did we have? Did these people think that they were doing this or was it just a scam? I think it, well, this is me speculating at this point. I think he had to know, right? And there was at one point there was a test, a blood test that they had done where they were looking for markers in the blood, and there were five different markers, and they tested about 150 different animals, and they published a paper saying, oh, look, we tested all these animals. None of them have all of the markers. One of them has one of the markers, and we just think the test is bad. Oh, no. Just boy. Yeah. Fun. Anyway, I digress. I don't remember what we were talking about.\n\nWell, we're just talking about a bunch of different animals that used to exist. You know, we were talking about uh, Gigantopithecus at one point in time. You said it's really old. Was it a 100,000 years ago? They speculate the age of them. Older, older. Yeah. I, I don't know. Maybe two, two million to approximately 3 to 200,000 years ago. Okay. So, as recently as 200,000 years ago. Do you like kind of homo sapiens are like 300, 400,000 years diverge from Neanderthals, is that like around that time? Yeah. So it is possible that at one point, and and so this is just a very limited amount of bones, right? It's just limited just like everything else in in paleoanthropology. So it's possible that they existed later than that. We just haven't found those samples yet. Maybe just really cool.\n\nThis is just about how we don't know anything. Um, we can actually get DNA directly from sediments. And this has been a relatively recent revelation. It's super cool because it means that you can take a plug of dirt from the inside of a lake, and you can reconstruct the whole ecosystem as it changes over time. Super cool, right? Wow. But recently there was a paper that was published by some colleagues of mine that had done this for sites in Canada, and they found mammoth DNA and horse DNA in Canada in these really well-preserved parts of the world where we've been working that date to probably around 4,000, 5,000 years ago. Horse DNA? Yes. In that's weird, right? Because they're supposed to be extinct in North America when 10,000 around the last, but you know, there are a lot of Native American cultures who believe that they have a long history of the horse, and that the horses survived, and it's, it's just dismissed because we don't have evidence for it, but until we find DNA directly in dirt. I mean, this is just showing us how much we don't know, how much we have to be really willing to, you know, obviously we have a model of the way the world works, and we don't just throw away the model with new data, but we have to incorporate the new data, right? You can't be arrogant about the model, so the model is, if you correct me if I'm wrong, that h\n\n\nHorses evolved in North America, but it went to other continents, but then eventually died off in North America, but survived elsewhere. Yeah. Eohippus, the very first horses, are from 50 million years ago. They're found in Wyoming. We, the fossil deposits in Wyoming. Those are the little cat house cat-sized horses. House cat-sized horses. Yeah. But you know, this is early horses around the same time as we have the first primates and the first of the other things that we know. That's so fascinating. It's so cool. So fascinating. Well, this, we were talking about this the other day, the the big debate that happened with Clovis first, that they used to think that human beings, they came over here at a very specific time, and then they found those footprints in White Sands, New Mexico, and they're like, \"Okay, we got to rethink this, and we're being forced to rethink this.\" And it was another time where archaeologists were horrible to each other. These scientists were horrible to each other because they attacked the guy who made the discovery. They said, \"This is nonsense. This is impossible. We know,\" which is the this arrogance. Yeah. They did that to Zakamar, who discovered the bones in Alaska and northern Canada that had cut marks on them that were older than the accepted time of when humans could be there. And you know, now everybody accepts that as it's true. We know that they can. It's so gross. It's so gross. And they keep doing it over and over and over again. So then the question is, okay, if we have 22,000-year-old footprints, how many thousands of years were they here before that? Like, were they always been here? How'd they get here? Like, what's the earliest known humans? You know, we, we know that there's no Neanderthals here so far. So far, so far, there's no Denisovans, but you imagine they found a different kind of human. Wasn't there something that came up where they found some human that lived... God, I want to say 6,000 years ago and his DNA is different? This is like very recent, different than anybody that they've ever discovered before. So they're like, \"Okay, well, that would be interesting.\" I think this is like super recent, like yesterday or the day before. But it's just these things keep, they keep finding new stuff. Here it is. 6,000-year-old skeletons, uh, with never-before-seen DNA rewrites human history. Huh. Yeah. So this was just June 7th. Yeah. I don't know anything about this. Yeah. They uncovered 6,000-year-old skeletons in Colombia that belong to a mysterious group of people that could rewrite human history. It doesn't match any of the other known indigenous populations. Their genetic signature reveals a distinct, now extinct lineage that may have descended from the earliest humans to reach South America. One that diverged early and remained genetically isolated for thousands of years. Yeah, this is, I mean, I have no doubt that this is true. I mean, how many of these human settlements are gone now and so we don't have any evidence of them? And they're all lineages that they all go back to humans originating in Africa at some point, but we haven't seen all of them. We haven't seen all of the pattern. We don't know even what questions we should be asking. You know what? You guys really need to try to bring back those little tridactyl skeletons they find in Peru. You... That's like when we had Luke Caverns on and Jesse, when we had Jesse Michaels on the other day, who has an amazing YouTube show. Both of them great guys. Uh, they were showing us these skeletons that they found in Peru that are very bizarre. And people initially thought they were a hoax, but then they found these newer ones that they've discovered that they have three fingers and three toes. They've done cat scans on these things, and they seem to be human or humanlike these things. Yeah, I've seen of these. They're amazing. Well, like I thought 100% horseshit when I first saw them, 'cause I think some of them are horseshit. Yeah. But then when they've done like, look at that image below where they do like x-rays of them, like, come on, like, what the hell is that? Like, what is that? That seemed... that there's no way, if, again, I'll say it again, but if that's art, let me buy it. Like, if somebody made that, so those, those x-rays are from the, the, the things themselves. I think I've seen some of these before. The cat scans are even weirder. Are they? 'Cause the CAT scans, when they show like these, the, the 3D, uh, CAT scan of the body, you're seeing all the, the areas where the cartilage is, and it just look... but it doesn't look totally human, 'cause this is it. So they have three fingers and three toes. It's really weird stuff, like there's layers of them as they go, you know, as you go through a CAT scan. Now, how old are they? I've dig these. I've seen some of the reports. This is the thing that was presented to the Mexican government at some point. This is Peru. The Mexican ones seem to be horseshit. Okay. It seems like, and the guy who discovered them, air quotes, right, seems to have a history of finding silly things. But this seems real. This seems very real. Like, look at this thing. What's that on the neck? Exactly. What is that on the neck? Who the hell knows? Like, who the hell know? Why does it have so many ribs? Like, look at it. Go back to that image where it shows the back, Jamie, where it was like... Yeah. Like when you see this thing, this guy's not like showing you the full body in this particular image. Whatever the hell that thing is on the back of its head is weird. The shape of its head is very weird, but it looks real. Like whatever, if, if you guys could find that, that's real. I know you won't bring back Neanderthals, but why don't you bring back one of them little three-toed alien people? I don't know. I mean, you would still have to ask their permission. It looks like a person. Listen, just talk to them. Bring them back. If they say, shoot them in the head, right? Easy. I don't know what to tell you, but bring them back. Like some things you just have to do. Like if we find out that that thing was a real thing, like what is that? Yeah. What's that thing in the back of its head? Have people tried to do DNA work or protein work on these things? I think there's a, there's a small select group of people that are even taking it seriously, but more people are taking it seriously now because of the CAT scans. Because I think initially, have you seen the original ones? The ones that look super fake? Yes. The ones that look super fake look like something you'd buy in like a roadside roadside stand. They look totally [ __ ]. But then, um, I, I was going back and forth with, uh, Jesse Michaels and, uh, Luke Caverns, and they were sending me these images of, I think it was 800 BC. This is how old these drawings are in these tapestries that show these weird three-toed, uh, three-fingered things that look like a, like a little one of those things, like... So, was this another type of human that lived with us at some point in time? It's interesting. There are the three-toed and three fingers thing is interesting. I wonder if there's a genetic mutation that would lead to that. You've seen the, the tribe, there's a isolated tribe that has the two. Yeah. Yeah. Very weird. Yeah. So, maybe that was that. Maybe that's what that was. I mean, who knows? It'd be fascinating to see if there's any DNA that could be recovered or proteins. Yeah. Yeah. So, why don't you guys get down to Peru? Yeah. I'll, I'll run it by Ben. See what he thinks. He would be into it. Ben seems like he'd be like, \"Let's go.\" Like, if you could find Gigantopithecus DNA, I think Ben would want to bring back Bigfoot. Yes. Probably. Let's not tell him that this is... I think that's what Bigfoot is. Don't you think Gigantopithecus? Yeah. Was it in Asia though? Like Bigfoot is supposed to be in North America. Well, they found the bones in China. Yeah. So, it could have come across. Is... Make sure that story is right that I said. I'm pretty sure that's true. Gigantopithecus bones found in apothecary shop in China. I was... Yeah, I was... I just didn't want to bring it up. That's a guy named Ralph Von Conigwall, 1935. They're being sold as dragon bones. So, they bought a bunch of stuff and then they started looking at them and found out that that's not what they were. That looks so '35, right? Early to middle place in China. That was super interesting. And I wonder, you know, if these populations were there, they're there at the same time as Denisovans were there and Neanderthals were there, they would have... if they could have hybridized with humans, they probably... Gez, who knows? Yeah, we know so little, right? Well, it seems to like if it coexisted with Homo sapiens, so I mean, but when did it start existing, right? How long was it? I mean, we know that Neanderthals were around for what, 300,000 years or so. Yep. Which is kind of crazy when you think that people, you know, we've really only been running things for a small period of time. That... I don't know who added this. Closely allied with orangutans. Once thought to be a homonym, now thought to be closely allied with orangutans. Once thought to be a member of the human line. Well, it was thought for a long time that orangutans were our closest living relative as well. Have you ever seen them spear fishing? No. Yeah, they've learned how to spear fish. That's amazing. They don't know whether it's from observing people. That's what they assume. But there's this crazy photograph of this orangutan hanging onto his branch and he's got a long stick in his hand and he's like leaning into the river stabbing a fish. You got to see it, 'cause it's so crazy. Did they learn from us? We don't necessarily know. So cool. Isn't that crazy? Really crazy. Like he's figured out how to catch fish. Yeah. Really? Oh, says after observing locals, which totally makes sense, right? Smart. Yeah. I mean, he's seen people catch a fish and like he's like, whoa, how did you do that? Which is probably how people learned. Like some really smart ape guy was like, you know, I think I can hit that bird with a rock. You know, learning and being able to communicate is one of the ways that we got the advantage over everything else, right? Because I don't have to evolve the ability to cook dinner. I can learn from my mom. Right. Right. Right. But that's what's so fascinating about living today is you don't have to even learn from someone who's anywhere near you. You're learning from things on your phone instantaneously on your laptop. And you don't have to learn because there's Door Dash, right? You can stay alive very easy. That's true, too. But it's just, you know, when AI gets involved in this stuff, when we have sentient AI that you can use to try to, you know, figure out what the consequences of bringing certain species back and whether or not it will be a pro or a con, like what, you know, that's that's where things get weird. Like if we decide, okay, let's bring back the woolly mammoth. Okay, what's going to be the negative impact of bringing back the woolly mammoth? Well, they're going to eat a lot. So, uh, they're going to push out sentient AI to do that. I mean, we have... No, you don't. But, but humans will make decisions based on biased evidence. We'll, we'll make decisions based on our, the, the potential for a financial windfall. You know, we'll, we'll, we'll gaslight people into thinking things are really a good idea and, oh, it's safe for everyone, and we'll, we'll do things if we know that we could profit. Whereas if you have AI that's going to be completely objective and its only mission is to analyze the outcome. Yeah. That world, you know, we're, we're actually working with teams of people that are external to Colossal to put together the rewilding plans and that sort of thing for each of the different species. We're not planning to rewild the direwolves, but we still have done this. We've put together a plan of what the potential impacts would be, but we deliberately keep that outside and hire people to put this together for us. And we haven't been delivered this yet. So, we'll see what it says when we get it. Like, uh, are they going to say to us? They're going to kill everything. They are not going to kill everything because they're not going to be re... What animal do you think... Well, obviously you guys are working with the red wolves and you plan to use which, which are normal native animals in North America that are threatened, which most people would agree is a good idea to give them a healthy population and release them. And that's that's the the best argument because there's a lot of people saying, \"Oh, this work could be used for conservation. It is being used for conservation.\" That's that's so infuriating about some of these haters. So, it's like they don't even bother looking it up or they don't care because they just want attention and they just want to be negative, and that's the best way to get attention. They want the click, right? And the best way to get that click is to whine. Yeah. To whine and complain. It's annoying. Yeah. It's gross. But they have to be themselves. That's their punishment. You know, that's the life you've chose. You just want to be this [ __ ] person. You're going to say that one thing forever, and people are going to be like, \"Oh, congratulations. You get a lot of attention for just being super negative all the time.\" But the, the, if you had to like look at their argument, like the, so the argument of like not doing this and that you're not really creating a direwolf, and this is just you're just taking direwolf genes and adding them to grey wolves. Have you ever have conversations with these people where they want to tell you that what you're doing is wrong, and what is your response to these people? I think that the this idea that, um...\n\n\nThe technology that we are developing is something that we shouldn't be developing because it's wrong. It's, uh, um, we're somehow playing God. Yes. I mean, people have been playing God for as long as we've existed as a lineage. First by making species become extinct as we spread around the world. Not intentionally initially, but we changed the habitat. We hunt things. Then we figured out that we didn't have to make a species go extinct in order to feed our families, and so we evolved domestication. We figured out how to only take the males or leave the juveniles or some way of maintaining that population so that you knew you could go back to the hunt the next year and they would be there again. And we domesticated things, and then we transformed to really authority over everything. When we protect a species, people who think about conservation often think of this as super hands-off. Like, I'm not doing anything. Everything just gets to evolve the way that it should be. That's [ __ ] Like, we decide how many animals live, where they get to live, what they get to eat, how many they get to eat. We call them when we want to. We protect them if we want to. We don't if we want to. We are as gods, as Stuart Brand wrote in the Whole Earth Catalog, right? And we just better get good at it. These technologies are not exactly the same as the technologies that our ancestors had because we are directly changing DNA sequences, but they are technologies that we can deploy to hopefully try to fix some of the things that we have [ __ ] up already. Right? And I, I think the biggest challenge that I have is to show people that deciding not to allow ourselves the space that we need to figure out what we can do with these technologies. We're still operating within regulatory frameworks. We're still operating within the bounds of biological reality. There's a long way to go here. But if we decide that that's too scary, that we don't trust ourselves, that we're always going to make the worst decision. First of all, it's that attitude of negativity, right? It's the, it's the, I don't want to do it because it's too scary because I'm going to be bad. Second of all, it's a decision. And to think that that decision has no consequences is naive. We know what the consequences are. The rate of extinction today is thousands to tens of thousands times higher than it is across the foss, across the history of the fossil record. And a lot of that is because of us. But we have the capacity to slow that rate. We have the capacity to help species that are alive today adapt to the rapid changes in their habitat. What if we could make Hawaiian honeycreepers resistant to avian malaria, which we introduced by introducing mosquitoes into their habitat and save them from becoming extinct? Or figure out how to transfer resistance to bleaching to corals around the world, or, um, anything that we could do to save some of these habitats that we know are in trouble because of this combination of people expanding and natural change to the ecosystem that we just don't like. You know, we don't want to see spruce forest disappearing because it's getting drier and that means that they can't make enough resin to fight off the beetles. Right. Right. Yeah. We have the capacity to use these tools or at least to think about how we might develop and deploy these tools to have a future that is both filled with people and biodiverse. I think what people are concerned with is the crude application of this, this, these techniques and this science when it's in its infancy. And if you just take that and draw it out to its natural conclusion with improvements over time and innovation over time, it could be something that's of an enormous benefit to not just animal species, but humans, right, to everyone. What's, it's a, it's kind of like a test run. Like, what's, we can make a direwolf, can we make a super person? Like, do you know what I mean? Like it's probably the future. Yeah. Yeah, I mean, having regular children, like just rolling the dice on seeing what your kid turns out will probably be super novel like a 100 years from now. Yeah, it's a, it's an interesting thing to think about, right? And, and I think we're getting gradually more accustomed to using these technologies to cure genetic diseases like the baby that was in the news over the last couple of weeks, baby KJ, the, this, uh, boy who was born with a metabolic disease. He couldn't, his had a genetic change, just a single mutation that meant that he couldn't digest protein. And people came together and mounted this incredible, like, collaborative effort to find a cure using the tools of genome engineering for this child. And he went home from the hospital last week with Crisper Editing, having gone into his own body to cure this particular disease. Now, wild. It's, it's amazing. And it was such a, it was a rush, you know, and it's a, but it's a, it's a really great example of personalized medicine that right now, obviously this is slow, but we start somewhere and we always have to start somewhere. Yes, it took six months and it's one baby and it took a lot of people to do this. But this is the beginning of how we can use these tools to cure your cancer, to figure out how we can engineer a, a fix for a baby who's born with cystic fibrosis, or if you get blood cancer, can we edit the blood cells to make sure, make that cancer mutation just go away? This is the beginning of these tools and, and for de-extinction and conservation. This is also just the beginning. You know, we've figured out how to learn DNA sequences from the past and actually transform that into an animal that has that's bigger than a greywolf and it's more muscular than a greywolf. We've, we've made direwolves using direwolf DNA and these amazing tools that we will have the potential to use to stop other species from becoming extinct. I love it. I think it is, obviously there are risks associated with using technologies that we don't fully understand, but we're not taking those risks. We're very carefully evaluating every single one of the edits that we make. We are in every case interested in making the fewest number of changes possible to still bring those animals back.\nWhat other animals are you going to bring back?\nWell, what's the plan?\nWhat's the plan, Beth?\nWell, we have announced obviously the, the mammoth and the thyloine. That's the Tasmanian tiger and the dodo, which is my favorite. I've seen my dodo. Oh, that's cool.\nUm, but we have DNA from, from lots of different animals, so you know, you never know. So, but is there like a, so, you've announced the woolly mammoth.\nThat's right.\nAnd where will that be? Where are we going to put mammoth? Are you going to reintroduce them area into areas eventually?\nThat is the goal to have animals that live in wild habitats, but this will be a very long process.\nDirewolves?\nNo, we won't be reintroducing direwolves.\nOkay. So, not predators, but you would consider...\nWell, not direwolves.\nOh, so you weren't joking about the cheetah?\nWell, I mean, we, we don't currently have any plans to, to bring cheetahs or, or saber-tooth cats back to life, but you might. I don't like how you said that, but if you did that, like that would be where it would get sketchy. If you reintroduce an animal that can run 60 miles an hour to the planes, those poor antelopes who have been like living it up because they evolved, you, you know that prongghorn analopes, the reason why they're so fast, they evolved to get away from these cheetahs that don't exist anymore.\nYeah, it's true. But we know also from looking at the, the, the cheetahs that we have that they didn't only eat pong horns, they were eating lots of things in their habitat. them. We found because pong horns are fast. They had to eat something else, otherwise they would die, right? They had to eat some slow stuff because the pong horns are like, &quot;Let's get out of here.&quot; Yeah. I mean, for every species, there will be different work that has to be done to figure out whether and where is a good idea to reintroduce them. For each of the species that we're working with, we have councils that we've put together in the part of the world where we would bring them back together to, to have conversations about where they should go, whether they should go, how many there should be, and, and who is willing to be the long-term stewards for these animals. Now, I know that they've talked about releasing woolly mammoths if they ever do make them in Siberia, right?\nWell, right now we're not focusing on Russia because issues obviously, right? Um, so probably it would be somewhere in North America. Maybe that's why Trump wants Greenland for mammoths.\nPick a good place filled with ice. I mean, mammoths really need a lot of vegetation. Yeah. Yeah. So, I think maybe, maybe not. Yeah, that's right. But, you know, there's plenty of space in Alaska, right? Or, or northern Canada or even around the plains. I mean, mammoths lived through warm periods and cold periods. Obviously, they're cold adapted because they're big and furry. Alaska would be the move, right? Because it's, it's like the size of onethird of the United States and they lived there, right? And you know, right? And I, I'm not worried about the mammoth population getting out of control. I mean, these are animals that take 10 to 14 years to reach reproductive maturity. They have a 2-year pregnancy. It's, it's not like they're suddenly going to be a thousand mammoths, right? This will be a very slow and deliberate and careful process. And like with the direwolves, there will be a stage in between the first calf being born and understanding how they're able to thrive in whatever habitat they're in. And these are really important parts of the de-extinction process. I was blown away when I heard that mammoths lived up till about 4,000 years ago on an island. Yes. Wrangle Island off the coast of Siberia, but now maybe even, maybe even in mainland North America based on that environmental DNA data. Isn't that crazy? That's crazy.\nYeah, that's crazy. The horses for 4,000 years, right? in that day and mammoth that was 4,000 years old, too. Wow. Right. Because we're not going to find the last fossils of something, right? Of course, because fossils are so difficult to make. Most of the things don't leave fossils when they die. That's right. Like what percentage of the entire fossil record, bad pun, bad word to use there, but in record of animals have been fossilized. It's really hard to know, right? It's and because the taffonomy, which means like how things are going to preserve, differs so much depending on where you are in the world, like when things die in Alaska and you have this glacial silt that preserves things really quickly. We're probably finding a lot of things, right? But we've never found woolly rhinos in North America. So the hypothesis is they never made it across the bearing, the there was a, you know, when the sea level was lower, the bearing straight was not a sea level. Everyone said it was, they called bingia. It was a land bridge. Animals walked across that land bridge, including people walked across the land bridge to come into North, which brings me to the shortfaced bear.\nOh, I don't like how you giggled. Are you guys going to try to bring that thing back?\nI don't know. We do have its DNA.\nOh my goodness. I love the shortfaced bear. You know what I like the most about it is because I think it's so dumb that it's called the shortfaced bear. Like, why? Who was, who was giving it that common name? and they're like, &quot;Oh, here's a bear that if it stands up, it's 12 feet tall. I'm going to call it the short-faced bear.&quot; Right. It's such an innocuous name for such a terrifying animal. Yeah. One of my favorite photos on the internet is a photo of the short-faced bear standing up next to these scientists that are standing there and you realize the size of it, you're like, &quot;That one.&quot; Yeah. Like, what in the hell? Have you seen the Longhorned bison? This bison that lived, um, 120, 150,000 years ago?\nI think I have.\nThis is...\nThere's a great photo that's somewhere on the internet of one of a skull on the ground and a scientist like laying that one.\nYeah, there it is.\nYeah, that's crazy. We have DNA from him. He might bring that back. Yeah, wouldn't that be cool? What about the, the Irish elk?\nYep, we could do that one. We have DNA from the megalos.\nWhen did that thing go extinct?\nI think that's also the end of the ice age. It wasn't in North America, but...\nRight. Yeah. Super cool. That thing's nuts. It's like a moose/ elk. I love it looking thing. There were also camels in North America. There's a camel called Camelops. That was pretty cool. Yeah. And a giant beaver, like a five foot tall beaver, which...\nOh, that's right. I forgot about the giant beaver. Beavers scare me. Especially a five foot beaver.\nA five foot beaver. Think about what a little beaver could do with its teeth. People have found logs that have been chewed on by this thing. Like just... Yeah. Just imagine.\nWhat did that die out in the ice age as well?\nYeah. So that's like 65% of all the megapona in North America, right? So many big things. We lost so many big things. Thomas Jefferson thought he had discovered a giant lion, but it was a sloth. Yeah. Giant sloth. Different species of giant named after him. Megalonx Jefferson. Wow. Well, when you look at its face, it kind of looks like it could be a cat if you don't know that much. Like if you don't know what we know now from the fossil bones that bone right there, make that the head. Like look at that thing. That looks like some crazy cat. Oh, what a weird animal. Sloths. I wonder if they moved as slowly as the small ones did. I, I can't imagine that they could have or they would have been really easily eaten by the giant shortfaced bear. Right. Right. Maybe that's why or the American cheetah or the smileon.\nThe cheetah is probably too little. You know, it would get smashed. Yeah. But if that thing was moving super slowly, you could just hack at it for a while. Well, have you ever seen sloths, even little\n\n\nSlow-moving ones swing at leopards or jaguars, rather?\n\nYeah, there's a video of a sloth, a regular one that is, uh, crawling on this vine, and this jaguar is trying to get at it, and it's swinging at it pretty fast.\nI was like, \"Wow, I didn't know they could swing that fast.\"\nBut it moves really slow, which is like, I wonder if it... Why does nature want you to die so easy?\nDon't they move so slowly that stuff grows on them?\nYes, mold grows on them.\nThere's a rescue place.\nSo this... See, look at that.\nLook how beautiful those jaguars are.\nGod, they're so beautiful.\nBig cats.\nYeah.\nSo, would you want the big cats that were here to come back?\nWell, I mean, I don't know.\nIt's like the jaguars are reemerging in the southwest, right?\nThey've spotted at least a couple of them in Arizona, which I think is great.\nI mean, I think they're awesome, but I wouldn't want to run into one, you know?\nI mean, like if you're out there camping and you see a jaguar, you're in a lot of trouble.\nThat's a giant mountain lion.\nBut, and I think about mountain lions, too.\nWhen I go running, you know, in the woods, in the redwoods, I live in Santa Cruz.\nI go running and I'm thinking, \"Oh, mountain lions.\nBring my dog, right?\"\nYeah.\nWell, the dog's going to get eaten, I guess.\nI think they're afraid of dogs a little bit.\nYeah, it depends on the dog.\nThey eat a lot of dogs.\nI have a 75-pound Labrador retriever.\nHe would probably want to be its friend.\nYeah, that's like my dog, my golden retriever.\nHe'd friend, can we play?\nOr he would just like tuck his tail and run and just leave me there to defend myself.\nBut you know, they know that like the ones that they get, the ones that are problem cats in Northern California, when they found them and they do these depredation tags, they found that 50% of their diet is dogs and cats.\nWow.\n50%.\nThat's nuts.\nYeah, that's nuts.\nThey're just eating people's dogs and cats.\nYikes.\nYeah.\nI don't know.\nThey're spooky.\nThey're cool, but they're spooky, you know.\nI don't know how many you want around.\nAnd there are a lot of cats.\nMaybe it's because we don't have any of the other predators that used to be there.\nI mean, the California golden bear.\nThere's another one that Hurst, I think Hurst collected.\nOne of the last ones of the California Golden Bear in Southern California had him shipped up to San Francisco and he became the bear that's the inspiration for the flag.\nOh, really?\nHis name is Monarch.\nWe actually sequenced his genome, too.\nThe last guy that got killed by a grizzly bear in or a brown bear, whatever it was in California.\nThey have a town named after him, Lbeck, California.\nIt's named after the guy.\nYeah.\nNamed after the last guy to get killed by a bear.\nI wonder if it's worth it to his him.\nNope.\nNope.\nNope.\nNope.\nIt's kind of funny though that the bear is on the flag and then they killed all of them.\nThere's none of them.\nYeah.\nWell, by the time I think it was on the flag, it was already on their way out.\nYeah, probably.\nWell, people are probably wanting to bring them back, too.\nYou know, you know that we showed recently using DNA that they're really closely related to the bears that are in Yellowstone right now.\nSo, if you really want bears in California, you can just bring those guys over.\nDon't do it, people.\nIs Mont... because the thing about it is once you have them in your area, you can't manage them because then people have decided that they're precious.\nSo once they become problems and once they become overpopulated, like Montana has a bit of an issue with that now, they would like to list them so people...\nYes, with grizzly bears.\nThey would like people to be able to hunt them.\nMonarch, they put a smile on his face.\nOh, hi guys.\nOnly you can prevent forest fires.\nHe looks had a miserable life though.\nHe was mostly in a cage.\nHe was being fed the wrong diet for a brown bear, just mostly meat.\nAnd yeah.\nSo right now he's on... he's on display.\nHe's not on display actually.\nHe is in the basement in a fridge at the Cal Academy of Sciences in San Francisco.\nUm, but his postcranial skeleton, everything except his head is at Berkeley in the museum.\nWe've sampled it for DNA.\nSo, his diet should have been fruit and vegetables and meat.\nBut they were just giving him meat.\nI imagine he was just really uncomfortable all the time.\nReally?\nYou imagine if you just ate only meat?\nThat's all I eat.\nI mostly just eat meat.\nI'm not uncomfortable at all.\nI think meat is need a little bit of fiber to help your digestion.\nBut I bet if you had like a plate... Well, actually not true.\nI was saying if you had a plate of meat and a plate of fruit, the bear would just eat the meat.\nBut the bear would probably eat the fruit, too.\nEat everything.\nThey eat cars.\nI mean, when I lived in Colorado, just like people, not us, would have been like they're involved in in the world of scarcity where you eat the stuff that's in front of you.\nAlso, they really have to get fat because they're going to chill out and just take naps for 3 months.\nI love the fat bear week competition.\nI love that.\nDo you know that?\nNo.\nWhat is that?\nIt's like it's around the time when they come out, they're eating all the salmon because they got to get suit and they have a competition between which is the best fat bear and you get to vote for them and then there's a fat bear that wins.\nYeah, that's good fun.\nI love it.\nTo me, that's the most fascinating um species of bears is the bears that live on those salmon rivers because they don't care about people at all.\nLike there's this crazy video of this guy that's sitting in a lawn chair and this bear comes up beside him and this bear... where the he's not in the lawn chair, right?\nHe's beside the lawn chair, but the lawn chair is great for perspective when you see how big the bear is.\nThis bear is huge.\nIt's like 10, 11 feet tall, long, whatever.\nAnd it it doesn't care about the person at all.\nIt just has been eating salmon.\nSo this is it.\nLook at this.\nAnd salmon are so much better.\nLook at the size of that thing.\nImagine.\nGive me some volume so you hear this guy talking because it's so crazy.\nYeah.\nBear's not interested in them.\nThere's meat right to his right.\nHe just lays down.\nI'm going chill.\nHumans probably make a terrible snack though, right?\nI mean, we're bony.\nWe're or fatty.\nThat salmon is absolutely delicious source of protein, right?\nAlso, it's, you know, just flopping around in there.\nIt's easy to catch and he's probably full, which is also why they're so big, right?\nHe looks full.\nHe's... I like him.\nHe looks chill.\nThat's the bear that I would want to run into in the field.\nHe's talking to him.\nHey, hey, hey.\nThat's a crazy... like it's a dog.\nLike, hey, get out of here.\nYou going to convince them, hey, man, this is my space.\nDon't invade it.\nYeah, they just... they all those Kodiak bears, they're that's why they're so huge.\nThey get so much protein.\nNever been out there.\nOh, I want to watch them.\nI want to watch them eat the salmon.\nYeah.\nWith a high-powered rifle right next to me.\nAnd maybe in a giant bulletproof hamster wheel or something.\nI don't... I'm so scared of those things.\nHave you seen the documentary Grizzly Man?\nYes.\nAnother great Werner Herzog film.\nOkay.\nI... I have to look at the Werner is actually in that film.\nYou know, he's interviewing the people in that film, which is that it's one of the best unintentional comedies.\nIt's a really funny movie.\nI think... I think I don't even think it's unintentional because Werner Herzog's a genius.\nI think he made it funny on purpose cuz there's some like smash cuts where he just like, oh my god, we just laughing and the guy was so nuts and he just decided to... I think in my eyes, I think it was like suicide by bear.\nI think he just decided to stay long enough where eventually they just got him.\nHe was like super depressed and oh my god wanted to be an actor and it never made it.\nSo he decided he was going to save the bears and the bears like didn't even care that he was alive.\nLike they're not used to people being around at all.\nThey didn't even know what he was and then one of them eventually decided to eat him.\nI can't imagine that is a good way to go, but it's not a good way to go.\nBut if you're completely obsessed with bears and you, you know, yeah, there's a woman who's worked in my lab for a long time.\nShe works on mountain lions or mountain lion genetics and she said when it's her time, she wants to go.\nOh god, lady, don't say that.\nDon't say that.\nThe one thing better about getting killed by a cat than a bear is a cat will kill you and then eat you.\nA bear will just hold you down and eat you while you're still alive.\nYeah.\nThey don't care at all.\nYou die of shock.\nbefore and after photos of these founders before they got fat.\nLike that one was wildly skinny, like a dog almost.\nYeah.\nWell, they look real weird when they get skinny and they look real long-legged.\nThat's one of the things that freaks hunters out um is when they see them skinned and they're hanging, they look like humans.\nIt's like very weird.\nBigfoot?\nNo.\nWell, that's probably what Bigfoot is, honestly.\nWhen people are seeing Bigfoot, have you ever seen a bear walk on two legs before?\nNo, they walk on two legs all the time.\nAll the time.\nThey walk on two legs to present themselves as larger, to scare the other males.\nAnd sometimes they have injuries.\nLike there was a famous bear in New Jersey that was missing a paw.\nAnd so he always walked on two legs and it just looked like a man like a man like a Bigfoot.\nLike if you see him through the woods, right?\nIf it's dusk and you're going on a hike and you're already like heightened senses, you're a little weirded out already and you see this thing.\nIt's a black bear that's walking on two legs through the woods like you would be convinced that you saw Bigfoot, don't you think?\nYeah.\nThere was a paper that was published maybe a decade ago or so where people had done niche modeling, environmental niche modeling based onoot sightings.\nIsn't that crazy?\nOh my goodness.\nYeah.\nIsn't that nuts?\nSo, if you saw that walking through the woods, 100% you'd think it's Bigfoot.\nOh my god, I found him.\nHe's real.\nHe's real.\nIf that picture was just a little bit blurriier, it would be Bigfoot, right?\nYeah.\nA little blurrier and then a little more distance and in between trees.\nYeah.\nI talked to a lady once.\nWe did this uh television show.\nMy friend, that's amazing.\nI know.\nIt's nuts.\nAnd that's a small one.\nWe did this uh television show a long time ago.\nMe and my friend Duncan.\nWe went to go look for Bigfoot.\nIt was part of the show.\nIt was called Joe Rogan Questions Everything.\nAnd we went to and I met this one lady who was so convincing and she told me she saw Bigfoot.\nShe and the Pacific Northwest where we were at outside of Seattle like up in those mountains, it's so dense cuz it's a rainforest and it's like the the way I describe it, it's like a box of Q-tips.\nThat's what the trees are like.\nYou know, you get a box of Q-tips, you can't see in between those Q-tips.\nSuper dense.\nSuper dense.\nAnd she said she saw something that was like a hundred yards away that was moving through the trees that she is sure was a... She goes, \"I saw a giant ape.\"\nAnd I was like, \"What is that?\nAn ape?\"\nI'm like, \"Oh my god, it's Bigfoot.\"\nAnd my brain was going, \"I think it was a bear.\"\nWell, that's what this niche niche modeling or environmental modeling study found is they looked at all the reported sightings of Bigfoot and then created what would be the environmental niche for a Bigfoot and it pretty much just overlapped the niche for for bears for brown.\nYeah, of course.\nI mean, it's the only thing that makes sense.\nBut what the the weird thing about it is the Native Americans because Native Americans have a name for that creature and they have many names for it in different tribes.\nSo, it's not like an isolated thing, but they don't have a lot of mythical animals.\nThey don't have fake animals other than Sasquatch.\nIt's weird.\nIt... It is weird because if Binga, is that what it's called?\nThe Bearing Land Bridge.\nBingia.\nBingia.\nBingia existed and we know that it did.\nAnd we know that people during that time made their way across.\nIf Gigantopithecus lived alongside people, we don't know if it did, but it could have.\nAnd if it did, it would be in the same area.\nIt would be in the same area of Asia.\nAnd perhaps it would have to come really far north though to get across the Bearing Land Bridge cuz that was really far, that was all glaciated and cold.\nSo it would have to be something that was adapted to living in warmer climates like where it was found as well as being able to survive.\nIt's not like a week of a walk across the land bridge.\nRight.\nAlso, we don't find primates in cold climates like that, right?\nOther than humans, right?\nYeah.\nYou have to have the ability to keep yourself warm.\nWe're like, let's just keep walking north.\nWe got to get away from these other [ __ ] Yeah.\nReally love mosquitoes.\nI... I think this is what I'm going for.\nLike the more mosquitoes the better.\nI think they're probably just chasing animals, right?\nYeah, that's probably what they were doing.\nMostly following the herds and then eventually they had to learn to adapt to these colder climates.\nYeah, it's funny.\nWe talk about it as like people are are moving deliberately through this landscape when\n\n\nClearly, they weren't. You know, they're just trying to find food like the Doggon people. They're going to places where there's still grass that their reindeer can graze on. Yeah. They just want to eat. And it's just so weird to think that, you know, we live in houses and we have internet and we, you know, you drive an electric car to work and oh, living in this sophisticated world, but not all the people are living in this world. And there's indigenous people that are living the same way they've lived for, but that now they have a snowmobile, now they have a rifle, right? But they're still if you had to live there, you'd be like, \"Oh my god, like what am I doing? Like where is Starbucks?\" Right? Like, but somehow they're happier than us. That's so weird. It's really weird. Um, out of all the animals that you guys might potentially, uh, what's the word, rebirth? What's the word? Oh, I mean, people have used the word de-extinction, which I kind of hate because I can't figure out how to conjugate it in a way that doesn't make me cringe. If you've done it successfully, do you say you deextincted something? So, what would be the word? Do we need a new word? Because it's never happened before. Bring back. Resurrect. Resurrect. I think resurrect's probably, but that has biblical, right? So that's why we try to stay away from that. But you're kind of playing God, so let's go with that. Okay, cool. I'm in. Um, is there one that gives you pause? Like maybe the shortfaced bear pause. Like maybe like maybe this isn't the best idea. The host eagle. Well, humans. I've already had paws at this. Like Neanderthals and Denisovans, they were people. And so I feel like that's not really a thing that that's not somewhere we should go. Host eagle. That's a cool one. That's a cool one. That's a really This was a massive massive giant eagle that ate moa, which was a bird, an extinct bird. People too. Probably they were. No. They think that they found these markings on human skulls there that indicate talons of raptors. Wow. Yeah. Wow. Right. Which makes sense that that's how they went extinct. Like the New Zealand are like enough of this [ __ ] Yeah. Well, the moa went extinct and so they couldn't eat moa anymore. But maybe it was both, right? I mean, why did shortfaced bears go extinct? Probably because nobody wanted a bear that stood 12 feet high. That was cool about it, though. Like, imagine kill it. Could you imagine the daunting task of getting a group of guys together with spears to go after a shortfaced bear when you know at least four or five of you are getting whacked before you can get a spear tip into one? Maybe. Doesn't it depend? I mean, maybe what they were doing is, you know, how they would ambush mammoths and things like that. So, you hide around bluffs and you can have a group of people in different places and hit them all at once. Maybe you wait until that bear is eating something else, right? Oh, sure. And then it's paused and you have time to I mean, how much did they even understand the wind back then? Like they probably understood it really well, right? Because these are people who relied on that. They probably understand it better than people who aren't hunters today, right? So they probably knew that these animals had a greater sense of smell than we do. They probably had a greater sense of smell than we do or more attuned. Yes. Oh yeah, for sure. They probably could smell it because you can smell certain animals when you're like you if you go into the elk woods, you 100% can smell elk. And is that something that you've been able to develop? Well, I was taught it, you know. Um, I would smell something and then you know like the guys that I'd be hunting with like you smell that like that's that's elk cuz you could because they urinate everywhere and you know you get this sense they they have like this really musty smell during the rut too and you could smell them. Could you smell the direwolves? Well they they were stinky. I don't think you guys are bathing them. Why would we bathe a direwolf? I know. My wife would be like, \"Take him to the groomer because she hates when my dog gets stinky. She hates when I like take him out into the the dirt and play around with them and he comes back covered in burrs and stinky. You got to brush them down.\" Do they smell different? Yeah. Yeah, they did smell different. But I I don't smell a lot of dogs that are never bathed. Right. You know, most of the dogs that I've ever smelled These aren't dogs. Yeah. Right. Wolves, right? Right. Sorry. Which is what is really which is really weird. That was the other conversation that we had that they all come from wolves. Like even a French Jamie has a French bulldog. He's adorable. That was a wolf at one point in time. And we don't know which wolf. Right. Right. I mean, this is I think dog domestication is one of those places where both we come to terms with what we don't know and the opportunity to discover new things. You know, the very first scientific paper that said when dogs were domesticated looked at um a type of DNA that's only inherited from your mom called mitochondrial DNA. Our cells have a nucleus that has the DNA and our chromosomes that make us look and act the way we do. And then it has little cells that were once bacteria that we co-opted that make energy. And you only inherit them from your mom and there's a ton of them. Like there's thousands of mitochondrial genomes in every cell and only one of your nuclear genome. So in ancient DNA, because there's way more, we started just with that. It was the only thing we could recover. And the first dog mitochondrial genomes that were recovered, people were like dogs were domesticated in Asia 150,000 years ago, which is clearly wrong, right? The there weren't human populations, societies, which is kind of what you need for dog domestication because they're attracted to the garbage or the living around where people were. So you need communities of people that are staying in place together for some time before you can have dog domestication. Do we know for sure there weren't human populations like that 150,000 years ago? We don't. But we do know now that dogs probably aren't that old, right? I think what I read was 36. I think it changes all the time, which is because we don't know everything. And also probably because the first dogs were in warm parts of the world and so we we don't have the fossils. We don't have the the DNA and that the fossils just didn't preserve. I think right now what people are happiest with is that it was probably sometime after the the peak of the last ice age, sometime 15 to 20,000 years ago. And um not sure where because again probably in a a warmer spot. There's been lots of gene flow, lots of hybridization between domestic dogs and wolves that have made this a really hard problem. Like you were talking about with the black wolves, right? Exactly like that. But what's cool about this date 15 to 20,000 years ago is that most these people are like, \"Yeah, that's probably the date for dogs.\" Which means if dogs only form when there are human like communities that are together, groups of people that are living together in the same place for a long time, that they were around 15 to 20,000 years ago. That is not what archaeologists think. Right. So these two these two weights of evidence are saying, you know, we still don't know, right? Sort of, right? But they do believe hunter gatherers existed in small tribes 15,000 years ago. And maybe that was enough. But you know, if you think of domestication and scientists like to have names, we like to have ways of classifying things. And so there was recently sort of a friend a couple of friends of mine have published a paper which they've redefined how you consider something domestic. And they say a domestic population is something that can only survive within a human environment within a human niche. And if you think of that as what our dogs are, right? They can only really survive and breed as dogs within this human niche. Then you need a lot of humans around and you need a sort of steady stream of the crap that humans produce to do this. That's still kind of early. Like it's still Yeah. Maybe there were hunter-gatherer populations that were more of, you know, established somewhere in the south where we don't have dog bones. Right. Right. That's we don't know. Right.\nIt's But and then wolves don't Are most wolves from warmer climates? No. Right. They're from colder climates, aren't they? All over the place. All over the place. Well, Mexican wolves, right? There's Mexican wolves. Mexican wolves that there's um but we think that the closest living relative of dogs is is greywolves. It's this greywolf lydant. But we don't know if dogs are outside of the diversity of greywolves. So, it's an extinct type of greywolf that was the predator of dogs. or if they fall within the diversity of all the lineages of greywolves that are around. And that's just because there's been so much movement of DNA around that part of the tree. It's it's a I think it's a fascinating story that as we get more information, we're going to learn more about people as well. And I just I love that. Well, dogs are the most fascinating to me because it's such it's so obvious that there's manipulation involved. It's so obvious that through selective breeding and and also getting these animals to get accustomed to people getting close to the fire, feeding them so they don't have to hunt anymore and then they bark when intruders come and you know we develop this sort of relationship where we work together that it's it's so interesting that they we see the genes change into a poodle. We see this weirdness or now it's a border collie like what? And then the those too are probably Victorian, right? The all of the breeds that we think of today, whether it's cattle or bison, they're, you know, within the last couple hundred years. That is really fast selection by humans. So, we are manipulating the DNA of the species that we surround ourselves with. And we have been for 15 to 20,000 years and probably longer. Just not in a laboratory. Just not in a laboratory. But, you know, is our backyard a laboratory? If I say, I like the way that dog looks, but I like the way that that one can swim in water. And I bet if I breed them together, I can make one that has this double layer coat so they can go get in that frozen water, but they'll still have that like cute look or something. That's interesting, right? Because we're we're thinking about science as only being done in a laboratory or manipulation only being done in a laboratory. It was clearly done with food. I mean, it was done with plants forever, right? Selective breeding of plants, splicing two plants together, right? I mean when we graft plants together, I mean that is like all of the the vineyards in in France which are grafted onto American rootstocks because of the introduction of phylloxera, this aphid that came from North America that was going to completely devastate the the wine industry. Now they're all spliced onto American rootstocks that can survive this aphid. And ain't that wild? Yeah. I talked to a rancher in California and they were telling me that I think it was either the avocado trees were spliced onto the pistachio trees or vice versa. It's amazing that the plants can survive that that they don't go like, \"Yo, that's not me.\" Like, we can't do that. We can't take a a pig liver and shove it in your Yeah. Your body would fight it off. Your immune system would fight it off. Well, we're trying. Again, that's another cool thing that we can do with this gene editing technology is there are we can turn off the genes that would cause that rejection to happen. So maybe someday we can use pig organs in place of humans and save save people from dying or we can just re-engineer a new version of your organs. Yeah. So that is really cool science. This thing called organoids where you can actually grow in a dish in a lab a version of a little brain. something that approximates a brain or that approximates a heart or a kidney or or something else. We're using this at Colossal Biosciences, for example, to test hypotheses about what changes we might make to bring about to resurrect to de-extinct the phenotypes that we're interested in. If we grow an organoid that grows hair, can we see what that hair looks like without having to make a mammoth in order to see what that change is going to do? But it has really amazing potential for personalized medicine. So, I can take some of your cells, if you get a tumor, I can grow them in this dish, and I can challenge those cells with different drug cocktails to see what works before I put them in you. Now, this is this technology is so cool and really just beginning. Well, it is it's amazing when you think about this technology and you think about what we had just a few hundred years ago and then you push a few hundred years from now and you think what are the possibilities and the only way to find out is to do experiments like what you guys are doing. And so that's one of the reasons why some of this push back is so silly. Like would you rather no one ever do this work or would you like to be the one who does the work or is it just that you think the work should never be done like what is the thought process again is I think it's this negativity and it's this scarcity mindset that if if they do this then we can't do this which is just it's not it's not the way we innovate it's not the way we make progress but is just be is this the nature of academia where you know because it's very gatekeeped even inside of academia, right? You you work for a university and you have to get the approval of all the other people and you have to be politically aligned with them and everyone has to say the right things on Twitter. You know, it's like there's a lot of like weirdness, a lot of group think that comes along with all that stuff. And then you have to play politics in order to get funding. You know, you can't be ostracized.\n\n\nIf you're ostracized, even if you have tenure, you know, when you see this with certain scientists that have very outside-the-box ideas, they get pushed out and they can't get funding anymore. Or if they don't agree with a certain narrative, what's being pushed with whether it's public health or the environment or anything, they get ostracized even if they're actually talking about real data and science.\n\nYeah, I think, you know, we can agree that it's a mess, right? It's a hot mess. But there is genuine, real science that comes out of the university system of the academic system that we need. You know, all the technology that led to MRIs, the early technology that gave us CRISPR, this gene editing platform was developed using, you know, funding from the government in scientific labs by people who are willing to take risks and step outside of that box. And then it's taken outside of there and turned into all of these cool things. I mean, there has to be a place where we get both of these things because there's some things that no one is ever going to build a business around until it exists. And we need this, you know, public system in order to do that.\n\nYeah. And that's what's so scary about what's going on with politics and funding and research, you know? It's because it's like if as soon as you stop defunding research, you start making it more scarce and then making people, it's just going to get worse. It's going to get harder. And we're going to fall behind, and we are going to lose the place that we have had as innovators. And by we, I mean this country. We are going to lose the place we have had as innovators in biotechnology, innovators in physics, innovators in all of these technologies because we've had such a robust system. It's a balance. You know, we clearly need both of these things. And right now it's broken.\n\nAnd there's a lot of weirdness that's going on with biology in general in the world right now. And one of them is, I think there was a third scientist that was arrested for trying to bring in toxic mold from China. We know that this one scientist was arrested, and then I think there's been two more. So they're trying to introduce this toxic mold into our food supply. The same toxic mold. I think so. It might have been a different one, but I know it's also the same kind of thing. See if you can find it, Jamie.\n\nWhen I heard this the first time, and I've only heard about the first one, my first thought was, you know, is this deliberate or is this super naive on the part from China, which scares the [ __ ] out of me because if China wanted to [ __ ] America's food supply, there'd be a great way to compromise basically everything.\n\nThere is a country that is investing in science. Oh my god. Yeah. Just their drone technologies off the charts. I was watching a documentary yesterday on the autonomous production of coal. And so they have these coal mines now that are done entirely with electric trucks, and everything's done with AI, and humans aren't involved at all. So these trucks go, they dig, they mine, they fill the trucks, they bring the coal back, and then when they're low on batteries, they charge themselves. Oh my gosh. Yeah. And they're running 24 hours a day around the clock. Yeah. And we don't have anything like that. No, we're not even close to doing that. And we're fighting about the amount of money that we should invest into very basic infrastructure. Exactly. It's terrifying. It is terrifying. It's terrifying because we always hope that with every administration there will be positive changes, and it just never seems to be the case. It's just like more and more of the same and more short-sightedness.\n\nLike, is it also this scarcity mindset, like I can't agree with this person because they once said this thing? I mean, we, why can't we have just a normal conversation like you and I are having right now?\n\nWell, I think it's because it's kind of engineered into our social media structure that human beings are going to fight with each other. The algorithm favors you looking and interacting with things that upset you. You know, this is just natural human nature. If you look at like some of the people that we were talking about earlier, negative scientists, you see them online. They're tweeting negative things like all day long. Like, and it's probably because they don't have any funding. So they can't actually do any science.\n\nChinese scientist was arrested while arriving in the US at Detroit airport. A second case in days involving the alleged smuggling of biological material. But is it the same biological? No, different stuff. What is this stuff? So this was worms. Worms described as worms. Certain worms require a government permit. Um, I had heard that there was a third one, and this is the third. This is the third. So there's a second one, and this one happened. Oh, second case in days. I will say they were going to the same place. Oh boy. University of Michigan. Another Chinese scientist also going to the University of Michigan.\n\nBoy, it's also really crazy because the thing about China and their scientists that come over to America is they all have to check in with the CCP. Like if you are a Chinese scientist and you're from China and you're working in America, you got to check in. Which means like how much of this research is just getting shared with China, and it's all weird, and we're focused on something else. We're focused on Yeah. They play a very long game, and I think their game involves raptors and T-Rexes. They're going to release all the stuff that you won't. I've seen that movie.\n\nI wonder, like, I worry about that, like your information, the stuff that you guys are working on, if that stuff can be compromised, if someone can get a hold of it, and then they start doing that stuff over there.\n\nThe thing is, the foundation for what we're doing, all of the stuff from sequencing ancient DNA to gene editing technologies to learning how do we link certain DNA sequence changes to the way something looks. This stuff is all out there anyway, right? Like CRISPR technology exists. We're not working on humans, but other companies are openly, right? It's not like there's\n\nWell, you know, the story from China where the one doctor got in trouble and wound up going to jail because they had supposedly inoculated these babies from HIV, but they in fact were making them more intelligent. I think maybe that was two separate stories because I know the story about Jang, that's He Jiankui was the name of that scientist, and he went to jail for three years. He actually did some training in the US. His name is H. He but he um was trying to make trying to use gene editing tools to to make these babies have a particular mutation that we know is protective against HIV. It's the one that stops the HIV from entering the cells where it then kills the cells. And I think this was a story that was broken by a guy at MIT Tech Review a couple of days before it was announced. He thought that he was going to be able to announce this to great fanfare in front of a community that was going to celebrate him for having done this. And the story broke a few days early, but he had set this up, a whole PR thing. He had um like YouTube videos that were ready to go to explain what he had done. He wasn't trying to do it in secret. He thought he was going to be a hero, right? But people were like, \"Holy [ __ ] dude. What the fuck?\" Like, \"No, we're not editing human germ lines, the cells that will be passed on to the next generation. There's still a moratorium against doing that work. The baby that was just born, for example, they didn't edit any of his cells that would get passed on to the next generation. It's only the cells in his body. So those edits will only ever live in him, right? And there's a difference between doing that, and it's the second one that we're uncomfortable with.\n\nI thought they were editing it to make the children have a potential for higher intelligence. I think that's I think that's a maybe an unintended consequence of the gene that they were editing because in mice it did something like that, and so I think they just assume they're going to be smarter, but I don't think that they're old enough to even test that yet. Interesting. Maybe, but if they knew that, but it wasn't, it didn't end up even being the right because is HIV a real issue today? It's not really. So the reason that this that he got whatever ethical permission he did in China to do this is because they were children that were born by um IVF because the dad had AIDS. Oh, and so what they were trying to do was create what he claimed he was trying to do was create an environment where they would never accidentally get it. I guess if there's blood and it also makes them smarter. I don't know if they knew that at the time, but I mean they did. China's played a long game. It definitely affected their brains is what they just keep saying sort of in this article.\n\nYeah, but they don't, they don't know because they haven't been able to measure anything with these. I mean, they're guessing that would have affected their brains at this point. These scientists when they're the leaders of the world in 20 years, we'll know. We'll know for sure. We'll know.\n\nYeah. Yeah. This is, I mean, what makes us smart has been a thing that people have been trying to solve for a long time. And we're always looking for like the one or two genes that cure that figure out this. Very few traits are encoded by one or two genes. There are some hair traits. Whether your earlobes are attached or not, that's one gene that you can It is quite fascinating to think that in the future, dumb people will not exist. I doubt that's true.\n\nWhy? Maybe relatively dumb compared to everyone else that's alive then, but maybe far more intelligent than people that are alive today. Do you know what's interesting about the efforts that have gone on to try to figure out genes that make people smart, is that they can find associations between what we're classifying as smart, and this is hard. Like when you're when you're saying smart, do you mean somebody who can have a conversation with another person and shut up so that you're actually listening to other personalities? Do you mean somebody who can solve shitload of math problems and be a physicist or whatever and be awkward socially? Do you mean somebody who's just really [ __ ] good-looking, right? I mean, what do you mean when you say uh is this thing? And so you have to define that first. And then once it's defined, if you look for associations between genes at high frequency with people who rank high on whatever your thing is that you're you're ranking them on, it's different depending on which, you know, human population you're you're studying. So it's I mean, and this makes total evolutionary sense. Different things were under selection in different habitats at different times, and that made different people smarter in different ways for whatever that was.\n\nYeah, I actually think this is not how we start editing ourselves because that's not how evolution works. As soon as we edit everybody to be smart in that particular way and to be 5 foot 10 and blonde with blue eyes and perfect and never going to have diabetes, the most attractive thing out there is going to be the opposite of that, right? So there will be I just don't think I people are always thinking about we're going to get superhumans, but they have a specific picture in their mind of what that means. That's not the same picture that the Chinese government has in mind. It's not the same picture that I have in mind, right? And and that's that's why I don't fear it as much, I think, just because that's not that's not how it's going to happen. How it will happen is there will be some massive pandemic, and we discover that there is a particular mutation that means you're going to die, and then suddenly this most unethical thing that is like completely aborant and you absolutely can't do it will be the only ethical solution. That is how we get there. Wow. In in my imagination.\n\nWow. Um, well, I would love to have you back on when you get more information and more breakthroughs and more stuff that you really, really enjoy. You should come to the lab. I know you got to see.\n\nI would love to come to the lab. I will definitely do that. I promise you. I promise. Thank you so much for being here. It was really great. I really, really enjoyed it. And your book, Life as We Made It: How 50,000 Years of Human Innovation Refined―and Redefined―Nature, Beth Shapiro. I think the rest of my Siberia story is in there, including the part at the end where I did an audio book. I did. I read the audio book for that. Yes. Yes. I love it. I'm so glad you read it. I hate when other people have to read people's work.\n\nWell, I I asked if I could read it because my first book, How to Clone a Mammoth, I didn't read. And I heard the audio book. And I write in first person, and I tell stories, and I try to make it funny. And I was like, that's not how it should be read. So, I wrote to them and I said, \"Can I can I read this book?\" And they said, \"Oh, you're going to have to audition.\" And I was like, audition for your own book. What if I am not good enough to read my own audio book?\n\nWell, you clearly are. You're a great talker. Um, thank you so much. Thank you really for being here. I I really appreciate it. It was really fun. Thank you. All right. Bye, everybody.\n\n[Music]\n[Applause]\n[Music]\n",
  "metadata": {
    "summary": "In this episode, Joe Rogan hosts Beth Shapiro, an evolutionary molecular biologist and Chief Science Officer at Colossal Biosciences. They discuss Shapiro's career transition from broadcast journalism to science, her work at Colossal, and her experiences in Siberia, including encounters with aggressive mosquitoes and challenging expeditions. The conversation delves into topics such as the impact of human innovation on nature, the challenges of academia, and the potential of de-extinction. They also touch on the ethics of genetic engineering, the reintroduction of species, and the implications of these technologies for the future.",
    "topClaims": [
      {
        "text": "Scarcity mindset and gatekeeping stifle innovation in academia.",
        "rating": 8.5,
        "chunkId": "ck-PsMH1-Bbqr0-3"
      },
      {
        "text": "Humans are not designed for the modern world.",
        "rating": 7.8,
        "chunkId": "ck-PsMH1-Bbqr0-11"
      },
      {
        "text": "Snakes have wiped out 90% of the mammals in the Everglades.",
        "rating": 9.1,
        "chunkId": "ck-PsMH1-Bbqr0-48"
      },
      {
        "text": "Humans have never introduced a species to control another species without it going horribly wrong.",
        "rating": 8.2,
        "chunkId": "ck-PsMH1-Bbqr0-51"
      },
      {
        "text": "The rate of extinction today is thousands to tens of thousands times higher than it is across the history of the fossil record.",
        "rating": 8.9,
        "chunkId": "ck-PsMH1-Bbqr0-110"
      }
    ],
    "topQuotes": [
      {
        "text": "I feel like I have to defend what I think is the way that we should be doing science. Whenever there's a controversial subject and people are groundbreakers, you're without doubt going to get a lot of pushback and a lot of people that just want attention, a lot of people that are angry that you're getting attention.",
        "chunkId": "ck-PsMH1-Bbqr0-2",
        "chunkNum": 2,
        "relevance": 8.8,
        "interesting": 9.2
      },
      {
        "text": "And we're not really designed for this world, right?",
        "chunkId": "ck-PsMH1-Bbqr0-11",
        "chunkNum": 11,
        "relevance": 7.9,
        "interesting": 7.5
      },
      {
        "text": "Snakes have wiped out 90% of the mammals in the Everglades. But this is exactly why we need these technologies that we're trying to develop at Colossal Biosciences.",
        "chunkId": "ck-PsMH1-Bbqr0-48",
        "chunkNum": 48,
        "relevance": 8.5,
        "interesting": 8.1
      },
      {
        "text": "We've never done that before, right? Australia's a wreck.",
        "chunkId": "ck-PsMH1-Bbqr0-51",
        "chunkNum": 51,
        "relevance": 8.3,
        "interesting": 8.7
      },
      {
        "text": "We have the capacity to use these tools or at least to think about how we might develop and deploy these tools to have a future that is both filled with people and biodiverse.",
        "chunkId": "ck-PsMH1-Bbqr0-111",
        "chunkNum": 111,
        "relevance": 9.1,
        "interesting": 9.5
      }
    ],
    "topTopics": [
      {
        "name": "academic gatekeeping",
        "count": 15,
        "description": "The challenges and politics within the academic world."
      },
      {
        "name": "siberian mosquitoes",
        "count": 12,
        "description": "The aggressive nature of mosquitoes in Siberia."
      },
      {
        "name": "de extinction ethics",
        "count": 18,
        "description": "The potential and ethics of de-extinction and genetic engineering."
      },
      {
        "name": "species introduction",
        "count": 14,
        "description": "The introduction of species and its consequences."
      },
      {
        "name": "human impact",
        "count": 10,
        "description": "The impact of humans on the environment and biodiversity."
      }
    ],
    "videoInfo": {
      "id": "PsMH1-Bbqr0",
      "etag": "1XtguN9QWdLQtNuQ8enmUAcyaqI",
      "kind": "youtube#video",
      "snippet": {
        "tags": [
          "Joe Rogan Experience",
          "JRE",
          "Joe",
          "Rogan",
          "podcast",
          "MMA",
          "comedy",
          "stand",
          "up",
          "funny",
          "Freak",
          "Party"
        ],
        "title": "Joe Rogan Experience #2338 - Beth Shapiro",
        "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
        "localized": {
          "title": "Joe Rogan Experience #2338 - Beth Shapiro",
          "description": "Beth Shapiro, Ph.D., is an evolutionary molecular biologist and Chief Science Officer at Colossal Biosciences. She’s also the author of “Life as We Made It: How 50,000 Years of Human Innovation Refined―and Redefined―Nature.”\n⁠https://www.hachettebookgroup.com/titles/beth-shapiro/life-as-we-made-it/9781541644151⁠\n⁠https://colossal.com/team/beth-shapiro-ph-d/⁠\n\nUnlock yourself at https://join.WHOOP.com/jre for one month free\n\n50% off your first box at ⁠https://www.thefarmersdog.com/rogan⁠!"
        },
        "categoryId": "22",
        "thumbnails": {
          "high": {
            "url": "https://i.ytimg.com/vi/PsMH1-Bbqr0/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/PsMH1-Bbqr0/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/PsMH1-Bbqr0/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "default": {
            "url": "https://i.ytimg.com/vi/PsMH1-Bbqr0/default.jpg",
            "width": 120,
            "height": 90
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/PsMH1-Bbqr0/sddefault.jpg",
            "width": 640,
            "height": 480
          }
        },
        "description": "Beth Shapiro, Ph.D., is an evolutionary molecular biologist and Chief Science Officer at Colossal Biosciences. She’s also the author of “Life as We Made It: How 50,000 Years of Human Innovation Refined―and Redefined―Nature.”\n⁠https://www.hachettebookgroup.com/titles/beth-shapiro/life-as-we-made-it/9781541644151⁠\n⁠https://colossal.com/team/beth-shapiro-ph-d/⁠\n\nUnlock yourself at https://join.WHOOP.com/jre for one month free\n\n50% off your first box at ⁠https://www.thefarmersdog.com/rogan⁠!",
        "publishedAt": "2025-06-17T17:00:25Z",
        "channelTitle": "PowerfulJRE",
        "defaultLanguage": "en",
        "defaultAudioLanguage": "en-US",
        "liveBroadcastContent": "none"
      },
      "statistics": {
        "likeCount": "12287",
        "viewCount": "730809",
        "commentCount": "2714",
        "favoriteCount": "0"
      },
      "contentDetails": {
        "caption": "false",
        "duration": "PT2H59M48S",
        "dimension": "2d",
        "definition": "hd",
        "projection": "rectangular",
        "contentRating": {},
        "licensedContent": true
      }
    },
    "checkCount": 26,
    "nodeCounts": [
      {
        "node": "Neanderthals",
        "count": 8
      },
      {
        "node": "Florida",
        "count": 7
      },
      {
        "node": "Colossal",
        "count": 6
      },
      {
        "node": "DNA",
        "count": 6
      },
      {
        "node": "Colossal Biosciences",
        "count": 5
      },
      {
        "node": "Denisovans",
        "count": 5
      },
      {
        "node": "China",
        "count": 5
      },
      {
        "node": "direwolves",
        "count": 4
      },
      {
        "node": "Siberia",
        "count": 4
      },
      {
        "node": "Mosquitoes",
        "count": 4
      },
      {
        "node": "helicopter",
        "count": 4
      },
      {
        "node": "Ben",
        "count": 4
      },
      {
        "node": "California",
        "count": 4
      },
      {
        "node": "attention",
        "count": 3
      },
      {
        "node": "scarcity mindset",
        "count": 3
      },
      {
        "node": "innovation",
        "count": 3
      },
      {
        "node": "mosquitoes",
        "count": 3
      },
      {
        "node": "Alaska",
        "count": 3
      },
      {
        "node": "genes",
        "count": 3
      },
      {
        "node": "ice age",
        "count": 3
      },
      {
        "node": "Amazon",
        "count": 3
      },
      {
        "node": "humans",
        "count": 3
      },
      {
        "node": "Ancient DNA",
        "count": 3
      },
      {
        "node": "Jurassic Park",
        "count": 3
      },
      {
        "node": "paleoanthropology",
        "count": 3
      },
      {
        "node": "buffalo",
        "count": 3
      },
      {
        "node": "Texas",
        "count": 3
      },
      {
        "node": "honey badgers",
        "count": 3
      },
      {
        "node": "early 20th century",
        "count": 3
      },
      {
        "node": "wolves",
        "count": 3
      },
      {
        "node": "Yellowstone",
        "count": 3
      },
      {
        "node": "Klesi",
        "count": 3
      },
      {
        "node": "species concepts",
        "count": 3
      },
      {
        "node": "hybrid",
        "count": 3
      },
      {
        "node": "Dawson City",
        "count": 3
      },
      {
        "node": "Neanderthal genome",
        "count": 3
      },
      {
        "node": "animals",
        "count": 3
      },
      {
        "node": "conservation",
        "count": 3
      },
      {
        "node": "de-extinction",
        "count": 3
      },
      {
        "node": "ancient DNA",
        "count": 2
      },
      {
        "node": "expert",
        "count": 2
      },
      {
        "node": "broadcast journalism",
        "count": 2
      },
      {
        "node": "human history",
        "count": 2
      },
      {
        "node": "national parks",
        "count": 2
      },
      {
        "node": "Alan Cooper",
        "count": 2
      },
      {
        "node": "Yakutsk",
        "count": 2
      },
      {
        "node": "boat",
        "count": 2
      },
      {
        "node": "mammoths",
        "count": 2
      },
      {
        "node": "happy people",
        "count": 2
      },
      {
        "node": "gas tanks",
        "count": 2
      },
      {
        "node": "communication",
        "count": 2
      },
      {
        "node": "Zodiacs",
        "count": 2
      },
      {
        "node": "medical ethanol",
        "count": 2
      },
      {
        "node": "vodka",
        "count": 2
      },
      {
        "node": "Whoop",
        "count": 2
      },
      {
        "node": "tribes",
        "count": 2
      },
      {
        "node": "funding",
        "count": 2
      },
      {
        "node": "uncontacted people",
        "count": 2
      },
      {
        "node": "people",
        "count": 2
      },
      {
        "node": "human rights violations",
        "count": 2
      },
      {
        "node": "Percy Fawcett",
        "count": 2
      },
      {
        "node": "Luke Caverns",
        "count": 2
      },
      {
        "node": "Europe",
        "count": 2
      },
      {
        "node": "Jamie",
        "count": 2
      },
      {
        "node": "dodos",
        "count": 2
      },
      {
        "node": "sheep",
        "count": 2
      },
      {
        "node": "Komodo Island",
        "count": 2
      },
      {
        "node": "San Francisco",
        "count": 2
      },
      {
        "node": "feeding cage",
        "count": 2
      },
      {
        "node": "Neanderthal",
        "count": 2
      },
      {
        "node": "Florida man",
        "count": 2
      },
      {
        "node": "Everglades",
        "count": 2
      },
      {
        "node": "competition",
        "count": 2
      },
      {
        "node": "dogs",
        "count": 2
      },
      {
        "node": "Florida Man",
        "count": 2
      },
      {
        "node": "video",
        "count": 2
      },
      {
        "node": "Louisiana",
        "count": 2
      },
      {
        "node": "red wolves",
        "count": 2
      },
      {
        "node": "direwolf",
        "count": 2
      },
      {
        "node": "Water hyacinth",
        "count": 2
      },
      {
        "node": "Africa",
        "count": 2
      },
      {
        "node": "lake cow bacon",
        "count": 2
      },
      {
        "node": "Colombia",
        "count": 2
      },
      {
        "node": "William Randolph Hearst",
        "count": 2
      },
      {
        "node": "wild pigs",
        "count": 2
      },
      {
        "node": "ballot box biology",
        "count": 2
      },
      {
        "node": "Santa Cruz",
        "count": 2
      },
      {
        "node": "Montana",
        "count": 2
      },
      {
        "node": "ecosystem",
        "count": 2
      },
      {
        "node": "elk",
        "count": 2
      },
      {
        "node": "consequences",
        "count": 2
      },
      {
        "node": "American cheetah",
        "count": 2
      },
      {
        "node": "hybridization",
        "count": 2
      },
      {
        "node": "North America",
        "count": 2
      },
      {
        "node": "brown bear",
        "count": 2
      },
      {
        "node": "Bison priscus",
        "count": 2
      },
      {
        "node": "boneyard",
        "count": 2
      },
      {
        "node": "fight",
        "count": 2
      },
      {
        "node": "Canada",
        "count": 2
      },
      {
        "node": "Fairbanks",
        "count": 2
      },
      {
        "node": "American Museum",
        "count": 2
      },
      {
        "node": "fossil",
        "count": 2
      },
      {
        "node": "Gigantopithecus DNA",
        "count": 2
      },
      {
        "node": "Neanderthal DNA",
        "count": 2
      },
      {
        "node": "extinct",
        "count": 2
      },
      {
        "node": "Gigantopithecus",
        "count": 2
      },
      {
        "node": "skeletons",
        "count": 2
      },
      {
        "node": "Peru",
        "count": 2
      },
      {
        "node": "Bigfoot",
        "count": 2
      },
      {
        "node": "playing God",
        "count": 2
      },
      {
        "node": "personalized medicine",
        "count": 2
      },
      {
        "node": "cheetah",
        "count": 2
      },
      {
        "node": "bear",
        "count": 2
      },
      {
        "node": "moa",
        "count": 2
      },
      {
        "node": "audio book",
        "count": 2
      },
      {
        "node": "Joe Rogan podcast",
        "count": 1
      },
      {
        "node": "The Joe Rogan Experience",
        "count": 1
      },
      {
        "node": "Beth",
        "count": 1
      },
      {
        "node": "paleogenomics",
        "count": 1
      },
      {
        "node": "modern-day explorer",
        "count": 1
      },
      {
        "node": "Chief Science Officer",
        "count": 1
      },
      {
        "node": "academic job",
        "count": 1
      },
      {
        "node": "controversial subject",
        "count": 1
      },
      {
        "node": "groundbreakers",
        "count": 1
      },
      {
        "node": "pushback",
        "count": 1
      },
      {
        "node": "defend what I think",
        "count": 1
      },
      {
        "node": "angry",
        "count": 1
      },
      {
        "node": "doing science",
        "count": 1
      },
      {
        "node": "negativity",
        "count": 1
      },
      {
        "node": "gatekeeping",
        "count": 1
      },
      {
        "node": "podcasts",
        "count": 1
      },
      {
        "node": "colleagues",
        "count": 1
      },
      {
        "node": "subject",
        "count": 1
      },
      {
        "node": "local TV station",
        "count": 1
      },
      {
        "node": "Rome, Georgia",
        "count": 1
      },
      {
        "node": "morning show",
        "count": 1
      },
      {
        "node": "University of Georgia",
        "count": 1
      },
      {
        "node": "news director",
        "count": 1
      },
      {
        "node": "freshman",
        "count": 1
      },
      {
        "node": "broadcast radio station",
        "count": 1
      },
      {
        "node": "teleprompter",
        "count": 1
      },
      {
        "node": "field geology and archaeology program",
        "count": 1
      },
      {
        "node": "UC Santa Cruz",
        "count": 1
      },
      {
        "node": "geological history",
        "count": 1
      },
      {
        "node": "creative controllers of this landscape",
        "count": 1
      },
      {
        "node": "east coast",
        "count": 1
      },
      {
        "node": "west coast",
        "count": 1
      },
      {
        "node": "communicator",
        "count": 1
      },
      {
        "node": "scientist",
        "count": 1
      },
      {
        "node": "clean room",
        "count": 1
      },
      {
        "node": "geology",
        "count": 1
      },
      {
        "node": "rewriting stories",
        "count": 1
      },
      {
        "node": "human ancestry",
        "count": 1
      },
      {
        "node": "Soviet Union",
        "count": 1
      },
      {
        "node": "Moscow",
        "count": 1
      },
      {
        "node": "Summer",
        "count": 1
      },
      {
        "node": "Russian collaborators",
        "count": 1
      },
      {
        "node": "experiences in Siberia",
        "count": 1
      },
      {
        "node": "infrastructure",
        "count": 1
      },
      {
        "node": "Taima",
        "count": 1
      },
      {
        "node": "Tent",
        "count": 1
      },
      {
        "node": "Clapping",
        "count": 1
      },
      {
        "node": "Stinging",
        "count": 1
      },
      {
        "node": "Ickpikpuck River",
        "count": 1
      },
      {
        "node": "Mammoth bones",
        "count": 1
      },
      {
        "node": "Wind",
        "count": 1
      },
      {
        "node": "Moose",
        "count": 1
      },
      {
        "node": "Anchorage",
        "count": 1
      },
      {
        "node": "summertime",
        "count": 1
      },
      {
        "node": "salmon fishing",
        "count": 1
      },
      {
        "node": "Ari",
        "count": 1
      },
      {
        "node": "bug repellent",
        "count": 1
      },
      {
        "node": "tall grass",
        "count": 1
      },
      {
        "node": "blood meal",
        "count": 1
      },
      {
        "node": "mosquito repellent",
        "count": 1
      },
      {
        "node": "Happy People, Life in the Tiger",
        "count": 1
      },
      {
        "node": "Tiger River",
        "count": 1
      },
      {
        "node": "subsistence lifestyle",
        "count": 1
      },
      {
        "node": "pine pitch",
        "count": 1
      },
      {
        "node": "snowmobiles",
        "count": 1
      },
      {
        "node": "genetic level",
        "count": 1
      },
      {
        "node": "internal level",
        "count": 1
      },
      {
        "node": "society today",
        "count": 1
      },
      {
        "node": "10,000 years ago",
        "count": 1
      },
      {
        "node": "obesity",
        "count": 1
      },
      {
        "node": "diabetes",
        "count": 1
      },
      {
        "node": "depression",
        "count": 1
      },
      {
        "node": "anxiety",
        "count": 1
      },
      {
        "node": "Warner Herszog",
        "count": 1
      },
      {
        "node": "basic life",
        "count": 1
      },
      {
        "node": "Russian helicopter",
        "count": 1
      },
      {
        "node": "Siberian helicopter",
        "count": 1
      },
      {
        "node": "MI8",
        "count": 1
      },
      {
        "node": "Hatanga",
        "count": 1
      },
      {
        "node": "Pasha",
        "count": 1
      },
      {
        "node": "expedition team",
        "count": 1
      },
      {
        "node": "smoking",
        "count": 1
      },
      {
        "node": "Russian and French leaders",
        "count": 1
      },
      {
        "node": "air flow",
        "count": 1
      },
      {
        "node": "expedition",
        "count": 1
      },
      {
        "node": "mammoth bones",
        "count": 1
      },
      {
        "node": "woolly rhino bones",
        "count": 1
      },
      {
        "node": "animals bones",
        "count": 1
      },
      {
        "node": "firebomb",
        "count": 1
      },
      {
        "node": "family",
        "count": 1
      },
      {
        "node": "parents",
        "count": 1
      },
      {
        "node": "backpack",
        "count": 1
      },
      {
        "node": "cooler",
        "count": 1
      },
      {
        "node": "French",
        "count": 1
      },
      {
        "node": "Russian",
        "count": 1
      },
      {
        "node": "tent",
        "count": 1
      },
      {
        "node": "boats",
        "count": 1
      },
      {
        "node": "outboard",
        "count": 1
      },
      {
        "node": "lake",
        "count": 1
      },
      {
        "node": "glaciated",
        "count": 1
      },
      {
        "node": "finding",
        "count": 1
      },
      {
        "node": "devastating",
        "count": 1
      },
      {
        "node": "Russian cook",
        "count": 1
      },
      {
        "node": "crazy decision",
        "count": 1
      },
      {
        "node": "24-hour sunlight",
        "count": 1
      },
      {
        "node": "72 degrees latitude",
        "count": 1
      },
      {
        "node": "river water",
        "count": 1
      },
      {
        "node": "fish",
        "count": 1
      },
      {
        "node": "catch food",
        "count": 1
      },
      {
        "node": "shoot geese",
        "count": 1
      },
      {
        "node": "logistic",
        "count": 1
      },
      {
        "node": "Dolgon community",
        "count": 1
      },
      {
        "node": "Healthspan",
        "count": 1
      },
      {
        "node": "machine guns",
        "count": 1
      },
      {
        "node": "reindeer",
        "count": 1
      },
      {
        "node": "Communist Party",
        "count": 1
      },
      {
        "node": "David Atenboroough",
        "count": 1
      },
      {
        "node": "Paul Rosalie",
        "count": 1
      },
      {
        "node": "documentary",
        "count": 1
      },
      {
        "node": "leaf over my private parts",
        "count": 1
      },
      {
        "node": "eat you",
        "count": 1
      },
      {
        "node": "bugs that can kill you",
        "count": 1
      },
      {
        "node": "snakes that could kill you",
        "count": 1
      },
      {
        "node": "rainforest",
        "count": 1
      },
      {
        "node": "poor people",
        "count": 1
      },
      {
        "node": "logging job",
        "count": 1
      },
      {
        "node": "gnarly encounters",
        "count": 1
      },
      {
        "node": "weird noises",
        "count": 1
      },
      {
        "node": "stalked",
        "count": 1
      },
      {
        "node": "hunting animal",
        "count": 1
      },
      {
        "node": "perception",
        "count": 1
      },
      {
        "node": "senses",
        "count": 1
      },
      {
        "node": "paths",
        "count": 1
      },
      {
        "node": "rafts",
        "count": 1
      },
      {
        "node": "peace gesture",
        "count": 1
      },
      {
        "node": "him",
        "count": 1
      },
      {
        "node": "arrows",
        "count": 1
      },
      {
        "node": "escaped",
        "count": 1
      },
      {
        "node": "make contact",
        "count": 1
      },
      {
        "node": "loggers",
        "count": 1
      },
      {
        "node": "Westerner",
        "count": 1
      },
      {
        "node": "land takeover",
        "count": 1
      },
      {
        "node": "resource extractors",
        "count": 1
      },
      {
        "node": "minerals",
        "count": 1
      },
      {
        "node": "LiDAR discoveries",
        "count": 1
      },
      {
        "node": "sophisticated grids",
        "count": 1
      },
      {
        "node": "preppers",
        "count": 1
      },
      {
        "node": "civilization",
        "count": 1
      },
      {
        "node": "The Lost City of Z",
        "count": 1
      },
      {
        "node": "sophisticated civilizations",
        "count": 1
      },
      {
        "node": "horrible diseases",
        "count": 1
      },
      {
        "node": "LiDAR",
        "count": 1
      },
      {
        "node": "jungle consumed",
        "count": 1
      },
      {
        "node": "explorers",
        "count": 1
      },
      {
        "node": "settlers",
        "count": 1
      },
      {
        "node": "Civilizations",
        "count": 1
      },
      {
        "node": "Mysteries",
        "count": 1
      },
      {
        "node": "Getting Started",
        "count": 1
      },
      {
        "node": "dinosaurs back to life",
        "count": 1
      },
      {
        "node": "DNA stuff",
        "count": 1
      },
      {
        "node": "Michael Crichton",
        "count": 1
      },
      {
        "node": "Berkeley lab",
        "count": 1
      },
      {
        "node": "extinct species study group",
        "count": 1
      },
      {
        "node": "quagga",
        "count": 1
      },
      {
        "node": "Alan Wilson",
        "count": 1
      },
      {
        "node": "Neanderthal genome sequence",
        "count": 1
      },
      {
        "node": "Denisova people",
        "count": 1
      },
      {
        "node": "finger bone",
        "count": 1
      },
      {
        "node": "new species of human",
        "count": 1
      },
      {
        "node": "whole genome",
        "count": 1
      },
      {
        "node": "evolutionary history",
        "count": 1
      },
      {
        "node": "last decade",
        "count": 1
      },
      {
        "node": "podcast",
        "count": 1
      },
      {
        "node": "big head people",
        "count": 1
      },
      {
        "node": "jewelerin",
        "count": 1
      },
      {
        "node": "Homo sapiens",
        "count": 1
      },
      {
        "node": "December of 2020",
        "count": 1
      },
      {
        "node": "Juliani",
        "count": 1
      },
      {
        "node": "Breeding",
        "count": 1
      },
      {
        "node": "Hobbit people",
        "count": 1
      },
      {
        "node": "Flores",
        "count": 1
      },
      {
        "node": "DNA extraction",
        "count": 1
      },
      {
        "node": "Beth Shapiro's team",
        "count": 1
      },
      {
        "node": "DNA degradation",
        "count": 1
      },
      {
        "node": "Rampasa people",
        "count": 1
      },
      {
        "node": "husband's work",
        "count": 1
      },
      {
        "node": "DNA code",
        "count": 1
      },
      {
        "node": "spectrum of sizes",
        "count": 1
      },
      {
        "node": "different genes",
        "count": 1
      },
      {
        "node": "island dwarfism",
        "count": 1
      },
      {
        "node": "island",
        "count": 1
      },
      {
        "node": "hypothesis",
        "count": 1
      },
      {
        "node": "extreme",
        "count": 1
      },
      {
        "node": "fixation",
        "count": 1
      },
      {
        "node": "Elephants",
        "count": 1
      },
      {
        "node": "Komodo",
        "count": 1
      },
      {
        "node": "botulism",
        "count": 1
      },
      {
        "node": "venom",
        "count": 1
      },
      {
        "node": "Instagram",
        "count": 1
      },
      {
        "node": "goat",
        "count": 1
      },
      {
        "node": "Komodo dragons",
        "count": 1
      },
      {
        "node": "Sharon Stone's husband",
        "count": 1
      },
      {
        "node": "journalist",
        "count": 1
      },
      {
        "node": "white socks",
        "count": 1
      },
      {
        "node": "ex-husband",
        "count": 1
      },
      {
        "node": "Bronstein",
        "count": 1
      },
      {
        "node": "dragon",
        "count": 1
      },
      {
        "node": "reptile",
        "count": 1
      },
      {
        "node": "zookeeper",
        "count": 1
      },
      {
        "node": "tennis shoes",
        "count": 1
      },
      {
        "node": "rats",
        "count": 1
      },
      {
        "node": "flesh",
        "count": 1
      },
      {
        "node": "2001",
        "count": 1
      },
      {
        "node": "dumb things",
        "count": 1
      },
      {
        "node": "giraffes",
        "count": 1
      },
      {
        "node": "Matt James",
        "count": 1
      },
      {
        "node": "Chief Animal Officer at Colossal",
        "count": 1
      },
      {
        "node": "San Diego Zoo",
        "count": 1
      },
      {
        "node": "Giraffe intelligence",
        "count": 1
      },
      {
        "node": "Giraffe necks",
        "count": 1
      },
      {
        "node": "Food preference experiment",
        "count": 1
      },
      {
        "node": "Brain size",
        "count": 1
      },
      {
        "node": "Evolution",
        "count": 1
      },
      {
        "node": "Person",
        "count": 1
      },
      {
        "node": "Kid in basement",
        "count": 1
      },
      {
        "node": "Call of Duty",
        "count": 1
      },
      {
        "node": "James",
        "count": 1
      },
      {
        "node": "Video games",
        "count": 1
      },
      {
        "node": "War Thunder",
        "count": 1
      },
      {
        "node": "De-extinction",
        "count": 1
      },
      {
        "node": "Dire wolves",
        "count": 1
      },
      {
        "node": "Kesi",
        "count": 1
      },
      {
        "node": "Direwolf coat",
        "count": 1
      },
      {
        "node": "extinction work",
        "count": 1
      },
      {
        "node": "species preservation work",
        "count": 1
      },
      {
        "node": "awe",
        "count": 1
      },
      {
        "node": "Kesi's birth",
        "count": 1
      },
      {
        "node": "conference",
        "count": 1
      },
      {
        "node": "text messages",
        "count": 1
      },
      {
        "node": "Klesia",
        "count": 1
      },
      {
        "node": "COVID",
        "count": 1
      },
      {
        "node": "wonder",
        "count": 1
      },
      {
        "node": "Extinction",
        "count": 1
      },
      {
        "node": "Human arrogance",
        "count": 1
      },
      {
        "node": "Ecosystem",
        "count": 1
      },
      {
        "node": "Invasive species",
        "count": 1
      },
      {
        "node": "The beginning",
        "count": 1
      },
      {
        "node": "Everything",
        "count": 1
      },
      {
        "node": "The line",
        "count": 1
      },
      {
        "node": "Burmese pythons",
        "count": 1
      },
      {
        "node": "monetary reward",
        "count": 1
      },
      {
        "node": "Python cowboy",
        "count": 1
      },
      {
        "node": "snakes",
        "count": 1
      },
      {
        "node": "alligators",
        "count": 1
      },
      {
        "node": "endangered species list",
        "count": 1
      },
      {
        "node": "class of 1967",
        "count": 1
      },
      {
        "node": "18-foot-long snake",
        "count": 1
      },
      {
        "node": "Alligator",
        "count": 1
      },
      {
        "node": "Swimming in a lake",
        "count": 1
      },
      {
        "node": "Alligator bite",
        "count": 1
      },
      {
        "node": "Walking with one arm",
        "count": 1
      },
      {
        "node": "Bleeding to death",
        "count": 1
      },
      {
        "node": "Netflix",
        "count": 1
      },
      {
        "node": "Georgia",
        "count": 1
      },
      {
        "node": "golf courses",
        "count": 1
      },
      {
        "node": "alligator",
        "count": 1
      },
      {
        "node": "Facebook",
        "count": 1
      },
      {
        "node": "Cannibalize",
        "count": 1
      },
      {
        "node": "Snakes",
        "count": 1
      },
      {
        "node": "Mammals",
        "count": 1
      },
      {
        "node": "Birds",
        "count": 1
      },
      {
        "node": "Species preservation",
        "count": 1
      },
      {
        "node": "Raccoons",
        "count": 1
      },
      {
        "node": "Skunks",
        "count": 1
      },
      {
        "node": "Deer",
        "count": 1
      },
      {
        "node": "Adaptation",
        "count": 1
      },
      {
        "node": "Saving Florida panthers",
        "count": 1
      },
      {
        "node": "Florida panthers",
        "count": 1
      },
      {
        "node": "Texas panthers introduction",
        "count": 1
      },
      {
        "node": "Genetic diversity",
        "count": 1
      },
      {
        "node": "Crypto orchidism",
        "count": 1
      },
      {
        "node": "Heart problems",
        "count": 1
      },
      {
        "node": "Breeding population",
        "count": 1
      },
      {
        "node": "Inbreeding",
        "count": 1
      },
      {
        "node": "genetic rescue",
        "count": 1
      },
      {
        "node": "red wolf",
        "count": 1
      },
      {
        "node": "American wolf",
        "count": 1
      },
      {
        "node": "captive breeding program",
        "count": 1
      },
      {
        "node": "Bridget Bonhold",
        "count": 1
      },
      {
        "node": "Princeton",
        "count": 1
      },
      {
        "node": "animal",
        "count": 1
      },
      {
        "node": "DNA ancestry",
        "count": 1
      },
      {
        "node": "canids",
        "count": 1
      },
      {
        "node": "genetic diversity",
        "count": 1
      },
      {
        "node": "editing DNA",
        "count": 1
      },
      {
        "node": "python problem",
        "count": 1
      },
      {
        "node": "feral cat problem",
        "count": 1
      },
      {
        "node": "giant African land snails",
        "count": 1
      },
      {
        "node": "rosy wolf snail",
        "count": 1
      },
      {
        "node": "giant esargo",
        "count": 1
      },
      {
        "node": "rosy wolf snails",
        "count": 1
      },
      {
        "node": "endemic snails",
        "count": 1
      },
      {
        "node": "cobras",
        "count": 1
      },
      {
        "node": "lions",
        "count": 1
      },
      {
        "node": "wild cats episode",
        "count": 1
      },
      {
        "node": "camouflage",
        "count": 1
      },
      {
        "node": "Wolverine",
        "count": 1
      },
      {
        "node": "snake",
        "count": 1
      },
      {
        "node": "antivenom properties",
        "count": 1
      },
      {
        "node": "coat pattern",
        "count": 1
      },
      {
        "node": "hippo solution",
        "count": 1
      },
      {
        "node": "American history",
        "count": 1
      },
      {
        "node": "Early 20th century",
        "count": 1
      },
      {
        "node": "Overgrazing",
        "count": 1
      },
      {
        "node": "Meat question",
        "count": 1
      },
      {
        "node": "World Fair",
        "count": 1
      },
      {
        "node": "New Orleans",
        "count": 1
      },
      {
        "node": "Water hyacinth gift",
        "count": 1
      },
      {
        "node": "Mississippi",
        "count": 1
      },
      {
        "node": "Hippo import",
        "count": 1
      },
      {
        "node": "Bayou",
        "count": 1
      },
      {
        "node": "Team",
        "count": 1
      },
      {
        "node": "Congressman",
        "count": 1
      },
      {
        "node": "Boy Scouts of America",
        "count": 1
      },
      {
        "node": "Con man",
        "count": 1
      },
      {
        "node": "Journalist",
        "count": 1
      },
      {
        "node": "Boer Wars",
        "count": 1
      },
      {
        "node": "animals from Africa",
        "count": 1
      },
      {
        "node": "hunting animals",
        "count": 1
      },
      {
        "node": "conservation legislation",
        "count": 1
      },
      {
        "node": "show",
        "count": 1
      },
      {
        "node": "conman",
        "count": 1
      },
      {
        "node": "congressman's team",
        "count": 1
      },
      {
        "node": "utility of nature",
        "count": 1
      },
      {
        "node": "scout",
        "count": 1
      },
      {
        "node": "testified in front of Congress",
        "count": 1
      },
      {
        "node": "con man",
        "count": 1
      },
      {
        "node": "editorial",
        "count": 1
      },
      {
        "node": "Teddy Roosevelt",
        "count": 1
      },
      {
        "node": "bill",
        "count": 1
      },
      {
        "node": "New York Times",
        "count": 1
      },
      {
        "node": "Congress",
        "count": 1
      },
      {
        "node": "Failed House bill",
        "count": 1
      },
      {
        "node": "US",
        "count": 1
      },
      {
        "node": "hippo ranchers",
        "count": 1
      },
      {
        "node": "low-cost meat",
        "count": 1
      },
      {
        "node": "hippopotamus",
        "count": 1
      },
      {
        "node": "Pablo Escobar",
        "count": 1
      },
      {
        "node": "mammal",
        "count": 1
      },
      {
        "node": "hippos",
        "count": 1
      },
      {
        "node": "wild boars",
        "count": 1
      },
      {
        "node": "property",
        "count": 1
      },
      {
        "node": "importing",
        "count": 1
      },
      {
        "node": "domestication of pigs",
        "count": 1
      },
      {
        "node": "Southeast Asia",
        "count": 1
      },
      {
        "node": "feral pigs",
        "count": 1
      },
      {
        "node": "northern Manchuria",
        "count": 1
      },
      {
        "node": "Colorado governor",
        "count": 1
      },
      {
        "node": "Wolves introduction",
        "count": 1
      },
      {
        "node": "Introductory biology class",
        "count": 1
      },
      {
        "node": "Debate",
        "count": 1
      },
      {
        "node": "New York City",
        "count": 1
      },
      {
        "node": "Calves compensation",
        "count": 1
      },
      {
        "node": "Cattle ranches",
        "count": 1
      },
      {
        "node": "Tools to think",
        "count": 1
      },
      {
        "node": "natural migration",
        "count": 1
      },
      {
        "node": "British Columbia",
        "count": 1
      },
      {
        "node": "Alberta",
        "count": 1
      },
      {
        "node": "overpopulation of elk",
        "count": 1
      },
      {
        "node": "hunting seasons",
        "count": 1
      },
      {
        "node": "apex predators",
        "count": 1
      },
      {
        "node": "Yellowstone thing",
        "count": 1
      },
      {
        "node": "introduction of wolves",
        "count": 1
      },
      {
        "node": "mountain lions",
        "count": 1
      },
      {
        "node": "hunting cooperative animals",
        "count": 1
      },
      {
        "node": "reintroduction of wolves",
        "count": 1
      },
      {
        "node": "elk population",
        "count": 1
      },
      {
        "node": "elk hunters",
        "count": 1
      },
      {
        "node": "Aspen",
        "count": 1
      },
      {
        "node": "cattle ranch",
        "count": 1
      },
      {
        "node": "Debate class",
        "count": 1
      },
      {
        "node": "debate",
        "count": 1
      },
      {
        "node": "rancher",
        "count": 1
      },
      {
        "node": "politician",
        "count": 1
      },
      {
        "node": "conservationist",
        "count": 1
      },
      {
        "node": "18-year-olds",
        "count": 1
      },
      {
        "node": "perspective",
        "count": 1
      },
      {
        "node": "thoughtfulness",
        "count": 1
      },
      {
        "node": "conclusion",
        "count": 1
      },
      {
        "node": "apex predator",
        "count": 1
      },
      {
        "node": "Calabasas",
        "count": 1
      },
      {
        "node": "pets",
        "count": 1
      },
      {
        "node": "goats",
        "count": 1
      },
      {
        "node": "predator's eyes",
        "count": 1
      },
      {
        "node": "DNA being modified",
        "count": 1
      },
      {
        "node": "gene expression",
        "count": 1
      },
      {
        "node": "health span",
        "count": 1
      },
      {
        "node": "lifespan",
        "count": 1
      },
      {
        "node": "habitat",
        "count": 1
      },
      {
        "node": "ecological preserve",
        "count": 1
      },
      {
        "node": "weak and soft",
        "count": 1
      },
      {
        "node": "breeding",
        "count": 1
      },
      {
        "node": "hormonal contraceptive",
        "count": 1
      },
      {
        "node": "castrate",
        "count": 1
      },
      {
        "node": "track",
        "count": 1
      },
      {
        "node": "cameras",
        "count": 1
      },
      {
        "node": "fencing",
        "count": 1
      },
      {
        "node": "monitoring",
        "count": 1
      },
      {
        "node": "hormones",
        "count": 1
      },
      {
        "node": "Jeff Goldblum",
        "count": 1
      },
      {
        "node": "Henry Woo",
        "count": 1
      },
      {
        "node": "evil transition",
        "count": 1
      },
      {
        "node": "dinosaurs",
        "count": 1
      },
      {
        "node": "genome sequences",
        "count": 1
      },
      {
        "node": "population problems",
        "count": 1
      },
      {
        "node": "Maitius",
        "count": 1
      },
      {
        "node": "Criticisms",
        "count": 1
      },
      {
        "node": "DNA manipulation",
        "count": 1
      },
      {
        "node": "Direwolf genome sequences",
        "count": 1
      },
      {
        "node": "Genome engineering",
        "count": 1
      },
      {
        "node": "Romulus",
        "count": 1
      },
      {
        "node": "Remus",
        "count": 1
      },
      {
        "node": "Light coat color",
        "count": 1
      },
      {
        "node": "Direwolf evolution",
        "count": 1
      },
      {
        "node": "Direwolf",
        "count": 1
      },
      {
        "node": "Light color coat",
        "count": 1
      },
      {
        "node": "Ice age",
        "count": 1
      },
      {
        "node": "La Brea Tar Pits",
        "count": 1
      },
      {
        "node": "DNA recovery",
        "count": 1
      },
      {
        "node": "Polar bear hair",
        "count": 1
      },
      {
        "node": "Polar bears turning green",
        "count": 1
      },
      {
        "node": "Mold in polar bear hair",
        "count": 1
      },
      {
        "node": "Interglacial periods",
        "count": 1
      },
      {
        "node": "Northern part",
        "count": 1
      },
      {
        "node": "evolutionary advantage",
        "count": 1
      },
      {
        "node": "geographical overlap",
        "count": 1
      },
      {
        "node": "induced ovulator",
        "count": 1
      },
      {
        "node": "scavenge for food",
        "count": 1
      },
      {
        "node": "Ian Stirling",
        "count": 1
      },
      {
        "node": "hunting seals",
        "count": 1
      },
      {
        "node": "ice shelves",
        "count": 1
      },
      {
        "node": "black nose",
        "count": 1
      },
      {
        "node": "Canadian Wildlife",
        "count": 1
      },
      {
        "node": "Hybridization",
        "count": 1
      },
      {
        "node": "last ice age",
        "count": 1
      },
      {
        "node": "brown bears",
        "count": 1
      },
      {
        "node": "polar bears",
        "count": 1
      },
      {
        "node": "Neanderthal ancestors",
        "count": 1
      },
      {
        "node": "ABC islands",
        "count": 1
      },
      {
        "node": "admixture",
        "count": 1
      },
      {
        "node": "German zoo",
        "count": 1
      },
      {
        "node": "bears",
        "count": 1
      },
      {
        "node": "polar bear",
        "count": 1
      },
      {
        "node": "academic scientists",
        "count": 1
      },
      {
        "node": "species definition",
        "count": 1
      },
      {
        "node": "dinosaur fossils",
        "count": 1
      },
      {
        "node": "morphological species concept",
        "count": 1
      },
      {
        "node": "bone shapes",
        "count": 1
      },
      {
        "node": "Step bison",
        "count": 1
      },
      {
        "node": "Bison crassicornis",
        "count": 1
      },
      {
        "node": "Bison occidentalis",
        "count": 1
      },
      {
        "node": "Bison aliscansis",
        "count": 1
      },
      {
        "node": "bone lab",
        "count": 1
      },
      {
        "node": "gold mines",
        "count": 1
      },
      {
        "node": "permafrost",
        "count": 1
      },
      {
        "node": "beer",
        "count": 1
      },
      {
        "node": "women fighting",
        "count": 1
      },
      {
        "node": "men fighting",
        "count": 1
      },
      {
        "node": "guns",
        "count": 1
      },
      {
        "node": "bell",
        "count": 1
      },
      {
        "node": "diamond driller",
        "count": 1
      },
      {
        "node": "paleo geneticists",
        "count": 1
      },
      {
        "node": "Canadians",
        "count": 1
      },
      {
        "node": "ringing the bell",
        "count": 1
      },
      {
        "node": "buying a round",
        "count": 1
      },
      {
        "node": "collection",
        "count": 1
      },
      {
        "node": "East River",
        "count": 1
      },
      {
        "node": "John Reeves",
        "count": 1
      },
      {
        "node": "step bison bones",
        "count": 1
      },
      {
        "node": "jaw fragments",
        "count": 1
      },
      {
        "node": "bison",
        "count": 1
      },
      {
        "node": "species concept",
        "count": 1
      },
      {
        "node": "AM&H",
        "count": 1
      },
      {
        "node": "bone",
        "count": 1
      },
      {
        "node": "paleontologists",
        "count": 1
      },
      {
        "node": "river",
        "count": 1
      },
      {
        "node": "last laugh",
        "count": 1
      },
      {
        "node": "10,000 years",
        "count": 1
      },
      {
        "node": "Dirty Water Dawn",
        "count": 1
      },
      {
        "node": "gold mining activity",
        "count": 1
      },
      {
        "node": "John's property",
        "count": 1
      },
      {
        "node": "warehouses",
        "count": 1
      },
      {
        "node": "animals die off",
        "count": 1
      },
      {
        "node": "Klondike region",
        "count": 1
      },
      {
        "node": "gold miners",
        "count": 1
      },
      {
        "node": "gold-bearing gravel",
        "count": 1
      },
      {
        "node": "mammoth tooth",
        "count": 1
      },
      {
        "node": "knife handles",
        "count": 1
      },
      {
        "node": "logo",
        "count": 1
      },
      {
        "node": "founding fathers and mammoths",
        "count": 1
      },
      {
        "node": "high-pressure water hoses",
        "count": 1
      },
      {
        "node": "frozen dirt",
        "count": 1
      },
      {
        "node": "handwritten letter",
        "count": 1
      },
      {
        "node": "naked girl",
        "count": 1
      },
      {
        "node": "Bigfoot DNA",
        "count": 1
      },
      {
        "node": "Bigfoots",
        "count": 1
      },
      {
        "node": "insulation",
        "count": 1
      },
      {
        "node": "strip club",
        "count": 1
      },
      {
        "node": "basement",
        "count": 1
      },
      {
        "node": "email",
        "count": 1
      },
      {
        "node": "meth",
        "count": 1
      },
      {
        "node": "Bigfoot peas",
        "count": 1
      },
      {
        "node": "human DNA",
        "count": 1
      },
      {
        "node": "Gigantopithecus extinction",
        "count": 1
      },
      {
        "node": "bones",
        "count": 1
      },
      {
        "node": "anthropologist",
        "count": 1
      },
      {
        "node": "apothecary shop",
        "count": 1
      },
      {
        "node": "primate Teeth",
        "count": 1
      },
      {
        "node": "jawbones",
        "count": 1
      },
      {
        "node": "digging and discovering",
        "count": 1
      },
      {
        "node": "rewrite human history",
        "count": 1
      },
      {
        "node": "partial jawbone",
        "count": 1
      },
      {
        "node": "fossils",
        "count": 1
      },
      {
        "node": "species",
        "count": 1
      },
      {
        "node": "fossils are hard to make",
        "count": 1
      },
      {
        "node": "creatures",
        "count": 1
      },
      {
        "node": "arrogantly",
        "count": 1
      },
      {
        "node": "limited resource",
        "count": 1
      },
      {
        "node": "Paleoanthropologists",
        "count": 1
      },
      {
        "node": "Archaeologists",
        "count": 1
      },
      {
        "node": "Interbreed",
        "count": 1
      },
      {
        "node": "Human history",
        "count": 1
      },
      {
        "node": "Paleoanthropology",
        "count": 1
      },
      {
        "node": "Archaeology",
        "count": 1
      },
      {
        "node": "DNA testing places",
        "count": 1
      },
      {
        "node": "brother",
        "count": 1
      },
      {
        "node": "cousins",
        "count": 1
      },
      {
        "node": "forehead",
        "count": 1
      },
      {
        "node": "genomes",
        "count": 1
      },
      {
        "node": "mutations",
        "count": 1
      },
      {
        "node": "split from Neanderthals",
        "count": 1
      },
      {
        "node": "human",
        "count": 1
      },
      {
        "node": "names",
        "count": 1
      },
      {
        "node": "proto-hominids",
        "count": 1
      },
      {
        "node": "endangered species",
        "count": 1
      },
      {
        "node": "biological species concept",
        "count": 1
      },
      {
        "node": "hybrids",
        "count": 1
      },
      {
        "node": "admixture history",
        "count": 1
      },
      {
        "node": "F1s",
        "count": 1
      },
      {
        "node": "Bud Basolo",
        "count": 1
      },
      {
        "node": "1975 individual",
        "count": 1
      },
      {
        "node": "hybrid cattle and bison",
        "count": 1
      },
      {
        "node": "buffalo of the week competition",
        "count": 1
      },
      {
        "node": "I can't remember the name",
        "count": 1
      },
      {
        "node": "North American prairies",
        "count": 1
      },
      {
        "node": "Highland cattle",
        "count": 1
      },
      {
        "node": "zebu",
        "count": 1
      },
      {
        "node": "Brazil zebu",
        "count": 1
      },
      {
        "node": "historic buffalo",
        "count": 1
      },
      {
        "node": "dude",
        "count": 1
      },
      {
        "node": "website",
        "count": 1
      },
      {
        "node": "Steve Vanella",
        "count": 1
      },
      {
        "node": "Chihuahua",
        "count": 1
      },
      {
        "node": "understanding",
        "count": 1
      },
      {
        "node": "blood test",
        "count": 1
      },
      {
        "node": "markers",
        "count": 1
      },
      {
        "node": "paper",
        "count": 1
      },
      {
        "node": "homo sapiens",
        "count": 1
      },
      {
        "node": "mammoth DNA",
        "count": 1
      },
      {
        "node": "horse DNA",
        "count": 1
      },
      {
        "node": "Native American cultures",
        "count": 1
      },
      {
        "node": "model",
        "count": 1
      },
      {
        "node": "arrogant",
        "count": 1
      },
      {
        "node": "Horses",
        "count": 1
      },
      {
        "node": "Eohippus",
        "count": 1
      },
      {
        "node": "Wyoming",
        "count": 1
      },
      {
        "node": "Clovis first",
        "count": 1
      },
      {
        "node": "White Sands, New Mexico",
        "count": 1
      },
      {
        "node": "Zakamar",
        "count": 1
      },
      {
        "node": "northern Canada",
        "count": 1
      },
      {
        "node": "footprints",
        "count": 1
      },
      {
        "node": "DNA rewrites human history",
        "count": 1
      },
      {
        "node": "mysterious group of people",
        "count": 1
      },
      {
        "node": "indigenous populations",
        "count": 1
      },
      {
        "node": "extinct lineage",
        "count": 1
      },
      {
        "node": "South America",
        "count": 1
      },
      {
        "node": "earliest humans",
        "count": 1
      },
      {
        "node": "human settlements",
        "count": 1
      },
      {
        "node": "humans originating in Africa",
        "count": 1
      },
      {
        "node": "tridactyl skeletons",
        "count": 1
      },
      {
        "node": "Jesse Michaels",
        "count": 1
      },
      {
        "node": "YouTube show",
        "count": 1
      },
      {
        "node": "three fingers and three toes",
        "count": 1
      },
      {
        "node": "cat scans",
        "count": 1
      },
      {
        "node": "x-rays",
        "count": 1
      },
      {
        "node": "CAT scan",
        "count": 1
      },
      {
        "node": "cartilage",
        "count": 1
      },
      {
        "node": "fingers and toes",
        "count": 1
      },
      {
        "node": "reports",
        "count": 1
      },
      {
        "node": "Mexican government",
        "count": 1
      },
      {
        "node": "the guy",
        "count": 1
      },
      {
        "node": "silly things",
        "count": 1
      },
      {
        "node": "thing on the neck",
        "count": 1
      },
      {
        "node": "image of the back",
        "count": 1
      },
      {
        "node": "shape of its head",
        "count": 1
      },
      {
        "node": "three-toed alien people",
        "count": 1
      },
      {
        "node": "DNA work",
        "count": 1
      },
      {
        "node": "protein work",
        "count": 1
      },
      {
        "node": "thing in the back of its head",
        "count": 1
      },
      {
        "node": "select group of people",
        "count": 1
      },
      {
        "node": "tapestries",
        "count": 1
      },
      {
        "node": "three-toed, three-fingered things",
        "count": 1
      },
      {
        "node": "another type of human",
        "count": 1
      },
      {
        "node": "genetic mutation",
        "count": 1
      },
      {
        "node": "isolated tribe",
        "count": 1
      },
      {
        "node": "proteins",
        "count": 1
      },
      {
        "node": "dragon bones",
        "count": 1
      },
      {
        "node": "Ralph Von Conigwall",
        "count": 1
      },
      {
        "node": "1935",
        "count": 1
      },
      {
        "node": "orangutans",
        "count": 1
      },
      {
        "node": "spear fishing",
        "count": 1
      },
      {
        "node": "learning",
        "count": 1
      },
      {
        "node": "sentient AI",
        "count": 1
      },
      {
        "node": "woolly mammoth",
        "count": 1
      },
      {
        "node": "financial windfall",
        "count": 1
      },
      {
        "node": "gaslight",
        "count": 1
      },
      {
        "node": "biased evidence",
        "count": 1
      },
      {
        "node": "Door Dash",
        "count": 1
      },
      {
        "node": "rewilding plans",
        "count": 1
      },
      {
        "node": "potential impacts",
        "count": 1
      },
      {
        "node": "native animals",
        "count": 1
      },
      {
        "node": "rewilding",
        "count": 1
      },
      {
        "node": "haters",
        "count": 1
      },
      {
        "node": "healthy population",
        "count": 1
      },
      {
        "node": "whine",
        "count": 1
      },
      {
        "node": "punishment",
        "count": 1
      },
      {
        "node": "negative",
        "count": 1
      },
      {
        "node": "creating",
        "count": 1
      },
      {
        "node": "taking",
        "count": 1
      },
      {
        "node": "technology development",
        "count": 1
      },
      {
        "node": "species extinction",
        "count": 1
      },
      {
        "node": "habitat change",
        "count": 1
      },
      {
        "node": "domestication",
        "count": 1
      },
      {
        "node": "population maintenance",
        "count": 1
      },
      {
        "node": "authority",
        "count": 1
      },
      {
        "node": "hands-off",
        "count": 1
      },
      {
        "node": "animals live",
        "count": 1
      },
      {
        "node": "Stuart Brand",
        "count": 1
      },
      {
        "node": "Whole Earth Catalog",
        "count": 1
      },
      {
        "node": "DNA sequences",
        "count": 1
      },
      {
        "node": "fix some of the things",
        "count": 1
      },
      {
        "node": "as gods",
        "count": 1
      },
      {
        "node": "deploy",
        "count": 1
      },
      {
        "node": "ancestors",
        "count": 1
      },
      {
        "node": "biggest challenge",
        "count": 1
      },
      {
        "node": "space that we need",
        "count": 1
      },
      {
        "node": "regulatory frameworks",
        "count": 1
      },
      {
        "node": "biological reality",
        "count": 1
      },
      {
        "node": "attitude of negativity",
        "count": 1
      },
      {
        "node": "decision",
        "count": 1
      },
      {
        "node": "trust ourselves",
        "count": 1
      },
      {
        "node": "extinction rate",
        "count": 1
      },
      {
        "node": "Hawaiian honeycreepers",
        "count": 1
      },
      {
        "node": "avian malaria",
        "count": 1
      },
      {
        "node": "mosquitoes introduction",
        "count": 1
      },
      {
        "node": "bleaching resistance",
        "count": 1
      },
      {
        "node": "ecosystem changes",
        "count": 1
      },
      {
        "node": "habitat changes",
        "count": 1
      },
      {
        "node": "spruce forest",
        "count": 1
      },
      {
        "node": "resin",
        "count": 1
      },
      {
        "node": "beetles",
        "count": 1
      },
      {
        "node": "tools",
        "count": 1
      },
      {
        "node": "biodiverse future",
        "count": 1
      },
      {
        "node": "crude application",
        "count": 1
      },
      {
        "node": "animal species",
        "count": 1
      },
      {
        "node": "test run",
        "count": 1
      },
      {
        "node": "super person",
        "count": 1
      },
      {
        "node": "future",
        "count": 1
      },
      {
        "node": "genetic diseases",
        "count": 1
      },
      {
        "node": "baby KJ",
        "count": 1
      },
      {
        "node": "metabolic disease",
        "count": 1
      },
      {
        "node": "genetic change",
        "count": 1
      },
      {
        "node": "genome engineering",
        "count": 1
      },
      {
        "node": "collaborative effort",
        "count": 1
      },
      {
        "node": "protein",
        "count": 1
      },
      {
        "node": "Crisper Editing",
        "count": 1
      },
      {
        "node": "cystic fibrosis",
        "count": 1
      },
      {
        "node": "blood cancer",
        "count": 1
      },
      {
        "node": "direwolf DNA",
        "count": 1
      },
      {
        "node": "greywolf",
        "count": 1
      },
      {
        "node": "genetic edits",
        "count": 1
      },
      {
        "node": "cancer mutation",
        "count": 1
      },
      {
        "node": "mammoth",
        "count": 1
      },
      {
        "node": "Tasmanian tiger",
        "count": 1
      },
      {
        "node": "dodo",
        "count": 1
      },
      {
        "node": "saber-tooth cats",
        "count": 1
      },
      {
        "node": "pronghorn antelopes",
        "count": 1
      },
      {
        "node": "reintroduction",
        "count": 1
      },
      {
        "node": "short-faced bear",
        "count": 1
      },
      {
        "node": "photo",
        "count": 1
      },
      {
        "node": "Longhorned bison",
        "count": 1
      },
      {
        "node": "Irish elk",
        "count": 1
      },
      {
        "node": "scientists",
        "count": 1
      },
      {
        "node": "megalos",
        "count": 1
      },
      {
        "node": "camels",
        "count": 1
      },
      {
        "node": "Camelops",
        "count": 1
      },
      {
        "node": "giant beaver",
        "count": 1
      },
      {
        "node": "five foot beaver",
        "count": 1
      },
      {
        "node": "logs",
        "count": 1
      },
      {
        "node": "megapona",
        "count": 1
      },
      {
        "node": "Thomas Jefferson",
        "count": 1
      },
      {
        "node": "Megalonx Jefferson",
        "count": 1
      },
      {
        "node": "giant sloth",
        "count": 1
      },
      {
        "node": "giant shortfaced bear",
        "count": 1
      },
      {
        "node": "smileon",
        "count": 1
      },
      {
        "node": "sloths",
        "count": 1
      },
      {
        "node": "jaguars",
        "count": 1
      },
      {
        "node": "swinging",
        "count": 1
      },
      {
        "node": "nature",
        "count": 1
      },
      {
        "node": "mold",
        "count": 1
      },
      {
        "node": "rescue place",
        "count": 1
      },
      {
        "node": "Jaguars",
        "count": 1
      },
      {
        "node": "Arizona",
        "count": 1
      },
      {
        "node": "Mountain lions",
        "count": 1
      },
      {
        "node": "redwoods",
        "count": 1
      },
      {
        "node": "camping",
        "count": 1
      },
      {
        "node": "running",
        "count": 1
      },
      {
        "node": "big cats",
        "count": 1
      },
      {
        "node": "Dog eating",
        "count": 1
      },
      {
        "node": "Fear of dogs",
        "count": 1
      },
      {
        "node": "Labrador retriever",
        "count": 1
      },
      {
        "node": "Golden retriever",
        "count": 1
      },
      {
        "node": "Northern California",
        "count": 1
      },
      {
        "node": "Depredation tags",
        "count": 1
      },
      {
        "node": "Diet",
        "count": 1
      },
      {
        "node": "Spooky",
        "count": 1
      },
      {
        "node": "California golden bear",
        "count": 1
      },
      {
        "node": "Hurst",
        "count": 1
      },
      {
        "node": "Monarch",
        "count": 1
      },
      {
        "node": "genome",
        "count": 1
      },
      {
        "node": "Lbeck, California",
        "count": 1
      },
      {
        "node": "Southern California",
        "count": 1
      },
      {
        "node": "grizzly bear",
        "count": 1
      },
      {
        "node": "grizzly bears",
        "count": 1
      },
      {
        "node": "forest fires",
        "count": 1
      },
      {
        "node": "diet",
        "count": 1
      },
      {
        "node": "Cal Academy of Sciences",
        "count": 1
      },
      {
        "node": "postcranial skeleton",
        "count": 1
      },
      {
        "node": "uncomfortable",
        "count": 1
      },
      {
        "node": "fiber",
        "count": 1
      },
      {
        "node": "eat everything",
        "count": 1
      },
      {
        "node": "hibernation",
        "count": 1
      },
      {
        "node": "fat bear week",
        "count": 1
      },
      {
        "node": "Colorado",
        "count": 1
      },
      {
        "node": "Fat Bear Week",
        "count": 1
      },
      {
        "node": "Salmon rivers bears",
        "count": 1
      },
      {
        "node": "Grizzly Man",
        "count": 1
      },
      {
        "node": "Werner Herzog film",
        "count": 1
      },
      {
        "node": "Suicide by bear",
        "count": 1
      },
      {
        "node": "Mountain lion genetics",
        "count": 1
      },
      {
        "node": "Niche modeling",
        "count": 1
      },
      {
        "node": "Joe Rogan Questions Everything",
        "count": 1
      },
      {
        "node": "Pacific Northwest",
        "count": 1
      },
      {
        "node": "Sasquatch",
        "count": 1
      },
      {
        "node": "Binga",
        "count": 1
      },
      {
        "node": "Bearing Land Bridge",
        "count": 1
      },
      {
        "node": "Bingia",
        "count": 1
      },
      {
        "node": "Asia",
        "count": 1
      },
      {
        "node": "warmer climates",
        "count": 1
      },
      {
        "node": "land bridge",
        "count": 1
      },
      {
        "node": "Primates",
        "count": 1
      },
      {
        "node": "Humans",
        "count": 1
      },
      {
        "node": "Animals",
        "count": 1
      },
      {
        "node": "Colder climates",
        "count": 1
      },
      {
        "node": "Adapting",
        "count": 1
      },
      {
        "node": "Landscape",
        "count": 1
      },
      {
        "node": "indigenous people",
        "count": 1
      },
      {
        "node": "sophisticated world",
        "count": 1
      },
      {
        "node": "electric car",
        "count": 1
      },
      {
        "node": "weird",
        "count": 1
      },
      {
        "node": "Starbucks",
        "count": 1
      },
      {
        "node": "traditional living",
        "count": 1
      },
      {
        "node": "snowmobile",
        "count": 1
      },
      {
        "node": "rifle",
        "count": 1
      },
      {
        "node": "Doggon people",
        "count": 1
      },
      {
        "node": "grass",
        "count": 1
      },
      {
        "node": "resurrect",
        "count": 1
      },
      {
        "node": "rebirth",
        "count": 1
      },
      {
        "node": "Bring back",
        "count": 1
      },
      {
        "node": "shortfaced bear",
        "count": 1
      },
      {
        "node": "Neanderthals and Denisovans",
        "count": 1
      },
      {
        "node": "host eagle",
        "count": 1
      },
      {
        "node": "giant eagle",
        "count": 1
      },
      {
        "node": "markings on human skulls",
        "count": 1
      },
      {
        "node": "talons of raptors",
        "count": 1
      },
      {
        "node": "moa extinction",
        "count": 1
      },
      {
        "node": "shortfaced bears extinction",
        "count": 1
      },
      {
        "node": "shortfaced bears",
        "count": 1
      },
      {
        "node": "hunting a shortfaced bear",
        "count": 1
      },
      {
        "node": "daunting task",
        "count": 1
      },
      {
        "node": "spears",
        "count": 1
      },
      {
        "node": "group of guys",
        "count": 1
      },
      {
        "node": "12 feet high",
        "count": 1
      },
      {
        "node": "New Zealand",
        "count": 1
      },
      {
        "node": "ambush",
        "count": 1
      },
      {
        "node": "wind",
        "count": 1
      },
      {
        "node": "sense of smell",
        "count": 1
      },
      {
        "node": "hunters",
        "count": 1
      },
      {
        "node": "rut",
        "count": 1
      },
      {
        "node": "groomer",
        "count": 1
      },
      {
        "node": "stinky",
        "count": 1
      },
      {
        "node": "brush",
        "count": 1
      },
      {
        "node": "bathed",
        "count": 1
      },
      {
        "node": "Wolves",
        "count": 1
      },
      {
        "node": "French bulldog",
        "count": 1
      },
      {
        "node": "Dog domestication",
        "count": 1
      },
      {
        "node": "Mitochondrial DNA",
        "count": 1
      },
      {
        "node": "Last ice age",
        "count": 1
      },
      {
        "node": "Selective breeding",
        "count": 1
      },
      {
        "node": "Gene editing technology",
        "count": 1
      },
      {
        "node": "Organoids",
        "count": 1
      },
      {
        "node": "Phylloxera",
        "count": 1
      },
      {
        "node": "Domestic population",
        "count": 1
      },
      {
        "node": "Greywolf",
        "count": 1
      },
      {
        "node": "organoid",
        "count": 1
      },
      {
        "node": "drug cocktails",
        "count": 1
      },
      {
        "node": "academia",
        "count": 1
      },
      {
        "node": "tumor",
        "count": 1
      },
      {
        "node": "hair",
        "count": 1
      },
      {
        "node": "University",
        "count": 1
      },
      {
        "node": "Political Alignment",
        "count": 1
      },
      {
        "node": "Ostracization",
        "count": 1
      },
      {
        "node": "Scientists",
        "count": 1
      },
      {
        "node": "Funding",
        "count": 1
      },
      {
        "node": "Group Think",
        "count": 1
      },
      {
        "node": "Public Health",
        "count": 1
      },
      {
        "node": "Environment",
        "count": 1
      },
      {
        "node": "Real Data and Science",
        "count": 1
      },
      {
        "node": "Twitter",
        "count": 1
      },
      {
        "node": "university system",
        "count": 1
      },
      {
        "node": "MRIs",
        "count": 1
      },
      {
        "node": "CRISPR",
        "count": 1
      },
      {
        "node": "government funding",
        "count": 1
      },
      {
        "node": "public system",
        "count": 1
      },
      {
        "node": "scientific labs",
        "count": 1
      },
      {
        "node": "gene editing platform",
        "count": 1
      },
      {
        "node": "politics and funding",
        "count": 1
      },
      {
        "node": "defunding research",
        "count": 1
      },
      {
        "node": "innovators",
        "count": 1
      },
      {
        "node": "biotechnology",
        "count": 1
      },
      {
        "node": "physics",
        "count": 1
      },
      {
        "node": "robust system",
        "count": 1
      },
      {
        "node": "Toxic mold",
        "count": 1
      },
      {
        "node": "Scientist arrest",
        "count": 1
      },
      {
        "node": "Food supply",
        "count": 1
      },
      {
        "node": "Biology",
        "count": 1
      },
      {
        "node": "America",
        "count": 1
      },
      {
        "node": "Science Investment",
        "count": 1
      },
      {
        "node": "Drone Technologies",
        "count": 1
      },
      {
        "node": "Autonomous Coal Production",
        "count": 1
      },
      {
        "node": "Electric Trucks",
        "count": 1
      },
      {
        "node": "AI in Coal Mining",
        "count": 1
      },
      {
        "node": "24/7 Coal Mining",
        "count": 1
      },
      {
        "node": "Infrastructure Investment",
        "count": 1
      },
      {
        "node": "Short-sightedness",
        "count": 1
      },
      {
        "node": "Positive Changes",
        "count": 1
      },
      {
        "node": "social media structure",
        "count": 1
      },
      {
        "node": "algorithm",
        "count": 1
      },
      {
        "node": "negative scientists",
        "count": 1
      },
      {
        "node": "human nature",
        "count": 1
      },
      {
        "node": "online negativity",
        "count": 1
      },
      {
        "node": "tweeting negative things",
        "count": 1
      },
      {
        "node": "Chinese scientist",
        "count": 1
      },
      {
        "node": "smuggling of biological material",
        "count": 1
      },
      {
        "node": "worms",
        "count": 1
      },
      {
        "node": "University of Michigan",
        "count": 1
      },
      {
        "node": "CCP",
        "count": 1
      },
      {
        "node": "research",
        "count": 1
      },
      {
        "node": "long game",
        "count": 1
      },
      {
        "node": "raptors and T-Rexes",
        "count": 1
      },
      {
        "node": "Detroit airport",
        "count": 1
      },
      {
        "node": "information security",
        "count": 1
      },
      {
        "node": "sequencing ancient DNA",
        "count": 1
      },
      {
        "node": "gene editing technologies",
        "count": 1
      },
      {
        "node": "CRISPR technology",
        "count": 1
      },
      {
        "node": "HIV inoculation",
        "count": 1
      },
      {
        "node": "He Jiankui",
        "count": 1
      },
      {
        "node": "HIV protection mutation",
        "count": 1
      },
      {
        "node": "gene editing tools",
        "count": 1
      },
      {
        "node": "HIV cell entry",
        "count": 1
      },
      {
        "node": "Germ line editing",
        "count": 1
      },
      {
        "node": "Higher intelligence",
        "count": 1
      },
      {
        "node": "Gene editing",
        "count": 1
      },
      {
        "node": "Brain development",
        "count": 1
      },
      {
        "node": "Genes and intelligence",
        "count": 1
      },
      {
        "node": "Superhumans",
        "count": 1
      },
      {
        "node": "Chinese government",
        "count": 1
      },
      {
        "node": "Evolution of intelligence",
        "count": 1
      },
      {
        "node": "Pandemic",
        "count": 1
      },
      {
        "node": "IVF",
        "count": 1
      },
      {
        "node": "unethical solution",
        "count": 1
      },
      {
        "node": "Human Innovation",
        "count": 1
      },
      {
        "node": "Beth Shapiro",
        "count": 1
      },
      {
        "node": "Life as We Made It",
        "count": 1
      },
      {
        "node": "Siberia story",
        "count": 1
      },
      {
        "node": "mutation",
        "count": 1
      },
      {
        "node": "ethical solution",
        "count": 1
      },
      {
        "node": "How to Clone a Mammoth",
        "count": 1
      },
      {
        "node": "first person",
        "count": 1
      },
      {
        "node": "audition",
        "count": 1
      }
    ],
    "topicGroups": {
      "groups": [
        {
          "topics": [
            "Neanderthals",
            "Denisovans",
            "direwolves",
            "mammoths",
            "ice age",
            "Bison priscus",
            "dodos",
            "direwolf",
            "American cheetah"
          ],
          "category": {
            "name": "Paleontology",
            "description": "Paleontology and prehistoric life topics"
          }
        },
        {
          "topics": [
            "DNA",
            "genes",
            "Ancient DNA",
            "Neanderthal genome",
            "hybrid",
            "hybridization"
          ],
          "category": {
            "name": "Genetics and DNA",
            "description": "Topics related to genetics and DNA"
          }
        },
        {
          "topics": [
            "Colossal Biosciences",
            "de-extinction",
            "Alan Cooper",
            "Colossal"
          ],
          "category": {
            "name": "De-Extinction",
            "description": "Topics related to de-extinction and related companies"
          }
        },
        {
          "topics": [
            "humans",
            "human history",
            "paleoanthropology",
            "tribes",
            "uncontacted people",
            "people",
            "Neanderthal",
            "early 20th century",
            "Percy Fawcett"
          ],
          "category": {
            "name": "Human History and Anthropology",
            "description": "Topics related to human history and anthropology"
          }
        },
        {
          "topics": [
            "animals",
            "wolves",
            "buffalo",
            "honey badgers",
            "red wolves",
            "elk",
            "dogs",
            "sheep",
            "wild pigs",
            "brown bear"
          ],
          "category": {
            "name": "Animals and Wildlife",
            "description": "Topics related to animals and wildlife"
          }
        },
        {
          "topics": [
            "Florida",
            "China",
            "Siberia",
            "Alaska",
            "Amazon",
            "Texas",
            "Yellowstone",
            "Europe",
            "Komodo Island",
            "San Francisco",
            "Louisiana",
            "Africa",
            "Colombia",
            "Santa Cruz",
            "Montana",
            "North America",
            "Canada",
            "Fairbanks",
            "Yakutsk",
            "Dawson City"
          ],
          "category": {
            "name": "Geography and Locations",
            "description": "Topics related to geography and locations"
          }
        },
        {
          "topics": [
            "conservation",
            "ecosystem",
            "Water hyacinth"
          ],
          "category": {
            "name": "Conservation and Ecosystems",
            "description": "Topics related to conservation and ecosystems"
          }
        },
        {
          "topics": [
            "Ben",
            "Jamie",
            "Klesi",
            "William Randolph Hearst"
          ],
          "category": {
            "name": "People",
            "description": "Topics related to specific people"
          }
        },
        {
          "topics": [
            "Mosquitoes",
            "helicopter",
            "innovation",
            "attention",
            "Jurassic Park",
            "expert",
            "species concepts",
            "medical ethanol",
            "Whoop",
            "video",
            "gas tanks",
            "boat",
            "communication",
            "broadcast journalism",
            "funding"
          ],
          "category": {
            "name": "Science and Technology",
            "description": "Topics related to science and technology"
          }
        },
        {
          "topics": [
            "scarcity mindset",
            "human rights violations",
            "consequences",
            "ballot box biology",
            "fight"
          ],
          "category": {
            "name": "Current Events and Social Issues",
            "description": "Topics related to current events and social issues"
          }
        },
        {
          "topics": [
            "Florida man",
            "Everglades",
            "lake cow bacon"
          ],
          "category": {
            "name": "Florida",
            "description": "Topics related to Florida and its unique aspects"
          }
        },
        {
          "topics": [
            "mosquitoes",
            "ice age",
            "happy people",
            "vodka",
            "Zodiacs",
            "Luke Caverns",
            "feeding cage",
            "competition",
            "boneyard",
            "national parks"
          ],
          "category": {
            "name": "Miscellaneous",
            "description": "Topics related to miscellaneous items"
          }
        }
      ]
    },
    "shortSummary": "Joe Rogan interviews Beth Shapiro, an evolutionary molecular biologist and Chief Science Officer at Colossal Biosciences, discussing her career, scientific views, and experiences in Siberia.",
    "lastStoryCheck": "2025-07-14T22:14:29.844Z",
    "storyCheckResults": {
      "missingChunks": [],
      "missingStories": [],
      "totalCategories": 12,
      "totalChunksChecked": 147
    }
  }
}