{
  "id": "9V6tWC4CdFQ",
  "title": "Sundar Pichai: CEO of Google and Alphabet | Lex Fridman Podcast #471",
  "channelId": "UCSHZKyawb77ixDdsGog4iWA",
  "publishedAt": "2025-06-05T17:46:22.000Z",
  "cleanText": "There was a 5-year waiting list, and we got a rotary telephone, but it dramatically changed our lives. You know, people would come to our house to make calls to their loved ones. You know, I, I would have to go all the way to the hospital to get blood test records, and it would take 2 hours to go, and they would say, \"Sorry, it's not ready. Come back the next day.\" 2 hours to come back. And that became a five-minute thing. So as a kid, like, I mean, this light bulb went in my head, you know, this power of technology to kind of change people's lives. We had no running water, you know, it was a massive drought. So they would get water in these trucks, maybe eight buckets per household. So me and my brother, sometimes my mom, we would wait in line, get that, and bring it back home.\n\nMany years later, like, we had running water, and we had a water heater, and you could get hot water to take a shower. I mean, like, so, you know, for me, everything was discreet like that. Uh, and so I've always had this thing, you know, firsthand feeling of, like, how technology can dramatically change, like, your life and, like, the opportunity it brings. I think if pdoom is actually high at some point, all of humanity is, like, aligned in making sure that's not the case, right? And so we'll actually make more progress against it, I think. So the irony is, so there is a self-modulating aspect there. Like, I think if humanity collectively puts their mind to solving a problem, whatever it is, I think we can get there. So because of that, I think I'm optimistic on the pdoom scenarios.\n\nBut that doesn't mean I think the underlying risk is actually pretty high. But I'm, uh, you know, I have a lot of faith in humanity kind of rising up to the to meet that moment. Take me through that experience when there's all these articles saying you're the wrong guy to lead Google through this. Google is lost. It's done. It's over.\n\nThe following is a conversation with Sundar Pichai, the CEO of Google and Alphabet, on this, the Lex Fridman Podcast. Your life story is inspiring to a lot of people. It's inspiring to me. You grew up in India, whole family living in a humble two-room apartment, very little, almost no access to technology. And from those humble beginnings, you rose to lead a $2 trillion technology company. So if you could travel back in time and told that, let's say, 12-year-old Sundar that you're now leading one of the largest companies in human history, what do you think that young kid would say? I would have probably laughed it off. Um, you know, uh, probably too far-fetched to imagine or believe at that time. You would have to explain the internet first, for sure. I mean, computers to me at that time. You know, I was 12 in 1984. So probably, uh, you know, by then I started reading about them. I had seen one. What was that place like? Take me to your childhood.\n\nYou know, I grew up in Chennai. Uh, it's in south of India. It's a beautiful, bustling city. Lots of people, lots of energy, you know, simple life. Definitely, like, fond memories of playing cricket outside the home. We just used to play on the streets. All the neighborhood kids would come out, and we would play till it got dark and we couldn't play anymore barefoot. Um, traffic would come, we would just stop the game, everything would drive through, and you would just continue playing, right? Just to kind of get the visual in your head. You know, precomputers, there's a lot of free time now. Now that I think about it, now you have to go and seek that quiet solitude or something. Newspapers, books is how I gained access to the was information at the time, you will. Uh, my grandfather was a big influence. He worked in the post office. He was so good with language. His English, you know, his handwriting till today is the most beautiful handwriting I've ever seen. He would write so clearly. He was so articulate. And so he kind of got me introduced into books. He loved politics. So we, we could talk about anything, and you know, that was there in my family throughout. So, uh, lots of books, trashy books, good books, everything from Ayn Rand to books on philosophy to stupid crime novels. So books was a big part of my life. But that kind of this soul, it's not surprising I ended up at Google because Google's mission kind of always resonated deeply with me, this access to knowledge. I was hungry for it, but definitely have, you know, fond memories of my childhood. Access to knowledge was there, so that's the wealth we had.\n\nUh, you know, every aspect of technology, I had to wait for a while. I've obviously spoken before about how long it took for us to get a phone, about 5 years, but it's not the only thing, a telephone. There was a 5-year waiting list. Uh, and we got a rotary uh, telephone. Mhm. But it dramatically changed our lives. You know, people would come to our house to make calls to their loved ones. You know, I, I would have to go all the way to the hospital to get blood test records, and it would take 2 hours to go, and they would say, \"Sorry, it's not ready. Come back the next day.\" 2 hours to come back. And that became a 5-minute thing. So as a kid, like, I mean, this light bulb went in my head, you know, this power of technology to kind of change people's lives. We had no running water, you know, it was a massive drought. So they would get water in these trucks, maybe eight buckets per household. So me and my brother, sometimes my mom, we would wait in line, get that, and bring it back home.\n\nMany years later, like, we had running water, and we had a water heater, and you could get hot water to take a shower. I mean, like, so, you know, for me, everything was discreet like that. Uh, and so I've always had this thing, you know, firsthand feeling of, like, how technology can dramatically change, like, your life and, like, the opportunity it brings. So, you know, that was kind of a subliminal takeaway for me throughout growing up. And, you know, I, I kind of actually observed it and felt it, you know. So, we had to convince my dad for a long time to get a VCR. Do you know what a VCR is? Yeah. I'm trying to date you now. But, you know, because before that, you only had, like, kind of one TV channel. Mhm. Right. That's it. Um, and so, you know, you can watch movies or something like that, but this was by the time I was in 12th grade, we got a VCR. You know, it was a uh, like a Panasonic, which we had to go to some, like, shop, which had kind of smuggled it in, I guess, and that's where we bought a VCR, but then being able to record, like, a World Cup football game and then or, like, get put, like, video tapes and watch movies, like, all that. So, like, you know, I had these discrete memories growing up, and so, you know, always left me with the feeling of, like, how getting access to technology drives that step change in your life. I don't think you'll ever be able to equal the first time you get hot water to have that convenience of going and opening a tap and have hot water come out. Yeah. It's interesting. We take for granted the progress we've made. If you look at human history, just those plots that look at GDP across 2,000 years, and you see that exponential growth to where most of the progress happened since the industrial revolution, and we just take for granted. We forget how how far we've gone. So our ability to understand how great we have it and also how quickly technology can improve is quite poor.\n\nOh, I mean, it's it's extraordinary. You know, I go back to India now. The power of mobile. You know, it's mind-blowing to see the progress through the arc of time. It's phenomenal. What advice would you give to young folks listening to this all over the world who look up to you and uh, find your story inspiring, who want to be maybe the next Bachai, who want to start create companies, uh, build something that has a lot of impact in the world? Look, it's you have a lot of luck along the way, but you obviously have to make smart choices. You're thinking about what you want to do. Your brain is telling you something. But when you do things, I think it's important to kind of get that, listen to your heart and see whether you actually enjoy doing it, right? That that feeling of if you love what you do, it's so much easier, and you're going to see the best version of yourself. It's easier said than done. I think it's tough to find things uh, you love doing. Um, but I think kind of listening to your heart a bit more than your mind in terms of figuring out what you want to do, I think, I think is one of the best things I would uh, tell people. The second thing is, I mean, trying to work with people who you feel, at various points in my life, I worked with people who I felt were better than me, right? Kind of like, you know, you almost are sitting in a room talking to someone, and they're like, wow, like, you know, you know, and you want that feeling a few times, trying to get yourself in a position where you're working with people who you feel are kind of, like, stretching your abilities is what helps you grow, I think. Uh, so putting yourself in uncomfortable situations, and I think often you'll surprise yourself. So I think being open-minded enough to kind of put yourself in those positions is maybe uh, maybe another thing I would say. What lessons can we learn, maybe from an outsider perspective, for me looking at your story and gotten to know you a bit? You're humble, you're kind. Usually when I think of somebody who has had a journey like yours and climbs to the very top of leadership, they're us in a cutthroat world, they're usually going to be a bit of an So what wisdom are we supposed to draw from the fact that uh, your general approach of is of balance, of humility, of kindness, listening to everybody? What's what's what's your secret? I do get angry. I do get frustrated. I, I have the same emotions all of us do, right, in the context of work and everything. Uh, but a few things, right? I, I, I think, you know, I over time, I figured out the best way to get the most out of people. Uh, you know, you kind of find mission-oriented people who are in the shad journey, who have this inner drive to excellence, to do the best, and and you know, you kind of motivate people, and and and you can, you can achieve a lot that way, right? And so it, it often tends to work out that way. But have there been times, like, you know, I lo lose it, yeah, but you know, not maybe less often than others, uh, and maybe over the years less and less so because, you know, I find it's not needed to achieve what you need to do. So losing your has not been productive. Yeah. Less often than not, I think people respond to that. Yeah. They may do stuff to react to that, like, but you, you actually want them to do the right thing, and and and so, you know, maybe there's a bit of, like, sports, you know, you know, I'm a sports fan in football coaches, uh, in soccer, uh, that football, uh, you know, people, people often talk about, like, man management, right? Coaches do, right? I think there is an element of that in our lives, how do you get the best out of the people you work with? You know, at times you're working with people who who are so committed to achieving, if they've done something wrong, they feel it more than you do, right? So you treat them differently than, you know, occasionally there are people who you need to clearly let them know, like, that wasn't okay or whatever it is, but I've often found that not to be the case, and sometimes the right words at the right time, spoken firmly, can reverberate through time also. Sometimes the unspoken words, you know, people can sometimes see that, like, you know, you're unhappy without you saying it, and so sometimes the silence can uh, deliver that message even more. Sometimes less is more. Um, who's the greatest uh, soccer player of all time, Messi or Ronaldo or Pele or Maradona? I'm going to make, you know, in this question, is this going to be a political answer? No, I, I, I will tell the truthful answer because uh, answer it is, you know, it's been interesting because my son is a big Cristiano Ronaldo fan. And uh, so we've had to watch El Classicos together, you know, with that dynamic in there. I so admire CR7s. I mean, I've never seen an athlete more committed to that kind of excellence. And so he's one of the all-time greats, but you know, for me, Messi is it. Yeah. Yeah, when I see Lionel Messi, you just are in awe that humans are able to achieve that level of greatness and genius and artistry. When we talk, we'll talk about AI, maybe robotics and this kind of stuff, that level of genius. I'm not sure you can possibly match by AI in a long time. It's just an example of greatness. And you have that kind of greatness in other disciplines, but in sport, you get to visually see it unlike anything else. And just the the timing, the movement, this is genius. I had the chance to see him a couple weeks ago. He played in uh, San Jose. So um, against the Quake. So I went to see it, see the game. I was a fan on the had good seats. Knew where he would play in the second half, hopefully. And uh, even at his age, just watching him when he gets the ball, that movement, you know, you're right, that special quality, it's tough to describe, but you feel it when you see it. Yeah, he still got it. Uh, if we rank all the technological innovations throughout human history, let's go back uh, maybe the history of human civilizations 12,000 years ago, and you rank them by the how much of a productivity multiplier they've been. So uh, we can go to electricity or the labor mechanization of the industrial revolution, or we can go back to the first agricultural revolution 12,000 years ago in that long list of inventions. Do you think AI, when history is written a thousand years from now, do you think it has a chance to be the number one productivity multiplier? It's a great question. Look, many years ago, I think it might have been 2017 or 2018. Um, you know, I, I said at the time, like, you know, AI is the most profound technology humanity will ever work on. It'll be more profound than fire or electricity. So, I have to back myself. I, you know, I still think uh, that's the case. You know, when you asked this question, I was thinking, well, do we have a recency bias, right? You know, like in sports, it's very tempting to call the current person you're seeing the greatest player, right? And and so is there a recency bias? And you know, I do think uh, from first principles, I would argue AI will be bigger than all of those. I didn't live through those moments.\n\n\nYou know, two years ago, I had to go through a surgery, and then I processed that there was a point in time people didn't have anesthesia when they went through these procedures. At that moment, I was like, that has got to be the greatest invention humanity has ever, ever done, right? So, look, we don't know what it is to have lived through those times, but you know, and many of what you're talking about were kind of these general things, which pretty much affected everything, you know, electricity or internet, etc.\n\nBut I don't think we have ever dealt with a technology both which is progressing so fast, becoming so capable. It's not clear what the ceiling is, and the main unique thing is it's recursively self-improving, right? It's capable of that. And so the fact it is going, it's the first technology will kind of dramatically accelerate creation itself, like creating things, building new things can improve and achieve things on its own, right? I think that puts it in a different league, right? And so, different league, and so I think the impact it'll end up having will far surpass everything we've seen before. Obviously, with that comes a lot of important things to think and wrestle with, but I definitely think that'll end up being the case, especially if it gets to the point of where we can achieve superhuman performance on the AI research itself. So, it's a technology that may, that's an open question, but it may be able to achieve a level to where the technology itself can create itself better than it could yesterday. It's like the move 37 of alpha research or whatever it is, right? Like, you know, and when, when, yeah, you're right, when it can do novel self-directed research, obviously for a long time, we'll, we'll have, hopefully always humans in the loop and all that stuff, and these are complex questions to talk about, but yes, I think the underlying technology, you know, I've said this, like, if you watched seeing AlphaGo start from scratch, be clueless, and like become better through the course of a day, you know, like, you know, kind of like, you know, really it hits you when you see that happen, even our like the V3 models, if you sample the models when they were like 30% done and 60% done and looked at what they were generating, and you kind of see how it all comes together, it's kind of like, I would say it's kind of inspiring, a little bit unsettling, right? As a, as a human. So all of that is true.\n\nI think, well, the interesting thing of the industrial revolution, electricity, like you mentioned. You can go back to the, again, the agricultural, the first agricultural revolution. There's um, what's called the Neolithic package of the first agricultural revolution, that it wasn't just that the nomads settled down and started planting food, but all this other kinds of technology was born from that, and it's included in this package. It wasn't one piece of technology. It's there's these ripple effects, second and third order effects that happen. Everything from something silly, like silly profound, like pottery that can store liquids and food, uh, to something we kind of take for granted, but social hierarchies, uh, and political hierarchy. So like early government was formed, cuz it turns out if humans stop moving and have some surplus food, they start coming up with, uh, they get bored and they start coming up with interesting systems, then trade emerges, which turns out to be a really profound thing, and like I said, government there. I mean, there's just uh, second and third order effects from that, including that package is incredible and probably extremely difficult if, if you ask one of the people in the nomadic tribes to predict that, it would be impossible. It's difficult to predict.\n\nBut all that said, what do you think are some of the early things we might see in the quote unquote AI package? I mean, most of it probably we don't know today, but like, you know, the one thing which we can tangibly start seeing now is, you know, obviously with the coding progress, you got a sense of it. It's going to be so easy to imagine like thoughts in your head, translating that into things that exist. That'll be part of the package, right? Like it's going to empower almost all of humanity to kind of express themselves. Maybe in the past you could have expressed with words, but like you could kind of build things into existence, right? You know, maybe not fully today. We are at the early stages of VIP coding. You know, I've been amazed at what people have put out online with V3, but it takes a bit of work, right? You have to stitch together a set of prompts, but all this is going to get better. The thing I always think about, this is the worst it'll ever be, right? Like at any given moment in time. Yeah, it's interesting you went there as kind of a first thought. So the exponential increase of access to creativity, software creation, are you creating a program, a piece of content for to be shared with others, games down the line, all of that like just becomes infinitely more possible.\n\nWell, I think the big thing is that uh, it makes it accessible. It unlocks the cognitive capabilities of the entire 8 billion. No, I agree. Look, think about 40 years ago, maybe in the US there were five people who could do what you were doing. Mhm. Like go do an interview, you know, and you know, but today think about with YouTube and other other products, etc. Like how many more people are doing it? So I think this is what technology does, right? Like when the internet created blogs, you know, you heard from so many more people. So I think, but, but with AI, I think that number won't be in the few hundreds of thousands, it'll be tens of millions of people, maybe even a billion people, like putting out things into the world in a deeper way, and I think it'll change the landscape of creativity and makes a lot of people nervous, like for example, uh, whatever Fox, MSNBC, CNN are really nervous about this part, like you mean this dude in a who could just do this and and use and YouTube and and and thousands of others, tens of thousands, millions of other creators can do the same kind of thing. That makes him nervous. And now you get a podcast from Nobook LM. That's about five to 10 times better than any podcast I've ever done. True. I'm I'm joking at this time, but maybe not. And that changes. You have to evolve because I, on the podcasting front, I'm a fan of podcasts much more than I am a fan of being a host or whatever. If there's great podcasts that are both AIs, I'll just stop doing this podcast. I'll listen to that podcast. But you have to evolve and you have to change, and that makes people really nervous, I think. But it's also a really exciting future.\n\nThe only thing I may say is I do think like in a world in which there are two AI, I think people value and uh, choose, just like in chess, you and I would never watch Stockfish 10 or whatever and Alph Go play against each, like it would be boring for us to watch, but Magnus Carlson and Gish, that game would be much more fascinating to watch. So it's tough to say, like, one way to say is you'll have a lot more content, and so you will be listening to AI generated content because sometimes it's efficient, etc. But the premium experiences you value might be a version of like the human essence wherever it comes through, going back to what we talked earlier about watching Messi dribble the ball. I don't know, one day I'm sure a machine will dribble much better than Messi, but I don't know whether it would evoke that same emotion in us. So I think that'll be fascinating to see. I think the element of podcasting or audiobooks that is about information gathering, that part might be removed, or that might be more efficiently and in a compelling way done by AI, but then it'll be just nice to hear humans struggle with the information, contend with the information, try to internalize it, combine it with the complexity of our own emotions and consciousness and all that kind of stuff. But if you actually want to find out about a piece of history, you go to Gemini. If you want to see Lex struggle with that history, then you look, or other humans, you look, you look at that. But that the point is it's going to change the nature, uh, continue to change the nature of how we discover information, how we consume the information, how we create that information. The same way that YouTube changed everything completely, changed news, it changed, and that's something our society is struggling with. Yeah, YouTube, look, YouTube enabled, I mean, you know this better than anyone else. It's enabled so many creators. There is no doubt in me that like we will enable more filmmakers than there have ever been, right? You're going to empower a lot more people. Um, so I think there's an expansionary aspect of this which is underestimated. I think I think it'll unleash human creativity in a way uh, that hasn't been seen before. It's tough to internalize. The only way is if you, if you brought someone from the 50s or 40s and just put them in front of YouTube, you know, I think it would blow their mind away. Similarly, I think we would get blown away by what's possible in a 10 to 20 year time frame. Uh, do you think there's a future? How many years out is it that, let's say, let's put a marker on it? 50% of content in a compel good content, 50% of good content is generated by V4, 56. You know, I think depends on what it is for. Um, like, you know, maybe if you look at movies today with CGI, there are great filmmakers, like you still look at like who the directors are and who use it. There are filmmakers who don't use it at all. You value that. There are people who use it incredibly. You know, think about somebody like a James Cameron, like what he would do with these tools in his hands. But I think there'll be a lot more content created, like just like writers today use Google Docs and not think about the fact that they're using a tool like that, like people will be using the future versions of these things, like it won't be a big deal at all to them.\n\nI've gotten a chance to get to know Darren Aronowski well. He's been really leaning in and trying to figure it's, it's fun to watch a genius who came up before any of this was even remotely possible. He created Pi, one of my favorite movies, and from there just continued to create a really interesting variety of movies. And now he's trying to see how can AI be used to create compelling films. You have people like that. You have people I've gotten to just know uh, edgier folks uh, that are AI first, like Door Brothers. Both Areronowski and Door Brothers create at the edge of the Overton window of society. You know, they push whether it's uh, sexuality or or violence. It's edgy like artists are, but it's still classy. It doesn't cross that line. Uh, whatever that line is, you know. Um, Hunter S. Thommpson is this line that the uh, the only way to find out where the edge, where the line is, is by crossing it. Uh, and I think for artists that's true. That's kind of their purpose. Sometimes comedians and artists just cross that line. I wonder if you can comment on the weird place that puts Google because Google's line is probably different than some of these artists. What, what's your, how do you think about specifically Vio um, and Flo about like how to allow artists to get do crazy, but also like the responsibility of like, um, not for it not to be too crazy.\n\nI, It's a great question. Look, part of you mentioned Darren, uh, you know, he's a clear visionary, right? Part of the reason we work started working with him early on VO is he's one of those people who was able to kind of see that future, get inspired by it, and kind of showing the way for how creative people can express themselves with it. Look, I think when it comes to allowing artistic free expression is one of the most important values in a society, right? I think, you know, artists have always been the ones to push, push boundaries, expand the frontiers of thought, uh, and so look, I think I think that's going to be an important value we have, so I think we will provide tools and put it in the hands of artists for them to use and put out their work, those APIs. I mean, I almost think of that as infrastructure, just like when you provide electricity to people or something, you want them to use it and like you're not thinking about the use cases on top of it. So it's a paintbrush. Yeah. And and so I think that's how, obviously there have to be some things, and you know, society needs to decide at a a fundamental level what's okay, what's not. Uh, we'll be responsible with it. Um, but I do think, you know, when it comes to artistic free expression, I think that's one of those values we should work hard to defend. Uh, I wonder if you can comment on um, maybe earlier versions of Gemini were a little bit careful on the kind of things you would be willing to answer. I just want to comment on, I was really surprised and uh, pleasantly surprised and enjoy the fact that Gemini 2.5 Pro is a lot less careful in a good sense. Don't ask me why, but I've been doing a lot of research on Jenghask Khan and the Aztecs. Uh, so there's a lot of violence there in that history. It's a very violent history. I've also been doing a lot of research on World War I and World War II. And earlier versions of Gemini were very um, basically this kind of sense, are you sure you want to learn about this? And now it's actually very factual, objective, uh, talks about very difficult parts of human history and does so with nuance and depth. It's it's been really nice. But there's a line there that I guess Google has to kind of walk. I wonder if it's and it's also an engineering challenge how to how to do that at scale across all the weird queries that people ask. What um, can you just speak to that challenge? How do you allow Gemini to say, again, forgive, pardon my French, crazy but not too, not not too crazy?\n\nI think one of the good insights here has been as the models are getting more capable, the models are really good at this stuff, right? And so I think in some ways maybe a year ago the models weren't fully there. So they would also do stupid things more often, and so you know, you're trying to handle those edge cases, but then you make a mistake in how you handle those edge cases and it compounds. But I think with 2.5, what we particularly found is once the models cross a certain level of intelligence and sophistication, you know, they are, they are able to reason through these nuanced issues pretty well. And I think users really want that, right? Like, you know, you want as much access to the raw model as possible, right? But I think it's a great area to think about, like, you know, over time, you know, we should allow more and more closer access to it, maybe obviously let people custom prompts if they wanted to and like, you know, and you know, experiment with it, etc. Uh, I, I think that's an important direction, but look, the first principles we want to think about it.\n\n\nIt is, you know, from a scientific standpoint, like making sure the models, and I'm saying scientific in the sense of like how you would approach math or physics or something like that, from first principles, having the models reason about the world, be nuanced, etc., uh, you know, from the ground up, is the right way to build these things, right? Not like some subset of humans is kind of hard coding things on top of it. Uh, so I think it's the direction we've been taking, and I think you'll see us continue to push in that direction.\n\nYeah. I actually asked, uh, I gave these notes. I took extensive notes, and I gave them to Gemini and said, \"Can you ask a novel question that's not in these notes?\" And it wrote, Gemini continues to really surprise me, really surprise me. It's been really beautiful. It's an incredible model. Uh, the, the question it generated was, \"You,\" meaning Sundar, \"told the world Gemini is turning out 480 trillion tokens a month. Uh, what's the most life-changing five-word sentence hiding in that vast stack?\" That's a Gemini question, but it made me, it gave me a sense. I don't think you can answer that, but it gave me, it made it, woke me up to like all of these tokens are providing little aha moments for people across the globe. So that's like learning that those tokens are people are curious. They ask a question, and they find something out, and it truly could be life-changing.\n\nOh, it is. I look, I know I had the same feeling about search many, many years ago. You, you know, you, you definitely, you know, this tokens per month is like grown 50 times in the last 12 months. Is that accurate, by the way?\n\nYeah, it is. You know, it is, it is accurate. I'm glad it got it right. Um, but you know, that number was 9.7 trillion tokens per month 12 months ago, right? It's gone, gone up to 480. You know, it's a 50x increase. So there's no limit to human curiosity. Uh, and I think it's, it's one of those moments. Uh, maybe I don't think it is there today, but maybe one day there's a five-word phrase which says what the actual universe is or something like that and something very meaningful. But I don't think we are quite there yet.\n\nDo you think the scaling laws are holding strong on, um, there's a lot of ways to describe the scaling laws for AI, but on the pre-training, on the post-training fronts? So the flip side of that, do you anticipate AI progress will hit a wall? Is there a wall?\n\nYou know, it's a cherished micro kitchen conversation. Once in a while, I have it, you know, like when Demis is visiting or, you know, Dennis, Cori, Jeff, Gnome, Sergey, a bunch of our people, like we sit and, uh, you know, you know, talk about this, right? And, um, look, I, we see a lot of headroom ahead, right? I think, uh, we've been able to optimize and improve on all fronts, right? Uh, pre-training, post-training, test time, compute, tool use, right? Over time, making these more agentic. So, getting these models to be more general world models in that direction, like V3, uh, you know, the physics understanding is dramatically better than what V1 or something like that was. So, you kind of see on all those dimensions. I, I feel, you know, progress is very obvious to see, and I feel like there is significant headroom. More importantly, you know, I'm fortunate to work with some of the best researchers on the planet, right? They think, uh, there is more headroom to be had here, uh, and so I think we have an exciting trajectory ahead. It's tougher to say, you know, each year I sit and say, \"Okay, we're going to throw 10x more compute over the course of next year at it,\" and like, will we see progress? Sitting here today, I feel like the year ahead, we'll have a lot of progress.\n\nAnd do you feel any limitations, like that, the bottlenecks, compute limited, uh, data limited, idea limited? Do you feel any of those limitations, or is it full steam ahead on all fronts?\n\nI think it's compute limited in this sense, right? Like, you know, we can, part of the reason you've seen us do Flash, Nano, Flash, and Pro models, but not an Ultra model. It's like, for each generation, we feel like we've been able to get the Pro model at like, I don't know, 80, 90% of Ultra capability, but Ultra would be a lot more, uh, like slow and a lot more expensive to serve. But what we've been able to do is to go to the next generation and make the next generation's Pro as good as the previous generation's Ultra. Yeah. But be able to serve it in a way that it's fast and you can use it and so on. So I do think scaling laws are working. But it's tough to get at any given time. The models we all use the most is maybe like a few months behind the maximum capability we can deliver, right? Because that won't be the fastest, easiest to use, etc. Also, that's in terms of intelligence. It becomes harder and harder to measure, uh, performance in quotes, because, you know, you could argue Gemini Flash is much more impactful than Pro just because of the latency. It's super intelligent already. I mean, sometimes like latency is, uh, maybe more important than intelligence, especially when the intelligence is just a little bit less in Flash, not, it's still incredibly smart model. Yeah. And so you, you have to now start measuring impact, and then it feels like benchmarks are less and less capable of capturing the intelligence of models, the effectiveness of models, the usefulness, the real-world usefulness of models.\n\nUh, another kitchen question. So lots of folks are talking about timelines for AGI or ASI, artificial super intelligence. So AGI, loosely defined, is basically human expert level at a lot of the main fields of pursuit for humans, and then ASI is what AGI becomes, presumably quickly, by being able to self-improve. So becoming far superior in intelligence across all these disciplines than humans. When do you think we'll have AGI? Is 2030 a possibility?\n\nUh, there's one other term we should throw in there. I don't know who used it first. Maybe Karpati did, AJI. Have you, have you heard AJI? The artificial jagged intelligence, sometimes feels that way, right? Both there are progress, and you see what they can do, and then like you can trivially find they make numerical errors or like, you know, counting Rs and strawberry or something, which seems to trip up most models or whatever it is, right? So, uh, so maybe we should throw that term in there. I feel like we are in the AJI phase, where like dramatic progress, some things don't work well, but overall, you know, you're seeing, uh, lots of progress. But if your question is, will it happen by 2030? Look, we constantly move the line of what it means to be AGI. There are moments today, you know, like sitting in a way in a San Francisco street with all the crowds and the people and kind of work its way through, I see glimpses of it there. The car is sometimes kind of impatient, trying to work its way, uh, using Astra, like in Gemini Live, or seeing, uh, you know, asking questions about the world. \"What's this skinny building doing in my neighborhood?\" It's a street light, not a building. You, you see glimpses. That's why I use the word AJI, because then you see stuff which obviously, you know, we're far from AGI too. So you have both experiences simultaneously happening to you. I'll answer your question, but I'll also throw out this. I almost feel the term doesn't matter. What I know is by 2030, there'll be such dramatic progress. We'll be dealing with the consequences of that progress, both the positives, uh, both the positive externalities and the negative externalities that come with it in a big way by 2030. So that I strongly feel, right? Whatever we may be arguing about the term, or maybe Gemini can answer what that moment is in time in 2030, but I think the progress will be dramatic, right? So that I believe in.\n\nWill the AI think it has reached AGI by 2030? I would say we will just fall short of that timeline, right? So I think it'll take a bit longer. It's amazing in the early days of Google DeepMind, in 2010, they talked about a 20-year time frame to achieve, uh, AGI. So which is, which is kind of fascinating to see. But you know, I, for me, the whole thing, seeing what Google Brain did in 2012, and when we acquired DeepMind in 2014, uh, right close to where we're sitting in 2012, you know, Jeff Dean showed the image of when the neural networks could recognize, uh, a picture of a cat, right? And identify it. You know, this is the early versions of Brain, right? And so, you know, we all talked about a couple decades. I don't think we'll quite get there by 2030, so my sense is it's slightly after that, but I, I would stress it doesn't matter, like what that definition is, because you will have mind-blowing progress on many dimensions. Maybe AI can create videos. We have to figure out as a society, how do we, we need some system by which we all agree that this is AI generated, and we have to disclose it in a certain way, because how do you distinguish reality otherwise?\n\nYeah, there's so many interesting things you said. So, first of all, just looking back at this recent, now feels like distant history, uh, with Google Brain. I mean, that was before TensorFlow, before TensorFlow was made public and open sourced. So, the tooling matters too, combined with GitHub, ability to share code. Then you have the ideas of attention, transformers, and the diffusion now, and then there might be a new idea that seems simple in retrospect, but will change everything, and that could be the post-training, the inference time innovations. And I think Shad Cen tweeted that Google is just one great UI from completely winning the AI race, meaning like UI is a huge part of it, like how that intelligence, uh, uh, I think Logan Cop project likes to talk about this, right? Now, it's an LLM, but it become like, when is it going to become a system where you're talking about shipping systems versus shipping the particular model? Yeah, that matters too. How the system is, um, manifest itself and how it presents itself to the world, that really, really matters.\n\nOh, hugely so. There are simple UI innovations which have changed the world, right? And, uh, I absolutely think so. Um, we will see a lot more progress in the next couple of years is, I think, AI itself, uh, on a self-improving track for UI itself, like, you know, today, we are like constraining the models, the models can't quite express themselves in terms of the UI to to people, um, but that is, uh, like, you know, if you think about it, we've kind of boxed them in that way, but given these models can code, uh, you know, they should be able to write the best interfaces to express their ideas over time, right? That is an incredible idea. So the APIs are already open. So you, you create a really nice agentic system that continuously improves the way you can be talking to an AI. Yeah. But it, a lot of that is the interface, and then of course, the incredible multimodal aspect of the interface that Google's been pushing. These models are natively multimodal. They can easily take content from any format, put it in any format. They can write a good user interface. They probably understand your preferences better that over time, like, you know, and so, so all this is like the evolution ahead, right? And so, um, that goes back to where we started the conversation. I like, I think there'll be dramatic evolutions in the years ahead.\n\nMaybe one more kitchen question. Uh, this even further ridiculous concept of P-doom. So the philosophically minded folks in the AI community think about the probability that AGI and then ASI might destroy all of human civilization. I would say my P-doom is about 10%. Do you ever think about this kind of long-term threat of ASI, and what would your P-doom be?\n\nLook, I mean, for sure. Look, I've, uh, both been, uh, very excited about AI. Uh, but I've always felt, uh, this is a technology, you know, we have to actively think about the risks and work very, very hard to harness it in a way that it, it all works out well. Um, on the P-doom question, look, it's, you know, won't surprise you to say that's probably another micro kitchen conversation that pops up once in a while, right? And given how powerful the technology is, maybe stepping back, you know, when you're running a large organization, if you can kind of align the incentives of the organization, you can achieve pretty much anything, right? Like, you know, if you can get kind of people all marching in towards like a goal, uh, in a very focused way, in a mission-driven way, you can pretty much achieve anything. But it's very tough to organize all of humanity that way. But I think if P-doom is actually high at some point, all of humanity is like aligned in making sure that's not the case, right? And so we'll actually make more progress against it, I think. So the irony is, so there is a self-modulating aspect there, like I think if humanity collectively puts their mind to solving a problem, whatever it is, I think we can get there. So because of that, you know, I, I, I think I'm optimistic take on the P-doom scenarios, but that doesn't mean I think the underlying risk is actually pretty high, but I'm, uh, you know, I have a lot of faith in humanity kind of rising up to the to meet that moment.\n\nThat's really, really well put. I mean, as the threat becomes more concrete and real, humans do really come together and get their together. Well, the other thing I think people don't often talk about is probability of doom without AI. So, there's all these other ways that humans can destroy themselves. And it's very possible, at least I believe so, that AI will help us become smarter, kinder to each other, uh, more efficient. Uh, it, it'll help more parts of the world flourish where it would be less resource constrained, which is often the source of military conflict and tensions and so on. So we also have to load into that, what's the P-doom without AI, with AI P-doom, with AI P-doom without AI, cuz it's very possible that AI will be the thing that saves us, saves human civilizations from all the other threats.\n\nI agree with you. I think, I think it's insightful. Uh, look, I felt like to make progress on some of the toughest problems, it would be good to have AI like pair helping you, right? And and like, you know, so that resonates with me for sure.\n\nYeah. Quick pause. Bathroom break. You know, let's do that. If Notebook LM was the same compel, like what I saw today with Beam, if it was compelling in the same kind of way, blew my mind. It was incredible. Oh, I didn't think it's possible. I didn't. My was like, can you imagine like the US president and the Chinese president being able to do something like Beam with the live me translation working well? So, they're both sitting and talking, make progress a bit more. Uh, yeah, just, uh, for people listening, we took a quick bath break, and now\n\n\nWe're talking about the demo I did. We'll probably post it somewhere, somehow, maybe here. I got a chance to experience Beam, and it was, it's hard to describe in words how real it felt with just, what is it, six cameras? It's incredible. It's incredible. It's one of the toughest products. You can't quite describe it to people, even when we show it in slides, etc. Like, you don't know what it is; you have to kind of experience it.\n\nOn the world leaders front, on politics, geopolitics, there's something really special again with studying World War II and how much could have been saved if Chamberlain met Stalin in person. I sometimes also struggle explaining to people, articulating why I believe meeting in person for world leaders is powerful. It just seems naive to say that, but there is something there in person. With Beam, I felt that same thing, and then I'm unable to explain. All I kept doing is what a child does: you look real, you know? And I mean, I don't know if that makes meetings more productive or so on, but it certainly makes them more, uh, the same reason you want to show up to work versus remote, sometimes that human connection.\n\nI don't know what that is. It's hard to put into words.\n\nUm, there's something beautiful about great teams collaborating on a thing that's not captured by the productivity of that team or by whatever on paper. Like, some of the most beautiful moments you experience in life is at work, pursuing a difficult thing together for many months. There's nothing like it. You're in the trenches, and yeah, you do form bonds that way, for sure. And to be able to do that like somewhat remotely in that same personal touch, I don't know, that's a deeply fulfilling thing.\n\nI know a lot of people, I, I personally hate meetings because a significant percent of meetings, when done poorly, are, are, don't serve a clear purpose. So, but that's a meeting problem. That's not a communication problem. If you can improve the communication for the meetings that are useful, that's just incredible. So yeah, I was blown away by the great engineering behind it, and then we get to see what impact that has. That's really interesting, but just incredible engineering. Really impressive. Oh, it is. And obviously, we'll work hard over the years to make it more and more accessible. But yeah, even on a personal front, outside of work meetings, you know, a grandmother who's far away from our grandchild and being able to, you know, have that kind of an interaction, right? All that, I think, will end up being very mean. Nothing substitutes being in person, but you know, it's not always possible. You know, you could be a soldier deployed, right, trying to talk to your loved ones. So, I think, uh, you know, so that's what inspires us.\n\nWhen you and I hung out last year and took a walk, I remember, I don't think we talked about this, but I remember, uh, you know, outside of that, seeing dozens of articles written by analysts and experts and so on that Sundar Pichai should step down because the perception was that Google was definitively losing the AI race, has lost its magic touch in the rapidly evolving technological landscape. And now, a year later, it's crazy. You showed this plot of all the things that were shipped over the past year is incredible, and Gemini Pro is winning across many benchmarks and products as we sit here today. So, take me through that experience when there's all these articles saying you're the wrong guy to lead Google through this. Google's lost, it's done, it's over, to today where Google is winning again. What were some low points during that time?\n\nLook, I, um, I mean, lots to unpack. Um, you know, obviously, like the main bet I made as a CEO was to really, uh, you know, make sure the company was approaching everything in an AI-first way. Really, you know, setting ourselves up to develop AGI responsibly, right? And, and, and make sure we're putting out products, uh, which embodies that, things that are very, very useful for people. So look, I, I knew even through moments like that last year, uh, you know, I had a good sense of what we were building internally, right? So I'd already made, you know, many important decisions, you know, bringing together teams of the caliber of Brain and DeepMind and setting up Google DeepMind. There were things like we made the decision to invest in TPUs 10 years ago. So, we knew we were scaling up and building big models.\n\nAnytime you're in a situation like that, a few aspects, uh, I'm good at tuning out noise, right? Separating signal from noise. Do you scuba dive? Like, have you? No. You know, it's amazing. Like, I'm not good at it, but I've done it a few times. But sometimes you jump in the ocean, it's so choppy, but you go down one foot under, it's the calmest thing in the entire universe, right? So there's a version of that, right? Like, you know, uh, running Google, you know, you may as well be coaching Barcelona or Real Madrid, right? Like, you know, you have a bad season. So there are aspects to that, but you know, like, look, I, I'm good at tuning out the noise. I do watch out for signals, you know, it's important to separate the signal from the noise. So there are good people sometimes making good points outside. So you want to listen to it. You want to take that feedback in. But you know, internally, like, you know, you're making a set of consequential decisions, right? As leaders, you're making a lot of decisions. Many of them are like inconsequential, like it feels like, but over time, you learn that most of the decisions you're making on a day-to-day basis doesn't matter. Like, you have to make them, and you're making them just to keep things moving, but you have to make a few consequential decisions, right? And, and, uh, we had set up the right teams, right leaders, we had world-class researchers. We were training Gemini internally. There are factors which were, for example, outside people may not have appreciated. I mean, TPUs are amazing, but we had to ramp up TPUs, two, that took time, right? And, and, uh, to scale, actually having enough TPUs to get the compute needed, but I could see internally the trajectory we were on, and and be, you know, I was so excited internally about the possibility. To me, this moment felt like one of the biggest opportunities ahead for us as a company. That the opportunity space ahead over the next decade, next 20 years is bigger than what has happened in the past. Um, and I thought we were set up like better than most companies in the world to go, uh, realize that vision.\n\nI mean, you had to make some consequential, bold decisions, like you mentioned the merger of DeepMind and Brain. Uh, maybe it's my perspective, just knowing humans. I'm sure there's a lot of egos involved. It's very difficult to merge teams, and I'm sure there are some hard decisions to be made. Can you take me through your process of how you think through that? Do you go to pull the trigger and make that decision? Maybe what were some painful points? How do you navigate those turbulent waters?\n\nLook, we were fortunate to have two world-class teams. Uh, but you're right, like it's like somebody coming and telling to you, take Stanford and MIT, right? And then put them together and create a great department, right? And, and easier said than done. Uh, but we were fortunate, you know, phenomenal teams, both had their strengths, you know, they were run very differently, right? Like, uh, Brain was kind of a lot of diverse projects, bottoms up, and out of it came a lot of important research breakthroughs. DeepMind at the time had a strong vision of how you want to build AGI, and so they were pursuing their direction. But I think through those moments, luckily tapping into, um, you know, Jeff had expressed a desire to be more, to go back to more of a scientific individual contributor roots. You know, he felt like management was taking up too much of his time. Uh, and, and, and Demis naturally, I think, uh, you know, uh, was running DeepMind and was a natural choice there. But I think it was, you were right, you know, it took us a while to bring the teams together. Credit to Demis, Jeff, Kai, all the great people there. They worked super hard to combine the best of both worlds. When you set up that team, a few sleepless nights here and there as we put that thing together. We were patient in how we did it so that it works well for the long term, right? And, and some of that in that moment, I think, yes, with things moving fast, uh, I think you definitely, uh, felt the pressure, but I think we pulled off that, uh, transition well, and you know, I think, I think, uh, you know, they've obviously, uh, doing incredible work, and there's a lot more incredible things ahead coming from them.\n\nLike we talked about, you have a very calm, even-tempered, respectful demeanor. During that time, whether it's the merger or just dealing with the noise, uh, did, were there times where frustration boiled over? Like, did you, uh, have to go a bit more intense on everybody than you usually would?\n\nProbably. You know, probably, right? I think, I think in the sense that, you know, it was a moment where we were all driving hard, but when you're in the trenches working with passion, you're going to have days, right? You disagree, you argue, but like all that, I mean, just part of the course of working intensely, right? And, uh, you know, at the end of the day, all of us are doing what we're doing because, uh, the impact it can have, we're motivated by it. It's like, uh, you know, for many of us, this has been a long-term, uh, journey, and so it's been super exciting. The positive moments far outweigh the kind of stressful moments. Just early this year, I had a chance to celebrate back-to-back over two days, like, you know, Nobel Prize for Jeff Finton and the next day a Nobel Prize for Dennis and John Jumper. You know, you worked with people like that. All that is super inspiring.\n\nIs there something like with view where you had to like put your foot down, maybe with less, uh, versus more, where like, I'm the CEO and we're, we're doing this? To my earlier point about consequential decisions you make, there are decisions you make people can disagree pretty vehemently, and but at some point, like, you know, you make a clear decision, and you, you just ask people to commit, right? Like, you know, you can disagree, but it's time to disagree and commit so that we can get moving. And whether it's putting the foot down or, you know, like, you know, it's, it's a natural part of what all of us have to do, and you know, I think you can do that calmly and be very firm in the direction you're making the decision. And I think if you're clear, actually, people over time respect that, right? Like, you know, if you can make decisions with clarity, I find it very effective in meetings where you're making such decisions to hear everyone out. I think it's important when you can to hear everyone out. Sometimes what you're hearing actually influences how you think about, and you're wrestling with it and making a decision. Sometimes you have a clear conviction, and you state so, look, I, uh, I, you know, this is how I feel, and you know, this is my conviction, and you kind of place the bet and you move on.\n\nOther big decisions like that, I'm kind of intuitively assume the merger was the big one. I think that was a very important decision, uh, you know, for, for the company to, to meet the moment. I think we had to make sure we were, uh, we were doing that and doing that well. I think that was a consequential decision. There were many other things. We set up an AI infrastructure team, like to really go meet the moment, to scale up the compute we needed to, and really brought teams from disparate parts of the company, kind of created it to, to move forward. Um, you know, bringing people like getting people to kind of work together physically, both in London with DeepMind and what we call Gradient Canopy, which is where the Mountain View Google DeepMind teams are. But one of my favorite moments is I routinely walk, uh, like multiple times per week to the graining canopy building where our top researchers are working on the models. Sergey is often there amongst them, right? Like, you know, just, you know, looking at, uh, you know, getting an update on the model, seeing loss curves. So all that, I think that cultural part of getting the teams together back with that energy, I think, ended up playing a big role too.\n\nWhat about the decision to recently add AI mode? So, Google Search is the, uh, as they say, the front page of the internet. It's like a legendary minimalist thing with 10 blue links. Like, that's when people think internet, they think that page, and now you're starting to mess with that. So, the AI mode, which is a separate tab, and then integrating AI in the results. I'm sure there were some battles in meetings on that one.\n\nLook, uh, you know, in some ways, when mobile came, you know, people wanted answers to more questions. So, we're kind of constantly evolving it. But you're right, this moment, you know, that evolution, uh, because the underlying technology is becoming much more capable, you know, you can have AI give a lot of context, you know, but one of our important design goals, though, is when you come to Google Search, you're going to get a lot of context, but you're going to go and find a lot of things out on the web. So that will be true in AI mode, in AI overviews, and so on. But I think to our earlier conversation, we are still giving you access to links, but think of the AI as a layer which is giving you context, summary, maybe in AI mode, you can have a dialogue with it back and forth. Mhm. On your journey, right? And but through it all, you're kind of learning what's out there in the world. So those core principles don't change, but I think AI mode allows us to push the, we have our best models there, right? Uh, models which are using search as a deep tool, really, for every query you're asking, kind of fanning out, doing multiple searches, like kind of assembling that knowledge in a way so you can go and consume what you want to, right? And, and, and that's how we think about it.\n\nI got a chance to listen to a bunch of Elizabeth Liz Reed, yeah, describe this. Two things stood out to me that you mentioned. One thing is what you were talking about is the query fan out, which I didn't even think about before, uh, is the powerful aspect of integrating a bunch of stuff on the web for you in one place. So yes, it provides that context so that you can decide which page to then go on to. The other really, really big thing speaks to the earlier in terms of productivity multiplier that we're talking about, that she mentioned was, um, language. So one of the things you don't quite understand is it, through AI mode, you make for non-English speakers, you make sort of, let's say, English language websites accessible by in the reasoning process as you try to figure out what you're looking for. Of course.\n\n\nOnce you show up to a page, you can use a basic translate. Yeah. But that process of figuring it out, if you empathize with a large part of the world that doesn't speak English, their web is much smaller in that original language. And so it unlocks, again, unlocks that huge cognitive capacity there that we don't, you know, you take for granted here with all the bloggers and the journalists writing about AI mode. You forget that this now unlocks, um, because Gemini is really good at translation. No, it is. I mean, the multimodality, the translation, uh, its ability to reason, we are dramatically improving tool use. Uh, like I, as putting that power in the flow of search, I, I think, look, I'm, I'm super excited with AI overviews. We've, we've seen the product has gotten much better. We know we measure it using all kinds of user metrics. It's obviously driven strong growth of the product, uh, and, you know, we've been testing AI mode, you know, it's now in the hands of millions of people, and the early metrics are very encouraging. So, look, I, I, I'm excited about this next chapter, chapter of search for people who are not thinking through or aware of this. So, there's the 10 blue links with AI overview on top that provides a nice summarization. You can expand it and you have sources and links now. Yep. Embedded. Yeah, I believe at least Liz said so. I actually didn't notice it, but there's ads in the AI overview.\n\nAlso, I don't think there's ads in AI mode.\n\nUh, when ads in AI mode. So now, when do you think, I mean, it's okay, we should say that in the '90s, I remember the animated gifts, banner gifts that take you to some shady websites that have nothing to do with anything. AdSense revolutionized advertisement. It's one of the greatest inventions, um, in, in recent history because it allows us for free to have access to all these kinds of services. So, ads fuel a lot of really powerful services, and at its best, it's showing you relevant ads, but also very importantly, in a way that's not super annoying. Mhm. Right. In a classy way. So, uh, when do you think it's possible to add ads into AI mode, and what does that look like from a classy, non-annoying perspective? Two things. Early part of AI mode, uh, will obviously focus more on the organic experience to make sure we are getting it right. I think the fundamental value of ads are it enables access to deploy the services to billions of people. The second is ads are the reason we've always taken ads seriously is we view ads as commercial information, but it's still information, and so we bring the same quality metrics to it. I think with AI mode, to our earlier conversation about, I think AI itself will help us over time figure out, you know, the best way to do it. I, I think, given we giving context around everything, we, I think it'll give us more opportunities to also explain, okay, here's some commercial information, like today, as a podcaster, you do it at certain spots, and you probably figure out what's best in your podcast.\n\nUm, I, I think so, there are aspects of that, but I think, you know, I think the underlying need of people, value commercial information, businesses are trying to connect to users, all that doesn't change in a AI moment, but look, we will rethink it. You've seen us in YouTube now do a mixture of subscription and ads, like, obviously, you know, we, we are now introducing subscription offerings, uh, across everything, and so as part of that, we can optim, the optimization point will end up being a different place as well.\n\nDo you see a trajectory in the possible future where AI mode completely replaces the 10 blue links plus AI overview? Our current plan is AI mode is going to be there as a separate tab for people who really want to experience that, but it's not yet at the level where our main search page is, but as features work, we'll keep migrating it to the main page, and so you can view it as a continuum. AI mode will offer you the bleeding edge experience, but it'll work, will keep overflowing to AI overviews and the main, main experience, and the idea that AI mode will still take you to the web, to the human-created web. Yes, that's going to be a core design principle for us. So, really, if users decide, right, they drive this. Yeah, it's just exciting, a little bit scary that it might change the internet because you Google has been dominating with a very specific look and idea of what it means to have the internet, and to as you move to AI mode, I mean, I, it's just a different experience. Um, I think Liz was talking about, I think you've mentioned that you ask more questions, you ask longer questions, dramatically different types of questions. Yeah. Like it actually fuels curiosity. Like I think it's for me, I've been asking just a much larger number of questions of this blackbox machine, let's say, whatever it is. And, and with AI overview, it's interesting, like I, because I still value the human, I still ultimately want to end up on the human-created web, but I, like you said, the context really helps, it helps us deliver higher quality referrals, right? You know, where people are like, they have much higher likelihood of finding what they're looking for, they're exploring, they're curious, their intent is getting satisfied more, so all that's what all our metrics.\n\nIt makes the humans that create the web nervous. The journalists are getting nervous. They've already been nervous. Like we mentioned, CNN is nervous because of podcasts. Um, it makes people nervous. Look, I, I, I think news and journalism will play an important role, you know, in the future. Uh, we're pretty committed to it, right? And, uh, so I think making sure that ecosystem, in fact, I think we'll be able to differentiate ourselves as a company over time because of our commitment there. So, it's, it's, it's something I think, you know, I definitely value a lot, and, and as we are designing, we'll continue prioritizing approaches. I'm sure for the people who want, they can have a fine-tuned AI model that's clickbait hit pieces, uh, that will replace current journalism. Uh, that's a shot of journalism, forgive me. Uh, but I, I find that if you're looking for really strong criticism of things that Gemini is very good at providing that. Oh, absolutely. It's better than anything the, for now, I mean, people are concerned that there would be bias that's introduced, that as the AI systems become more and more powerful, there's incentive from sponsors, uh, to roll in and try to control the output of the AI models. Uh, but for now, the objective criticism that's provided is way better than journalism. Of course, the argument is the journalists are still valuable, but then I don't know, the crowd search journalism that we get on the open internet is also very, very powerful. I feel like they're all super important things. I think it's good that you get a lot of crowdsourced information coming in, but I feel like there is real value for high quality journalism, right? And, and I think these are all complimentary. I think, like, I view it as I find myself constantly seeking out also, like, try to find objective reporting on, on things too. Uh, and, and sometimes you get more context from the crowdfunded sources you read online, but I think both end up playing a super important role. So, there's, uh, you spoken a little about about this, de talked about this is sort of the, the slice of the web that will increasingly become about providing information for agents. So, we can think about as like two layers of the web. One is for humans, one is for agents. Do you see the AI agents? Do, do you see the one that's for AI agents growing over time? Do you see there still being long-term, 5, 10 years value for the human-created, human-created for the purpose of human consumption web, or will it all be agents in the end? Yeah.\n\nToday, like not everyone does, but, you know, you, you go to a, you go to a big retail store, you love walking the aisle, you love shopping, uh, or grocery store, picking out food, etc., but you're also online shopping and they're delivering, right? So, both are complimentary, and like that's true for restaurants, etc. So, I do feel like over time websites will also get better for humans. They will be better designed. Uh, AI might actually design them better for humans. So, I, I expect the web to get a lot richer and more interesting and, uh, better to use. At the same time, I think there'll be an agentic web, which is also making a lot of progress, and you have to solve the business value and the incentives to make that work well, right? Like for people to participate in it, but I think both will coexist, and obviously the agents may not need the same, I mean, not may not, they won't need the same design and the UI paradigms which humans need to interact with, uh, but I think both will, both be there. I have to ask you about Chrome. Uh, I have to say, for me personally, Google Chrome is probably, I don't know, I'd like to see where I would rank it. But in this temptation, this is not a recency bias, although it might be a little bit, but I think it's up there, top three, maybe the number one piece of software for me of all time. It's just incredible. It's really incredible. The browser is our window to the web. And Chrome really continued for many years, but even initially to push the innovation on that front when it was stale, and it continues to challenge, it continues to make it more, uh, performant, so efficient, just innovate constantly. Uh, and the, the, the Chromium aspect of it. Anyway, uh, you were one of the pioneers of Chrome, pushing for it when it was an insane idea, probably one of the ideas that was criticized and doubted and so on. So, can you tell me, um, the story of what it took to push for Chrome? What was your vision? Look, it was a such a dynamic time, uh, in around 2004, 2005, with Ajax, the web suddenly becoming dynamic in a matter of few months, Flickr, Gmail, Google Maps, all kind of came into existence, right? Like the fact that you have an interactive, dynamic web. The web was evolving from simple, uh, text pages, simple HTML to rich, dynamic applications. But at the same time, you could see the browser was never meant for that world, right? Like JavaScript execution was super slow. Uh, you know, the browser was far away from being an operating system for that rich, modern web which was coming into, uh, coming into place. So, that's the opportunity we saw, like, uh, you know, it's an amazing early team. I still remember the day we got a shell on WebKit running and how fast it was. Uh, you know, we had the clear vision for building a browser, like we wanted to bring core OS principles into the browser, right? Like, so we built a secure browser sandbox, each tab was its own, not these things are common now, but at the time, like it was pretty unique. Uh, we found an amazing team in our Denmark, uh, with a leader who built a V8, the JavaScript VM, which at the time was 25 times faster than, uh, any other JavaScript VM out there. And by the way, you're right. We open sourced it all and, you know, and put it in Chromium too. But we really thought the web could work much better, um, uh, you know, much faster, and you could be much safer browsing the web. And the name Chrome came was because we literally felt people were like, the, the, the Chrome of the browser was getting clunkier. We wanted to minimize it. And so that was the origins of the project. Definitely, obviously, uh, highly biased person here talking about Chrome. Uh, but, you know, it's the most fun I've had, uh, building a product from the ground up, and, you know, it, it was an extraordinary team. Uh, had, uh, my co-founders on the project were terrific. So, definite fond memories. So, for people who don't know, Sundar, it's probably fair to say you're the reason we have Chrome. Yes. I know there's a lot of incredible engineers, but pushing for it inside a company that probably was opposing it because it's a crazy idea, because, um, as everybody probably knows, it's incredibly difficult to build a browser. Yeah. Look, I, uh, Eric, who was the CEO at the time, I think it was less that he was opposed to it. He kind of firsthand knew what a crazy thing it is to go build a browser. And so he definitely was like, this is, you know, there was a crazy aspect to actually wanting to go build a browser. But, um, he was very supportive, uh, you know, everyone, the founders were, I think, once we started, you know, building something and we could use it and see how much better from then on, like, you know, you're, you're really tinkering with the product and making it better, it came to life pretty fast. What, uh, wisdom do you draw from that from, um, pushing through on a crazy idea in the early days that ends up being revolutionary? What for future crazy ideas like it? I mean, this, this is something Larry and Sergey have articulated clearly. I really internal, internalized this early on, which is, you know, their whole feeling around working on moonshots, like, as a way, when you work on something very ambitious, first of all, it attracts the best people, right? So, that's an advantage you get. Number two, because it's so ambitious, you don't have others working on something crazy, so you pretty much have the path to yourselves, right? It's like way more self-driving. Number three, it is, even if you end up quite not accomplishing what you set out to do, and you end up doing 60, 80% of it, you'll end up being a terrific success. So, so, you know, that's the advice I would give people, right? I think, like, you know, it's just aiming for big ideas has all these advantages, and, and it's risky, but it also has all these advantages which people I don't think fully internalize.\n\nI mean, you mentioned one of the craziest, biggest moonshots, which is Whimo. Uh, it's when, when I first saw over a decade ago, a Waymo vehicle, a Google self-driving car vehicle. It was, it was for me, it was an aha moment for robotics. It made me fall in love with robotics even more than before. It gave me a glimpse into the future. So, it's incredible. I'm truly grateful for that project for what it symbolizes. But it's also crazy moonshot. Is for, for a long time has been just like you mentioned with scuba diving, just not listening to anybody, just calmly improving the system better and better, more testing, just expanding, uh, the operational domain more and more. First of all, congrats on, uh, 10 million paid robo taxi rides. Uh, what lessons do you take from Whimo about, like, the, the perseverance, the persistence on that project? I look really proud of the progress, uh, we have had with Whimo. One of the things I think we were very committed to, you know, the final 20% can look like, I mean, we always say, right, the first 80% is easy, the final 20% takes 80% of the time. I think we definitely were, we're working through that phase with Whimo, but I was aware of that, so, but, you know, we knew we were at that stage, we knew we were the technology gap between while there were many people, many\n\n\nOther self-driving companies, we knew the technology gap was there. In fact, right at the moment when others were doubting Whimo is when, I don't know, I made the decision to invest more in Whimo, right? Because so, uh, so in some ways, it's counterintuitive, uh, but I think, look, we've always been a deep technology company, and like, uh, you know, is a version of kind of building an AI robot that works well. And so we get attracted to problems like that. The caliber of the teams there, uh, you know, uh, phenomenal teams. And so I know you followed the space super closely, uh, you know, I'm talking to someone who knows the space well, but it was very obvious it's going to get there. And you know, there's still more work to do, but we, you know, it's a good example where we always prioritized being ambitious and safety at the same time, right? And and and equally committed to both and and pushed odd, and you know, couldn't be more thrilled with uh, how it's working, uh, how much people love, love the experience. And it this year is definitely, we've scaled up a lot, and we'll continue scaling up in '26. That said, uh, the competition is heating up. You've been uh, friendly with Elon, uh, even though technically is a competitor, but you've been friendly with a lot of tech CEOs in that way, just showing respect towards them and so on. What do you think about the robo taxi efforts that Tesla is doing? Do you see it as competition? What do you think? Do you like the competition?\nWe are one of the earliest and biggest backers of SpaceX, uh, as Google, uh, right? So, uh, you know, thrilled with uh, what SpaceX is doing and fortunate to be uh, investors as a company there, right? And and look, we don't compete with Tesla directly. We are not making cars, etc., right? We're building L4/5 autonomy. We're building a way driver, which is general purpose and can be used in many headings. They're obviously working on making Tesla self-driving too. I've just assumed it's a de facto that Elon would succeed in whatever he does. So like, you know, you know that that that is uh, not something I question. So, but I think we are so far from these spaces are such vast spaces, like I, I think about transportation, the opportunity space. The Whimo driver is a general purpose technology. We can apply in many situations. So you have a vast green space. Uh, in all future scenarios, I see Tesla doing well and you know, Waymo doing well. Like we mentioned with the Neolithic package, I think it's very possible that in the quote unquote AI package, when the history is written, autonomous vehicles, self-driving cars is like the big thing that changes everything. Imagine over a period of uh, a decade or two, just a complete transition from manually driven to autonomous in ways we might, we might not predict. It might change the way we move about the world completely. So that, you know, the possibility of that and then the second and third order effects as you're seeing now with Tesla, very possibly you would see some um, internally with Alphabet, maybe Whimo, maybe some of the Gemini robotics stuff, it might lead you into the other domains of robotics because we should remember that Whimo is a robot. Mhm. It just happens to be on four wheels. So you, you said that the next big thing, we can also throw that into AI package. The big aha moment might be in the space of robotics. What do you think that that would look like? Dispoint team is very focused on Gemini robotics, right? So we are definitely building the underlying models. Well, so we have a lot of investments there, and I think we also pretty cutting edge in our uh, research there. So we are definitely driving that direction. We obviously are thinking about applications in robotics. We'll, we'll kind of work seriously. We are partnering with a few companies today. But it's an area I would say stay tuned. We are, you know, we are yet to fully articulate our plans outside, but it's an area we are definitely committed to driving a lot of progress, but I think AI ends up driving that massive progress in robotics. The field has been held back uh, uh, for for a while. I mean, the hardware has made extraordinary uh, progress. Uh, the software had been the challenge, but you know, with AI now and uh, and and the and the generalized models we are building, uh, you know, we are building these models, getting them to work in the real world in a safe way, in a generalized way is the frontier we're pushing pretty hard on. Well, it's really nice to see the the models and the different teams integrated to where all of them are pushing towards one world model that's being built. To from all these different angles, multimodal. You're ultimately trying to get Gemini. So the same thing that would make AI mode really effective in answering your questions, which requires a kind of world model, is the same kind of thing that would help a robot be useful in the physical world. So everything is aligned. That that is what makes this moment so unique because running a company for the first time, you can do one investment in a very deep horizontal way. On top of it, you can like drive multiple businesses forward, right? And you know, and that's that's effectively what we are doing in Google and Alphabet, right? Yeah, it's all coming together like it was planned ahead of time, but it's not, of course, it's all distributed. I mean, if uh, Gmail and sheets and all these other incredible services. I can sing Gmail praises for years. I mean, it's just just revolutionized email, but the moment you start to integrate AI Gemini into Gmail, I mean, that's the other thing. Speaking of productivity multiplier, people complain about email, but that changed everything. Email, like the invention of email changed everything. And it's been ripe. There's been a few folks trying to revolutionize email, some of them on top of Gmail, but that's like ripe for innovation, not just spam filtering, but you uh, you you demoed a really nice demo of personalized responses, right? Personalized responses. And it at first, I was like, at first I felt really bad about that. But then I realized that's there's nothing wrong to feel bad about because will you uh, the example you gave is when a friend asks, you know, you went to whatever hiking location, uh, do you have any advice? And they just searches through all your information to give them good advice, and then you put the cherry on top, maybe some love or whatever camaraderie, but the formational aspect, the knowledge transfer it does for you, I think there'll be important moments like it should be like today if you write a card in your own handwriting and send it to someone, that's a special thing. Similarly, there'll be a time, I mean, to your friends, maybe your friend wrote and said he's not doing well or something, you know, those are moments you want to save your times for writing something, reaching out, but you know, like saying, give me all the details of the trip you took, you know, to me makes a lot of sense for a AI assistant to help you, right? And so I think both are important, but I think I think I'm excited about that direction. Yeah, I think ultimately it gives more time for us humans, us to do the things we humans find meaningful. And I think it scares a lot of people because we're going to have to ask ourselves the hard question of like, what do we find meaningful? And I'm sure there's answers. I, it's the old question of the meaning, meaning of existence is you, you have to try to figure that out. That might be ultimately uh, parenting or being creative in some domains of art or writing. And it it challenges to to to like, you know, it's a good question of to ask yourself, like, in my life, what is the thing that brings me most joy and fulfillment? And if I'm able to actually focus more time on that, that's really powerful. I think that's the uh, you know, that's the holy grail. If you get this right, I think it allows more people uh, to find that. I have to ask you on the programming front, uh, AI is getting really good at programming. Gemini, both the Agentic and just the LLM has been incredible. So, a lot of programmers are really worried that their jobs, they will lose their jobs, uh, how worried should they be and how should they adjust so they can be thriving in this new world where more and more code is written by AI? I think a few things, looking at Google, um, you know, we've given various stats around like, you know, 30% of uh, code now uses like AI generated suggestions or whatever it is, but the most important metric, and we carefully measure it, is like how much has our engineering velocity increased as a company due to AI, right? And it's like tough to measure, and we kind of rigorously try to measure it, and our estimates are that number is now at 10%. Right? Like now across the company, we've accomplished a 10% engineering velocity increase using AI, but we plan to hire engineers, more engineers next year, right? So you, because the opportunity space of what we can do is expanding too, right? And so I think hopefully, you know, for at least the near to midterm term, for many engineers, it frees up more and more of the, you know, even in engineering and coding, there are aspects which are so much fun, you're designing, you're architecting, you're solving a problem, there's a lot of grunt work, you know, which all goes hand in hand, but it hopefully takes a lot of that away, makes it even more fun to code, frees you up more time to create, problem solve, brainstorm with your fellow colleagues and so on, right? So that's that's the opportunity there. And second, I think like, you know, it'll attract, it'll put the creative power in more people's hands, which means people will create more, that means there'll be more engineers doing more things. So it's tough to fully predict, but you know, I, I think in general, in this moment, it feels like, you know, you know, people uh, adopt these tools and be better programmers, like there are more people playing chess now than ever before. Right? So uh, you know, it feels positive that way to me at least, speaking from within a Google context, uh, is how I would you know, talk to them about it. I still, I just know anecdotally, a lot of great programmers are generating a lot of code. So their productivity, they're not always using all the code, just you know, there's still a lot of editing, but like even for me, it's still programming as a side thing. I think I'm like 5x more productive. I don't, I, I think that's uh, even for a large code base that's touching a lot of users like Google's does. I'm imagining like very soon that productivity should be going up even more. The big unlock will be as we make the agent capabilities much more robust, right? I think that's what unlocks that next big wave. I think the 10% is like a massive number, like you know, if tomorrow like I showed up and said like you can improve like a large organization's productivity by 10%. When you have tens of thousands of engineers, that's a phenomenal number. Uh, and you know, that's different than what others cite as statistics, saying like, you know, like this percentage of code is now written by AI. I'm talking more about like overall productivity, the actual productivity, right? Engineering productivity, which is two different things and and which is the more important uh, metric. And but I think it'll get better, right? And like, you know, uh, I think there's no engineer who tomorrow, if you magically became 2x more productive, it's just going to create more things, you're going to create more value added things, and so I think they, you'll, you'll find more satisfaction in your job, right? So, and there's a lot of aspects, I mean, the actual Google codebase might just improve because it'll become more standardized, more um, easier for people to move about the codebase because AI will help with that, and therefore that will also allow the AI to understand the entire codebase better, which makes the engineering aspect, that's I've been using cursor a lot, uh, as as a way to program with Gemini and other models is like it. One of its powerful things is it's aware of the entire codebase, and that allows you to ask questions of it. It allows the agents to move about that code base in a really powerful way. I mean, that's a huge unlock. Think about like, you know, migrations, refactoring old coal bases. Refactoring. Yeah. I mean, think about like, you know, once we can do all this in a much better, more robust way than where we are today. I think in the end, everything will be written in JavaScript and run in Chrome. I think it's all going to that uh, direction. I mean, just for fun, Google has legendary code coding interviews, uh, like rigorous interviews for the engineers. How can you comment on how that has changed in the era of AI? It's just such a weird uh, you know, the whiteboard interview, I, I assume is not allowed to have some prompts. Such a a good question. Look, I do think, you know, we're making sure, you know, we'll we'll introduce at least one round of in-person interviews for people just to make sure the fundamentals are there. I think that'll end up being important, but it's an equally important skill. Look, if you can use these tools to generate better code, uh, like you know, I think I think that's an asset. And so uh, you know, I think uh, so overall, I think it's a it's a massive positive vibe coding engineer. Uh, do you recommend uh, pe people uh, students interested in programming still get an education uh, in computer science and college education? What do you think?\nI do. If you have a passion for computer science, I would, you know, computer science is obviously a lot more than programming alone, so I would, I still don't think I would change what you pursue. You um, I think AI will horizontally allow impact every field. It's pretty tough to predict in what ways. So any education in which you're learning good first principles thinking, I think is good education. You've revolutionized web browsing, you've revolutionized a lot of things over the years. Um, Android changed the game. It's an incredible uh, operating system. And we could talk for hours about Android. What does the future of Android look like? Is it is it possible it becomes more and more AI-centric? Uh, especially now that you throw into the mix Android XR with being able to do augmented reality, mixed reality and virtual reality in the physical world? Yeah. The best innovations in computing have come when you're uh, through a paradigm IO change, right? Like you know, when when with GUI and then with a graphical user interface and then with multi-touch in the context of mobile voice later on. Similarly, I feel like, you know, AR is that next paradigm. I think it was held back both the system integration challenges of making good AR is very, very hard. The second thing is you need AI to actually kind of, otherwise the IO is too complicated for you to have natural, seamless IO to that uh, uh, paradigm. AI ends up being super important, and so this is why project Astra ends up being super critical for that Android uh, XR world, uh, but it is, I think when you use glasses and you know, always been amazed like at at the how useful these things are going to be. So I look, I think it's a real opportunity for Android. I think XR is one way it'll kind of really come to life. But I think there's an opportunity to rethink the\n\n\nMobile OS too, right? I think we've been kind of living in this paradigm of like apps and shortcuts. All that won't go away. But again, like if you're trying to get stuff done at an operating system level, you know, it needs to be more agentic so that you can kind of describe what you want to do or like it proactively understands what you're trying to do, learns from how you're doing things over and over again, and kind of is adapting to you. All that is kind of like the unlock we need to go and do with a basic, efficient, minimalist UI.\n\nI've gotten a chance to try the glasses, and they're incredible. It's the little stuff. It's hard to put into words, but no latency. It just works. Even that little map demo where you look down and you look up, and there's a very smooth transition between the two, and useful, very small amount of useful information is shown to you. Enough not to distract from the world outside, but enough to provide a bit of context when you need it.\n\nAnd some of that be in order to bring that into reality, you have to solve a lot of the OS problems to make sure it works when you're integrating the AI into the whole thing. So, everything you do launches an agent that answers some basic question. A good moonshot, you know, it's crazy. No, but, but you know, I think, uh, we are, you know, but it's much closer to reality than, uh, other moonshots. You know, we expect to have classes in the hands of developers later this year and, and you know, in consumer science next year. So, it's an exciting time.\n\nYeah. Well, extremely well executed Beam, all the stuff, you know, cuz I sometimes you don't know, like somebody commented on a top comment on one of the demos of Beam. They said, uh, this will either be killed off in 5 weeks or revolutionize all meetings in 5 years. And there's very much Google tries so many things and sometimes sadly kills off very promising projects, but because there's so many other things to focus on. I use, I use so many Google products. Google Voice I still use. I'm so glad that's not being killed off. That's still alive. Thank you, whoever is defending that, cuz it's, it's, it's awesome, and it's great they keep innovating. I just want to list off just as a big thank you. So, search, obviously Google revolutionized. Chrome and all of these could be multi-hour conversations. Gmail, I've been singing Gmail praises forever. Maps, incredible technological innovation on revolutionizing mapping. Android, like we talked about, YouTube, like we talked about. AdSense, uh, Google Translate. For the academic minded, Google Scholar is incredible when with the book and also the scanning of the books. So, making all the world's knowledge, um, accessible, even with that knowledge is a kind of niche thing which Google Scholar is. Uh, and then obviously with DeepMind, uh, with Alpha Zero, AlphaFold, Alpha Evolve, I could talk forever about Alpha Evolve. That's mind-blowing. All of that released and as part of that, uh, set of things you've released in this year when, uh, those brilliant articles were written about Google is done. Uh, and, uh, like we talked about pioneering self-driving cars and quantum computing, which could be another thing that is lowkey is scuba diving. It's way to changing the world forever.\n\nUh, so another ptheads slash, um, micro kitchen question. If you build AGI, what kind of question would you ask it? What would you, what would you want to talk about? Definitively Google has created AGI that can basically answer any question. What topic are you going to? What, where's it, where's it? Where are you going? It's a great question. Um, maybe it's proactive by then and should tell me a few things I should know. But I think if I were to ask it, I think it'll help us understand ourselves much better. Um, in a way that'll surprise us, I think. Um, and so maybe that's you already see people do it with the products and so, but you know, in a AGI context, I think that'll be pretty powerful at a personal level or or general human nature at a personal level, like you talking to AGI. I think, I think, you know, uh, there is some chance it'll, it'll kind of understand you in a, in a very deep way. Uh, I think, uh, you know, in a profound way, that's a possibility. Uh, I, I think there is also the obvious thing of like, maybe it helps us understand the universe better. Um, you know, in a way that expands the frontiers of our understanding of the world. Uh, that is something super exciting. But look, I, I really don't know. I think, you know, I haven't, haven't had access to something that powerful yet. But I think those are all possibilities. I think on the personal level, asking questions about yourself could a sequence of questions like that about what makes me happy. I think we would be very surprised to learn those kind of the, um, a sequence of questions and answers. We might explore some profound truths in the way that sometimes art reveals to us, great books reveal to us, great conversations with loved ones reveal. Uh, things that are obvious in retrospect, but are nice when they're said. Uh, but for me, number one question is about how many alien civilizations are there? 100%. Are they... That's going to be your first question. Number one, how many living and dead alien civilizations? Uh, maybe a bunch of follow-ups like how close are they? Are they dangerous? Um, if, if there's no alien civilizations, why? Uh, or if there's no advanced alien civilizations, but bacteria-like life everywhere, why? What is the barrier preventing it from getting to that? Uh, is it because that there's, uh, that when you get sufficiently intelligent, you end up, uh, destroying ourselves because you need competition in order to develop an advanced civilization. And when you have competition, it's going to lead to military conflict and conflict eventually kills everybody. I don't know. I'm going to have that kind of discuss. Get an answer to the Fermi paradox. Yeah, exactly. And like have a real discussion about it. I'm not sure it's a, um, I'm realizing now with your answer is a more productive, um, answer because I'm not sure what I'm going to do with that information, but maybe it speaks to the general human curiosity that Liz talked about that we're all just really curious and making the world's information accessible allows our curiosity to be satiated some with AI even more. We can be more and more curious and learn more about the world, about ourselves. And in so doing, I always wonder if I don't know if you can comment on like, is it possible to measure the, not the GDP productivity increase like we talked about, but maybe the whatever that increases the, the breadth and depth of human knowledge that Google has unlocked with Google Search and now with AI mode with Gemini is a difficult thing to measure. Many years ago there was a, I think it was a MIT study, they just estimated the impact of Google Search and they basically said it's the equivalent to on a per person basis, it's few thousands of dollars per year per person, right? Uh, like is the value that got created per year, right? And, and, but it's, yeah, it's tough to capture these things, right? You kind of take it, take it for granted as these things come, uh, and, and the frontier keeps moving. Think, but, uh, you know, how do you measure the value of something like AlphaFold over time, right? And, and, and so on. So, and also the increase in quality of life when you learn more. I have to say, like with, uh, some of the programming I do done by AI, for some reason, I'm more excited to program, uh, and so the same with knowledge, with discovering things about the world, uh, it makes you more excited to be alive. It makes you more curious to, and it keeps the more curious you are, the more exciting it is to live and experience the world. And it's very hard to, I don't know if that makes you more productive. It probably not nearly as much as it makes you happy to be alive. And that's a hard thing to measure. The quality of life increases some of these things do.\n\nAs AI continues to get better and better at everything that humans do, what do you think is the biggest thing that makes us humans special?\n\nLook, I, I, I think it's stuff taught in the essence of humanity. There's something about, uh, you know, the consciousness we have, what makes us uniquely human. Maybe the lines will blur over time, uh, and, and it's tough to articulate, but, uh, I hope, hopefully, you know, we live in a world where if you make resources more plentiful and make the world lesser of a zero-sum game over time, right? And, and which it's not, but you know, in a resource constraint environment, people perceive it to be, right? And, and, um, and so I hope the the values of what makes us uniquely human, empathy, kindness, all that surfaces more is the aspirational hope I have. Yeah, it multiplies the compassion, but also the curiosity, just the, the banter, the debates we'll have about the meaning of it all. And I, I, I also think in the scientific domains, all the incredible work that DeepMind is doing, I think we'll still continue to to play to explore scientific questions, uh, mathematical questions, physics questions, even as AI gets better and better at helping us solve some of the questions. Sometimes the question itself is a really difficult thing. Uh, both the right new questions to ask and the answers to them and, and, and the self-discovery process which it'll drive. I think, you know, our early work with both co-scientist and Alpha Evolve, just super exciting to see what gives you hope about the future of human civilization.\n\nI've always, I'm an optimist and you know, I, I, I look at, um, now if you were to say you take the journey of human civilization. Uh, it's been, you know, we've relentlessly made the world better, right? In many ways. At any given moment in time, there are big issues to work through. It may look, but you know, I always ask myself the question, would you have been born now or any other time in the past? I most often, not most often, almost always would rather be born now, right? You know, and so that's the extraordinary thing the human civilization has accomplished, right? And like, you know, and we, we've kind of constantly made the world a better place. And so something tells me as humanity, we always rise collectively to drive that, uh, frontier forward. So I expect it to be no different in the future.\n\nI agree with you totally. I'm truly grateful to be alive in this moment, and I'm also really excited for the future, and the work, uh, you and incredible teams here are doing is one of the big reasons I'm excited for the future. So thank you. Thank you for all the cool products you've built, and please don't kill Google Voice.\n\nThank you. We won't. Yeah. Thank you for talking today. This was incredible.\n\nThank you. Real pleasure. I appreciate it.\n\nThanks for listening to this conversation with Sundar Pichai. To support this podcast, please check out our sponsors in the description or at lexfreedman.com/sponsors. Shortly before this conversation, I got a chance to get a couple of demos that frankly blew my mind. The engineering was really impressive. The first demo was Google Beam and the second demo was the XR glasses and some of it was caught on video. So, I thought I would include here some of those, uh, video clips.\n\nHey, Lex. My name is Andrew. I lead the Google Beam team, and we're going to be excited to show you a demo. We're going to show you, I think, a glimpse of something new. So, that's the idea. A way to connect, a way to feel present from anywhere with anybody you care about. Here's Google Beam. This is a development platform that we've built. So, there's a prototype here of Google Beam. There's one right down the hallway. I'm going to go down and turn that on in a second. We're going to experience it together. We'll be back in the same room. Wonderful.\n\nWa. Okay. Here we are. All right. This is real already. Wow. This is real. Good to see you. This is Google Beam. We're trying to make it feel like you and I could be anywhere in the world, but when these magic windows open, we're back together. I see you exactly the same way you see me. It's almost like we're sitting at the table sharing a table together. I could learn from you, talk to you, share a meal with you, get to know you. So, you can feel the depth of this. Yeah. Great to meet you. Wow. Wow.\n\nSo, for people who probably can't even imagine what this looks like, there's a, there's a 3D version of It looks real. You look real. It looks to me, it looks real to you. It looks like you're coming out of the screen. We quickly believe, um, once we're in beam that we're just together. Like you settle into it. You're naturally attuned to seeing the world like this and you just get used to seeing people this way, but literally from anywhere in the world with these magic screens. This is incredible. It's a neat technology. Wow. So I saw demos of this, but they don't come close to the experience of this. Yeah. I think one of the top YouTube comments on one of the demos I saw was like, why would I want a high definition? Like I'm trying to turn off the camera, but this actually is, this feels like the camera has been turned off and we're just in the same room together. This is really compelling. That's right. I, I know it's kind of late in the day, too, so I brought you a snack just in case you're a little bit hungry. But, um... So what can you push it further? And it just becomes... Let's... Let's try to float it between rooms. You know, it kind of fades it from my room into your room. And then, and then you see my hand, the depth of my hand. Of course. Yes, of course. Yeah. It feels like you, um, try this. Try give me a high five. And there's almost a sensation of feeling touch. You almost feel because you're so attuned to, you know, that should be a high five. It feeling like you could connect with somebody that way. So, it's kind of a magical experience. Oh, this is really nice. How much does it cost? Yeah, we've got a lot of companies testing it. We just announced that we're going to be bringing it to offices soon as a set of products. We've got some companies helping us build these screens. Um, but eventually, I think this will be in almost every screen. There's nothing I'm not wearing anything. Well, I'm wearing a suit tie to clarify. I ain't wearing clothes. This is not CGI. But outside of that, cool. And the audio is really good. And you can see me in the same three-dimensional way. Yeah, the audio is spatialized. So if I'm talking from here,\n\n\nOf course, it sounds like I'm talking from here.\nYou know, if I move to the other side of the room here.\nSo these little subtle cues, these really matter to bring people together.\nAll the non-verbals, all the emotion, the things that are lost today.\nHere it is.\nWe put it back into the system.\nYou pulled this off.\nHoly, they pulled it off and integrated into this.\nI saw the translation also.\nRight.\nThis is the...\nYeah, we got a bunch of things.\nLet me show you a couple kind of cool things.\nLet's do a little bit of work together.\nMaybe we could um critique one of your latest uh um so you know it's you and I work together, so of course we're in the same room, but with this superpower, I can bring other things in here with me.\nUm and it's it's nice, you know, it's like we could sit together, we could watch something, we could work.\nUm, we've shared meals as a team together in this system, but once you do the presence aspect of this, you want to bring some other superpowers to it.\nAnd so, you could do review code together.\nYeah.\nYeah.\nExactly.\nI've got some uh slides I'm working on.\nYou know, maybe you could help me with this.\nKeep your eyes on me for a second.\nI'll slide back into the center.\nI didn't really move, but the system just kind of puts us in the right spot and knows where we need to be.\nOh, so you just turn to your laptop, the system moves you, and then it does the overlay automatically.\nIt kind of morphs the room to put things in the spot that they need to to be in.\nEverything has a place in the room.\nEverything has a sense of presence or spatial consistency and that kind of makes it feel like we're together with us and other things.\nI I should also say you're not just three-dimensional.\nIt feels like you're leaning like out of the screen.\nYou you're like coming out of the screen.\nYou're not just in that world three-dimensional.\nYeah, exactly.\nHoly crap.\nMove back to center.\nOkay.\nOkay.\nOkay.\nLet let me tell you how this works.\nYou probably already have the the premise of it, but there's two things, two really hard things that we put together.\nOne is a AI video model.\nSo, there's a set of cameras.\nYou asked kind of about those earlier.\nThere's six color cameras just like webcams that we have today.\nTaking video streams and feeding them into our AI model and turning that into a 3D video of you and I.\nIt's effectively a light field.\nSo, it's kind of an interactive 3D video that you can see from any perspective.\nThat's transmitted over to the second thing and that's a light field display and it's happening bi-directionally.\nI see you and you see me both in our light field displays.\nThese are effectively flat televisions or flat displays but they have the sense of dimensionality, depth, size is correct.\nYou can see shadows and lighting are correct and everything's correct from your vantage point.\nSo if you move around ever so slightly and I hold still, you see a different perspective here.\nYou see kind of things that were occluded become revealed.\nYou see shadows that you know move in the way they should move.\nAll of that's computed and generated using our AI video model for you.\nIt's based on your eye position.\nWhere does the right scene need to be placed in this light field display for you just to feel present?\nIt's real time, no latency.\nI'm not seeing lat.\nYou weren't freezing up at all.\nNo, no, I hope not.\nI think it's it's you and I together real time.\nThat's what you need for real communication and at a at a quality level realistic.\nIs it possible to do three people?\nLike is that going to move that way also?\nYeah.\nLet me let me kind of show you.\nSo if if she enters the room with us, you can see her, you can see me.\nAnd if we had more people, you eventually lose the sense of presence.\nYou kind of shrink people down.\nYou lose a sense of scale.\nSo think of it as the window fits a certain number of people.\nIf you want to fit a big group of people, you want, you know, the boardroom or the big room, you need like a much wider window.\nUm if you want to see, you know, just grandma and the kids, you can do smaller windows.\nSo everybody has a seat at the table or everybody has a sense of where they belong and there's kind of the sense of presence that's obeyed.\nIf you have too many people, you kind of go back to like 2D metaphors that we're used to.\nPeople in tiles placed anywhere for the image I'm seeing.\nDid you have to get scanned?\nI I mean I see you without being scanned.\nSo it's just so much easier if you don't have to wear anything.\nYou don't have to pre-scan.\nYou just do it the way it's supposed to happen without anybody having to learn anything or put anything on.\nI thought you had to solve the the scanning problem, but here you don't.\nIt's just cameras.\nIt's just vision.\nIt it's video.\nYeah.\nWe're not trying to kind of make an approximation of you because everything you do every day matters.\nYou know, I cut myself shaving.\nI put on a pin.\nUm all the little kind of, you know, aspects of you, those just happen.\nUm we don't have the time to scan or kind of capture those or dress avatars.\nWe we kind of appear as we appear.\nAnd so all that's transmitted truthfully as it's happening.\nStill, how you doing?\nGood to meet you.\nNice to meet you.\nSo, um as Max mentioned, got the eye glasses here.\nWe start with um a foundation of great glasses, something stylish, lightweight, wearable.\nAnd we say, how can we build great technology and experiences on top of that?\nUm, one of the core tenants of the Android XR platform, this idea of a multimodal conversational device, see what you see, hear what you hear.\nSo, we've got a camera, you've got speakers, multiple microphones for speaker isolation.\nUm, I'll give you a chance to try these yourself.\nYeah.\nSorry, woke it up there.\nWhoa.\nYeah.\nSo, the first thing you see, it's a super uh simple, straightforward home screen.\nSo, you probably see the time, the weather, calendar, appointments there.\nThis is designed to be sort of your one-stop shop for quick glanceable information throughout the day.\nWe want to be something that's um easy to, you know, get what you need and then go back to what you're doing.\nSo, you can imagine, you know, turning on the display, getting that quick glance, and then um continuing on your way.\nYou can be fully conversational at this point.\nYou can um ask questions, for example, about the paintings.\nYou can interrupt.\nYou can ask follow-up questions.\nAnd as I mentioned before, if you want to at any time pause, you just tap there on the right.\nGemini, how much does this painting cost?\nThe painting is called the bridge of belief leap 1875 by Arman Gome.\nIt appears to be a print and it would be impossible to know its cost without finding the seller.\nOkay, so this is fake.\nI understand.\nWhy do humans pay so much money for paintings?\nPeople pay a lot for paintings because of their artistic merit, the artist, the decent rarity, and for the appreciation.\nSo, uh, a few more things that we want to show you just for, uh, sake of time.\nDid you go ahead and long press on the side again to to sleep Gemini there?\nUm, there you go.\nUm, did you catch Google IO last week by any chance?\nSo, you might have seen on stage the uh, Google Maps experience very briefly.\nWant to give you a chance to get a sense of what that feels like today.\nYou can imagine you're walking down the street.\nIf you look up like you're walking straight ahead, you get quick turn-by-turn directions.\nSo, you have a sense of what the next turn is like, sticking your phone in your pocket.\nOh, that's so intuitive.\nSometimes you need that quick sense of which way is the right way.\nSometimes.\nYeah.\nSo you, let's say you're coming out subway, getting out of a cab, you can just glance down at your feet.\nWe have it set up to translate from Russian to English.\nI think I get to wear the glasses.\nYou speak to me if you don't mind.\nI can speak Russian.\nI'm doing well.\nHow are you doing?\nTempted to swear.\nTempted to say inappropriate things.\nUh I see it transcribed in real time and so obviously you know based on the uh different languages and the sequence of subjects and verbs there's a slight delay sometimes but it's really just like subtitles for the real world.\nThank you for this.\nAll right, back to me.\nHopefully watching videos of me having my mind blown like the apes in 2001 Space Odyssey playing with a monolith was uh somewhat interesting.\nUh like I said, I was very impressed.\nAnd now I thought if it's okay, I could make a few additional comments about the episode and just in general.\nIn this conversation with Sundar Pichai, I discussed the concept of the Neolithic package which is the set of innovations that came along with the first agricultural revolution about 12,000 years ago which included the formation of social hierarchies, the early primitive forms of government, labor specialization, domestication of plants and animals, early forms of trade, large scale cooperations of humans like that required to build yes the pyramids and temples like Gobeclete.\nI think this may be the right way to actually talk about the inventions that changed human history, not just as a single invention, but as a kind of network of innovations and transformations that came along with it.\nAnd the productivity multiplier framework that I mentioned in the episode I think is a nice way to try to concretize the impact of each of these inventions under consideration.\nAnd uh we have to remember that each node in the network of the sort of fast follow-on inventions is in itself a productivity multiplier.\nSome are additive, some are multiplicative.\nSo in some sense the size of the network in the package is the thing that matters when you're trying to rank the impact of uh inventions on human history.\nThe easy picks for the period of biggest transformation at least in sort of uh modern day discourse is the industrial revolution or even uh in the 20th century the computer or the internet.\nI think it's because it's easiest to intuit it for modern-day humans the impact the exponential impact uh of those technologies.\nBut recently and I suppose this changes week to week but uh I have been doing a lot of reading on ancient human history.\nSo recently my pick for the number one invention would have to be the first agricultural revolution.\nThe Neolithic package that led to the formation of human civilizations.\nThat's what enabled the scaling of the collective intelligence machine of humanity and for us to become the early bootloader for the next 10,000 years of technological progress which yes includes AI and the tech that builds on top of AI.\nAnd of course it could be argued that the word invention doesn't properly apply to the agricultural revolution.\nI think actually uh Yuval Noah Harari argues that it wasn't the humans who were the inventors but uh a handful of plant species namely wheat, rice, and potatoes.\nThis is strictly a fair perspective, but I'm having fun like I said with this discussion here.\nI just think of the entire earth as a system that continuously transforms and I'm using the term invention in that context asking the question of when was the biggest leap on the log scale plot of uh human progress.\nWill AI, AGI, ASI eventually take the number one spot in this ranking?\nI think it has a very good chance to do so due again to the size of the network of inventions that will come along with it.\nI think we discuss in this podcast uh the kind of things that would be included in the so-called AI package but I think there's uh a lot more possibilities including uh discussed in previous podcasts in many previous podcasts including with Darede uh talking on the biological innovation side the science progress side in this podcast I think we talk about something that I'm particularly excited about in the near term which is unlocking the cognitive capacity of the entire landscape of brains that is the human species.\nMaking it more accessible through education and through machine translation making information knowledge and the rapid learning and innovation process accessible to more humans to the entire 8 billion if you will.\nSo I do think language or machine translation applied to all the different methods that we use on the internet to discover knowledge is uh a big unlock.\nBut there are a lot of other stuff in the so-called AI package like discuss with Daario curing all major human diseases.\nHe really focuses on that in the machines of love and grace essay.\nI think there will be huge leaps in productivity for human programmers and semi-autonomous human programmers.\nSo, humans in the loop, but most of the programming is done by AI agents and then moving that towards a superhuman AI researcher that's doing the research that develops and programs the AI system in itself.\nI think there would be huge transformative effects from autonomous vehicles.\nThese are the things that we maybe don't immediately understand or we understand from an economics perspective.\nBut there will be a point when AI systems are able to interpret, understand, interact with the human world to a sufficient degree to where many of the manually controlled human and loop systems we rely on become fully autonomous.\nAnd I think mobility is such a big part of human civilization that there will be effects on that that they're not just economic but are social, cultural and so on.\nAnd there's a lot more things I could talk about for a long time.\nSo obviously the integration utilization of AI in the creation of art, film, music I think the digitalization and um automating basic functions of government and then integrating AI into that process thereby decreasing corruption and cost and increasing transparency and uh efficiency.\nI think we as humans, individual humans will continue to transition further and further into cyborgs.\nSort of there's already a AI in the loop of the human condition and that will become increasingly so as AI becomes uh more powerful.\nThe thing I'm obviously really excited about is major breakthroughs in science and not just on the medical front but uh on physics fundamental physics which would then lead to energy breakthroughs increasing the chance that we become we actually become a Kardashev type one civilization and then enabling us in so doing to do interstellar exploration of space and colonization of space.\nI think they're also in the near term much like with the uh industrial revolution that led to rapid specialization of skills of expertise there might be a great sort of despization.\nSo as the AI systems become superhuman experts at particular fields, there might be greater and greater value to being the integrator of AIS for humans to be sort of generalists.\nAnd so the great value of the human mind will come\n\n\nFrom the generalists, not the specialists.\nThat's a real possibility that that changes the way we are about the world, that we want to know a little bit of a lot of things and move about the world in that way.\nThat could have, when passing a certain threshold, a complete shift in who we are as a collective intelligence, as a human species.\nAlso, as an aside, when uh thinking about the invention that was the greatest in human history, again, for a bit of fun, we have to remember that all of them build on top of each other.\nAnd so we need to look at the delta, the step change on the, I would say, impossibly to perfectly measure plot of exponential human progress.\nReally, we can go back to the entire history of life on Earth.\nAnd a previous podcast guest, Nick Lane, does a great job of this in his book Life Ascending, listing these 10 major inventions throughout the evolution of life on Earth, like DNA, photosynthesis, complex cells, sex, movement, sight, all those kinds of things.\nI forget the full list that's on there, but I think that's so far from the human experience that my intuition about, let's say, productivity multipliers of those particular invention completely uh breaks down and uh a different framework is needed to understand the impact of these inventions of evolution.\nThe origin of life on Earth or even the Big Bang itself, of course, is the OG invention that set the stage for all the rest of it.\nAnd there are probably many more turtles under that which are yet to be discovered.\nSo anyway, we live in interesting times, fellow humans.\nI do believe the set of positive trajectories for humanity outnumber the set of negative trajectories, but not by much.\nSo uh let's not mess this up.\nAnd now let me leave you with some words from French philosopher Jean Debrier.\nOut of difficulties grow miracles.\nThank you for listening and hope to see you next time.\n",
  "metadata": {
    "summary": "In this episode, Lex Fridman interviews Sundar Pichai, CEO of Google and Alphabet. They discuss Pichai's journey, leadership styles, and the impact of AI on human history. Key topics include Google's advancements in AI, the future of search, and the potential of technologies like Google Beam and XR glasses. They also touch on the challenges and opportunities in the evolving tech landscape, including the role of AI in creativity, programming, and the future of humanity.",
    "topClaims": [
      {
        "text": "AI will be bigger than fire or electricity.",
        "rating": 9.5,
        "chunkId": "ck-9V6tWC4CdFQ-11"
      },
      {
        "text": "The impact of the technology will far surpass everything seen before.",
        "rating": 8.8,
        "chunkId": "ck-9V6tWC4CdFQ-13"
      },
      {
        "text": "Google was perceived as losing the AI race.",
        "rating": 8.5,
        "chunkId": "ck-9V6tWC4CdFQ-40"
      },
      {
        "text": "Autonomous vehicles, self-driving cars is like the big thing that changes everything.",
        "rating": 8,
        "chunkId": "ck-9V6tWC4CdFQ-64"
      }
    ],
    "topQuotes": [
      {
        "text": "AI is the most profound technology humanity will ever work on. It'll be more profound than fire or electricity.",
        "chunkId": "ck-9V6tWC4CdFQ-11",
        "chunkNum": 11,
        "relevance": 9.5,
        "interesting": 9.2
      },
      {
        "text": "I think the impact it'll end up having will far surpass everything we've seen before.",
        "chunkId": "ck-9V6tWC4CdFQ-13",
        "chunkNum": 13,
        "relevance": 9,
        "interesting": 8.8
      },
      {
        "text": "Google's lost, it's done, it's over, to today where Google is winning again.",
        "chunkId": "ck-9V6tWC4CdFQ-40",
        "chunkNum": 40,
        "relevance": 8.7,
        "interesting": 8.5
      },
      {
        "text": "Imagine over a period of uh, a decade or two, just a complete transition from manually driven to autonomous in ways we might, we might not predict.",
        "chunkId": "ck-9V6tWC4CdFQ-64",
        "chunkNum": 64,
        "relevance": 8.2,
        "interesting": 8
      }
    ],
    "topTopics": [
      {
        "name": "ai impact",
        "count": 12,
        "description": "The impact and future of artificial intelligence."
      },
      {
        "name": "google future",
        "count": 8,
        "description": "Google's advancements and future direction."
      },
      {
        "name": "google beam",
        "count": 5,
        "description": "The development and potential of Google Beam."
      },
      {
        "name": "programming future",
        "count": 4,
        "description": "The future of programming and coding."
      },
      {
        "name": "autonomous vehicles",
        "count": 3,
        "description": "The potential of autonomous vehicles."
      }
    ],
    "videoInfo": {
      "id": "9V6tWC4CdFQ",
      "etag": "RCJAMx7GsPQRzh-5jHs43Q92x6A",
      "kind": "youtube#video",
      "snippet": {
        "tags": [
          "Sundar Pichai",
          "alex friedman",
          "lex ai",
          "lex debate",
          "lex freedman",
          "lex fridman",
          "lex friedman",
          "lex interview",
          "lex lecture",
          "lex mit",
          "lex podcast",
          "lex transcript"
        ],
        "title": "Sundar Pichai: CEO of Google and Alphabet | Lex Fridman Podcast #471",
        "channelId": "UCSHZKyawb77ixDdsGog4iWA",
        "localized": {
          "title": "Sundar Pichai: CEO of Google and Alphabet | Lex Fridman Podcast #471",
          "description": "Sundar Pichai is CEO of Google and Alphabet.\nThank you for listening  Check out our sponsors: https://lexfridman.com/sponsors/ep471-sb\nSee below for timestamps, transcript, and to give feedback, submit questions, contact Lex, etc.\n\n*Transcript:*\nhttps://lexfridman.com/sundar-pichai-transcript\n\n*CONTACT LEX:*\n*Feedback* - give feedback to Lex: https://lexfridman.com/survey\n*AMA* - submit questions, videos or call-in: https://lexfridman.com/ama\n*Hiring* - join our team: https://lexfridman.com/hiring\n*Other* - other ways to get in touch: https://lexfridman.com/contact\n\n*EPISODE LINKS:*\nSundar's X: https://x.com/sundarpichai\nSundar's Instagram: https://instagram.com/sundarpichai\nSundar's Blog: https://blog.google/authors/sundar-pichai/\nGoogle Gemini: https://gemini.google.com/\nGoogle's YouTube Channel: https://www.youtube.com/@Google\n\n*SPONSORS:*\nTo support this podcast, check out our sponsors & get discounts:\n*Tax Network USA:* Full-service tax firm.\nGo to https://lexfridman.com/s/tax_network_usa-ep471-sb\n*BetterHelp:* Online therapy and counseling.\nGo to https://lexfridman.com/s/betterhelp-ep471-sb\n*LMNT:* Zero-sugar electrolyte drink mix.\nGo to https://lexfridman.com/s/lmnt-ep471-sb\n*Shopify:* Sell stuff online.\nGo to https://lexfridman.com/s/shopify-ep471-sb\n*AG1:* All-in-one daily nutrition drink.\nGo to https://lexfridman.com/s/ag1-ep471-sb\n\n*OUTLINE:*\n0:00 - Episode highlight\n2:08 - Introduction\n2:18 - Growing up in India\n8:27 - Advice for young people\n10:09 - Styles of leadership\n14:29 - Impact of AI in human history\n26:39 - Veo 3 and future of video\n34:24 - Scaling laws\n38:09 - AGI and ASI\n44:33 - P(doom)\n51:24 - Toughest leadership decisions\n1:02:32 - AI mode vs Google Search\n1:15:22 - Google Chrome\n1:30:52 - Programming\n1:37:37 - Android\n1:42:49 - Questions for AGI\n1:48:05 - Future of humanity\n1:51:26 - Demo: Google Beam\n1:59:09 - Demo: Google XR Glasses\n2:01:54 - Biggest invention in human history\n\n*PODCAST LINKS:*\n- Podcast Website: https://lexfridman.com/podcast\n- Apple Podcasts: https://apple.co/2lwqZIr\n- Spotify: https://spoti.fi/2nEwCF8\n- RSS: https://lexfridman.com/feed/podcast/\n- Podcast Playlist: https://www.youtube.com/playlist?list=PLrAXtmErZgOdP_8GztsuKi9nrraNbKKp4\n- Clips Channel: https://www.youtube.com/lexclips\n\n*SOCIAL LINKS:*\n- X: https://x.com/lexfridman\n- Instagram: https://instagram.com/lexfridman\n- TikTok: https://tiktok.com/@lexfridman\n- LinkedIn: https://linkedin.com/in/lexfridman\n- Facebook: https://facebook.com/lexfridman\n- Patreon: https://patreon.com/lexfridman\n- Telegram: https://t.me/lexfridman\n- Reddit: https://reddit.com/r/lexfridman"
        },
        "categoryId": "28",
        "thumbnails": {
          "high": {
            "url": "https://i.ytimg.com/vi/9V6tWC4CdFQ/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/9V6tWC4CdFQ/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/9V6tWC4CdFQ/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "default": {
            "url": "https://i.ytimg.com/vi/9V6tWC4CdFQ/default.jpg",
            "width": 120,
            "height": 90
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/9V6tWC4CdFQ/sddefault.jpg",
            "width": 640,
            "height": 480
          }
        },
        "description": "Sundar Pichai is CEO of Google and Alphabet.\nThank you for listening  Check out our sponsors: https://lexfridman.com/sponsors/ep471-sb\nSee below for timestamps, transcript, and to give feedback, submit questions, contact Lex, etc.\n\n*Transcript:*\nhttps://lexfridman.com/sundar-pichai-transcript\n\n*CONTACT LEX:*\n*Feedback* - give feedback to Lex: https://lexfridman.com/survey\n*AMA* - submit questions, videos or call-in: https://lexfridman.com/ama\n*Hiring* - join our team: https://lexfridman.com/hiring\n*Other* - other ways to get in touch: https://lexfridman.com/contact\n\n*EPISODE LINKS:*\nSundar's X: https://x.com/sundarpichai\nSundar's Instagram: https://instagram.com/sundarpichai\nSundar's Blog: https://blog.google/authors/sundar-pichai/\nGoogle Gemini: https://gemini.google.com/\nGoogle's YouTube Channel: https://www.youtube.com/@Google\n\n*SPONSORS:*\nTo support this podcast, check out our sponsors & get discounts:\n*Tax Network USA:* Full-service tax firm.\nGo to https://lexfridman.com/s/tax_network_usa-ep471-sb\n*BetterHelp:* Online therapy and counseling.\nGo to https://lexfridman.com/s/betterhelp-ep471-sb\n*LMNT:* Zero-sugar electrolyte drink mix.\nGo to https://lexfridman.com/s/lmnt-ep471-sb\n*Shopify:* Sell stuff online.\nGo to https://lexfridman.com/s/shopify-ep471-sb\n*AG1:* All-in-one daily nutrition drink.\nGo to https://lexfridman.com/s/ag1-ep471-sb\n\n*OUTLINE:*\n0:00 - Episode highlight\n2:08 - Introduction\n2:18 - Growing up in India\n8:27 - Advice for young people\n10:09 - Styles of leadership\n14:29 - Impact of AI in human history\n26:39 - Veo 3 and future of video\n34:24 - Scaling laws\n38:09 - AGI and ASI\n44:33 - P(doom)\n51:24 - Toughest leadership decisions\n1:02:32 - AI mode vs Google Search\n1:15:22 - Google Chrome\n1:30:52 - Programming\n1:37:37 - Android\n1:42:49 - Questions for AGI\n1:48:05 - Future of humanity\n1:51:26 - Demo: Google Beam\n1:59:09 - Demo: Google XR Glasses\n2:01:54 - Biggest invention in human history\n\n*PODCAST LINKS:*\n- Podcast Website: https://lexfridman.com/podcast\n- Apple Podcasts: https://apple.co/2lwqZIr\n- Spotify: https://spoti.fi/2nEwCF8\n- RSS: https://lexfridman.com/feed/podcast/\n- Podcast Playlist: https://www.youtube.com/playlist?list=PLrAXtmErZgOdP_8GztsuKi9nrraNbKKp4\n- Clips Channel: https://www.youtube.com/lexclips\n\n*SOCIAL LINKS:*\n- X: https://x.com/lexfridman\n- Instagram: https://instagram.com/lexfridman\n- TikTok: https://tiktok.com/@lexfridman\n- LinkedIn: https://linkedin.com/in/lexfridman\n- Facebook: https://facebook.com/lexfridman\n- Patreon: https://patreon.com/lexfridman\n- Telegram: https://t.me/lexfridman\n- Reddit: https://reddit.com/r/lexfridman",
        "publishedAt": "2025-06-05T17:46:22Z",
        "channelTitle": "Lex Fridman",
        "defaultLanguage": "en",
        "defaultAudioLanguage": "en-US",
        "liveBroadcastContent": "none"
      },
      "statistics": {
        "likeCount": "8349",
        "viewCount": "352518",
        "commentCount": "757",
        "favoriteCount": "0"
      },
      "contentDetails": {
        "caption": "true",
        "duration": "PT2H12M5S",
        "dimension": "2d",
        "definition": "hd",
        "projection": "rectangular",
        "contentRating": {},
        "licensedContent": true
      }
    },
    "checkCount": 26,
    "nodeCounts": [
      {
        "node": "AI",
        "count": 18
      },
      {
        "node": "Google",
        "count": 13
      },
      {
        "node": "Gemini",
        "count": 11
      },
      {
        "node": "technology",
        "count": 7
      },
      {
        "node": "AI mode",
        "count": 6
      },
      {
        "node": "humanity",
        "count": 5
      },
      {
        "node": "Sundar Pichai",
        "count": 4
      },
      {
        "node": "internet",
        "count": 4
      },
      {
        "node": "electricity",
        "count": 4
      },
      {
        "node": "AGI",
        "count": 4
      },
      {
        "node": "DeepMind",
        "count": 4
      },
      {
        "node": "industrial revolution",
        "count": 3
      },
      {
        "node": "human civilizations",
        "count": 3
      },
      {
        "node": "Neolithic package",
        "count": 3
      },
      {
        "node": "AI package",
        "count": 3
      },
      {
        "node": "human civilization",
        "count": 3
      },
      {
        "node": "Beam",
        "count": 3
      },
      {
        "node": "products",
        "count": 3
      },
      {
        "node": "Google Search",
        "count": 3
      },
      {
        "node": "cognitive capacity",
        "count": 3
      },
      {
        "node": "programming",
        "count": 3
      },
      {
        "node": "rotary telephone",
        "count": 2
      },
      {
        "node": "blood test records",
        "count": 2
      },
      {
        "node": "drought",
        "count": 2
      },
      {
        "node": "water trucks",
        "count": 2
      },
      {
        "node": "power of technology",
        "count": 2
      },
      {
        "node": "progress",
        "count": 2
      },
      {
        "node": "Alphabet",
        "count": 2
      },
      {
        "node": "India",
        "count": 2
      },
      {
        "node": "agricultural revolution",
        "count": 2
      },
      {
        "node": "productivity multiplier",
        "count": 2
      },
      {
        "node": "first principles",
        "count": 2
      },
      {
        "node": "impact",
        "count": 2
      },
      {
        "node": "social hierarchies",
        "count": 2
      },
      {
        "node": "trade",
        "count": 2
      },
      {
        "node": "podcasting",
        "count": 2
      },
      {
        "node": "YouTube",
        "count": 2
      },
      {
        "node": "CGI",
        "count": 2
      },
      {
        "node": "artistic free expression",
        "count": 2
      },
      {
        "node": "APIs",
        "count": 2
      },
      {
        "node": "value",
        "count": 2
      },
      {
        "node": "World War II",
        "count": 2
      },
      {
        "node": "intelligence",
        "count": 2
      },
      {
        "node": "Sundar",
        "count": 2
      },
      {
        "node": "tokens",
        "count": 2
      },
      {
        "node": "tokens per month",
        "count": 2
      },
      {
        "node": "scaling laws",
        "count": 2
      },
      {
        "node": "pre-training",
        "count": 2
      },
      {
        "node": "post-training",
        "count": 2
      },
      {
        "node": "human curiosity",
        "count": 2
      },
      {
        "node": "micro kitchen conversation",
        "count": 2
      },
      {
        "node": "Demis",
        "count": 2
      },
      {
        "node": "Dennis",
        "count": 2
      },
      {
        "node": "Jeff",
        "count": 2
      },
      {
        "node": "Sergey",
        "count": 2
      },
      {
        "node": "compute",
        "count": 2
      },
      {
        "node": "P-doom",
        "count": 2
      },
      {
        "node": "ASI",
        "count": 2
      },
      {
        "node": "humans",
        "count": 2
      },
      {
        "node": "military conflict",
        "count": 2
      },
      {
        "node": "inspiration",
        "count": 2
      },
      {
        "node": "Opportunity space",
        "count": 2
      },
      {
        "node": "merger",
        "count": 2
      },
      {
        "node": "Nobel Prize",
        "count": 2
      },
      {
        "node": "AI overviews",
        "count": 2
      },
      {
        "node": "ads",
        "count": 2
      },
      {
        "node": "commercial information",
        "count": 2
      },
      {
        "node": "browser",
        "count": 2
      },
      {
        "node": "Gmail",
        "count": 2
      },
      {
        "node": "Chrome",
        "count": 2
      },
      {
        "node": "self-driving",
        "count": 2
      },
      {
        "node": "Whimo",
        "count": 2
      },
      {
        "node": "robotics",
        "count": 2
      },
      {
        "node": "future",
        "count": 2
      },
      {
        "node": "autonomous vehicles",
        "count": 2
      },
      {
        "node": "computer science",
        "count": 2
      },
      {
        "node": "Android",
        "count": 2
      },
      {
        "node": "conversation",
        "count": 2
      },
      {
        "node": "Google Beam",
        "count": 2
      },
      {
        "node": "first agricultural revolution",
        "count": 2
      },
      {
        "node": "water buckets",
        "count": 1
      },
      {
        "node": "5-year waiting list",
        "count": 1
      },
      {
        "node": "five-minute thing",
        "count": 1
      },
      {
        "node": "pdoom",
        "count": 1
      },
      {
        "node": "self-modulating",
        "count": 1
      },
      {
        "node": "running water",
        "count": 1
      },
      {
        "node": "water heater",
        "count": 1
      },
      {
        "node": "shower",
        "count": 1
      },
      {
        "node": "opportunity",
        "count": 1
      },
      {
        "node": "collective mind",
        "count": 1
      },
      {
        "node": "underlying risk",
        "count": 1
      },
      {
        "node": "Lex Fridman Podcast",
        "count": 1
      },
      {
        "node": "1984",
        "count": 1
      },
      {
        "node": "computers",
        "count": 1
      },
      {
        "node": "Chennai",
        "count": 1
      },
      {
        "node": "cricket",
        "count": 1
      },
      {
        "node": "precomputers",
        "count": 1
      },
      {
        "node": "solitude",
        "count": 1
      },
      {
        "node": "newspapers",
        "count": 1
      },
      {
        "node": "books",
        "count": 1
      },
      {
        "node": "grandfather",
        "count": 1
      },
      {
        "node": "access to knowledge",
        "count": 1
      },
      {
        "node": "telephone",
        "count": 1
      },
      {
        "node": "water delivery",
        "count": 1
      },
      {
        "node": "Technology",
        "count": 1
      },
      {
        "node": "Hot water",
        "count": 1
      },
      {
        "node": "Industrial Revolution",
        "count": 1
      },
      {
        "node": "VCR",
        "count": 1
      },
      {
        "node": "World Cup football game",
        "count": 1
      },
      {
        "node": "Access to technology",
        "count": 1
      },
      {
        "node": "Exponential growth",
        "count": 1
      },
      {
        "node": "Understanding progress",
        "count": 1
      },
      {
        "node": "Running water",
        "count": 1
      },
      {
        "node": "Video tapes",
        "count": 1
      },
      {
        "node": "power of mobile",
        "count": 1
      },
      {
        "node": "progress through the arc of time",
        "count": 1
      },
      {
        "node": "advice",
        "count": 1
      },
      {
        "node": "listening to your heart",
        "count": 1
      },
      {
        "node": "working with people better than you",
        "count": 1
      },
      {
        "node": "uncomfortable situations",
        "count": 1
      },
      {
        "node": "open-minded",
        "count": 1
      },
      {
        "node": "loving what you do",
        "count": 1
      },
      {
        "node": "create companies",
        "count": 1
      },
      {
        "node": "build something that has a lot of impact",
        "count": 1
      },
      {
        "node": "Outsider perspective",
        "count": 1
      },
      {
        "node": "Leadership journey",
        "count": 1
      },
      {
        "node": "Balance, humility, kindness",
        "count": 1
      },
      {
        "node": "Mission-oriented people",
        "count": 1
      },
      {
        "node": "Losing your temper",
        "count": 1
      },
      {
        "node": "Man management",
        "count": 1
      },
      {
        "node": "Unspoken words",
        "count": 1
      },
      {
        "node": "Silence in communication",
        "count": 1
      },
      {
        "node": "Less is more",
        "count": 1
      },
      {
        "node": "Inner drive to excellence",
        "count": 1
      },
      {
        "node": "Soccer Player",
        "count": 1
      },
      {
        "node": "Cristiano Ronaldo",
        "count": 1
      },
      {
        "node": "El Classicos",
        "count": 1
      },
      {
        "node": "CR7",
        "count": 1
      },
      {
        "node": "Greatness",
        "count": 1
      },
      {
        "node": "Lionel Messi",
        "count": 1
      },
      {
        "node": "San Jose",
        "count": 1
      },
      {
        "node": "Quake",
        "count": 1
      },
      {
        "node": "technological innovations",
        "count": 1
      },
      {
        "node": "technology humanity",
        "count": 1
      },
      {
        "node": "recency bias",
        "count": 1
      },
      {
        "node": "greatest player",
        "count": 1
      },
      {
        "node": "fire",
        "count": 1
      },
      {
        "node": "surgery",
        "count": 1
      },
      {
        "node": "anesthesia",
        "count": 1
      },
      {
        "node": "invention",
        "count": 1
      },
      {
        "node": "recursively self-improving",
        "count": 1
      },
      {
        "node": "accelerate creation",
        "count": 1
      },
      {
        "node": "superhuman performance",
        "count": 1
      },
      {
        "node": "AI research",
        "count": 1
      },
      {
        "node": "research",
        "count": 1
      },
      {
        "node": "move 37",
        "count": 1
      },
      {
        "node": "self-directed research",
        "count": 1
      },
      {
        "node": "humans in the loop",
        "count": 1
      },
      {
        "node": "AlphaGo",
        "count": 1
      },
      {
        "node": "V3 models",
        "count": 1
      },
      {
        "node": "nomads",
        "count": 1
      },
      {
        "node": "pottery",
        "count": 1
      },
      {
        "node": "political hierarchy",
        "count": 1
      },
      {
        "node": "early government",
        "count": 1
      },
      {
        "node": "coding progress",
        "count": 1
      },
      {
        "node": "VIP coding",
        "count": 1
      },
      {
        "node": "V3",
        "count": 1
      },
      {
        "node": "exponential increase of access to creativity",
        "count": 1
      },
      {
        "node": "software creation",
        "count": 1
      },
      {
        "node": "games",
        "count": 1
      },
      {
        "node": "content",
        "count": 1
      },
      {
        "node": "cognitive capabilities",
        "count": 1
      },
      {
        "node": "media landscape",
        "count": 1
      },
      {
        "node": "AI-generated podcasts",
        "count": 1
      },
      {
        "node": "creativity",
        "count": 1
      },
      {
        "node": "content creation",
        "count": 1
      },
      {
        "node": "media",
        "count": 1
      },
      {
        "node": "AI generated content",
        "count": 1
      },
      {
        "node": "Magnus Carlson",
        "count": 1
      },
      {
        "node": "Stockfish 10",
        "count": 1
      },
      {
        "node": "Alph Go",
        "count": 1
      },
      {
        "node": "Messi dribble the ball",
        "count": 1
      },
      {
        "node": "Lex",
        "count": 1
      },
      {
        "node": "filmmakers",
        "count": 1
      },
      {
        "node": "Expansionary aspect",
        "count": 1
      },
      {
        "node": "Future possibilities",
        "count": 1
      },
      {
        "node": "V4",
        "count": 1
      },
      {
        "node": "James Cameron",
        "count": 1
      },
      {
        "node": "Darren Aronowski",
        "count": 1
      },
      {
        "node": "Door Brothers",
        "count": 1
      },
      {
        "node": "Overton window",
        "count": 1
      },
      {
        "node": "Hunter S. Thompson",
        "count": 1
      },
      {
        "node": "Darren",
        "count": 1
      },
      {
        "node": "creative expression",
        "count": 1
      },
      {
        "node": "artists",
        "count": 1
      },
      {
        "node": "frontiers of thought",
        "count": 1
      },
      {
        "node": "infrastructure",
        "count": 1
      },
      {
        "node": "society",
        "count": 1
      },
      {
        "node": "Gemini 2.5 Pro",
        "count": 1
      },
      {
        "node": "Jenghask Khan",
        "count": 1
      },
      {
        "node": "Aztecs",
        "count": 1
      },
      {
        "node": "World War I",
        "count": 1
      },
      {
        "node": "engineering challenge",
        "count": 1
      },
      {
        "node": "human history",
        "count": 1
      },
      {
        "node": "challenge",
        "count": 1
      },
      {
        "node": "models",
        "count": 1
      },
      {
        "node": "edge cases",
        "count": 1
      },
      {
        "node": "nuanced issues",
        "count": 1
      },
      {
        "node": "2.5",
        "count": 1
      },
      {
        "node": "raw model",
        "count": 1
      },
      {
        "node": "custom prompts",
        "count": 1
      },
      {
        "node": "experiment",
        "count": 1
      },
      {
        "node": "scientific standpoint",
        "count": 1
      },
      {
        "node": "models reasoning",
        "count": 1
      },
      {
        "node": "ground up",
        "count": 1
      },
      {
        "node": "nuanced",
        "count": 1
      },
      {
        "node": "hard coding",
        "count": 1
      },
      {
        "node": "direction",
        "count": 1
      },
      {
        "node": "surprise",
        "count": 1
      },
      {
        "node": "model",
        "count": 1
      },
      {
        "node": "sentence",
        "count": 1
      },
      {
        "node": "life-changing",
        "count": 1
      },
      {
        "node": "search",
        "count": 1
      },
      {
        "node": "universe",
        "count": 1
      },
      {
        "node": "five-word phrase",
        "count": 1
      },
      {
        "node": "AI progress",
        "count": 1
      },
      {
        "node": "Cori",
        "count": 1
      },
      {
        "node": "Gnome",
        "count": 1
      },
      {
        "node": "headroom",
        "count": 1
      },
      {
        "node": "researchers",
        "count": 1
      },
      {
        "node": "trajectory",
        "count": 1
      },
      {
        "node": "data",
        "count": 1
      },
      {
        "node": "idea",
        "count": 1
      },
      {
        "node": "bottlenecks",
        "count": 1
      },
      {
        "node": "Compute limited",
        "count": 1
      },
      {
        "node": "Flash, Nano, Flash, and Pro models",
        "count": 1
      },
      {
        "node": "Ultra model",
        "count": 1
      },
      {
        "node": "Gemini Flash",
        "count": 1
      },
      {
        "node": "latency",
        "count": 1
      },
      {
        "node": "benchmarks",
        "count": 1
      },
      {
        "node": "real-world usefulness",
        "count": 1
      },
      {
        "node": "effectiveness",
        "count": 1
      },
      {
        "node": "models that can code",
        "count": 1
      },
      {
        "node": "best interfaces",
        "count": 1
      },
      {
        "node": "agentic system",
        "count": 1
      },
      {
        "node": "multimodal aspect",
        "count": 1
      },
      {
        "node": "evolution ahead",
        "count": 1
      },
      {
        "node": "dramatic evolutions",
        "count": 1
      },
      {
        "node": "user interface",
        "count": 1
      },
      {
        "node": "kitchen question",
        "count": 1
      },
      {
        "node": "philosophically minded folks",
        "count": 1
      },
      {
        "node": "AI community",
        "count": 1
      },
      {
        "node": "long-term threat of ASI",
        "count": 1
      },
      {
        "node": "risks",
        "count": 1
      },
      {
        "node": "organization",
        "count": 1
      },
      {
        "node": "incentives",
        "count": 1
      },
      {
        "node": "self-modulating aspect",
        "count": 1
      },
      {
        "node": "P-doom scenarios",
        "count": 1
      },
      {
        "node": "threat",
        "count": 1
      },
      {
        "node": "probability of doom",
        "count": 1
      },
      {
        "node": "AI pair",
        "count": 1
      },
      {
        "node": "Toughest problems",
        "count": 1
      },
      {
        "node": "Notebook LM",
        "count": 1
      },
      {
        "node": "US president",
        "count": 1
      },
      {
        "node": "Chinese president",
        "count": 1
      },
      {
        "node": "live me translation",
        "count": 1
      },
      {
        "node": "demo",
        "count": 1
      },
      {
        "node": "six cameras",
        "count": 1
      },
      {
        "node": "Chamberlain",
        "count": 1
      },
      {
        "node": "Stalin",
        "count": 1
      },
      {
        "node": "meeting in person",
        "count": 1
      },
      {
        "node": "human connection",
        "count": 1
      },
      {
        "node": "remote",
        "count": 1
      },
      {
        "node": "world leaders",
        "count": 1
      },
      {
        "node": "geopolitics",
        "count": 1
      },
      {
        "node": "collaboration",
        "count": 1
      },
      {
        "node": "beautiful moments",
        "count": 1
      },
      {
        "node": "remote work",
        "count": 1
      },
      {
        "node": "meetings",
        "count": 1
      },
      {
        "node": "communication",
        "count": 1
      },
      {
        "node": "engineering impact",
        "count": 1
      },
      {
        "node": "accessibility",
        "count": 1
      },
      {
        "node": "family interaction",
        "count": 1
      },
      {
        "node": "soldier communication",
        "count": 1
      },
      {
        "node": "AI race",
        "count": 1
      },
      {
        "node": "magic touch",
        "count": 1
      },
      {
        "node": "technological landscape",
        "count": 1
      },
      {
        "node": "Gemini Pro",
        "count": 1
      },
      {
        "node": "analysts",
        "count": 1
      },
      {
        "node": "AI-first",
        "count": 1
      },
      {
        "node": "Google DeepMind",
        "count": 1
      },
      {
        "node": "TPUs",
        "count": 1
      },
      {
        "node": "Signal from noise",
        "count": 1
      },
      {
        "node": "Next decade",
        "count": 1
      },
      {
        "node": "Ramp up TPUs",
        "count": 1
      },
      {
        "node": "World-class researchers",
        "count": 1
      },
      {
        "node": "merger of DeepMind and Brain",
        "count": 1
      },
      {
        "node": "egos",
        "count": 1
      },
      {
        "node": "merge teams",
        "count": 1
      },
      {
        "node": "painful points",
        "count": 1
      },
      {
        "node": "turbulent waters",
        "count": 1
      },
      {
        "node": "decision-making process",
        "count": 1
      },
      {
        "node": "bold decisions",
        "count": 1
      },
      {
        "node": "Brain",
        "count": 1
      },
      {
        "node": "Stanford",
        "count": 1
      },
      {
        "node": "MIT",
        "count": 1
      },
      {
        "node": "Kai",
        "count": 1
      },
      {
        "node": "research breakthroughs",
        "count": 1
      },
      {
        "node": "bottoms up",
        "count": 1
      },
      {
        "node": "scientific individual contributor roots",
        "count": 1
      },
      {
        "node": "noise",
        "count": 1
      },
      {
        "node": "frustration",
        "count": 1
      },
      {
        "node": "trenches",
        "count": 1
      },
      {
        "node": "argue",
        "count": 1
      },
      {
        "node": "driving hard",
        "count": 1
      },
      {
        "node": "journey",
        "count": 1
      },
      {
        "node": "positive moments",
        "count": 1
      },
      {
        "node": "Jeff Finton",
        "count": 1
      },
      {
        "node": "John Jumper",
        "count": 1
      },
      {
        "node": "consequential decisions",
        "count": 1
      },
      {
        "node": "disagree and commit",
        "count": 1
      },
      {
        "node": "CEO",
        "count": 1
      },
      {
        "node": "clarity",
        "count": 1
      },
      {
        "node": "hear everyone out",
        "count": 1
      },
      {
        "node": "conviction",
        "count": 1
      },
      {
        "node": "place the bet",
        "count": 1
      },
      {
        "node": "clear decision",
        "count": 1
      },
      {
        "node": "AI infrastructure team",
        "count": 1
      },
      {
        "node": "Gradient Canopy",
        "count": 1
      },
      {
        "node": "Google DeepMind teams",
        "count": 1
      },
      {
        "node": "loss curves",
        "count": 1
      },
      {
        "node": "team collaboration",
        "count": 1
      },
      {
        "node": "London",
        "count": 1
      },
      {
        "node": "front page of the internet",
        "count": 1
      },
      {
        "node": "legendary minimalist thing",
        "count": 1
      },
      {
        "node": "integrating AI",
        "count": 1
      },
      {
        "node": "battles in meetings",
        "count": 1
      },
      {
        "node": "Mobile",
        "count": 1
      },
      {
        "node": "Evolution",
        "count": 1
      },
      {
        "node": "Links",
        "count": 1
      },
      {
        "node": "Search",
        "count": 1
      },
      {
        "node": "Knowledge",
        "count": 1
      },
      {
        "node": "Core principles",
        "count": 1
      },
      {
        "node": "Elizabeth Liz Reed",
        "count": 1
      },
      {
        "node": "query fan out",
        "count": 1
      },
      {
        "node": "integrating a bunch of stuff on the web",
        "count": 1
      },
      {
        "node": "language",
        "count": 1
      },
      {
        "node": "non-English speakers",
        "count": 1
      },
      {
        "node": "English language websites",
        "count": 1
      },
      {
        "node": "multimodality",
        "count": 1
      },
      {
        "node": "user metrics",
        "count": 1
      },
      {
        "node": "blue links",
        "count": 1
      },
      {
        "node": "summarization",
        "count": 1
      },
      {
        "node": "tool use",
        "count": 1
      },
      {
        "node": "animated gifts",
        "count": 1
      },
      {
        "node": "AdSense",
        "count": 1
      },
      {
        "node": "organic experience",
        "count": 1
      },
      {
        "node": "classy ads",
        "count": 1
      },
      {
        "node": "podcaster",
        "count": 1
      },
      {
        "node": "shady websites",
        "count": 1
      },
      {
        "node": "subscription offerings",
        "count": 1
      },
      {
        "node": "AI overview",
        "count": 1
      },
      {
        "node": "human-created web",
        "count": 1
      },
      {
        "node": "core design principle",
        "count": 1
      },
      {
        "node": "blackbox machine",
        "count": 1
      },
      {
        "node": "higher quality referrals",
        "count": 1
      },
      {
        "node": "main search page",
        "count": 1
      },
      {
        "node": "bleeding edge experience",
        "count": 1
      },
      {
        "node": "Humans",
        "count": 1
      },
      {
        "node": "Journalists",
        "count": 1
      },
      {
        "node": "CNN",
        "count": 1
      },
      {
        "node": "Podcasts",
        "count": 1
      },
      {
        "node": "AI model",
        "count": 1
      },
      {
        "node": "Crowd search journalism",
        "count": 1
      },
      {
        "node": "AI agents",
        "count": 1
      },
      {
        "node": "Human consumption web",
        "count": 1
      },
      {
        "node": "Retail store",
        "count": 1
      },
      {
        "node": "Websites",
        "count": 1
      },
      {
        "node": "Agentic web",
        "count": 1
      },
      {
        "node": "Business value",
        "count": 1
      },
      {
        "node": "UI paradigms",
        "count": 1
      },
      {
        "node": "Restaurants",
        "count": 1
      },
      {
        "node": "Shopping",
        "count": 1
      },
      {
        "node": "Google Chrome",
        "count": 1
      },
      {
        "node": "innovation",
        "count": 1
      },
      {
        "node": "Chromium",
        "count": 1
      },
      {
        "node": "insane idea",
        "count": 1
      },
      {
        "node": "performant",
        "count": 1
      },
      {
        "node": "dynamic web",
        "count": 1
      },
      {
        "node": "Ajax",
        "count": 1
      },
      {
        "node": "Flickr",
        "count": 1
      },
      {
        "node": "Google Maps",
        "count": 1
      },
      {
        "node": "WebKit",
        "count": 1
      },
      {
        "node": "JavaScript execution",
        "count": 1
      },
      {
        "node": "rich, modern web",
        "count": 1
      },
      {
        "node": "early team",
        "count": 1
      },
      {
        "node": "operating system",
        "count": 1
      },
      {
        "node": "secure browser sandbox",
        "count": 1
      },
      {
        "node": "JavaScript VM",
        "count": 1
      },
      {
        "node": "V8",
        "count": 1
      },
      {
        "node": "open sourced",
        "count": 1
      },
      {
        "node": "web",
        "count": 1
      },
      {
        "node": "minimize",
        "count": 1
      },
      {
        "node": "origins",
        "count": 1
      },
      {
        "node": "core OS principles",
        "count": 1
      },
      {
        "node": "building a product",
        "count": 1
      },
      {
        "node": "extraordinary team",
        "count": 1
      },
      {
        "node": "Eric",
        "count": 1
      },
      {
        "node": "build a browser",
        "count": 1
      },
      {
        "node": "moonshots",
        "count": 1
      },
      {
        "node": "best people",
        "count": 1
      },
      {
        "node": "ambitious",
        "count": 1
      },
      {
        "node": "big ideas",
        "count": 1
      },
      {
        "node": "Larry and Sergey",
        "count": 1
      },
      {
        "node": "revolutionary",
        "count": 1
      },
      {
        "node": "Waymo vehicle",
        "count": 1
      },
      {
        "node": "scuba diving",
        "count": 1
      },
      {
        "node": "operational domain",
        "count": 1
      },
      {
        "node": "robo taxi rides",
        "count": 1
      },
      {
        "node": "technology gap",
        "count": 1
      },
      {
        "node": "invest more in Whimo",
        "count": 1
      },
      {
        "node": "deep technology company",
        "count": 1
      },
      {
        "node": "AI robot",
        "count": 1
      },
      {
        "node": "ambitious and safety",
        "count": 1
      },
      {
        "node": "scaling up",
        "count": 1
      },
      {
        "node": "self-driving companies",
        "count": 1
      },
      {
        "node": "competition",
        "count": 1
      },
      {
        "node": "Elon",
        "count": 1
      },
      {
        "node": "robo taxi",
        "count": 1
      },
      {
        "node": "SpaceX",
        "count": 1
      },
      {
        "node": "L4/5 autonomy",
        "count": 1
      },
      {
        "node": "Way driver",
        "count": 1
      },
      {
        "node": "transportation",
        "count": 1
      },
      {
        "node": "Whimo driver",
        "count": 1
      },
      {
        "node": "Tesla",
        "count": 1
      },
      {
        "node": "Waymo",
        "count": 1
      },
      {
        "node": "Gemini robotics",
        "count": 1
      },
      {
        "node": "personalized responses",
        "count": 1
      },
      {
        "node": "world model",
        "count": 1
      },
      {
        "node": "handwriting a card",
        "count": 1
      },
      {
        "node": "writing something",
        "count": 1
      },
      {
        "node": "AI assistant",
        "count": 1
      },
      {
        "node": "meaningful things",
        "count": 1
      },
      {
        "node": "meaning of existence",
        "count": 1
      },
      {
        "node": "parenting or being creative",
        "count": 1
      },
      {
        "node": "joy and fulfillment",
        "count": 1
      },
      {
        "node": "focusing more time",
        "count": 1
      },
      {
        "node": "holy grail",
        "count": 1
      },
      {
        "node": "AI programming",
        "count": 1
      },
      {
        "node": "Programmer job security",
        "count": 1
      },
      {
        "node": "AI-generated code",
        "count": 1
      },
      {
        "node": "Engineering velocity",
        "count": 1
      },
      {
        "node": "Future of engineers",
        "count": 1
      },
      {
        "node": "Agentic LLM",
        "count": 1
      },
      {
        "node": "engineering and coding",
        "count": 1
      },
      {
        "node": "creative power",
        "count": 1
      },
      {
        "node": "tools adoption",
        "count": 1
      },
      {
        "node": "brainstorming",
        "count": 1
      },
      {
        "node": "problem solve",
        "count": 1
      },
      {
        "node": "midterm term",
        "count": 1
      },
      {
        "node": "grunt work",
        "count": 1
      },
      {
        "node": "architecting",
        "count": 1
      },
      {
        "node": "chess",
        "count": 1
      },
      {
        "node": "programmers",
        "count": 1
      },
      {
        "node": "code base",
        "count": 1
      },
      {
        "node": "agent capabilities",
        "count": 1
      },
      {
        "node": "productivity",
        "count": 1
      },
      {
        "node": "engineers",
        "count": 1
      },
      {
        "node": "productivity wave",
        "count": 1
      },
      {
        "node": "Engineering productivity",
        "count": 1
      },
      {
        "node": "Google codebase",
        "count": 1
      },
      {
        "node": "Standardization",
        "count": 1
      },
      {
        "node": "AI understanding of codebases",
        "count": 1
      },
      {
        "node": "cursor",
        "count": 1
      },
      {
        "node": "Value added things",
        "count": 1
      },
      {
        "node": "codebase awareness",
        "count": 1
      },
      {
        "node": "agent movement",
        "count": 1
      },
      {
        "node": "refactoring",
        "count": 1
      },
      {
        "node": "migrations",
        "count": 1
      },
      {
        "node": "JavaScript dominance",
        "count": 1
      },
      {
        "node": "coding interviews",
        "count": 1
      },
      {
        "node": "whiteboard interview",
        "count": 1
      },
      {
        "node": "AI era",
        "count": 1
      },
      {
        "node": "Chrome runtime",
        "count": 1
      },
      {
        "node": "in-person interviews",
        "count": 1
      },
      {
        "node": "generate better code",
        "count": 1
      },
      {
        "node": "coding engineer",
        "count": 1
      },
      {
        "node": "college education",
        "count": 1
      },
      {
        "node": "first principles thinking",
        "count": 1
      },
      {
        "node": "web browsing",
        "count": 1
      },
      {
        "node": "future of Android",
        "count": 1
      },
      {
        "node": "Android XR",
        "count": 1
      },
      {
        "node": "augmented reality",
        "count": 1
      },
      {
        "node": "mixed reality",
        "count": 1
      },
      {
        "node": "virtual reality",
        "count": 1
      },
      {
        "node": "paradigm IO change",
        "count": 1
      },
      {
        "node": "GUI",
        "count": 1
      },
      {
        "node": "multi-touch",
        "count": 1
      },
      {
        "node": "project Astra",
        "count": 1
      },
      {
        "node": "seamless IO",
        "count": 1
      },
      {
        "node": "XR",
        "count": 1
      },
      {
        "node": "Mobile OS",
        "count": 1
      },
      {
        "node": "agentic",
        "count": 1
      },
      {
        "node": "minimalist UI",
        "count": 1
      },
      {
        "node": "moonshot",
        "count": 1
      },
      {
        "node": "consumer science",
        "count": 1
      },
      {
        "node": "developers",
        "count": 1
      },
      {
        "node": "sequence of questions and answers",
        "count": 1
      },
      {
        "node": "profound truths",
        "count": 1
      },
      {
        "node": "Fermi paradox",
        "count": 1
      },
      {
        "node": "alien civilizations",
        "count": 1
      },
      {
        "node": "advanced alien civilizations",
        "count": 1
      },
      {
        "node": "bacteria-like life",
        "count": 1
      },
      {
        "node": "human knowledge",
        "count": 1
      },
      {
        "node": "GDP productivity increase",
        "count": 1
      },
      {
        "node": "MIT study",
        "count": 1
      },
      {
        "node": "AlphaFold",
        "count": 1
      },
      {
        "node": "quality of life",
        "count": 1
      },
      {
        "node": "knowledge",
        "count": 1
      },
      {
        "node": "frontier",
        "count": 1
      },
      {
        "node": "consciousness",
        "count": 1
      },
      {
        "node": "lines will blur",
        "count": 1
      },
      {
        "node": "resources",
        "count": 1
      },
      {
        "node": "zero-sum game",
        "count": 1
      },
      {
        "node": "resource constraint environment",
        "count": 1
      },
      {
        "node": "empathy",
        "count": 1
      },
      {
        "node": "kindness",
        "count": 1
      },
      {
        "node": "compassion",
        "count": 1
      },
      {
        "node": "curiosity",
        "count": 1
      },
      {
        "node": "scientific domains",
        "count": 1
      },
      {
        "node": "scientific questions",
        "count": 1
      },
      {
        "node": "mathematical questions",
        "count": 1
      },
      {
        "node": "physics questions",
        "count": 1
      },
      {
        "node": "self-discovery process",
        "count": 1
      },
      {
        "node": "Alpha Evolve",
        "count": 1
      },
      {
        "node": "world better",
        "count": 1
      },
      {
        "node": "frontier forward",
        "count": 1
      },
      {
        "node": "optimist",
        "count": 1
      },
      {
        "node": "work",
        "count": 1
      },
      {
        "node": "Google Voice",
        "count": 1
      },
      {
        "node": "sponsors",
        "count": 1
      },
      {
        "node": "lexfreedman.com/sponsors",
        "count": 1
      },
      {
        "node": "XR glasses",
        "count": 1
      },
      {
        "node": "Google Beam team",
        "count": 1
      },
      {
        "node": "Andrew",
        "count": 1
      },
      {
        "node": "development platform",
        "count": 1
      },
      {
        "node": "3D version",
        "count": 1
      },
      {
        "node": "magic windows",
        "count": 1
      },
      {
        "node": "magic screens",
        "count": 1
      },
      {
        "node": "high definition",
        "count": 1
      },
      {
        "node": "three-dimensional",
        "count": 1
      },
      {
        "node": "audio",
        "count": 1
      },
      {
        "node": "companies",
        "count": 1
      },
      {
        "node": "screens",
        "count": 1
      },
      {
        "node": "magical experience",
        "count": 1
      },
      {
        "node": "high five",
        "count": 1
      },
      {
        "node": "AI video model",
        "count": 1
      },
      {
        "node": "light field display",
        "count": 1
      },
      {
        "node": "real communication",
        "count": 1
      },
      {
        "node": "spatial consistency",
        "count": 1
      },
      {
        "node": "3D video",
        "count": 1
      },
      {
        "node": "light field displays",
        "count": 1
      },
      {
        "node": "presence",
        "count": 1
      },
      {
        "node": "shared meals",
        "count": 1
      },
      {
        "node": "review code",
        "count": 1
      },
      {
        "node": "superpowers",
        "count": 1
      },
      {
        "node": "wider window",
        "count": 1
      },
      {
        "node": "grandma",
        "count": 1
      },
      {
        "node": "sense of belonging",
        "count": 1
      },
      {
        "node": "2D metaphors",
        "count": 1
      },
      {
        "node": "scanning problem",
        "count": 1
      },
      {
        "node": "cameras",
        "count": 1
      },
      {
        "node": "video",
        "count": 1
      },
      {
        "node": "approximation",
        "count": 1
      },
      {
        "node": "Android XR platform",
        "count": 1
      },
      {
        "node": "Multimodal conversational device",
        "count": 1
      },
      {
        "node": "Speaker isolation",
        "count": 1
      },
      {
        "node": "Great glasses",
        "count": 1
      },
      {
        "node": "Wearable",
        "count": 1
      },
      {
        "node": "Eye glasses",
        "count": 1
      },
      {
        "node": "home screen",
        "count": 1
      },
      {
        "node": "glanceable information",
        "count": 1
      },
      {
        "node": "the bridge of belief leap 1875",
        "count": 1
      },
      {
        "node": "Arman Gome",
        "count": 1
      },
      {
        "node": "pause",
        "count": 1
      },
      {
        "node": "interrupt",
        "count": 1
      },
      {
        "node": "follow-up questions",
        "count": 1
      },
      {
        "node": "Artistic merit",
        "count": 1
      },
      {
        "node": "Artist",
        "count": 1
      },
      {
        "node": "Rarity",
        "count": 1
      },
      {
        "node": "Appreciation",
        "count": 1
      },
      {
        "node": "Google Maps experience",
        "count": 1
      },
      {
        "node": "Turn-by-turn directions",
        "count": 1
      },
      {
        "node": "Walking down the street",
        "count": 1
      },
      {
        "node": "Sticking your phone in your pocket",
        "count": 1
      },
      {
        "node": "Google IO",
        "count": 1
      },
      {
        "node": "Gemini sleep",
        "count": 1
      },
      {
        "node": "translation",
        "count": 1
      },
      {
        "node": "transcription",
        "count": 1
      },
      {
        "node": "subtitles",
        "count": 1
      },
      {
        "node": "2001 Space Odyssey",
        "count": 1
      },
      {
        "node": "monolith",
        "count": 1
      },
      {
        "node": "inappropriate things",
        "count": 1
      },
      {
        "node": "Russian",
        "count": 1
      },
      {
        "node": "English",
        "count": 1
      },
      {
        "node": "government",
        "count": 1
      },
      {
        "node": "domestication",
        "count": 1
      },
      {
        "node": "cooperations",
        "count": 1
      },
      {
        "node": "productivity multiplier framework",
        "count": 1
      },
      {
        "node": "inventions",
        "count": 1
      },
      {
        "node": "computer",
        "count": 1
      },
      {
        "node": "ancient human history",
        "count": 1
      },
      {
        "node": "collective intelligence machine",
        "count": 1
      },
      {
        "node": "technological progress",
        "count": 1
      },
      {
        "node": "human progress",
        "count": 1
      },
      {
        "node": "biological innovation",
        "count": 1
      },
      {
        "node": "machine translation",
        "count": 1
      },
      {
        "node": "rapid learning",
        "count": 1
      },
      {
        "node": "earth as a system",
        "count": 1
      },
      {
        "node": "network of inventions",
        "count": 1
      },
      {
        "node": "machines of love and grace",
        "count": 1
      },
      {
        "node": "semi-autonomous human programmers",
        "count": 1
      },
      {
        "node": "superhuman AI researcher",
        "count": 1
      },
      {
        "node": "AI in art, film, music",
        "count": 1
      },
      {
        "node": "digitalization of government",
        "count": 1
      },
      {
        "node": "cyborgs",
        "count": 1
      },
      {
        "node": "physics breakthroughs",
        "count": 1
      },
      {
        "node": "Kardashev type one civilization",
        "count": 1
      }
    ],
    "topicGroups": {
      "groups": [
        {
          "topics": [
            "AI",
            "Gemini",
            "AI mode",
            "AGI",
            "AI package",
            "cognitive capacity",
            "ASI",
            "AI overviews",
            "self-modulating",
            "P-doom",
            "pdoom"
          ],
          "category": {
            "name": "Artificial Intelligence",
            "description": "Artificial intelligence and related concepts."
          }
        },
        {
          "topics": [
            "Google",
            "Sundar Pichai",
            "Sundar",
            "Alphabet",
            "DeepMind",
            "Google Search",
            "Beam",
            "Google Beam",
            "Demis",
            "Dennis",
            "Jeff",
            "Sergey",
            "Gmail",
            "Chrome",
            "Android",
            "Whimo"
          ],
          "category": {
            "name": "Google and Alphabet",
            "description": "Companies, people, and products related to Google."
          }
        },
        {
          "topics": [
            "technology",
            "internet",
            "electricity",
            "industrial revolution",
            "power of technology",
            "progress",
            "products",
            "programming",
            "computers",
            "computer science",
            "self-driving",
            "robotics",
            "future",
            "autonomous vehicles",
            "compute",
            "scaling laws",
            "pre-training",
            "post-training",
            "APIs",
            "CGI"
          ],
          "category": {
            "name": "Technology and Progress",
            "description": "Technological advancements and their impact."
          }
        },
        {
          "topics": [
            "humanity",
            "human civilizations",
            "human civilization",
            "social hierarchies",
            "trade",
            "World War II",
            "humans",
            "military conflict",
            "1984",
            "collective mind",
            "first principles",
            "impact",
            "value",
            "opportunity",
            "inspiration",
            "human curiosity",
            "Neolithic package",
            "first agricultural revolution"
          ],
          "category": {
            "name": "Humanity and Society",
            "description": "Humanity, society, and historical events."
          }
        },
        {
          "topics": [
            "podcasting",
            "YouTube",
            "ads",
            "commercial information",
            "browser",
            "conversation",
            "tokens",
            "tokens per month",
            "newspapers",
            "books",
            "artistic free expression",
            "Lex Fridman Podcast",
            "micro kitchen conversation"
          ],
          "category": {
            "name": "Information and Media",
            "description": "Information, communication, and media."
          }
        },
        {
          "topics": [
            "productivity multiplier",
            "blood test records",
            "Nobel Prize",
            "merger",
            "underlying risk",
            "Opportunity space"
          ],
          "category": {
            "name": "Economics and Science",
            "description": "Economic and scientific concepts."
          }
        },
        {
          "topics": [
            "drought",
            "water trucks",
            "water buckets",
            "running water",
            "water heater",
            "shower",
            "5-year waiting list",
            "five-minute thing"
          ],
          "category": {
            "name": "Infrastructure and Resources",
            "description": "Infrastructure and resources."
          }
        },
        {
          "topics": [
            "India",
            "Chennai",
            "cricket",
            "precomputers",
            "rotary telephone",
            "solitude"
          ],
          "category": {
            "name": "Historical and Geographical Context",
            "description": "Historical and geographical context."
          }
        }
      ]
    },
    "shortSummary": "Lex Fridman interviews Sundar Pichai, CEO of Google and Alphabet, discussing AI's impact, Google's future, and the potential of technology.",
    "lastStoryCheck": "2025-07-15T00:11:40.636Z",
    "storyCheckResults": {
      "missingChunks": [],
      "missingStories": [],
      "totalCategories": 7,
      "totalChunksChecked": 95
    }
  }
}