{
  "id": "eFohaNktKLs",
  "title": "ETH Breaks New Records While BTC Hits ANOTHER All Time High",
  "channelId": "UCAl9Ld79qaZxp9JzEOwd3aA",
  "publishedAt": "2025-07-18T10:30:38.000Z",
  "cleanText": "Bankless Nation is the third week of July. It's time for the Bankless Weekly rollup. David, it is Crypto Week this week. Okay. That's just not, that's not just me. Are we talking crypto this week? Yeah. No, this is Trump declaring it Crypto Week. He said, \"Happy Crypto Week.\" Did you see this? Where did he say this? He said this on social. Yeah. Yeah. And the reason why is because the Genius Bill is in front of the House as well as the Clarity Act, some other house bills for crypto. So, he's declaring you and uh everybody at BANKLESS a happy Crypto Week. We got to talk about the Genius Bill. It is a happy Crypto Week. I felt that actually this week. Okay, so the Genius Bill at the time of recording, we don't know whether it has passed or not, but I'm going to go ahead and say it passed. Okay, Bankless listeners, they're living the future. We're recording this on Thursday. The bill uh is going up for vote at 4 p.m. today. We don't know the outcome yet. You guys do. I think it passed, David. Okay, hold me to that prediction. I'm assuming that it's passing. It's going to pass. And also, I don't think that that is why the MARKETS has pumped, especially Ethereum has pumped. I think that the market will pump more as a result of this passing. After it passes, after it passes. Oh, it has passed. Of course, it has passed. It has passed. Yes. Uh, also, we got to talk about Bitcoin. Hit an all-time high. We got another all-time high week back to back. But, I do feel like all eyes are on ETH this week because there's not a Bitcoin story this week. No, there's been a vibe change. We talked about that last week. But now we've got ETFs, ETH ETFs, breaking all-time high records. We also have Tom Lee saying he wants to buy 5% of all ETH supply. That's a true story. How much? That's like 6 million ETH. And he is not anywhere close to 6 million ETH right now. No, he's got to work his way up, but he's getting there. And then of course, I'll cover the PUMP ICO because we don't want Ryan to do that. How did it go? Who bought in? What happened afterwards? And then Coinbase launched its everything app, brand new release out of Coinbase. We're entering in the world where crypto companies like Robin Hood, Coinbase, they are doing their own internal like, you know, jazzy marketing campaigns, marketing like streams like Steve Jobses and they're doing the the they're doing their own road shows in their own kind of context, which is pretty cool. Uh we're going to talk about the Roman Storm Trial as well. And remember that one time the Polymarket founder got raided by the FBI? Yeah. Uh we're going to hear more about that story as well. But first, before we get into the MARKETS and talk about all the different ETH treasury companies that are up like 40% on the week, we're going to first talk about fundamentals. Uh and all those fundamentals you're going to hear are at the Bankless Summit. The Bankless Summit is a one-day event that we are throwing at Dev Connect. We are recruiting all the greatest speakers in Ethereum to give 20 to 30 minute talks, no panels, just straight information about Ethereum. The newest speaker is Donna from L2B. He is joining the ranks to talk about native roll-ups and all the research that he's going there. But we've also got Justin Drake, Ongar, Tamas, Arjun, Uma, Roy. It's going to be a who's who. It's a TED talks for Ethereum the second day of Dev Connect. So, if you are going to Dev Connect and Bonosaris, which I highly recommend cuz all you're going to go do is you're going to go down to Bonosaris, you're going to talk about ETH, you're going to eat steak, you're going to drink Malbeck, and then you're going to talk about ETH some more. I don't know why anyone wouldn't want to go to Bonosaris. They are the people that adopted stable coins and ETH. They are the people that built Maker Dow. They are the the people over at Open Zeppelin. It's a great place to just be a crypto person and then once you're done being a crypto person, you just eat steak. It's great. Anyways, uh I'm very excited about it. Uh this is again happening the Tuesday of Dev Connect. Get your tickets before I increase the prices. Prices are $80 right now. They will not be $80 in the future. They are going to track ETH. Uh and so they will be about $160 by the time we run around to Dev Connect. That's an ETH price prediction. Okay, that's a 6K ETH if I'm doing the math right. No, 7K ETH. Oh my god. Wow. We are bullish on the week. Let's talk a little bit about Bitcoin price because we got an all-time high this week. Not quite at the time of recording, but previous to that, what did we hit and where are we at right now? Uh we are currently coming in at $19,000. Bitcoin is up 7 uh% on the week. A good old 7%. The new all-time high $122,800. I think I think it did hit $121,000. Uh so a pretty number. Yeah, it fell off. It fell off all the way, all the way. It crashed, Ryan. Bitcoin crashed this week from $123,000 all the way down to $116,000 and has since come up to $119,000. See, they always told not to buy because it would crash. They It always crashes every time. Not only that, why you never buy Bitcoin. Well, you know, part of the story this cycle, of course, has been the uh infinite institutional bid for Bitcoin, the asset. You're seeing that in no no better place to see that than in BlackRock's IBIT. So BlackRock's IBIT, of course, is the BlackRock Bitcoin ETF. It just became the fastest ever to hit 80 billion in AUM. And David, I got to tell you, it's not even 80 billion. 80 billion. My god. Did I say million? You said million. I got to up those uh up those numbers. 80 billion. Bear got in your mind. Okay. But look at this chart. It's like it's like, oh, it's the fastest ever. Okay. Nothing else is close. It's four times faster than the nearest competitors. It looks like like all the all the nearest competitors are like all within a pretty similar range to each other, like pretty neck and neck. And then Bitcoin is like I am four times faster than all of you. This is why Wall Street is so bullish on uh on crypto assets this cycle is because they're providing a lot of the crap uh a lot of the capital flows here. Um the question is, is Bitcoin fair market value or not? Well, if you look at some charts like the long-term holder net unrealized profit and loss, the the nuple, okay, this is basically how how up are Bitcoin holders. I believe it's measure uh that it's that kind of measure. We're actually not in froth market territory. Okay, we're between the npples are not frothy. Yeah, the npples are not frothy yet at least. We're somewhere at 69 and that's the uh the below the 69. Have I been sabotaged with this week's agenda? My god, is this an even a real metric? Forget this. Let's go to the classic rainbow. I like this chart much better. This is the classic Eric Wall rainbow price chart. It's way easier to chart than long-term holder net unrealized profit loss. What the is that? No, you just look at the rainbow chart. We are clearly still on the lower side of the rainbow chart. We are in the accumulation zone. We are not in the massive deal. We are not in the fire sale. We are not in the buy by buy section. We're in the accumulation zone, which is a modestly leaning bias towards buying, but not overly so, but we are definitely on the lower side of the Bitcoin price. We want we what we want to do is we want to get into the yellows and oranges slowly. We want to get into the elves and oranges in like 2027 which would put Bitcoin somewhere between one and $2 million if we got if we got to the orange red area where like FOMO is happening and then also as a sell signal. Yeah, this is a much better I feel set up. I think I was set up with this week's agenda and talking about I gave you the opportunity to kill this car, but you just walked right into that one. All right. You wanted to talk about this. So there's a new denomination. I think this is so cool. This is okay. So this is we all like to talk about price, you know, Bitcoin, there's only 21 million uh, you know, price targets, blah blah blah blah blah, there's also like the cultural element of Bitcoin acceptance and like, you know, the the tolerableness of Bitcoin and this is an indication that Bitcoin is just becoming so understood. Do you remember the first time we got into the Bloomberg terminals? That that was huge. That was a huge moment for us, right? And we're not $3,000 or $7,000 or something. Okay. The cool thing that's happening right now, I maybe this is small, maybe I'm over hyping this, but if you want to go look at Bitcoin in the Bloomberg terminals, the pricing chart on the right side, like the graph where you see the prices, the little tick marks, yeah, they are denominated in millions of dollars. So right now on the price of a Bitcoin according to Bloomberg when you go up and open up Bloomberg, you see a Bitcoin price of 0.112 million, not $112,000 or whatever, you see, you see it denominated in millions of dollars, which means if you imply, if implied it's going to be worth millions of dollars, like it wouldn't be worth million dollars, people don't assume it's going to hit 1 point something or 2 point something, the fact that we are denominated publicly on mainstream society that we are denominating Bitcoin in millions of dollars, I think is a huge historic land like cultural milestone. I choose to believe that and also you need to make room on the graphs, right? So every 10x you got to you got to move the uh, you know, the point somewhere, right? So pretty soon we're going to denominate in like what, I don't know, tens of millions of dollars, maybe. I is that is that what's next for a million? I think I think Bitcoin needs to get to a million dollars and then we can start talking about that. Yeah, this cycle, you think that's happening in this cycle? Well, what I just said, yeah, sometime in 2027, one to $2 million Bitcoin. That's what the nuples tell you. Or the rainbow. That's what the rainbow tells me. Yeah. Okay. But the but the nuples are also pointing in that direction. We've had enough here. Uh let's get to the ETH price on the week. This is uh tell us about ETH price. I am very excited about this number, but why why don't I let you say it? The number, the number for ETH, $3,420, up 23%. Not just double digits, but double digits with a two handle on it. Mostly driven by massive ETH Treasury accumulation. I woke up every single day to three different ETH Treasury companies announcing they are purchasing of somewhere between 10 and $300 million of ETH. And I got confused as like, okay, was this yesterday's announcement or is this tomorrow's announcement? Which announcement is this? Is this a repeat from the last one? Which which BTCS exactly like MNBT like treasury company is doing this? I don't know. They're all just buying each one is buying like somewhere between like 20, 10, I think like 20 was the smallest number that I heard, like $20 million, and then the largest I heard is like $300 million. But it just happened. It was just a big week. And then and then and on top of that, we're going to talk about this. ETH ETF inflows had its largest number ever. So, BlackRock ETH ETF took in 500 million of ETH for a total combined 700 something something $700 million of inflows. 726 million yesterday. That's all time. That's the biggest inflows ever for Ether, the asset from the ETF by far. By far, it was a big week for ETH. Really big week. also kind kind of close to flipping uh Bitcoin on that on the daily. Remember that's a kind of a in terms of daily, which is already massive because Bitcoin is still four times larger than ETH right now. It is massive. We've got some other measures of that. Maybe maybe we'll just talk about that for a second. So, uh this is Nate Jerassi saying we have record daily inflows for spot ETH ETFs, nearly 720 million. Obliviates the previous mark of 430 million. Obliviates. Just obliviates. Oh, obliterates. Obliterates. I'm using Harry Potter language. That's how bullish I am. Okay. Um, if you want to get into Anthony Cissano level bullishness though. Oh, yeah. That's I don't know. You can't go any higher than that. You start. Yeah. That's max. That's like, you know, your power maxed at Anthony Cissano, you know, bullishness. So, he likes to do this and he's been doing this on the daily basis. He likes to take the net inflows and then he looks likes to look at the the the net ETH issuance. So, we got net net ETH inflows of about 720 million. And do you know how much ETH supply was minted that same day, David? Not that much, less than that. 6.7 million. Okay. So, I'm not going to use the words ultrasound money here because that's not what we're talking about. But we are talking about um like a lack of supply in this market because this is the demand, the inflow demand was 110x the amount of supply issued. Okay. So much so that there are reports uh where I got that of OTC desks running out of ETH. Okay. Winter just said that Wintermute said, \"Yeah, we don't have any ETH on our desks. Everyone bought it.\" Can I be nitpicky about Sazzle's tweet? No, this is a bull, this is bull mode. Oh, we'll allow it. Okay, you get you get one one bearish thing. Go. This is we're what he's doing is he's he's like kind of using the whole this happened with the early days of the Bitcoin uh treasuries, too. But the difference here is, well, actually, actually, wait a second. This is a bullish interpretation of Anthony's tweet. Bitcoin miners have to sell their ETH. And so when we look at the\n\n\nThe Bitcoin miners have to sell their ETH. You lost me that when they when Bitcoin miners. Yeah. Uh, excuse me. Sorry. When Bitcoin miners mine Bitcoin and they have to sell the Bitcoin to pay for the expenses because it's very competitive, very low margins. And so when when the the sailor was accumulating like three times more than the Bitcoin mining sell pressure, there was bullish Bitcoin because like, oh, like all the supply is being soaked up by the by like Michael Sailor and the Bitcoin treasuries. Anthony is doing that same thing of alluding to that same effect. And it's just even more like there's an even larger discrepancy here between the $720 million that was purchased versus the $6.7 million of ETH that was minted. But the thing is, are you staking ETH, Ryan?\n\nI'm staking ETH.\n\nDid you Well, do you do you sell the ETH rewards that you accrue?\n\nUm, it depends. I mean, mostly, mostly not because I continue to be bullish at these prices.\n\nYeah. And so you just you just stake that ETH, too, right? That's what most ETH stakers do. They stake their ETH and then they get some rewards less their tax bills.\n\nLess tax bills, whatever. Yeah. Uh, you you pay for those in other ways. You you you take when you stake ETH stakers when they st they take their ETH rewards and they stake them again. They keep on accumulating ETH because they don't have very much costs. So they don't have to sell, right?\n\nAnd so like the there's not even any sell pressure there. It's actually just accumulation. There's just accumulation going on.\n\nYes. And the story behind the last bull market again, we're we talk about put this in perspective, right? We're not even at all-time highs. We're not even at December all-time highs. December, we're still 40% off of all-time highs.\n\nYeah. Okay. So, like at some level, this is a pump for ants still. Okay. We still have a lot more to go. I mean, 2021 was crazy. Do you remember all of that? 2020, 2021, we were rangebound from like 150 to 300 for a very long time and then went to $4,100. People don't remember uh that era of what ETH can actually do. But at that time, what was really interesting is the ETH uh monetary schedule kind of sucked where issuance was like what like 5% or something. This premerge. Yeah, it was like three ETH per block in a proof of work context. Yeah, it wasn't great.\n\nYeah, it wasn't great. This time around you have much less supply. Annual issuance is like 0.45%\n\n[Music]\n\nin a bull market under the paradigm of both proof of stake and EIP1559 which came in 2023 and 2024 2022 and 2023 respectively. See?\n\nUm, and so, yeah, the other thing I saw this week, which was interesting, there were actually days where Bitcoin was down, but down in dollars and ETH was up in dollars on the 24 hour. And again, this is this is segments of time, but I I just like, do you remember the last time we've seen this?\n\nThat has not happened in a long time. Sometimes you've had days Sometimes you've had days where ETH outperforms Bitcoin, right? Those have been rare, but I can't even remember a day this cycle where Bitcoin's actually gone down and ETH has gone up. So, this is some more story of the of the winds changing gear. We got more to talk about ETH in the in the treasury section. We're we're we're not done talking about ETH, but do you want to talk about macro really fast, though?\n\nYeah. Yeah. Yeah. Do you want to know what happened here in the in macro world?\n\nYeah, in macro world in trad world. Can you start with is it bullish or bearish?\n\nOh, actually, before we get to that, um can can we just check in on coin um total crypto market cap because I feel like we might be all-time highs or coin. We are tied for all-time highs on the MARKETS. We are $3.9 trillion. We hit $3.9 trillion four months ago, 5 months ago.\n\nOh wow.\n\nSo we are tied for a total crypto market cap and that is inclusive of uh Bitcoin dominance being very high.\n\nUm yeah.\n\nYeah.\n\nGood stuff. Good stuff. All right. Here's what's going on in Macro. So we had some CPI numbers in the report. Inflation picked up a little bit, but like it really wasn't that bad. It just ticked up a little bit, but it was pretty much as expected. And I think the big story here, oh I should say the numbers 12 12 month was at 2.7%. This is still the highest since February but pretty much in line with expectations. Do you know the story that was going on like uh 3 or 4 months ago about tariffs causing Inflation? We just haven't really seen that in uh the data yet. In fact, if you look at Polymarket compared to that point in time where you had US recession odds in 2025 at about 64% during a tariff craziness, it's down to about 20%. Now, of course, we have less time in the year, so the prediction gets you know like you know a little um a little more crisp uh but 20%. So recession fears have kind of evaporated from the market pretty much. And Trump of course used this as an opportunity to to to beat Powell over the head. He said, \"Consumer price is low. Bring Fed bring down the Fed rate.\" Now, he's talking to Powell, of course, about this. And I don't know if you saw this, David, but there was actually the New York Times reported that President Trump actually drafted a letter to fire Chair Powell. All right. So, he had the letter all drafted. Got to wonder what that letter said. But he had the letter. This is what the New York Times reported.\n\nI'm sure it was extremely cordial in respect.\n\nOkay. But then reporters asked Trump, um, do you have the letter? Have you drafted a letter? They say Trump said I haven't drafted a letter.\n\nReporter said, I have concept of a letter.\n\nTrump, the reporter goes, so you didn't show it to Republican lawmakers last night. This is what the New York Times was reporting.\n\nI talked about the concept of firing palace.\n\nThat's exactly what he said.\n\nNo, he actually said the word concept.\n\nYeah, this is a quote.\n\nDid it again. Verbatim that guy's a meme lord, dude.\n\nIt's great. It's great. So, uh, Trump on Jerome Powell, he said he's a terrible Fed chair. I was surprised he was appointed apparently forgetting to remember that he was the guy that originally appointed Powell actually. So it's all you know great stuff. Uh but what a circus it is a circus. I mean, lots of clippable stuff you can talk about on the week, but the the bottom line for me is like what what's the probability that uh Jerome Powell is out as the Fed chair? Again, this would be unprecedented, never happened in US history, right?\n\nPolymarket gives that an odds of about 20 21% chance happening this year. Okay. So, still pretty low odds.\n\nPretty low odds. Can I get my macro take?\n\nYeah. I don't want to rock the boat. Uh, I think if you are just like irrationally or uber bullish, you want Trump to fire Powell so that he can like lower down interest rates. You think you want that? That's I don't know if you want that. I think I think that's naive. I think some like naive bulls are like, \"Yeah, just cut the interest rates. Fire Palp cut the interest rates. Let's take this to the moon.\" Which will probably happen and then there will be a massive hangover all throughout 2022 and it's going to just delay further wealth. Like it's short-term wealth. It's short-term. I don't even know if it's like who knows how the market might react to that. They might react in the opposite way. They might be like, \"Okay, that, you know, central bank impartiality is totally screwed. The US is down.\" I think that's a black swan. I think we don't want to rock the boat. We have a good thing going right now. The SPY, the S&P 500 is up 2 and a half% from its peak in uh January right before the tariff dip. So, if you just ignore the tariffs, we are we're at all-time highs right now. Like, things are good. Like, let's just not keep it going. Don't change anything. I'm kind of inclined to agree with Polymarket that I don't think it's going to happen. It's like 20%. But the odds that Trump continues to talk about Trump pal. What are the odds of that?\n\nWhat are the odds of that?\n\nI don't I don't want pal's doing fine. Give that 100% odds. Okay, coming up next, David, we got to talk about this race to a billion dollars in ETH treasury. Seems like all of these treasuries are racing and uh we may have a winner already on the week. Somebody first to a billion in ETH. Also, we've got more Bitcoin. More more Bitcoin mining companies. They're pivoting to ETH treasuries. And also, Peter Teal is making a big bet on Peter Teal has entered the chat. Yeah. Uh and you got to tell me more about the uh the Coinbase wallet turning into a super app and everything app. They've got a big revamp. We'll have some videos and more. But before we do, we want to thank the sponsors that made this episode possible, including Uniswap. They are a browser wallet. They are a mobile wallet. They are the best place to do DeFi. Go check them out. Ethereum's layer 2 universe is exploding with choices. But if you're looking for the best place to park and move your tokens, make your next stop Uni Chain. First, liquidity. Uni Chain hosts the most liquid Uniswap V4 deployment on any layer 2, giving you deeper pools for flagship pairs like ETHUSDC. More liquidity means better prices, less slippage, and smoother swaps. Exactly what traders crave. The numbers back it up. Uni Chain leads all layer 2 in total value locked for Uniswap V4. And it's not just deep. It's fast and fully transparent. Purpose-built to be the home base for DeFi and cross-chain liquidity. When it comes to costs, Uni Chain is a no-brainer. Transaction fees come in about 95% cheaper than Ethereum mainnet, slashing the price of creating or accessing liquidity. Want to stay in the loop on Uni Chain? Visit unichain.org or follow @unchain on X for all the updates. Ever wonder how industry-leading companies like Coinbase, MetaMask, and Phantom Wallet build products that always stay ahead of market shifts and new token listings? It's because they all use the Coin Gecko API. The most reliable and comprehensive crypto data API backed by a rockolid 99.9% uptime SLA. Builders, analysts, and businesses rely on Coin Gecko for real-time data on 9 million cryptocurrencies across 1,500 exchanges and 200 different networks. It goes beyond crypto prices to access liquidity, OLCV, DEX data, metadata, NFT floor prices, and more, enabling your team to build and scale powerful products like wallets, oracles, exchanges, AI agents, and DeFi applications without limitations. Onboarding is easy with clear documentation and enterprisegrade support that answers you faster than Finality, 24/7 around the clock. Supercharge your product and build with Coin Gecko API today. Head to gcko.io/banklist io/banklist 10 and enter code banklist 10 for 10% off any plan. Coin Gecko API, crypto's most trusted and reliable data source. Imagine if your checking account and DeFi wallet finally spoke the same language. That's Mantle Banking, an all-in-one fiat and crypto account. It lets you save, spend, and invest all from one dashboard. Swipe for coffee, stake me through yield, or even use virtual cards for payments through Apple Pay. So, it feels web 2 simple yet stays web 3 sovereign. For allocators, meet Mantle Index 4, the S&P 500 of crypto. a tokenized institutional-grade fund seated with $400 million from the mantle treasury and balance across Bitcoin, Ether, Soul, and Yieldenhanced Stables. One asset, broad exposure, pure DeFi composability. The momentum is real. ME faults, FBTC bridges, and a $2.4 billion community treasury are all powering the next phase of onchain finance. Mantle brings real world access, yield, and utility to digital assets. Ready for the next era of onchain finance that actually belongs in 2025? Explore Mantle at mantle.xyz XYZ or follow Mantle official. Mantle, bridging TRFI and DeFi so you don't have to. Okay, we got maybe the first to $1 billion worth of ETH in treasuries. It's been a race and I got to say the race may have concluded earlier than I thought. Like it's moving faster. We've got number one. This is a strategic ETH reserve. By the way, I'm going to I'm going to filter by Treasury companies here. We got a new number one and it's just over $1 billion in ETH uh uh worth of ETH. That's uh 300,000. This is Bitmine Immersion Technologies. Okay. This is Tom Lee. This is team Tom Lee. This is the the horse that Tom Lee is the jockey of. He's riding. Yeah. He's riding this Bit Technology course and he just But he just like he just took the lead. Okay. Kind of last minute. It looked like Sharplink Gaming was going to be first. Joe Luben. That's Joe Luben's the jockey of Sharplink Gaming. Yep. That's SBET. Uh we'll talk maybe more about these tickers. Maybe people will remember. Maybe they'll forget like I do almost on a weekly basis. We got so many tickers going on. But uh Luben with SBET, he got up to 960 million at least publicly disclosed. He may have more that's not yet been been publicly disclosed, but will be. So just short of a billion. So David, Tom Lee may have won the first round here to $1 billion worth of ETH. I think um that's great for him. uh $1 billion of ETH, but but he's at 300,000 Etherish and Joe Lisman's at 280,000 Ether. Like the better number is who's first to 1 million Ether.\n\nOh, okay. Okay. But I think that's a much better race because it's it's roughly three times more than what we need where we're at right now and it's ETH denominated and so the ETH price doesn't like actually because because then we're measuring dollars of ETH price and we just why denominate in dollars like it's millions of ETH on the balance sheet is what we want.\n\nOkay, Tom's thinking the same thing.\n\n\nDavid. He's already ahead of that line of thought. Okay, this is a quote from Tom Lee. We are well about Bitcoin. We are well on our way to achieving our goal of acquiring and staking 5% of overall ETH supply. David Tom Lee wants to buy 5% of total ETH supply. What are we talking about? What's the math on that? If you want to do ETH denominated, what's ETH denominated 5% of total supply?\n\nWe are at 120 million. So times uh 0.05 is 6 million ETH. He Tom Lee wants 6 million ETH. He's got 300,000 now. He wants to get to 6 million. He's basically at zero. He basically doesn't have any ETH. That is what that is probably one Michael Sailor worth of uh ETH supply if you do the comp to uh to Bitcoin, right? Uh Sailor have three 4%. No, he might maybe he has 3% 2.5. He's trying to do a 2x sailor. All right, I've got the number. It's a 2.86% is Michael Sailor. This is Michael Micro Strategy or Strategy, I should say. Michael Micro Strategy. Michael Sailor Strategy owns 2.86% of the total Bitcoin supply. All right.\n\nSo, so Tom Lee wants 6%. And Joseph Le, let's not get ahead of ourselves. It's actually interesting. ESB actually um has more ETH now publicly than the Ethereum Foundation. Okay. So that was so the Ethereum Foundation made a sale of ETH this week to fund do their normal funding operations, but they just sold it to Micro Strategy or excuse me to to ESB to Joe Luben. So it never actually hit the order books.\n\nYeah. Uh and everyone was very bullish about that. It's like, oh, the EF's not going to dump on us. They can just buy it. It's going to get absorbed by ESB. But like also at the same time it's e it's just neutral because then the ESB dollars don't actually hit the order books.\n\nThis news came in. I don't know if this is recent, but it just came in with the Edgar filings. I can't believe I'm talking about Edgar filings. Okay. This is where one of us has to do it. Okay. Uh Peter Teal bought 9% of Tom Lee's ETH treasury company. That's the bit mine. Okay. So Peter Teal is in on all of this too. Uh he's providing some of the capital for I guess these uh these ETH purchases. That seems kind of bullish to me of big money, institutional money coming into these ETH treasury products.\n\nThe thing is too, there's more human. Okay, so it's not just these companies, there's other horses that are going to enter this race. I'm pretty certain of that. Um maybe let's look at the the stock prices here. These are the ETH treasury companies that are all, you know, publicly traded in the US. So the first is SBET. So this is Sharlink. Uh look at this chart. That is an unreal chart. That is a chart that just is a parabola up starting at the very beginning of July. Okay. But before that, do you remember that? Do you remember this right here? Weird spike where it was announced and had already pumped from like a dollar up to $50 and then it crashed back down and then everyone on Twitter was like grave dancing on it. That was such a weird What happened there? What happened? Like such a lowflat like thing to do and then it seems like just a bunch more float has hit the market. The market's behaving much more orderly right now.\n\nIt it is. But this was literally I think crypto investors misinterpreting the Edgar filings, the SEC filings. They thought all the all the original holders of this were like exit uh selling and they misinterpreted it. Yeah, people were wrong. And since uh not fully recovered, but I mean it's back to um 34 actually. I don't I don't think there was much volume. Sorry. Go back there and look at the volume under the very the very big spike that happened like in June. Oh yeah, just no volume. Absolutely no volume. Good point. And so so like people were like, \"Oh, like Joseph Luben and ETH people are dumping on you.\" It's like it hit $100 for a blip because like people were FOMO. We're trying to like snipe it. Now the volumes under it are like 10 times larger than the than when it was at like $100.\n\nOkay, this is um this is Bit Mine. So this is the BMNR. This is the Tom Lee. I can't believe we're looking at stocks so much on this. Okay, dude. This is ston season, man. Okay, so I I don't know what this chart is showing you. like I would Yeah, I don't really know. It looks like um looks like that one uh mountain in the Midwest I'd like to climb. This is bit digital. Another mountain maybe you want to climb here. Uh is because it's going up. It's a nice thing here from I mean has all the price action. All these are just not really doing what ESB is doing. Yeah. And then there's BT. This one's nice. Um BTCs. Yes. The these are what I'm what I'm quoting are the top four. And if you if you're noticing all the B's in these um in these ticker symbols, it's because it used to be Bitcoin mining companies. Yeah, these are all Bitcoin miners, which is kind of interesting that Bitcoin miners are like, you know what, mining sucks. We're going to accumulate ETH.\n\nLiterally, I mean, this is the um the founder of Bid Digital told us uh we have an episode coming out with the founder of of Bid Digital and he bas he basically said it was a he said it was a business. Yeah. And so instead they've diversified into staking ETH which is also validating a chain. Um there there's another company that just uh just this morning another Bitcoin company pivoting to ETH. This is um BTC digital. This is something we hadn't c we hadn't talked about yet. This is BTCT. You got another one.\n\nThe this I wonder how far this is the brand of this is indicative. Like does Wall Street see notice like all these are Bitcoin mining companies becoming ETH treasury companies and do they take that into account as to like what's going on? Because like my narrative here as a crypto native who's familiar with these subjects is like oh yes this is highly indicative of Bitcoin long-term security problems and you're actually seeing Bitcoin miners being like, \"Okay, well we are not paid much by Bitcoin. We're not paid enough to keep on doing what we're doing. So let's do something else.\" And all of a sudden when something good lands on their doorstep, they immediately jump ship to that other good thing which is ETH which has a sustainable I mean I don't know they don't really have to do that the capex expenditure of ASIC mining and like electricity and all that stuff. They're just doing the ETH the capex is buying ETH capex is buying ETH but like yeah right but that doesn't deteriorate like the electricity and the actual hardware that they were to buy. So it's a better business and to me to me that is indicative of the security budget stuff story that we've told for years. I think that's a longer term story. I I think probably Wall Street is not looking at that right now. I think right now they're just looking at oh my god, could this be the next Bitcoin? Right. And they're very excited about that. And looks like it's a Treasury asset from early indications. One other thing that um the strategic ETH reserve actually added was the uh price to the MNAV. Very key metric.\n\nYeah, this is the premium above basically the uh the assets the ETH assets under companies. Well, higher is more of a premium. higher is more expensive. Like I don't know necessarily if it's better. It depends on like you know if you own it it's better if you're a buyer. If you are Yeah. It's not great for the buyers. If you already own it it's better because that means that's the premium that you're getting for ETH holders. You want to see higher. Higher means that there's more premium to squeeze to buy more ETH. So the premium eventually turns into buy pressure for ETH.\n\nYeah, I think that's true. Also, I think it's indicative of froth potentially in the future. Right. There there's a time where these premiums will go down and there is a time where the where the premiums will be under one but when they're above one we're not yet anyway so we got um a range you know uh ESBAT is 2.63 63 MNAV whereas Tomley is 2.19 MNAV. Anyway, investors can look at this and all the data is on the strategic ETH reserve. So, wow, that's the Treasury story and it seemed to come out of nowhere. David, there's also another Treasury on the scene this week. I don't know if you saw this. This is the Hype token getting its own treasury. Sonnet Biootherrapeutics announced I believe this is its second treasury reserve company. Hype Hypes second treasury reserve company which is pretty crazy. Uh this new company will hold 12.6 million hype tokens at $570 billion. Uh they also have $35 million of cash which they are going to use to buy hype. Uh and then also the investors in this you will hear recognize their names. Paradigm Galaxy Digital Pantera Republic Digital Digital uh Paradigm co-founder Matt Hang said we've been investors in Hyperlquid since November 2024. We keep hearing from our stratify friends that they'd like easier access. So, I'm pretty sure Paradigm just like had their hype bags and then they did the inkind investment into this new vehicle and then they get shares back and so now they have the shares and we're like why do you want those? Well, because they traded a premium.\n\nYeah, it's a free premium. That's the thing is as excited as I am about all of these treasury entities particularly for ETH and kind of the propagation of you know ETH as a as a reserve asset treasury reserve asset first right you can also start to see the signs of how this gets too bubbly and too frothy and almost how it ends right so some of these are funded by this goes for all treasuries inind contributions as you said so somebody already has a bag let's say of ether or bitcoin or hype and they just contribute it to this entity before it goes public essentially and then they get an MNAV premium. Okay? And then they can quote unquote exit to retail. All right? I'm not saying that's what's happening yet, but you start to always in the beginnings of these big narrative uh you like exciting bubble type things. You can sort of if you squint hard enough, you can see how it's also going to end. So be excited now. And also at some point in time probably it's going to get overheated and buyer beware. I don't think we're close to that yet, but you can see a little bit.\n\nI don't know if it's necessarily retail. It's squeezing the juice out of public markets, out of the trady markets, retail included, but also in also large investors, right? Like whoever is buying in their brokerage is that's that's who is paying for the premium and that's the premium turns into converts into buying the L1 asset.\n\nLet's talk about another exciting uh retail product that uh Coinbase just rolled out. This is the Base App. So, I believe this used to be David, correct me if I'm wrong, this used to be the Coinbase wallet, and they've rebranded to Toshi. Toshi turned into Coinbase wallet. Yeah, it used to be called the Toshi wallet. That's a long time ago. I remember that. Was Brian Armstrong's like cat or something or dog. Okay. So, that was a long time ago. I don't think most people even remember. Can congrats if you remember what Toshi was, but then it Coinbase wallet now it's the base the base app basically, but it's um totally revamped. So, they've added a bunch of things. What uh what have they added here? It's just that Coinbase and Bass and Jesse really leaning into onchain social. So, they're just continuing to double triple down on the whole onchain social thing. So, it is a Farcaster client. So, when you go on there, it's Farcaster uh is their own client. So, their competitor a competitor to Warpcast. Uh and so you can do tweets and all the things that Warpcast Farcaster likes allows you to do. You can buy They're using the Farcaster protocol. Importantly, Exactly. Yeah. And so you can like you know tweet and you can share out tokens that you buy and and do any do any of the other features that Farcaster has. Zoro markets for example uh there's like ENS then there's also payments. Uh and then they're doing the whole mini app thing. So there is an open graph for mini apps as well. Uh they brand it as a uh an everything app. It's a super app is what Brian Armstrong called it. And so it does a bunch of different things. Uh there's also an encrypted chat. Um and then you can just like trade tokens and like I said make payments. Uh and so kind of encroaching on world apps uh territory was because they're doing the mini apps too. Telegram the Tom Blockchain also doing mini apps. So mini apps are are a thing and now now the base app is also doing this. Um and then yeah they like emphasis on really leaning into the creator economy. They had uh Gary Vee and Peopleleaser and one other creator that wasn't familiar who talked about how NFTs and the creator economy just helped them with their careers. So they were kind of doing like a narrative campaign for the creator economy and like branded it with the base app. Um so yeah, pretty pretty cool presentation.\n\nWell, all the posts can be minted, right? To your point about the creator. So they've also integrated Zora. What I think is interesting here is it's just feels like it's a coming together of a whole bunch of narratives from like circa 2015 2016 for Ethereum. So you got money, okay, that's obviously stable coins. That's um ether the asset. You have identity. So they've integrated ENS in this thing. So you have one single identity. You also have social. So this is the forecaster platform. That's a little web 3. And then you also have the ability to create mint post. That's that's uh the creator economy stuff. You have markets. So you got Uniswap in here. Very easy to trade things. You've got all of the dexes in here. And then you've got the communication uh protocol XMTP which is decentralized permissionless communication. And they slapped it all together in a nice polished retailfriendly uh userfriendly front end. So, this is like this almost feels like the contours of crypto\n\n\n's version of a super app of an everything app. I haven't used this yet, so I'm looking at videos at this point in time, but I could see some potential here. I could see it all coming together.\n\nYeah. Yeah, it is definitely like a dream come true from very early narratives up to like 2021, 2022 on Train Social like you said. I was listening to this presentation and I was like, I don't think this app is for me. Like I'm still yet to become a post collector or things of that nature. Uh, and this is I feel like this is kind of like a shared sentiment. Like I want Coinbase to do this and to win and to make this a reality and to take onchain social mainstream and to have like collecting content and the creator economy. I want that to work. It doesn't work for me and I don't think my last time you been on Farcaster has it been on uh well I was perusing through this um uh the this app yesterday not on my phone but on a friend's phone who had the access to it.\n\nIt's like Farcaster's kind of putting it together. Uh I go on Farcaster and I enjoy it. I also feel like it's somewhat overwhelming uh with all of kind of the mini app experience but it's evolving very fast. I I don't know. I mean I think it might be for you David. Maybe not yet, but coin the creator economy and coining content. And I don't you don't want to coin your post. Look at this post. This is a perfect kind of post to coin. This is uh Brian Armstrong and Jesse Pollock from Base doing a little fist bump handshake kind of exchange here. That was a nice moment.\n\nAnd I think they are going to coin that on on the uh the Coinbase Base app. So there you go. I'm I'm not totally I'm I'm supportive of Jesse and I want him to win. I' I have not been coining content pill.\n\nYou haven't been you coined any content yet?\n\nI have not. Uh no, I have not.\n\nWhat do we got coming up, man?\n\nComing up next, Crypto Week in DC, the Genius Bill. We're going to talk about that. We talked about it at the intro. Uh and then also PUMP ICO just became the world's third largest ICO to ever come out of crypto. We're going to talk about all that details and more. But first, a message from some of these fantastic sponsors that make the show possible like FRA and their FRA stable coins. It's got some of the best deals in DeFi. It's kind of like Circle Athena, Make It Out, all have a baby. But if they also had a layer 2 as well. Let's go hear from FRA right now. In the wild west of DeFi, stability and innovation are everything, which is why you should check out FRA Finance. The protocol revolutionizing stable coins, DeFi, and Rolex. The core of FRA Finance is FRAUSD, which is backed by Black Rock's institutional bidd. Frack designed FRAUSD for best-in-class yields across DeFi, T bills, and carry trade returns allinone. Just head to fra.com, then stake it to earn some of the best yields in DeFi. Want even more? Bridge your FRA USD over to the Fractal layer 2 for the same yield plus Fractal points and explore Fractal's diverse layer 2 ecosystem with protocols like Curve, Convex, and more. All rewarding early adopters. FRA isn't just a protocol. It's a digital nation powered by the FXS token and governed by its global community. Acquire FXS through fra.com or your go-to decks. Stake it and help shape FRA Nation's future. Ready to join the forefront of DeFi? Visit fra.com now to start earning with FRAUSD and staked FRAUSD. And for BANKLESS listeners, you can use fra.com/r/bankless when bridging to Fraal for exclusive Fraal perks and boosted rewards. Binance is the world's number one crypto exchange. Over 275 million users already trust their worldclass security. Binance makes starting crypto as simple as it should be. Whether it's learning about crypto on Binance Academy or browsing hundreds of assets and viewing your newly created portfolio in a clear, easy to track dashboard, Binance helps you go at your own pace. For hardcore traders, Binance Pro opens up industryleading services for trading professionals with fully bespoke trading products along with a suite of white gloved services for VIP and institutional clients. Need support? 24/7 customer service is on hand whenever you need it. And with some of the lowest fees and deepest liquidity in the market, it's no surprise why over 275 million users trust Binance for everything crypto. Download Binance today and get started in minutes. Binance is not available in certain countries, including the United States. Check its terms for more information.\n\nIt was crypto week in DC. That's what Trump declared. This is uh Bo Hine. So, he's an executive director in the president's council, a council of adviser basically for crypto. He said huge week ahead. It's crypto week in the house. Genius heads to the president's desk. That's is a genius bill. Clarity. Another bill moves to the Senate. Time to make America the crypto capital of the world. Donald Trump echoed those sentiments. You know what? We should start with the the genius bill itself. Of course, you guys know we've talked about this for a long time. That is the landmark stable coin bill that passed in the Senate with a decent majority, even got some Democrat support, and is now in the House. Okay. by the time that um you are listening to this, I am predicting I think you are probably predicting David that that will have passed. So assuming that's true, we have the first stable coin act, the first largest uh legislative action out of Congress for crypto ever and this is a milestone moment. I do think Scott Besson is right. The passage of this bill, we're going to see trillions in stable coins on chain. Okay, Scott Bessant echoed sentiments of three trillion by 2030. So that in it of itself is significant. Um there was last minute some some jockeying around. They tried to package all of these bills together. There were actually three bills. There was the the genius bill. There was the clarity act as well that's you know defining what the difference between a commodity and a security with respect to crypto is. And then there was like an anti- central bank digital currency bill of some sort. And some people wanted to package all of these things together. And so you know it was difficult to get all of the Republicans on board last minute. So, you know, Trump tried to knock some heads together in his own party and get some of the those that were uh that were not voting yes to actually vote yes. So, that's probably happened right now, which means huge progress for crypto in the US. So, while this was going on, there was also a campaign by some Democrats. Um, this is Representative Maxine Waters. She actually announced an anti-cryptocrion week and uh she said, \"I'm sounding the alarm in MSNBC. She wrote an op-ed about this. GOP crypto bills don't just fail to protect uh consumers, they greenlight Trump's billion-dollar cryptog invite the next financial crisis. I think I'm kind of with her on the first part. There's a little bit of a grift going on. I don't know about the second part. And I want to play this clip for you, David. This is Elizabeth Warren on the Genius Act in some of these bills.\n\nGuard rails to make sure that crypto as it is to blow up our entire economy. So, I'm very worried about that. But I want to add one more twist and that is the clarity bill has all those problems but it also has a provision in it that would let any company listed on the New York Stock Exchange opt out of SEC regulation by just digitizing themselves. put themselves on the blockchain and all of a sudden it turns out that Amazon or Meta or General Motors is no longer governed by the SEC.\n\nYou can just put yourself on the blockchain and then all the rules just go away. That's how it works.\n\nYou can just digitize yourself.\n\nDo you hear what she said? That could literally blow up the value of the New York Stock Exchange. All right. You know, I that's why that's why I'm in crypto because I understand that if I'm on if I'm just on the blockchain, then no rules apply to me.\n\nThat's that's what I'm here for.\n\nHe's he's he's being sarcastic. Okay, in case this gets clipped, you just digitize yourself and you put yourself on the blockchain and then you get to be God. I just I'm just kind of annoyed at the doubling down of a clearly on a clearly losing position. Talk about the anti-corruption, that's fine. But to to talk about crypto as if it's going to blow up US capital markets, that is just crazy at this point.\n\nYeah. I before crypto before Elizabeth Warren came after crypto, my f my family was very pro lives with Warren. I'm like, \"Oh, okay, sure.\" She's like anti- big banks. I'm like kind of into that. Uh and then when she goes on crypto, I'm like, \"Oh, wait. You're just lying about stuff. You're just lying through your teeth. None of that's true.\" And now I can't trust anything that you say ever. And now whenever my family is talking about Elizabeth Warren, I'm like, \"Bro, she's a snake. How is she Why are you guys supporting her?\"\n\nYeah, it's pretty disappointing, I think, to uh to some that are watching this. Um David, tell me about the PUMP ICO because I don't think disappointing is the word we would use for that.\n\nUh actually, uh some people are disappointed about that actually. Yeah, it started paying attention.\n\nYeah, this is See, this is why I'm learning this actually. Okay, it started off pretty good. Uh, and we are now down a decent bit. So, we are coming in at a $2 billion market cap.\n\nOh, wow. Wait, really? Bull down that much?\n\nNo, no, no, no, no. Yeah, market cap $5.6 billion fully diluted. Okay, so they're doing fine.\n\nThey're doing fine.\n\nWell, why are people just I the way I saw this was basically they had an ICO on Chain. It was a successful ICO. It was filled in like I don't know 6 minutes or something like this. You tell me. 12 minutes. Okay.\n\nAnd a chain didn't go down. Some of this activity happened on exchanges. Some of this happened on Solana.\n\nThere is like some sort of a revshare component. It's not 100% but they announced they started doing their initial buybacks and then the token pumped up to its like now current all-time highs. Uh which I mean the token is actually not volatile. I remember talking about how it's going to be volatile. I was actually wrong about that. The token price has become pretty is very liquid and it's pretty stable in the grand scheme of things. Okay. So why are people mad? Who's mad?\n\nUm well because it gone it went down. It went down 10% while ETH went up 20%.\n\nOkay.\n\nAnd so like it didn't track I I don't think you actually tracked beta. If you if you did the ICO, I think you're okay. But since launch, it hasn't done anything. So I think people's expectations are are dashed. Uh just to put out some stats, this makes PUMP the third largest ICO in history. Uh raised $600 million. EOS is number one. No one's ever going to beat that. Uh $4.1 billion in 2017. That was also crime. Uh, Telegram did $1.7 billion in 2019 and now uh PUMP is now number three at $600 million. Um, I mean there's a lot more stats here. Overall, I think uh it's successful and the the buyback is pretty cool and we could see more of that. Um, but I think people were were having higher expectations than what happened. Um, I do have some breaking news, Ryan, stuff that's not in the agenda. So, we're actually going to go back into Ethereum uh conversation because uh BlackRock's Eyesshares ETH treasury just filed for ETH staking uh while we're recording. So, they have filed to have ETH ETF ETH in the ETH ETF. The ETH ETH A the BlackRock EyesShares for for the ETH ETF filed for staking and BlackRock gets what it wants.\n\nThat that that's not going to help the ETH pump ratio there, David. So, uh, you know, I guess the ETH pump ratio.\n\nYes.\n\nAre you looking at the ETH pump ratio?\n\nNo, dude. You you made reference to it. I'm trying to riff off something you did. Also, Binance doing a um a uh what what is this?\n\nYeah, Binance is doing Launchpad. Okay. Actually, maybe perhaps one of the reasons why PUMP hasn't had the solid performance is this other launchpad called Bonk continues to maintain volumes against PUMP. And so it's taken a little bit of um of the wind out of the sales of PUMP. And then also Binance has unveiled its own launchpad on BNB chain 4. Meme number four.\n\nForme meme is now the pump fund of of BNB. And so that's out there. And then Ryan, I'm going to read you a headline and you're going to guess what year it's from.\n\nSnoop Dogg sells $12 million of NFTs in 30 minutes. What year is this headline from?\n\nYeah, I mean that I know it's now. That just happened this week, but if I were to hear that in isolation, that would be so, you know, 2021 coded.\n\nThat's what was happening all of the time.\n\nSo, this was on the TON blockchain, and this is part of the sticker pack. So, the stickers you can use in Telegram can be like unique fungeable assets, nonfgeible assets. Uh the tokens in the collection included vintage cars, swag bags, a digital dog, a marijuana related objects of course, and a mix of other items and symbols. Uh there so it's a Telegram gift that people can purchase and uh because it was on Ton, it's integrated into Telegram. Yeah. $12 million in 30 minutes by selling stickers, NFT stickers on Telegram.\n\nI'm not feeling bullish on the JPEGs these days, David. You know, it was you're not you're not a buyer of a of a lit blunt, Ryan. It's a hard It's been a hard four years on the lit blunts uh JPEGs. Okay, so I'm gonna wait this one out. I'm gonna let other people go first. Um David, this was actually big. Okay, this is Shane Copin. Do you remember it was what is it just like November? It was November of last year because it was just right before the election. Yeah, no, it\n\n\nIt was eight days after the election. Okay, after the election. So Shane Copan from the founder of Polymarket, the FBI just showed up at his apartment. I believe he's in New York. Busted in without due process, without a warrant, busted in, uh, arrested him and took a whole bunch of his equipment, including his phone. Yeah, including his phone. This is the founder of Polymarket. Obviously, we talk about Polymarket all the time. Incredibly successful prediction market. This is a startup founder in the US. Okay, an update on that story. This is from Shane. Eight months ago on election night, we were on top of the world after Polymarket called the election. You remember that? Eight days later, the FBI broke down my door at 6:00 a.m. and took all of my computers and phones, looking for anything that could imply foul play. While traumatic, it etched the story of Polymarket's accuracy and enduring resistance into the history of American politics. And today, here's the news part. I'm happy to announce that this, uh, this chapter of the story is over. After cooperating and engaging, we've been cleared of any wrongdoing. Justice prevailed.\n\nOkay, so the FBI was like, \"Oops, sorry. You didn't actually do anything. But what kind of evidence did they have busting into his house at 6:00 a.m. in the morning and confiscating all of his stuff? Is that not crazy to you? And let me ask you this. Do you think that the outcome of this investigation would have been different under a different, uh, president?\n\nI don't know. I don't know how to think about that. I don't want to think about that. It doesn't make me feel good to think about that. I do enjoy the juxtaposition of an application that speaks truth to power gets, uh, harassed by the FBI, and then they just have to, the FBI just has to let him go and be like, you did nothing wrong. Uh, but like this, this technology that's anti-authoritarian gets authoritarian, like the eye of Sauron gets pointed straight at Shane Copan, and then because at least we're in a good country with the good court system, Shane gets through that process and it's just completely Scott clear. Brian Armstrong says this was one of the most egregious examples of law affair from the last administration that should never have been possible in America. Imagine having your door broken down for predicting an election. The onus was on the government to prove, to prove there was something worth pursuing here, and they failed to do that. This is how you lose trust in institutions.\n\nUh, all right. So that's good news though. He was exonerated. Shane Copelan. We got another trial that started this week. Uh, this is the trial of Roman Storm, the Tornado Cash, uh, trial. And as you'll recall, Roman Storm faces charges of conspiracy to commit money laundering, conspiracy to violate US sanctions, conspiracy to operate an unlicensed money transmitting business at a maximum sentence of 45 years in prison. 45 years, David, the stakes are incredibly high. Roman Storm raised a whole bunch of funds from the crypto community. He still needs more, I believe, because this trial is going even longer than everyone suspected. Um, there is a judge in the case, uh, Katherine Pula FA. She is not exactly cryptofavorable. Okay. Not exactly, it seems like favorable to, um, to Roman Storm's case. Of course, we don't know for sure, but this has been indicated from some of the pre-trial, uh, statements and some of the things she allowed in the trial and things she didn't. So the prosecution, this is the, the government in this case is, um, alleging and and trying to prove that, um, Roman Storm turned a blind eye or he enabled some of the criminal activity that happened on Tornado Cash. Whereas the defense is of course saying no, this is a decentralized open protocol. Roman Storm had no ability, no control over how third parties would actually use it. This is similar to, you know, HTTPS, the internet, cryp cryptography, criminals, good guys can use it. It's a tool. Bad guys can use it as well. Uh, and this case is is ongoing.\n\nSo, like Brian said, this court case has just started. So, we're going to be continuing to watch this and we'll provide updates probably towards the end of every weekly roll up moving forward just to keep an eye on this. I don't feel like anyone really knows what the outcome here is, which is kind of the scary thing. The fact that this is like close at all, uh, to Roman Storm losing is automatically scary. Uh, it definitely definitely doesn't deserve to, to have anything happen to him. Uh, and so it's something that we're going to be keeping an eye on, uh, moving forward over the next four weeks, I think, is how long this case it's expected to to take. So, uh, we wish the best for Roman Storm, and we'll provide more updates as they come. Guys, we got to end with this. Of course, you know, even though it's been bullish on the week, none of this has been financial advice. Crypto is risky. You could lose what you put in, but we are headed west. This is the frontier. It's not for everyone, but we're glad you're with us on the bankless journey. Thanks a lot.\n[Music]\n",
  "metadata": {
    "summary": "The episode dives into the latest happenings in the crypto world, including Bitcoin's new all-time high and Ethereum's growing institutional interest. It highlights key developments such as Base's new \"everything app,\" the trend of Bitcoin miners viewing ETH as a treasury asset, and updates on macroeconomic factors. The discussion also touches on the Roman Storm trial and the implications of regulatory bills. The episode also covers the news of Tom Lee's goal of acquiring 5% of ETH supply.",
    "topClaims": [
      {
        "text": "Tom Lee wants to buy 5% of all ETH supply, which is like 6 million ETH, and he is not anywhere close to that.",
        "rating": 8.5,
        "chunkId": "ck-eFohaNktKLs-1"
      },
      {
        "text": "Bitcoin miners have to sell their ETH.",
        "rating": 7.8,
        "chunkId": "ck-eFohaNktKLs-10"
      },
      {
        "text": "I'm very worried about crypto blowing up the entire economy, but the clarity bill could let companies opt out of SEC regulation.",
        "rating": 7.2,
        "chunkId": "ck-eFohaNktKLs-41"
      },
      {
        "text": "The FBI broke down my door at 6:00 a.m. and took all of my computers and phones, looking for anything that could imply foul play.",
        "rating": 9.1,
        "chunkId": "ck-eFohaNktKLs-47"
      }
    ],
    "topQuotes": [
      {
        "text": "We got another all-time high week back to back, but I do feel like all eyes are on ETH this week.",
        "chunkId": "ck-eFohaNktKLs-1",
        "chunkNum": 1,
        "relevance": 9.2,
        "interesting": 8.9
      },
      {
        "text": "Bitcoin miners have to sell their ETH to pay for expenses because it's very competitive, very low margins.",
        "chunkId": "ck-eFohaNktKLs-11",
        "chunkNum": 11,
        "relevance": 8.1,
        "interesting": 7.5
      },
      {
        "text": "I'm very worried about crypto blowing up the entire economy, but the clarity bill could let companies opt out of SEC regulation.",
        "chunkId": "ck-eFohaNktKLs-41",
        "chunkNum": 41,
        "relevance": 7.3,
        "interesting": 6.8
      },
      {
        "text": "The FBI broke down my door at 6:00 a.m. and took all of my computers and phones, looking for anything that could imply foul play.",
        "chunkId": "ck-eFohaNktKLs-47",
        "chunkNum": 47,
        "relevance": 9.8,
        "interesting": 9.5
      }
    ],
    "topTopics": [
      {
        "name": "bitcoin price",
        "count": 12,
        "description": "Bitcoin's price and market behavior"
      },
      {
        "name": "ethereum eth",
        "count": 10,
        "description": "Ethereum's market performance and trends"
      },
      {
        "name": "base app",
        "count": 7,
        "description": "Coinbase's new application"
      },
      {
        "name": "bitcoin miners",
        "count": 6,
        "description": "Bitcoin miners' financial strategies"
      },
      {
        "name": "crypto week",
        "count": 5,
        "description": "Regulatory developments in crypto"
      }
    ],
    "videoInfo": {
      "id": "eFohaNktKLs",
      "etag": "_2bh0MoRjF8PkD_TPkcVMcQMSsY",
      "kind": "youtube#video",
      "snippet": {
        "title": "ETH Breaks New Records While BTC Hits ANOTHER All Time High",
        "channelId": "UCAl9Ld79qaZxp9JzEOwd3aA",
        "localized": {
          "title": "ETH Breaks New Records While BTC Hits ANOTHER All Time High",
          "description": "SPOTIFY PREMIUM RSS FEED | USE CODE: SPOTIFY24\nhttps://bankless.cc/spotify-premium\n\n-\nWere celebrating \"Crypto Week\" as declared by Trump amid the introduction of key regulatory bills.\n\nBut perhaps more importantly, Bitcoin's new all-time high, Ethereum's rising institutional interest, and Tom Lee's goal of acquiring 5% of ETH supply.\n\nHighlights include Base's new \"everything app,\" the trend of Bitcoin miners viewing ETH as a treasury asset, and updates on macroeconomic factors and the Roman Storm trial. This is the hottest news in crypto.\n\n---\nBANKLESS SPONSOR TOOLS:\n\nFRAX | SELF SUFFICIENT DeFi\nhttps://bankless.cc/Frax\n\nUNISWAP | SWAP ON UNICHAIN\nhttps://bankless.cc/unichain\n\nMANTLE | MODULAR LAYER 2 NETWORK\nhttps://bankless.cc/Mantle\n\nBINANCE | THE WORLDS #1 CRYPTO EXCHANGE\nhttps://bankless.cc/binance\n\n COINGECKO API | REAL-TIME CRYPTO PRICE & MARKET DATA\nhttps://bankless.cc/coingecko\n\n---\nTIMESTAMPS\n\n0:00 Trumps Crypto Week\nhttps://x.com/KobeissiLetter/status/1945144093350207624\n\n2:30 Bankless Summit\nhttps://lu.ma/0ph1qg6c\n\n3:50 MARKETS\nhttps://www.coingecko.com/en/coins/bitcoin\nhttps://x.com/WatcherGuru/status/1944663480755458526\nhttps://x.com/EricBalchunas/status/1943664470032576876\nhttps://x.com/glassnode/status/1943661049783431240\nhttps://x.com/glassnode/status/1943661049783431240\nhttps://x.com/ercwl/status/1944759201441477040\nhttps://x.com/jacqmelinek/status/1943373069063786953\n\n9:30 ETH\nhttps://www.coingecko.com/en/coins/ethereum\nhttps://x.com/RyanSAdams/status/1945180957033546069\nhttps://x.com/RyanSAdams/status/1945852323651022910\nhttps://x.com/coinbaseduck/status/1945217164442489220\nhttps://farside.co.uk/btc/\nhttps://farside.co.uk/eth/\nhttps://x.com/NateGeraci/status/1945665209529675794\nhttps://x.com/sassal0x/status/1945662874216788060\n\n16:00 Macro, Inflation, Powell\nhttps://www.cnbc.com/2025/07/15/cpi-inflation-report-june-2025.html\nhttps://polymarket.com/event/us-recession-in-2025\nhttps://x.com/KobeissiLetter/status/1945122105051185367\nhttps://x.com/KobeissiLetter/status/1945507837817303243\nhttps://x.com/BulwarkOnline/status/1945516462199673329\nhttps://polymarket.com/event/will-trump-remove-jerome-powell\n\n23:40 ETH Treasuries to $1B+ (BMNR, SBET, HYPE)\nhttps://www.strategicethreserve.xyz/\nhttps://x.com/maxxTFSA/status/1945828721321037966\nhttps://x.com/RyanSAdams/status/1945263091656057078\nhttps://x.com/bitmnr/status/1944743816986051049\nhttps://www.strategicethreserve.xyz/\nhttps://x.com/JoshwaaaDixon/status/1945851138407792793\nhttps://www.coindesk.com/markets/2025/07/08/ether-treasury-firm-btcs-surges-100-on-100m-eth-buying-plan\nhttps://x.com/HyperliquidNews/status/1944704235926434125\nhttps://x.com/ThinkingUSD/status/1944719934128279669\nhttps://x.com/matthuang/status/1944730866858799166\nhttps://x.com/Crypto_McKenna/status/1944706319207845958\n\n35:44 Coinbases Base App\nhttps://x.com/baseapp/status/1945609622913757190\nhttps://x.com/defiignas/status/1945793215665197468\nhttps://x.com/base/status/1945624674656030985\nhttps://x.com/brian_armstrong/status/1945676446204412244\nhttps://join.base.app/\nhttps://x.com/brian_armstrong/status/1943300747635925246\n\n42:40 Crypto Week in Congress\nhttps://x.com/BoHines/status/1943728972505714724\nhttps://x.com/RepMaxineWaters/status/1945151846433140920\nhttps://x.com/watcherguru/status/1945667844219277644\nhttps://x.com/campbelljaustin/status/1945857868734816662\nhttps://x.com/zGuz/status/1945682848054174091\n\n47:00 PUMP ICO\nhttps://x.com/pumpdotfun/status/1944043746292584849\nhttps://x.com/0xSharples/status/1944111013973876989?1\nhttps://www.coingecko.com/en/coins/pump-fun\nhttps://x.com/hyperstitionHQ/status/1945425882245710186\nhttps://blockworks.co/news/pump-fun-buybacks-axiom-competitor\nhttps://www.binance.com/en/support/announcement/detail/29d8942bfcd0472890c00d30d6b2676c\nhttps://www.binance.com/en/support/announcement/detail/29d8942bfcd0472890c00d30d6b2676c\n\n50:05 Snoop Dogg NFTs\nhttps://cointelegraph.com/news/snoop-dogg-nft-collection-telegram-ton-blockchain-sold-out\nhttps://x.com/durov/status/1943077902817411292\n\n51:20 Polymarket Cleared by DOJ\nhttps://x.com/shayne_coplan/status/1945146324271218767\nhttps://x.com/brian_armstrong/status/1945156692041457747\n\n53:50 Roman Storm Trial Starts\nhttps://www.theblock.co/post/362625/tornado-cash-roman-storm-trial-laundering\nhttps://x.com/realDannyNelson/status/1944824924838793454\nhttps://www.coindesk.com/policy/2025/07/16/hack-victims-say-tornado-cash-offered-no-help-in-the-wake-of-exploits-day-2-of-roman-storm-trial\n\n---\nNot financial or tax advice. See our investment disclosures here:\nhttps://www.bankless.com/disclosures"
        },
        "categoryId": "24",
        "thumbnails": {
          "high": {
            "url": "https://i.ytimg.com/vi/eFohaNktKLs/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/eFohaNktKLs/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/eFohaNktKLs/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "default": {
            "url": "https://i.ytimg.com/vi/eFohaNktKLs/default.jpg",
            "width": 120,
            "height": 90
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/eFohaNktKLs/sddefault.jpg",
            "width": 640,
            "height": 480
          }
        },
        "description": "SPOTIFY PREMIUM RSS FEED | USE CODE: SPOTIFY24\nhttps://bankless.cc/spotify-premium\n\n-\nWere celebrating \"Crypto Week\" as declared by Trump amid the introduction of key regulatory bills.\n\nBut perhaps more importantly, Bitcoin's new all-time high, Ethereum's rising institutional interest, and Tom Lee's goal of acquiring 5% of ETH supply.\n\nHighlights include Base's new \"everything app,\" the trend of Bitcoin miners viewing ETH as a treasury asset, and updates on macroeconomic factors and the Roman Storm trial. This is the hottest news in crypto.\n\n---\nBANKLESS SPONSOR TOOLS:\n\nFRAX | SELF SUFFICIENT DeFi\nhttps://bankless.cc/Frax\n\nUNISWAP | SWAP ON UNICHAIN\nhttps://bankless.cc/unichain\n\nMANTLE | MODULAR LAYER 2 NETWORK\nhttps://bankless.cc/Mantle\n\nBINANCE | THE WORLDS #1 CRYPTO EXCHANGE\nhttps://bankless.cc/binance\n\n COINGECKO API | REAL-TIME CRYPTO PRICE & MARKET DATA\nhttps://bankless.cc/coingecko\n\n---\nTIMESTAMPS\n\n0:00 Trumps Crypto Week\nhttps://x.com/KobeissiLetter/status/1945144093350207624\n\n2:30 Bankless Summit\nhttps://lu.ma/0ph1qg6c\n\n3:50 MARKETS\nhttps://www.coingecko.com/en/coins/bitcoin\nhttps://x.com/WatcherGuru/status/1944663480755458526\nhttps://x.com/EricBalchunas/status/1943664470032576876\nhttps://x.com/glassnode/status/1943661049783431240\nhttps://x.com/glassnode/status/1943661049783431240\nhttps://x.com/ercwl/status/1944759201441477040\nhttps://x.com/jacqmelinek/status/1943373069063786953\n\n9:30 ETH\nhttps://www.coingecko.com/en/coins/ethereum\nhttps://x.com/RyanSAdams/status/1945180957033546069\nhttps://x.com/RyanSAdams/status/1945852323651022910\nhttps://x.com/coinbaseduck/status/1945217164442489220\nhttps://farside.co.uk/btc/\nhttps://farside.co.uk/eth/\nhttps://x.com/NateGeraci/status/1945665209529675794\nhttps://x.com/sassal0x/status/1945662874216788060\n\n16:00 Macro, Inflation, Powell\nhttps://www.cnbc.com/2025/07/15/cpi-inflation-report-june-2025.html\nhttps://polymarket.com/event/us-recession-in-2025\nhttps://x.com/KobeissiLetter/status/1945122105051185367\nhttps://x.com/KobeissiLetter/status/1945507837817303243\nhttps://x.com/BulwarkOnline/status/1945516462199673329\nhttps://polymarket.com/event/will-trump-remove-jerome-powell\n\n23:40 ETH Treasuries to $1B+ (BMNR, SBET, HYPE)\nhttps://www.strategicethreserve.xyz/\nhttps://x.com/maxxTFSA/status/1945828721321037966\nhttps://x.com/RyanSAdams/status/1945263091656057078\nhttps://x.com/bitmnr/status/1944743816986051049\nhttps://www.strategicethreserve.xyz/\nhttps://x.com/JoshwaaaDixon/status/1945851138407792793\nhttps://www.coindesk.com/markets/2025/07/08/ether-treasury-firm-btcs-surges-100-on-100m-eth-buying-plan\nhttps://x.com/HyperliquidNews/status/1944704235926434125\nhttps://x.com/ThinkingUSD/status/1944719934128279669\nhttps://x.com/matthuang/status/1944730866858799166\nhttps://x.com/Crypto_McKenna/status/1944706319207845958\n\n35:44 Coinbases Base App\nhttps://x.com/baseapp/status/1945609622913757190\nhttps://x.com/defiignas/status/1945793215665197468\nhttps://x.com/base/status/1945624674656030985\nhttps://x.com/brian_armstrong/status/1945676446204412244\nhttps://join.base.app/\nhttps://x.com/brian_armstrong/status/1943300747635925246\n\n42:40 Crypto Week in Congress\nhttps://x.com/BoHines/status/1943728972505714724\nhttps://x.com/RepMaxineWaters/status/1945151846433140920\nhttps://x.com/watcherguru/status/1945667844219277644\nhttps://x.com/campbelljaustin/status/1945857868734816662\nhttps://x.com/zGuz/status/1945682848054174091\n\n47:00 PUMP ICO\nhttps://x.com/pumpdotfun/status/1944043746292584849\nhttps://x.com/0xSharples/status/1944111013973876989?1\nhttps://www.coingecko.com/en/coins/pump-fun\nhttps://x.com/hyperstitionHQ/status/1945425882245710186\nhttps://blockworks.co/news/pump-fun-buybacks-axiom-competitor\nhttps://www.binance.com/en/support/announcement/detail/29d8942bfcd0472890c00d30d6b2676c\nhttps://www.binance.com/en/support/announcement/detail/29d8942bfcd0472890c00d30d6b2676c\n\n50:05 Snoop Dogg NFTs\nhttps://cointelegraph.com/news/snoop-dogg-nft-collection-telegram-ton-blockchain-sold-out\nhttps://x.com/durov/status/1943077902817411292\n\n51:20 Polymarket Cleared by DOJ\nhttps://x.com/shayne_coplan/status/1945146324271218767\nhttps://x.com/brian_armstrong/status/1945156692041457747\n\n53:50 Roman Storm Trial Starts\nhttps://www.theblock.co/post/362625/tornado-cash-roman-storm-trial-laundering\nhttps://x.com/realDannyNelson/status/1944824924838793454\nhttps://www.coindesk.com/policy/2025/07/16/hack-victims-say-tornado-cash-offered-no-help-in-the-wake-of-exploits-day-2-of-roman-storm-trial\n\n---\nNot financial or tax advice. See our investment disclosures here:\nhttps://www.bankless.com/disclosures",
        "publishedAt": "2025-07-18T10:30:38Z",
        "channelTitle": "Bankless",
        "defaultAudioLanguage": "en",
        "liveBroadcastContent": "none"
      },
      "statistics": {
        "likeCount": "133",
        "viewCount": "1679",
        "commentCount": "12",
        "favoriteCount": "0"
      },
      "contentDetails": {
        "caption": "false",
        "duration": "PT56M28S",
        "dimension": "2d",
        "definition": "hd",
        "projection": "rectangular",
        "contentRating": {},
        "licensedContent": false
      }
    },
    "checkCount": 1,
    "nodeCounts": [
      {
        "node": "eth",
        "count": 11
      },
      {
        "node": "bitcoin",
        "count": 8
      },
      {
        "node": "trump",
        "count": 6
      },
      {
        "node": "eth-price",
        "count": 4
      },
      {
        "node": "bitcoin-miners",
        "count": 4
      },
      {
        "node": "staking-eth",
        "count": 4
      },
      {
        "node": "creator-economy",
        "count": 4
      },
      {
        "node": "crypto-week",
        "count": 3
      },
      {
        "node": "markets",
        "count": 3
      },
      {
        "node": "pump-ico",
        "count": 3
      },
      {
        "node": "eth-supply",
        "count": 3
      },
      {
        "node": "stable-coins",
        "count": 3
      },
      {
        "node": "polymarket",
        "count": 3
      },
      {
        "node": "eth-treasury-race",
        "count": 3
      },
      {
        "node": "farcaster",
        "count": 3
      },
      {
        "node": "telegram",
        "count": 3
      },
      {
        "node": "crypto",
        "count": 3
      },
      {
        "node": "shane-copan",
        "count": 3
      },
      {
        "node": "clarity-act",
        "count": 2
      },
      {
        "node": "ethereum",
        "count": 2
      },
      {
        "node": "coinbase",
        "count": 2
      },
      {
        "node": "eth-treasury-companies",
        "count": 2
      },
      {
        "node": "dev-connect",
        "count": 2
      },
      {
        "node": "-19000",
        "count": 2
      },
      {
        "node": "fomo",
        "count": 2
      },
      {
        "node": "eth-etf-inflows",
        "count": 2
      },
      {
        "node": "bitcoin-treasuries",
        "count": 2
      },
      {
        "node": "bitcoin-mining",
        "count": 2
      },
      {
        "node": "eth-rewards",
        "count": 2
      },
      {
        "node": "eth-stakers",
        "count": 2
      },
      {
        "node": "all-time-highs",
        "count": 2
      },
      {
        "node": "tariffs",
        "count": 2
      },
      {
        "node": "powell",
        "count": 2
      },
      {
        "node": "uniswap",
        "count": 2
      },
      {
        "node": "micro-strategy",
        "count": 2
      },
      {
        "node": "edgar-filings",
        "count": 2
      },
      {
        "node": "eth-reserve",
        "count": 2
      },
      {
        "node": "hype-token",
        "count": 2
      },
      {
        "node": "onchain-social",
        "count": 2
      },
      {
        "node": "ens",
        "count": 2
      },
      {
        "node": "super-app",
        "count": 2
      },
      {
        "node": "brian-armstrong",
        "count": 2
      },
      {
        "node": "binance",
        "count": 2
      },
      {
        "node": "elizabeth-warren",
        "count": 2
      },
      {
        "node": "ico",
        "count": 2
      },
      {
        "node": "pump",
        "count": 2
      },
      {
        "node": "bankless-nation",
        "count": 1
      },
      {
        "node": "bankless-weekly-rollup",
        "count": 1
      },
      {
        "node": "bankless",
        "count": 1
      },
      {
        "node": "etfs",
        "count": 1
      },
      {
        "node": "robin-hood",
        "count": 1
      },
      {
        "node": "marketing-campaigns",
        "count": 1
      },
      {
        "node": "steve-jobses",
        "count": 1
      },
      {
        "node": "polymarket-fbi-raid",
        "count": 1
      },
      {
        "node": "bankless-summit",
        "count": 1
      },
      {
        "node": "donna-l2b",
        "count": 1
      },
      {
        "node": "native-roll-ups",
        "count": 1
      },
      {
        "node": "justin-drake",
        "count": 1
      },
      {
        "node": "ted-talks-ethereum",
        "count": 1
      },
      {
        "node": "bonosaris",
        "count": 1
      },
      {
        "node": "maker-dow",
        "count": 1
      },
      {
        "node": "open-zeppelin",
        "count": 1
      },
      {
        "node": "crypto-person",
        "count": 1
      },
      {
        "node": "malbeck",
        "count": 1
      },
      {
        "node": "bitcoin-price",
        "count": 1
      },
      {
        "node": "bitcoin-crash",
        "count": 1
      },
      {
        "node": "-122800",
        "count": 1
      },
      {
        "node": "-116000",
        "count": 1
      },
      {
        "node": "-123000",
        "count": 1
      },
      {
        "node": "-121000",
        "count": 1
      },
      {
        "node": "institutional-bid",
        "count": 1
      },
      {
        "node": "blackrock-ibit",
        "count": 1
      },
      {
        "node": "bitcoin-etf",
        "count": 1
      },
      {
        "node": "80-billion-aum",
        "count": 1
      },
      {
        "node": "nearest-competitors",
        "count": 1
      },
      {
        "node": "crypto-assets",
        "count": 1
      },
      {
        "node": "nupl",
        "count": 1
      },
      {
        "node": "froth-market",
        "count": 1
      },
      {
        "node": "bitcoin-holders",
        "count": 1
      },
      {
        "node": "rainbow-chart",
        "count": 1
      },
      {
        "node": "rainbow-price-chart",
        "count": 1
      },
      {
        "node": "accumulation-zone",
        "count": 1
      },
      {
        "node": "yellows-oranges",
        "count": 1
      },
      {
        "node": "new-denomination",
        "count": 1
      },
      {
        "node": "bitcoin-acceptance",
        "count": 1
      },
      {
        "node": "bloomberg-terminals",
        "count": 1
      },
      {
        "node": "pricing-chart",
        "count": 1
      },
      {
        "node": "bitcoin-value",
        "count": 1
      },
      {
        "node": "cultural-milestone",
        "count": 1
      },
      {
        "node": "bitcoin-million-dollars",
        "count": 1
      },
      {
        "node": "eth-treasury-accumulation",
        "count": 1
      },
      {
        "node": "blackrock-eth-etf",
        "count": 1
      },
      {
        "node": "anthony-cissano",
        "count": 1
      },
      {
        "node": "otc-desks-eth",
        "count": 1
      },
      {
        "node": "wintermute",
        "count": 1
      },
      {
        "node": "nate-jerassi",
        "count": 1
      },
      {
        "node": "bearish",
        "count": 1
      },
      {
        "node": "bullish-interpretation",
        "count": 1
      },
      {
        "node": "anthony-s-tweet",
        "count": 1
      },
      {
        "node": "sell-eth",
        "count": 1
      },
      {
        "node": "eth-minted",
        "count": 1
      },
      {
        "node": "bullish-bitcoin",
        "count": 1
      },
      {
        "node": "eth-staking",
        "count": 1
      },
      {
        "node": "bullish",
        "count": 1
      },
      {
        "node": "eth-accumulation",
        "count": 1
      },
      {
        "node": "eth-monetary-schedule",
        "count": 1
      },
      {
        "node": "eth-issuance",
        "count": 1
      },
      {
        "node": "pump-for-ants",
        "count": 1
      },
      {
        "node": "2021-market",
        "count": 1
      },
      {
        "node": "2020-market",
        "count": 1
      },
      {
        "node": "eip1559",
        "count": 1
      },
      {
        "node": "annual-issuance",
        "count": 1
      },
      {
        "node": "winds-changing-gear",
        "count": 1
      },
      {
        "node": "macro",
        "count": 1
      },
      {
        "node": "macro-world",
        "count": 1
      },
      {
        "node": "bullish-bearish",
        "count": 1
      },
      {
        "node": "crypto-market-cap",
        "count": 1
      },
      {
        "node": "bitcoin-dominance",
        "count": 1
      },
      {
        "node": "trad-world",
        "count": 1
      },
      {
        "node": "3-9-trillion",
        "count": 1
      },
      {
        "node": "cpi-numbers",
        "count": 1
      },
      {
        "node": "inflation",
        "count": 1
      },
      {
        "node": "recession-odds",
        "count": 1
      },
      {
        "node": "recession-fears",
        "count": 1
      },
      {
        "node": "republican-lawmakers",
        "count": 1
      },
      {
        "node": "meme-lord",
        "count": 1
      },
      {
        "node": "jerome-powell",
        "count": 1
      },
      {
        "node": "fire-powell",
        "count": 1
      },
      {
        "node": "spy",
        "count": 1
      },
      {
        "node": "sandp-500",
        "count": 1
      },
      {
        "node": "impartiality",
        "count": 1
      },
      {
        "node": "black-swan",
        "count": 1
      },
      {
        "node": "coinbase-wallet",
        "count": 1
      },
      {
        "node": "uni-chain",
        "count": 1
      },
      {
        "node": "coin-gecko-api",
        "count": 1
      },
      {
        "node": "mantle-banking",
        "count": 1
      },
      {
        "node": "mantle-index-4",
        "count": 1
      },
      {
        "node": "bitmine",
        "count": 1
      },
      {
        "node": "sharplink-gaming",
        "count": 1
      },
      {
        "node": "denominate-dollars",
        "count": 1
      },
      {
        "node": "millions-eth",
        "count": 1
      },
      {
        "node": "6-million-eth",
        "count": 1
      },
      {
        "node": "2-86-",
        "count": 1
      },
      {
        "node": "joseph-le",
        "count": 1
      },
      {
        "node": "esb",
        "count": 1
      },
      {
        "node": "ethereum-foundation",
        "count": 1
      },
      {
        "node": "eth-sale",
        "count": 1
      },
      {
        "node": "joe-luben",
        "count": 1
      },
      {
        "node": "funding-operations",
        "count": 1
      },
      {
        "node": "peter-teal",
        "count": 1
      },
      {
        "node": "eth-purchases",
        "count": 1
      },
      {
        "node": "institutional-money",
        "count": 1
      },
      {
        "node": "esb-dollars",
        "count": 1
      },
      {
        "node": "sbet",
        "count": 1
      },
      {
        "node": "sharlink-chart",
        "count": 1
      },
      {
        "node": "parabola",
        "count": 1
      },
      {
        "node": "weird-spike",
        "count": 1
      },
      {
        "node": "grave-dancing",
        "count": 1
      },
      {
        "node": "float",
        "count": 1
      },
      {
        "node": "orderly-market",
        "count": 1
      },
      {
        "node": "crypto-investors",
        "count": 1
      },
      {
        "node": "sec-filings",
        "count": 1
      },
      {
        "node": "original-holders",
        "count": 1
      },
      {
        "node": "joseph-luben",
        "count": 1
      },
      {
        "node": "eth-people",
        "count": 1
      },
      {
        "node": "price-spike",
        "count": 1
      },
      {
        "node": "bmnr",
        "count": 1
      },
      {
        "node": "ston-season",
        "count": 1
      },
      {
        "node": "bit-digital",
        "count": 1
      },
      {
        "node": "btcs",
        "count": 1
      },
      {
        "node": "bid-digital-founder",
        "count": 1
      },
      {
        "node": "bitcoin-to-eth",
        "count": 1
      },
      {
        "node": "bitcoin-security",
        "count": 1
      },
      {
        "node": "eth-capex",
        "count": 1
      },
      {
        "node": "price-mnav",
        "count": 1
      },
      {
        "node": "premium",
        "count": 1
      },
      {
        "node": "eth-holders",
        "count": 1
      },
      {
        "node": "esbat",
        "count": 1
      },
      {
        "node": "tomley",
        "count": 1
      },
      {
        "node": "sonnet-biootherrapeutics",
        "count": 1
      },
      {
        "node": "paradigm",
        "count": 1
      },
      {
        "node": "hyperlquid",
        "count": 1
      },
      {
        "node": "base-app",
        "count": 1
      },
      {
        "node": "warpcast",
        "count": 1
      },
      {
        "node": "gary-vee",
        "count": 1
      },
      {
        "node": "minting-posts",
        "count": 1
      },
      {
        "node": "creator",
        "count": 1
      },
      {
        "node": "zora",
        "count": 1
      },
      {
        "node": "ethereum-narratives",
        "count": 1
      },
      {
        "node": "ether-asset",
        "count": 1
      },
      {
        "node": "forecaster-platform",
        "count": 1
      },
      {
        "node": "mint-post",
        "count": 1
      },
      {
        "node": "xmtp",
        "count": 1
      },
      {
        "node": "dexes",
        "count": 1
      },
      {
        "node": "post-collector",
        "count": 1
      },
      {
        "node": "mini-app",
        "count": 1
      },
      {
        "node": "coining-content",
        "count": 1
      },
      {
        "node": "jesse-pollock",
        "count": 1
      },
      {
        "node": "fist-bump",
        "count": 1
      },
      {
        "node": "coinbase-base",
        "count": 1
      },
      {
        "node": "fra-finance",
        "count": 1
      },
      {
        "node": "frausd",
        "count": 1
      },
      {
        "node": "fractal-layer-2",
        "count": 1
      },
      {
        "node": "fxs-token",
        "count": 1
      },
      {
        "node": "binance-academy",
        "count": 1
      },
      {
        "node": "bo-hine",
        "count": 1
      },
      {
        "node": "crypto-council",
        "count": 1
      },
      {
        "node": "crypto-capital",
        "count": 1
      },
      {
        "node": "donald-trump",
        "count": 1
      },
      {
        "node": "scott-besson",
        "count": 1
      },
      {
        "node": "stable-coin-trillions",
        "count": 1
      },
      {
        "node": "anti-cbdc-bill",
        "count": 1
      },
      {
        "node": "republicans",
        "count": 1
      },
      {
        "node": "democrats",
        "count": 1
      },
      {
        "node": "maxine-waters",
        "count": 1
      },
      {
        "node": "anti-cryptocrion-week",
        "count": 1
      },
      {
        "node": "gop-crypto-bills",
        "count": 1
      },
      {
        "node": "clarity-bill",
        "count": 1
      },
      {
        "node": "sec",
        "count": 1
      },
      {
        "node": "amazon",
        "count": 1
      },
      {
        "node": "meta",
        "count": 1
      },
      {
        "node": "general-motors",
        "count": 1
      },
      {
        "node": "blockchain",
        "count": 1
      },
      {
        "node": "digitizing",
        "count": 1
      },
      {
        "node": "distrust",
        "count": 1
      },
      {
        "node": "snake",
        "count": 1
      },
      {
        "node": "successful-ico",
        "count": 1
      },
      {
        "node": "token-price",
        "count": 1
      },
      {
        "node": "buybacks",
        "count": 1
      },
      {
        "node": "eos",
        "count": 1
      },
      {
        "node": "solana",
        "count": 1
      },
      {
        "node": "revshare",
        "count": 1
      },
      {
        "node": "volatility",
        "count": 1
      },
      {
        "node": "blackrock",
        "count": 1
      },
      {
        "node": "eth-etf",
        "count": 1
      },
      {
        "node": "bonk",
        "count": 1
      },
      {
        "node": "bnb-chain",
        "count": 1
      },
      {
        "node": "meme-number-four",
        "count": 1
      },
      {
        "node": "snoop-dogg",
        "count": 1
      },
      {
        "node": "nfts",
        "count": 1
      },
      {
        "node": "telegram-gift",
        "count": 1
      },
      {
        "node": "nft-stickers",
        "count": 1
      },
      {
        "node": "selling-stickers",
        "count": 1
      },
      {
        "node": "jpegs",
        "count": 1
      },
      {
        "node": "lit-blunt",
        "count": 1
      },
      {
        "node": "shane-copin",
        "count": 1
      },
      {
        "node": "ton",
        "count": 1
      },
      {
        "node": "fbi-raid",
        "count": 1
      },
      {
        "node": "enduring-resistance",
        "count": 1
      },
      {
        "node": "justice-prevails",
        "count": 1
      },
      {
        "node": "startup-founder",
        "count": 1
      },
      {
        "node": "fbi-investigation",
        "count": 1
      },
      {
        "node": "anti-authoritarian-tech",
        "count": 1
      },
      {
        "node": "predicting-election",
        "count": 1
      },
      {
        "node": "government-s-onus",
        "count": 1
      },
      {
        "node": "eye-of-sauron",
        "count": 1
      },
      {
        "node": "money-laundering",
        "count": 1
      },
      {
        "node": "money-transmitting",
        "count": 1
      },
      {
        "node": "crypto-funds",
        "count": 1
      },
      {
        "node": "katherine-pula-fa",
        "count": 1
      },
      {
        "node": "tornado-cash",
        "count": 1
      },
      {
        "node": "open-protocol",
        "count": 1
      },
      {
        "node": "crypto-risk",
        "count": 1
      }
    ],
    "topicGroups": {
      "groups": [
        {
          "topics": [
            "bitcoin",
            "bitcoin-miners",
            "bitcoin-treasuries",
            "bitcoin-mining",
            "bitcoin-price",
            "bitcoin-crash",
            "bitcoin-etf",
            "bitcoin-holders",
            "bitcoin-acceptance",
            "bitcoin-value",
            "bitcoin-million-dollars"
          ],
          "category": {
            "id": "bitcoin",
            "name": "Bitcoin",
            "description": "Topics related to Bitcoin and its ecosystem."
          }
        },
        {
          "topics": [
            "eth",
            "eth-price",
            "staking-eth",
            "eth-supply",
            "ethereum",
            "eth-rewards",
            "eth-stakers",
            "eth-reserve",
            "eth-treasury-accumulation",
            "blackrock-eth-etf",
            "otc-desks-eth",
            "sell-eth"
          ],
          "category": {
            "id": "ethereum",
            "name": "Ethereum",
            "description": "Topics related to Ethereum and its ecosystem."
          }
        },
        {
          "topics": [
            "markets",
            "crypto-week",
            "crypto",
            "stable-coins",
            "etfs",
            "crypto-assets",
            "all-time-highs",
            "fomo",
            "bearish",
            "bullish-interpretation",
            "nupl",
            "froth-market",
            "accumulation-zone",
            "yellows-oranges",
            "pricing-chart",
            "rainbow-chart",
            "rainbow-price-chart",
            "institutional-bid"
          ],
          "category": {
            "id": "crypto-markets",
            "name": "Crypto Markets",
            "description": "Topics related to the cryptocurrency market."
          }
        },
        {
          "topics": [
            "coinbase",
            "binance",
            "robin-hood",
            "blackrock-ibit",
            "80-billion-aum",
            "micro-strategy",
            "wintermute",
            "maker-dow",
            "etfs",
            "otc-desks-eth"
          ],
          "category": {
            "id": "financial-institutions-and-products",
            "name": "Financial Institutions & Products",
            "description": "Topics related to financial institutions and products."
          }
        },
        {
          "topics": [
            "trump",
            "powell",
            "brian-armstrong",
            "elizabeth-warren",
            "steve-jobses",
            "anthony-cissano",
            "nate-jerassi",
            "anthony-s-tweet",
            "justin-drake",
            "donna-l2b",
            "bonosaris",
            "malbeck",
            "shane-copan"
          ],
          "category": {
            "id": "people-and-actions",
            "name": "People & Actions",
            "description": "Topics related to individuals and their actions."
          }
        },
        {
          "topics": [
            "crypto-week",
            "dev-connect",
            "bankless-nation",
            "bankless-weekly-rollup",
            "bankless",
            "bankless-summit",
            "polymarket-fbi-raid",
            "ico",
            "pump",
            "pump-ico",
            "eth-etf-inflows",
            "eth-treasury-race",
            "clarity-act",
            "tariffs",
            "edgar-filings",
            "new-denomination",
            "cultural-milestone",
            "bloomberg-terminals"
          ],
          "category": {
            "id": "events-and-news",
            "name": "Events & News",
            "description": "Topics related to specific events and news."
          }
        },
        {
          "topics": [
            "staking-eth",
            "uniswap",
            "ens",
            "native-roll-ups",
            "open-zeppelin",
            "polymarket",
            "farcaster",
            "onchain-social",
            "creator-economy",
            "super-app",
            "ico",
            "pump",
            "pump-ico"
          ],
          "category": {
            "id": "defi-and-web3",
            "name": "DeFi & Web3",
            "description": "Topics related to decentralized finance (DeFi)."
          }
        },
        {
          "topics": [
            "ico",
            "pump",
            "pump-ico",
            "eth-etf-inflows"
          ],
          "category": {
            "id": "token-sales-and-fundraising",
            "name": "Token Sales & Fundraising",
            "description": "Topics related to token sales and fundraising."
          }
        },
        {
          "topics": [
            "eth-price",
            "bitcoin-price",
            "bitcoin-crash",
            "-19000",
            "-122800",
            "-116000",
            "-123000",
            "-121000",
            "all-time-highs",
            "bearish",
            "bullish-interpretation",
            "nupl",
            "froth-market",
            "accumulation-zone",
            "yellows-oranges",
            "pricing-chart",
            "rainbow-chart",
            "rainbow-price-chart"
          ],
          "category": {
            "id": "market-analysis-and-price",
            "name": "Market Analysis & Price",
            "description": "Topics related to market analysis and price movements."
          }
        },
        {
          "topics": [
            "telegram",
            "marketing-campaigns",
            "ted-talks-ethereum"
          ],
          "category": {
            "id": "communication-and-marketing",
            "name": "Communication & Marketing",
            "description": "Topics related to communication and marketing."
          }
        },
        {
          "topics": [
            "bankless-nation",
            "bankless-weekly-rollup",
            "bankless",
            "bankless-summit"
          ],
          "category": {
            "id": "bankless",
            "name": "Bankless",
            "description": "Topics related to the Bankless podcast."
          }
        },
        {
          "topics": [
            "elizabeth-warren",
            "clarity-act",
            "tariffs",
            "edgar-filings",
            "polymarket-fbi-raid"
          ],
          "category": {
            "id": "legal-and-regulatory",
            "name": "Legal & Regulatory",
            "description": "Topics related to the legal and regulatory environment."
          }
        },
        {
          "topics": [
            "staking-eth",
            "eth-rewards",
            "eth-stakers",
            "eth-reserve",
            "eth-treasury-accumulation",
            "blackrock-eth-etf",
            "otc-desks-eth",
            "sell-eth",
            "native-roll-ups",
            "justin-drake",
            "ted-talks-ethereum"
          ],
          "category": {
            "id": "ethereum-future",
            "name": "Ethereum Future",
            "description": "Topics related to the future of Ethereum."
          }
        },
        {
          "topics": [
            "creator-economy",
            "farcaster",
            "onchain-social",
            "super-app"
          ],
          "category": {
            "id": "creator-economy",
            "name": "Creator Economy",
            "description": "Topics related to the creator economy."
          }
        },
        {
          "topics": [
            "dev-connect",
            "native-roll-ups",
            "open-zeppelin",
            "justin-drake"
          ],
          "category": {
            "id": "ethereum-development",
            "name": "Ethereum Development",
            "description": "Topics related to the development of Ethereum."
          }
        },
        {
          "topics": [
            "eth-treasury-companies",
            "eth-treasury-accumulation",
            "otc-desks-eth",
            "sell-eth"
          ],
          "category": {
            "id": "ethereum-accumulation",
            "name": "Ethereum Accumulation",
            "description": "Topics related to the accumulation of Ethereum."
          }
        },
        {
          "topics": [
            "bitcoin-price",
            "bitcoin-crash",
            "-19000",
            "-122800",
            "-116000",
            "-123000",
            "-121000"
          ],
          "category": {
            "id": "bitcoin-price",
            "name": "Bitcoin Price",
            "description": "Topics related to the price of Bitcoin."
          }
        },
        {
          "topics": [
            "nearest-competitors"
          ],
          "category": {
            "id": "competitors",
            "name": "Competitors",
            "description": "Topics related to the competitors of BlackRock."
          }
        },
        {
          "topics": [
            "crypto-person"
          ],
          "category": {
            "id": "crypto-person",
            "name": "Crypto Person",
            "description": "Topics related to the crypto person."
          }
        }
      ]
    },
    "shortSummary": "This episode covers Bitcoin's new all-time high, Ethereum's rising institutional interest, and updates on macroeconomic factors and the Roman Storm trial.",
    "lastStoryCheck": "2025-07-18T13:39:31.180Z",
    "storyCheckResults": {
      "missingChunks": [],
      "missingStories": [],
      "totalCategories": 13,
      "totalChunksChecked": 50
    }
  }
}