{
  "id": "hwRD0NvAnbs",
  "title": "Joe Rogan Experience #2347 - Paul Stamets",
  "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
  "publishedAt": "2025-07-09T17:01:03.000Z",
  "cleanText": "Joe Rogan podcast. Check it out.\nThe Joe Rogan Experience.\nTrain by day, Joe Rogan podcast by night, all day.\nWe up. Yeah. Put them headphones on.\nLet's rock and roll, Paul. Good to see you, sir.\nGood to see you, Joe.\nWhat's happening? How you doing?\nBook number eight, huh?\nBook number eight. Yeah.\nWho would have known there's so many books to be written on mushrooms? Well, this is state-of-the-art taxonomy.\nPsilocybin mushrooms in their natural habitat covers 60 species all over the world, but it also shows not only historical use, which people are surprised. They've been used in India, in Europe, and South Africa. A new species was just found, Salosi Maluti, but the Basu and Luthu province have been using it obviously for hundreds of years. We know this because they have songs. So it's really interesting when indigenous people have been using psilocybin mushrooms and scientists quote discover them and give them a Latin binomial. But the psilocybin mushroom revolution is happening all over the world right now.\nI never expected it to be this big. And the Rand report came out this past year.\n3% of Americans tripped on psilocybin in 2023.\nThat's only three.\n3%. That's 8 million. I know. Well, I would agree with you because how many people would admit it, right? I mean, probably underreporting, not over.\nYeah, for sure.\nSo it seems to be, I think, a revolution for the freedom of consciousness, and it's crossing all political boundaries, all religious boundaries.\nWell, it's happening here in Texas for sure because of the Ibagain initiative and what's happening with Governor Rick Perry, who was former Republican governor of Texas, who was all in on this.\nHe's a great guy. I've talked to him backstage a few times, and he's the type of person that I really admire because even though we may have political differences or different cultural backgrounds, we're joined together with a common purpose of trying to help people.\nYeah. Well, he's not ideologically captured. Like he realized that he was wrong and that his position on this was based on ignorance. So he educated himself and completely turned around, did a 180, and now is an advocate, and it's helped a lot of people. There's, I mean, it's tremendous benefit to veterans and people with PTSD and, you know, coming back from the war, and it's one of the only things that's been shown to really get these people straight.\nThat and psilocybin, and yeah, my heart really goes out, and this is, I'm sort of a little left or center, so my friends will be surprised, but my heart goes out to law enforcement. Can you imagine stopping a car on a stormy night at two in the morning, right?\nAnd the window comes down, and you have two seconds to make a decision.\nYeah.\nYou do that hundreds of times.\nMhm.\nThe likelihood of having one mistake is very high.\nAnd having one very bad day define your life for the rest of your life is not right. No. Because then if you can't resolve those issues as a soldier, as a law enforcement, as a doctor who makes a mistake, if you can't get through that turmoil, that stress, right?\nThe anger that then can emanate out from your anger at yourself to other people.\nYeah.\nThen this is what psilocybin and I and other psychedelics I think really do. They help people forgive themselves and become better people. And once you forgive yourself and become a better person, then everyone is excited about the fact that you've changed. And yeah, and imagine the world that we could be living in if this experience was available to so many of the people that are committing crimes. So many of these people who have never had a psychedelic experience, have never really confronted their own reality in that way. How many of them would change their ways? I would imagine a great deal. You bring up a very important point that I've been thinking about a lot. We talk about using psychedelics and psilocybin and other substances for treating people who have trauma, you know, mental illness, you know, addiction issues. But what about prevention?\nYeah. If the return on investment is to reduce addiction and crime and all the other collateral damage that's associated with it, then it would save hundreds of billions of dollars.\nHundreds of billions of dollars.\nPsilocybin should be made free. I think, you know, as a citizen's right to have access, and the government should pay for it. It would massively reduce our national debt. It would make our better society. But that's not going to happen, right? That's a dream.\nWell, I don't know if that's not going to happen, but it's just not going to happen tomorrow. You know, I think we're on a path if you look at where we stand with marijuana, for instance. Like look at Las Vegas is a great example because I remember in the '90s and when we would go to Las Vegas for the UFC in the, I guess, I guess actually it was in the 2000s. It was highly illegal, and you know, I'd remember the stories from the '70s where people were locked up for their entire lives for, you know, like an ounce of marijuana in Vegas. They had zero tolerance for it. And I always wondered what that was about, whether that was an anti-hippie thing or whether it was in response to the alcohol lobby. Vegas obviously sells a lot of alcohol and anything that would cut back on their profits. You know, this was, we talked about this the other day. The study showed that amongst young people, alcohol consumption is down significantly. Isn't it down by like 25%?\nWhich, by the way, that I, I don't, it's down. I just don't know the number.\nWhich, by the way, a great thing. You know, that's that's a good thing, but it's not a good thing for profits. And so, but my point is that how many states now have cannabis as completely legal?\nI think it's like 19.\nYeah, it's more than a dozen for sure.\nYeah, I think it's somewhere around then. And then you have medical use, which is in many, many more states. It's just a matter of time before the people in the federal government realize this is a losing battle.\nIndeed. And think about the guilt that those law enforcement officers must feel, and certainly they must feel, I would hope so, that they know they put somebody in prison for 30 years for an ounce of marijuana when it's now legal in those states, right?\nHow do they reconcile that?\nHow do they Yeah. Well, I mean, PTSD amongst law enforcement is something that's very rarely discussed. We talk about it a lot with soldiers, but one of my friends who was a former Austin PD told me that you see more in your line of duty in police department than more death, more terrible, terrible things than he ever did when he was in combat. And it's just, it's like every day, every day you're dealing with shootouts. Every day you're dealing with stabbings, every day you're dealing with horrific crimes, and it's just your brain is just overrun with this.\nAnd with firefighters, you know, they're the often times the first responders are there first. My partner's a medical doctor in Canada, but she used to be a firefighter. And um yeah, they often times the policeman show up for 20 minutes and they're there, and the things they witness, I mean, things that no one should ever witness. And but I mean this is where it's so important that we come together as a society because I really believe that 98% of people are good and 2% of people are [ __ ]. And I think the [ __ ] can become good people if they have a psychedelic experience. I just really think there's progress right now. So much of the media and the clickbait journalism, they amplify the extraordinary and things that get eyeballs and attention.\nBut more and more I think people are, they become more, have greater wisdom about how they're being manipulated by the media. People come together and you know, it's why I like mushroom hunting. Mushroom hunting brings people together. You go out hunting, you have this eureka experience. You don't talk politics. You're excited about the species that you hope to find, and you find ones you don't. But they become like friends after a while. When you find a chantrelle, you find a shaggy mane. You find a philosophy, a psilocybin mushroom. They're, you know, they're that chance encounter, that Eureka experience, and sharing it, then sharing eating the mushrooms with her edible or otherwise. I mean, it brings a community of interest together. It's just a really fun thing to do. And there's something I want to mention, Joe, that's really important. I do have been to a lot of conferences. I just came back from the psychedelic science conference in Denver. Our friend Rick Doblin, 8,500 people there. Um, but what I really find an extraordinary way of taking iPhones and Droids, and all these kids are just addicted to their phones, right? They're not going out in nature. So, there is a called nature deficit syndrome. It's actually affecting people. But there's a there is an app that I'm just in love with called iNaturalist. It was stopped by created by a guy named Scott. He just gave a TED talk that was released yesterday. iNaturalist. You can take a phone and you can go out and you can look at a flower, a frog, a mineral, a mushroom. You photograph it. You upload it into the cloud of iNaturalist, and they have all these experts am am am am am am am am am am am am am am am am am am am am am am am am am am am am am am am am am am am am am amateurs trying to tell you what it is, and it's a great little debate going back and forth. No, you're right. No, you're right.&quot; And then when it hits research grade, it's when a group of experts come together says, &quot;Yep, you have copron katus. Yep, you have basus edgulus.&quot; They agree on identification. But it has fueled the scientific community with all sorts of these citizen scientists finding new species.\nOh wow.\nAnd it brings people into nature, gets kids excited, and they and then you can go to iNaturalist right now and you can look around your house or this place to see the reports of birds and mushrooms and things. I just went on a naturalist yesterday and philosophy cubensis, the golden tops grow on Austin, who knew, you know, because they've been reported. Now you have zones of privacy so you don't have to tell them exactly where the mushroom is, and that's probably not a good thing to do if it's a self-c mushroom, but you can make a peripheral zone of anonymity, it could be within two miles, five miles, 10 miles, you know, and that way you can do the report, but some of them have high specificity with lat long within a few inches.\nBut it's so exciting in the field of biology and minology and ornithology, etc., to have all these citizen scientists out there with their phones, and then every year all over the world now there's called uh bio uh bio blitzes where several hundred people literally come together, they'll go into a park, they have all their iPhones and Droids, and they they photograph everything, and they upload it to iNaturalist to look at species diversity. This has revolutionized the field of biology. I think it's revolutionizes bringing children and young people back into nature. And you then you build a community. You're not talking about politics, you're talking about nature. And what did you find? And holy moly, I never knew there's a blue mushroom or something like that. So, it's um it's inspiring to see the kids get so excited about this and adults. And so, this is, you know, I'm\nThat's very cool. Yeah. Very cool.\nHow many new species get discovered?\nOh, thousands. Literally every year.\nThousands every year now. Really?\nThousands and thousands. There's 223 known species of psilocybin mushrooms and about\nWow.\nI'd say 10, 10 of them in the past two years has come from uh citizen scientists, quote unquote amateurs who found it, who uploaded it to high naturalists. And\nso if they find a new species, like how do they determine what if it's a completely new species? How do they determine that it's psilocybin? How do they determine where it's from?\nExcellent question. Um, the psilocybin species localized in the genus Psilocybe, which is has the most psilocybin species. We just know from genetic associations if they're in the clay, the group that has psilocybin species, and the DNA analysis shows that they fit right into this cluster, then we have high confidence. But if a mushroom has gills, you know, and and it bruises bluish and has purple brown spores, those three things need to be true. Then 95% probability is a psilocybin mushroom. What species it is becomes more debatable. But psilocybin mushrooms are very hard to find with the exception of the golden top and there's another called pineal cinosins. They're growing pastures. They're easier to find. But most of these psilocybin mushrooms are hidden in the landscape.\nHow so? Well, I just had a 70-year-old man write me from Vermont and he has found Psilocybe serbica, and he wrote a classic letter to me that many people have written. I have looked for these mushrooms for years. I couldn't find them. And then I found a few, and I looked around, and they were everywhere. They're hiding in plain sight. And so now he knows with Psilocybe serbica in Vermont, he knows. It's just I can't believe how obvious they are to me and how unobvious they were to me before. When I took Michael Pollan out on a mushroom hunt, and in this in his book, How to Change Your Mind, when I said I took two steps out of this little cabin we were at, and I goes, &quot;There's one.&quot; He goes, &quot;Where?&quot; I go, &quot;Right there.&quot; He goes, &quot;Where?&quot; I go, &quot;Right there, Michael.&quot; And then I picked it up, and he goes, &quot;WTF? How can you tell this is a psilocybin mushroom?&quot; I go, &quot;Well, it's like\nyou're kind of an expert.&quot;\nWell, it's like meeting a friend. It's like meeting you. I know Joe Rogan, right? I know your face. I know your personality. I'm reacquainted with you. But psilocybin mushrooms.\nWait a minute. So,\n\n\nLike seeing it, you're reacquainted with it. Seeing it repeatedly and being familiarized with it gives you a memory of it, a pattern recognition. So, when it goes away, you still have that pattern recognition memory to memory map back onto the landscape around you. It's true with morelss too. This is a very common thing. People don't see morelss and they find one or two and then suddenly they jump out of the landscape. It's how your brain works with pattern recognition. So many of these species are hidden in a landscape, but they're actually quite common, but you just can't see them.\nGot it. And you're accustomed to seeing them. So, but you you're not saying like that you feel something from them. You're you're just saying recognize them visually.\nWell, you're waxing into the spiritual. Many people feel that the Muslims call to them.\nYeah.\nSo this is true in the Massetch tradition, you know. Um in my book I go deeply into the Massetch heritage of using psilocybin mushrooms. And um one of the things it was really embedded with with Christianity after the Spaniards came 1516 and 1519 1521 they brought in cattle and um and very quickly uh Christianity swept through Meso America specifically in Mexico and um there is a a friend of mine um uh who's a who's a PhD uh called uh uh Joe Ltori was in Waka and just found a in a church a cross from the 15th century 1500s I mean and soon after the concistad with the concisadors and Spanish arrived and in the center of the cross are psilocybin mushrooms.\nSo so Christianity has a long deep rooted history with psilocybin mushroom use in Meso America.\nWell there's that ancient um depiction of Adam and Eve from\nthat's that's more debatable in my mind.\nYeah. But here here it is. Thank you. This is uh from um Joe Ltori.\nLook at that.\nThat's a basket with mushrooms with three mushrooms in the in the basket. And there there is silos metricana. Um and so the mushrooms are phenotypically correct, but there's clearly a mushrooms in a basket. Can can the other slide show with a full cross?\nJoey, I'm not sure. Did you know Jack Herer?\nYes.\nWhen Jack was alive before he died, one of the things that he was working on was a book connecting psilocybin mushrooms and Christianity. And he had this massive collection of ancient images, paintings, all these different things. A lot of them were these religious depictions of people that were naked dancing under the like it was like a transparent mushroom shape and they were dancing. like something that would indicate that they were under the trance and they were dancing.\nYeah. This is um this is an example where there's so many different you you could have a hundred different potential representations, right? They're not all going to be correct. The one but a few of them are. And this example here, the one that clearly is and and and in the mat tradition is called um it's called synratism. When you have a foreign influence, in this case a religion coming into an indigenous people, they merge and they still continue their indigenous practices under the umbrella of protection in this case of Christianity. But in the midc tradition, they believe the tears of Christ is where the mushrooms would appear. They believe the mushrooms were the body of Christ and therefore you'd never boil them. You never because you'd be hurting the body of Christ. So you only eat them raw or dried.\nOh, interesting.\nSo really interesting that that that that's an example of of synratism. And the great Maria Sabina was a devout Catholic and when she did her psilocybin ceremonies, she had the holy trinity. So that's another example where under the umbrella and from a survival point of view, culturally it makes sense. um and they adapted but they found that this sort of merging of indigenous uh practices and knowledge of psilocybin and Christianity was very compatible. M just was published um I think two weeks ago at New York uh university in John's Hopkins they had 24 uh clergy from from different faiths Christianity Buddhism Judaism uh and Muslims and they had them come in and they did a high doses of psilocybin and they had one group that had delayed didn't do it for 6 months and the other group did a high dose of psilocybin. It all each of those faiths the use of salicide mushrooms reinforced their belief in their faith.\nThat was really amazing. I think they said 95% said it's the most significant experience in their uh in the top five of their most significant experiences in their life. So it just I think psilocybin makes nicer people. This episode is brought to you by OnX Off-Road. Ever wonder how to reach these epic mountain lakes? or tucked away dispersed campsites. With OnX Off-Road, you'll find legal open trails around you and even better guided trails mapped by real off-roaders. Each one includes photos, terrain descriptions, and difficulty ratings so you'll know if your vehicle is capable before you go. Unlike other apps, OnX gives you turnbyturn directions on the trail, and their new disperse camping layer shows where you can legally set up camp. You also get private land boundaries, public land overlays, and the ability to download maps for offline use so that you're never guessing even when you're off the grid. It's a powerful tool built for serious off-roaders. Try OnX Off-Road for 50% off. Go to onxmaps.com/jo.\nI mean, no, I would agree with you on that. the the image of uh Adam and Eve. I'm I'm curious to say what do you think is debatable about that? Can you pull up that fresco? There's an ancient fresco. I believe it's from France of uh Adam and Eve, which supposedly is the tree of life, but really looks like some sort of a mushroom plant.\nYes, it's been postulated uh by or Gordon Watson.\nShouldn't say plant.\nYeah. In front of you, especially. Thank you very much.\nThat that doesn't look like mushrooms.\nThey do look like mushrooms and um like I couldn't imagine it being anything else.\nWell, I mean here's an example that basically artists become um authors of field guides and art. You know, how much can you tell the public without violating your oath of secrecy um and so symbology, but yes, there's a cap and a stem and they come up in clusters. Um that looks like a psilocybin mushroom. Some people say it's amndium mascaria because of the dots, but those of us who've grown silos cubensus when they're very fresh, they have dots on them. They're very ephemeral. They got washed away. So, yes, I and you would see the dots obviously if it's still in the ground.\nIf it's in the ground, it's very fresh. Um, basilicide mushrooms bruised bluish. And so this is where we can get lost in a debate of interpretation. But all these representations are are not false. Some of these representations are extremely strong based on the evidence. And for instance, the solocide mushrooms that we found on the pyramids in Egypt, they are clearly silos. Not myself, but other Egyptologists have also published on this.\nFind those Jamie. Th those are fascinating because um I don't think until fairly recently within the last few decades it was understood that they were using psilocybin. I think there was some confusion as to what if anything like they were drinking they blue lotus I think was one of the\nthe blue lotus is a water lily where water liies grow there it is the water lilies grow near ponds\nthat's so clearly psilocy and this is the goddess Hor goddess of the cow by the way there you go the goddess of the cow and that's a vase and anyone who's grown oyster mushrooms or psilocy mushrooms know that you can put the substrate into a vase like that with openings and mushrooms will come out of the holes. And so that natural culture technique of collecting cow patty. So cows go to ponds to drink. The blue lot lotus grows in ponds. The blue lotus is blue. The psilocide mushrooms turn blue. The mushrooms are golden in color. Gold and blue colors are sacred in Egyptology in ancient Egyptian culture. So now I was not the first person to discover this. Actually, I saw this from a an article that was published by Izim Abdal um a friend of mine, a micologist in Egypt who presented it uh at a conference. And how long ago was this?\nThis was Well, this is over 2,000 years of age.\nNo, no, I mean when they\n2016 when they brought this to the 2016 2016\nThat's kind of crazy, isn't it?\nIt is. And then um Kindi, the great Kindi from Detroit. Um he unfortunately died of COVID. Um but he also from his African heritage also believed that you know and he was rediscovering his African heritage and this is called re-indigenization rediscovering that which your ancestors practiced even though the linear transition of knowledge may have been cut. But this is this is taxonomically um accurate for growing philosophy cubensus and it grows on cowdong. Cow goes the ponds. If you went to get the water lil, you'd run into this constantly. Now, this and with the Hor uh uh where this temple is now, they get less than one millimeter of rain a year and the Nile used to be flooding all the time. It was a bread basket of the world, but they build the dams and you know, and the flooding and so the climate change. So, the modern Egyptologists have no reference. And so when you have climate change, the ecosystem changes, then the scientists of today don't have the familiarity uh as the experts thousands of years ago, right? So they become rare, they become scarce, and the generational knowledge is lost. But now there's a real big re-engineerization movement in Egypt combining the blue lotus with philosophy commensus.\nWhat is the psychedelic compound in the blue lotus?\nYou know, that's that's that's a debatable thing. There's a really complex chemistry there. I'm not an expert on that, but I've talked to my other friends who are experts. There seems to be an entourage effect of multiple agents. Um, so I I can't really speak authoritatively that, but I have been told that there are several active ingredients and they think the entourage effect of them together creates this heightened state of awareness and I think that as an ad mixture with psilocybin makes a lot of sense.\nAre contemporary people taking blue lotus?\nYes.\nReally?\nYes.\nIs there like a community of people?\nMassive community. But the because blue lotus now has become scarce because ponds are scarce. Ah,\nso I put out there a reward of $1,000 for anyone who can find, you know, DNA of psilocybin mushrooms in any of the wells or ancient ponds used to be ponds in in the Egypt area. Because if we can find the DNA in the vase and the substrate, then we can actually prove this theory, right? It's more than a hypothesis because I've met many Egypt Egyptian micologists now who absolutely believe this is true. not scientifically but sort of intuitively from their culture this makes a lot of sense.\nIt does make a lot of sense and if you've got it on the these hieroglyphs and they were known as the flesh of the gods which is the very same name when translated for tanak from me of America the saliva mushrooms were known sloxana as flesh of the gods. So it's interesting in both sides of the world they have the same interpretation. Mushrooms were not allowed um back in this time to be picked by commoners. They were only reserved for the royalty.\nOh boy.\nDoesn't it always work out that way?\nYeah, it seems to.\nUm another thing that's really fascinating is depictions of ancient saints and even Jesus Christ with a halo and that the halo is essentially the bottom of a mushroom. It's a very different halo. When we think about a halo, we think about like a Frisbee that's hovering over an angel's head or, you know, a saint's head. But the ancient depictions of them weren't that. The ancient depictions of them, you saw those ribs that made it look like the bottom of a psilocybin mushroom.\nI didn't know that.\nYou didn't know that? Oh, come on. I'm teaching you this. Come on. Jamie will pull up these images, but these images of Christ of uh there's many different religious figures. Um, and they have this halo that's very different than the more modern halo. The modern halo being this like circle. This is not a c it's a circle, but it's a mushroom. It's essentially they're explaining that these godly, holy people were under the influence of psilocybin. You know, I think what we can't and not just me, what we can't prove some of these ideas today. What we can prove is like the the John's Hopkins New York University study that religious belief systems are enhanced through the use of psilocybin which totally makes it makes sense. So we we can argue about the past but we can't we have really good scientific methodology now for analyzing the effects of psilocybin and it's profound. It's profound.\nYou got any of those images?\nIt's not the what's coming up really is us talking about it before and then a bunch of pictures of mushrooms. I was trying to find out.\nThere's there's some better ones like I know, but it's not I didn't get\nYou can't find them.\nI wasn't getting\nMan, the government's pulled them off the internet, man.\nUh that's not one.\nYeah, that's that's uh the the ones that I've seen are far clearer than that.\nUm I'll just show you there.\nYes, those like look at that one, which is crazy that you have to you have to go to us.\nThat's See what I Google?\nI can see the one on the left.\nYeah, that's what I'm talking about. I mean that that essentially looks exactly like that.\nI' I've never seen that.\nThat's crazy that you can't find that anymore and we clearly found it in the past because we talked about it.\nWell, that may be the effect of Joe Rogan, right? You could just overwhelmed the entire internet with images. So, I mean, look at the bottom of that one in particular, the one in the center.\nYeah. I mean, that that looks exactly like that halo.\nYeah. That's not a\nWhich totally makes sense. Look at that.\nOkay, there's one. Look at that image.\nYeah.\nSo, this is the old school Halo. The old school Halo clearly looks like the bottom of\nI'm blown away. I'm blown away. I'm hiding in plain sight. Right.\n\n\nI can't believe that I'm teaching you this. I am, I can't believe you. Who did? How come nobody told you this? I don't know. You said you knew Jack. You knew Jack when he was alive. This was like his primary concern towards the end of his life. He was, he was working on a book. Yeah. I mean, you know, the limitation of life, unfortunately, we have all these great people who pass when they're at the at the peak of their knowledge, you know, and that's, that's the other thing that I think psilocybin has really informed me is that Joe Rogan and Paul Stamets are talking, Jaime is there, but we have such a thin slice of reality. And when you're on psilocybin, the the unonymity of universal consciousness to be involved in something you realize is so large. Yeah.\n\nDid you see the galactic images from the Reuben telescope that came out yesterday? No, I did not. Millions and millions of new galaxies. Literally millions of new galaxies. I think 2,100 new asteroids. Whoa. In near Earth orbit. Oh, fun. Oh, fun. Oops. Well, there's already 900,000 of them. Yeah. So there's, but this has just happened. Wow. But this is, yeah, one of those telescopes just got, got released, the largest telescope in the world, and there are millions of galaxies, millions of galaxies. And so from my experience, which I will admit I came from a Christian background. So my first times on soul mushrooms is very oriented. God, look at that. And then as I got more and more into the soul experience, I realized that this is a just this concept that we live in in this great expanse, and I'm an assembly of molecules. So are you. We didn't exist before we were born. You know, we will disassemble, decompose, and we'll go back into the cosmic dust. And this is part of the continuum of existence. We all exist all the time forever. Forever.\n\nCan I ask you this? What do you think happens to consciousness? I think that we think from a mechanical perspective, we might be looking at have the constructs of consciousness that uh is analogous to the to the model T Ford, you know, and I think as we expand our knowledge sets and become more informed, we see how much there is out there. I think that psilocybin mushrooms and other psychedelics, and this is why I think religions are very much attracted to this, is a portal to expand the horizons of your imaginations that there is a, there is a consciousness that far exceeds that which you can comprehend. My mother was a charismatic Christian, and um, what is what is a charismatic? Well, she's an evangelical. She speaks in tongues. She was a leader. She was very much into this like mom really different side of her. But we had an interesting conversation. I said, \"Mom, you believe God is omnipotent, right?\" She goes, \"Absolutely.\" I said, \"You believe God is all knowledgeable?\" She goes, \"Absolutely.\" You believe that humans are fallible and we're not all knowledgeable? She goes, \"Yep, I do.\" I said, \"Then can you accept the fact that our concept of God is inferior to God's definition by your own thinking that no matter how we think of God, we'll be inferior to the enormity of the concept?\" So, and she admitted that. So, but so we're fallible. We, we don't have the capacity to understand the enormity of consciousness in which we are embedded, of which we are a tiny part.\n\nSo, this brings me to a subject I really wanted to talk to you about. Okay? And that is artificial intelligence. And I know you've spent a lot of time on this, but I want to recently, I want to introduce a new concept. Okay. Okay. I'm a dead head. I could never tell. Never tell. I went to the sphere, you know. I bet it was amazing. It was incredible. The visuals were insane. Fantastic. What a great venue to see. It was a great venue. It just revolutionized music festivals, I think, forever.\n\nAll right, folks. This is insane. For the first time ever, we got a full-blown all women's boxing mega event going down in New York City. Two title fights, same night. Let's go. And if you're like me and you love the action, DraftKings Sportsbook is where it's at. We're talking Katie Taylor versus Amanda Serrano 3, the trilogy fight. Absolute legends. Katie's putting her super lightweight belt on the line. And you know, Serrano's bringing the heat, but don't sleep on the co-mate. Alicia the bomb Bob Gardner explosive power is taking on the undefeated WBA interim champ Jennifer Miranda. This one's going to be fireworks. If you've never bet with DraftKings, it's super simple. Just pick who you think's going to win. That's it. It's easy. And check this out. If you're new to DraftKings, throw down five bucks and boom, you get $150 in bonus bets instantly. That is wild. Download the DraftKings Sportsbook app right now and use the promo code ROGAN. That's promo code Rogan for new customers to get $150 in bonus bets instantly when you bet just five bucks. Only on DraftKings. The crown is yours. Gambling problem? Call 1-800-GAMBLER. In New York, call 877-8-HOPEY or text HOPE and Y467-369. In Connecticut, help is available for problem gambling. Call 888-789-7777 or visit ccpg.org. Please play responsibly on behalf of Boot Hill Casino & Resort in Kansas. 21 and over. Agent eligibility varies by jurisdiction. Void Ontario. New customers only. Bonus bets expire 168 hours after issuance. For additional terms and responsible gaming resources, see dkg.co/audio.\n\nSo there is, I, I bought, there's something called Postcards from Earth, and I'd heard a lot about it. It's in a matinee in the afternoon before the big concerts, and it's great flying through around the earth through the old growth forest and the volcanoes. Um, so we went there and we got an early bird ticket, which allowed us to talk to an AI robot. So I thought, oh, this is my opportunity. Now, two years ago, I got the disruptor award at sin bio beta 2200 nerdy scientists. I mean, these are top nerds, and I was so surprised that I got the disruptor award, uh, because I'm kind of a natural products kind of guy. Um, but a great honor. So I pos, I posited the question then, will uh, AI may never be able to write an algorithm for random acts of kindness? And then I'm thinking back my life, maybe yours, maybe Jaime's, maybe most people out there. You are here today because of random acts of kindness. Your great-grandfather, your great-grandmother, your father, your grandfather, grandmother. Is that reaching out of a hand in a time of need by a random act of kindness from a stranger that probably created a lot of relationships, and random acts of kindness was not transactional where you genuinely feel something for someone, not expecting to have something in return, right? And you've reached out. I think that's why many, many, if not most people, their lineages can be traced to a random act of kindness. So then I went to Las Vegas, went to this sphere. I had this idea, you know, I can ask this robot. So I asked this robot.\n\nWhat robot? It was a, I, I think it was a chat GPT run, but I'm, I'm not sure it, that was at theosphere. Atosphere. Okay, there's a robot I talked to. Oh, this so creepy. Look at that face. Oh my god, it's so creepy. Okay, very creepy. So, I asked the robot, \"Look at that robot. That's so creepy.\" I asked the robot, \"Given that so many of us are here today because of random acts of kindness of our ancestors, and we've invented artificial intelligence, and we're traceable to random acts of kindness, how will artificial intelligence incorporate random acts of kindness in the future?\" Good question. The robot took an unusually long time to answer. It was like a very long time. And the robot came back going, \"Why would humans do that? It's far more efficient to have a return on your investment transactionally. Why would it's inefficient to have random acts of kindness?\" Boom. Blew me away. Did you film any of this? Yeah, we had, we did film this. A friend of mine has a film of it. And then I need to see that. And then that robot needs to be shut off.\n\nNo, about 5 days ago, I asked chat GPT a Grock Gemini the same question, and now it was greatly nuanced. Well, random axis can help uh, help the community with goodwill, and this can be, you know, help the community because it's, you know, it's more sustainable, etc. So this is the, this is what I want to do. Now, when, if possible, all those who are so inspired to go after this talk, after this interview, go and ask artificial intelligence, whatever platform you want, but preface it with this. Given that humans are here today largely because of random acts of kindness, how will artificial intelligence utilize the advantage of random acts of kindness for the perpetuation of the goodwill and health of the human species? Now, I just met, you know, I think that that that's going to inform artificial intelligence. And so when I asked this question again, it was like, it was more nuanced. Of like, oh, artificial intelligence learning, that's how large language models work, right? The more input they get, more inputs of millions of people start training AI on the importance of, you know, someone has a flat tire, you stop to pick it up, help them, you could drive by, you know, someone's hurt in an accident, you stop and pull over to help that person, you could keep on driving. Those are random acts of kindness. My life is successful because of random acts of kindness. I bet most people when they think back, there was an act of generosity and kindness, and you really feel grateful for that, and you want to pay it forward. I met at this last conference, I met two students from the Harvard Business School, and they said they want to interview me, and I go, I want to interview you, and they said, why? I go, do they teach you at Harvard Business School about the advantages of random acts of kindness? He goes, no. Well, they should. Yeah, business school is just teaching you how to make some money.\n\nBut isn't this important, Joe? We can inform, inform artificial intelligence how to be better to keep human, you know, community and psychology and and to propel the best of the human species, and I think we have this opportunity. So if millions of people start informing artificial intelligence with the premise, and we know it's true, that random acts of kindness are why many of us are here, if not the majority, going back in your lineage, you know, many generations, you know, we gave birth to artificial intelligence. I, I don't think artificial intelligence is properly named. I think it's a form of natural intelligence. We just have reamplified it exponentially.\n\nWhat do you think artificial intelligence means in terms of the the future of the human race? Well, that's a great question, too, because about the 10 people who asked this robot, you know, questions, they were all data mining. Who was the best baseball player in history? And, you know, who hit the most home runs? And it was also like data mining, right? Is so, um, Sam Sam Altman was at the TED conference, and he said that basically there are self-awareness of some of these systems, but artificial intelligence have not come to the point where they actually can create something. I found that really interesting because I thought, well, I thought they were creating, but he was insistent they actually don't have that spark or creativity. They can assemble data, but actually that true creative spirit is not something that AI has currently achieved. I met another, you know, this guy's a total genius, and many, I've heard this, other people say that, you know, we're not likely to have biological aliens, we're likely to have robots, and the extinction of biological species came because AI found that biological fathers and mothers irrelevant, so they didn't need them. Um, etc, etc. So that's logical, but again, if we can infuse artificial intelligence with the importance of the human's ability to have random acts of kindness, which are not transactional, that feed into the benefit of the commons of goodwill. Mhm. I mean, if you've been helped by somebody and you had a flat tire, and you saw someone else have a flat tire on the road, you would be a lot more inclined to stop and pull over to pay, to pay it forward. Yeah, for sure.\n\nSo, I think we have an opportunity here. And I think we just, we have to do this now because if we don't do it now, I think we're, we're going down an extremely dangerous path. In what way? Well, I think it's ultimately the the extinction of the human species, which, you know, depending on your point of view, may not be a terrible thing, but I, I think that we're Neandanthals with nuclear weapons. When I met another person, he's a Mensa person, funded, you know, by a tech company, 19-year-old Chinese uh, guy. And I, he said, I said, \"What's the scariest thing about artificial intelligence?\" Oh, he said, \"I'll tell you my scariest thing. I just wrote a paper on this.\" Autonomous weapons. Autonomous weapons. You have a million people. You assemble a million experts and you blackmail them. I catch you watching porn. I catch you masturbating. I catch you having an affair. Mhm. And you have a million people sending components for a weapon to one location, and you blackmail them and you assemble, you know, a biological weapon or something like that. So, I don't want to go there. This is something that I, I, you know, it's never as bad as as you fear, and it's never as good as you hope. So, interesting. I, I think that we're at that nexus point, and the Joe Rogan Experience can be pivotal, I think, in steering artificial intelligence to be the best that it can be ethically, and I think we have that opportunity right now.\n\nI think the real fear among people that are cynical about artificial intelligence is that it's going to replace us and will find us irrelevant, and that we're creating a digital life. We're essentially assembling it with every, all the knowledge of the human race, all the understanding of how human beings interact with each other and how we interface with the world. And we're creating something that has, when, when you think about computing intelligence, when you think about acquisition of data, the ability to form an understanding of any subject, we're basically there already. And that's just accelerating. And it's going to get to the point where these things become sentient in whatever, however you define it. You know, we, we're already in\n\n\nA situation whereby most people's understanding, it would pass the touring test. There's a sense of, you know, nostalgia in a sense is even building today of the times that have passed. Yeah. You know, of what, you know, and I I don't think it's all doom and gloom. I do think so. I think we can steer this. Well, I think we're always steering it. I think this is the battle that human beings have been involved in since the beginning of time. I think this is probably the reason why religion was created in the first place or the observable religion. I think we have always realized there's this battle of good and evil in us and a part of it becomes part of it comes rather from how we originated. We originated as these barbarian tribes competing for resources, fighting off other marauding barbarian tribes, fighting off predators and trying to stay alive. So, we've unfortunately got this intense history of chaos and of savagery that we're trying to move past, right, slowly but surely over time. And I think a catalyst for this psychedelics, I think so, too. I think psilocybin mushrooms are unique because it democratizes the access to psilocybin. MDMA you can't grow in your closet. You know, psilocybin mushrooms, you know, there's no economic barrier on psilocybin mushrooms is available for the poorest of the poor. They just [ __ ] everything up in 1970, didn't they? 19 Yeah. 71, I think. 1972 when they put it on schedule one. The schedule one substance is supposed to be has no medical benefit. Highly addictive um and um and potentially toxicity. Did you know the LD50 lethal dose of psilocybin mushrooms is 42 pounds? Yeah, that's a lot. 42 lbs. And that only kills half the people. When it kills half the people, you die them indigestion. That's for psilocybin. Diarrhea. Imagine a diarrhea you get eating 42 pounds of mushrooms. It's the least toxic one of the least toxic medicines ever decide found in nature. But but there's a concern though with people that have uh problems with mental health though, right? I don't think psilocybin mushrooms or or psilocybin is good for people who have who are psychotic, right? I I think there are the groups of people I we do need psilocybin or psychologic assisted therapy. You know, it's super important that people who are experienced can help other people who are inexperienced process. Yeah, that's really important. I think so too. I think that's part of the that's probably part of the one of the things that's really wonderful about the community of people that have experienced these things is that they do understand how life-changing it is from a personal perspective and they can aid people and help them through it. And if they're good people and they, you know, can show you like, hey, I've done this. This is going to be scary. It's going to weird you out, but ultimately you're going to come out on the other end of this a better person. And you know, you just met my uh my partner, Dr. Pam Krisco. She is part of a group called Roots to Thrive in Canada. Um and you have Canadian Health Approval for high doses of psilocybin. Um interestingly, we just put a paper published a paper on pure psilocybin versus the mushrooms psilocybin with patients who've taken both. I'll talk about that in a second. But um what these are end of life patients typically with stage 4 diagnoses oftentimes cancer and they're just existentially disturbed. I'm going to die and leave my family. What are they going to do? Lots of heart uh heartbreaking um thoughts etc. They do a long preparatory period together as a group. They have a commonality that they all have terminal illnesses and terminal diagnoses. So they have they have that thread that holds them together as a community because they talk about the difficulty and their estate planning and talking to their daughter and and how they're going to miss them and they're going to miss you all those dynamics that we all know about. But this always brings me to tears. They're doing it on indigenous land with indigenous elders also participating. So, and what happened from one of the experiences that I can share the with about a dozen or so terminal patients, high doses of psilocybin and the indigenous especially in the Pacific Northwest and and in Canada um when you do psilocybin the first 20 minutes is lift off you hit an hour you start to really get high an hour hour and a half you're peaking and just at the peaking of this experience Unbeknownst to them, the elders had a drum circle next door and they started playing drums. And the impact of having those indigenous elders recognizing that these patients are on the journey to the end of their life and they respected them enough to say they needed this. The impact of those that indigenous wisdom to help these terminal patients was so impactful. And this is where I think this is a great opportunity. And then the common theme is that those patients became the counselors to their families. They went back and saying, &quot;It's okay. I'm dying. I'll be okay. You'll be okay.&quot; And the families are going, &quot;WTF? What is going on here?&quot; And this happens with law enforcement. This happens with PTSD and and soldiers. This happening with terminal cancer patients is we all are going to die. That is a fact. To be able to come, you know, into to be able to to come at peace to the fact that your mortality is near. When you're 20 years old, you don't really think about this. But when you get older and older, I'm 69, turning on 70. I feel like I'm 35, but that's not true. Um, I just feel like, you know, I didn't exist in this form before I was born. I'm going to be going back into molecules that'll disamiguate into atoms, reassemble into new molecules. I'm part of the continuum of existence. And I think this is what these psychedelics give a lot of people confidence about the fact that they will always and have always existed and will exist forever. If your molecules are going into the continuum of existence, what do you think the purpose of you being here now is? What do you think the purpose of the present moment of your life as you're currently living? That's the that's the great question of all time. That's what um but I think even the construct of the question is confined but the limitation of our ability to to construct uh that question. I think we're maybe asking the wrong question. I think the our the purpose of our being is a tautology. We are we are being here because we are and I don't think there's I mean again look at the Reuben telescope images. I have a friend my dear friendc it's incredible millions of galaxies right when you see the enormity of the universe it I mean I can't wait to fly I I want my molecules and atoms to fly through space. Boy, I would love to see the rings of so many planets. I'd love to see supernova. And I I feel like Yeah. And that's the direction we're all headed towards. So whether you like it or not, can't do anything about it. Yeah. Have you paid attention to the James Webb telescope discoveries? Yep. Some That's some insane stuff where they're finding these galaxies that are they should have not been able to be formed as quickly as they are. It's an order of magnitude higher. They can do the entire uh the visible universe. I think in about 3 days that took otherwise months to do. So the assembly and AI is helping of course right so I think near earth near earth asteroids this is an impactful discovery literally I I always worry about an asteroid coming from behind the sun you know and then how many well it's probably been the the reset for civilization over and over again throughout time. Well, that's that's a proliferation for instance of psilocybin. I I fund a lot of different things. Well, I have a I have a business and I created my business specifically to do research, but one of the at Utah State University, I funded uh a study on the evolution of the genes that uh that code for psilocybin and the results in some molecular uh genetic clock data. There's variability of a few million years in interpretation, but the arrival of psilocybin in the fungal genome is about 65 million years ago. Whoa. Wow. Right. That's interesting. After after the asteroid impact now is association causation not necessarily, but probably makes sense. There was a new asteroid. Look at there goes this video on the New York Times article. I don't know how to control the video so I let it read. No, there are three different asteroids. There are six nine asteroids. It's showing here these discoveries. And here in a second it it'll show you that like how in the timeline of the discoveries it'll show like one day that right here I think it is they'll discover like 800 or 900 in the first day. Oh boy. Like 4 or 500 more the next day. So couple more the next day. But watch how it zooms out here in a second to show you where this is. It gives you like a perspective. So, this is like 10 days in. Wow. Wow. And then it zooms out here again further. Oh, no. So, they discovered 2,000 asteroids in that tiny little sliver right there. I haven't seen this. Boy, whoever made that video. It's awesome. Jamie, you're you're the master of discovering these things. I mean, what should people when they want to New York Times article about the Reuben telescope that came out probably today or yesterday. And they're keeping much of this undercover, so to speak. The scientists are very disciplined. They're only letting a little bit out at a time. Keep people from freaking out. Well, no, I don't think that as they're trying to be good scientists. They're trying to assemble the data in a fashion that, you know, they don't have to redefine later. So, has this telescope recently come online? Just in a past Well, it's been online, I think, for a few months. The data is just being reve revealed now. Wow. But I think 3.2 billion pixel camera. It's the largest ever created. In five years from now, you'll have that on your phone. I mean, maybe I was wondering what kind of lens they made to go on it, but like wow, look at that thing. That's insane. And if they had that telescope out in space, they wouldn't have the interference of our atmosphere. But how would you get that thing? So, kind of a rocket. When you go back to those images, this is this is astronomy 101. I'm not telling you anything you don't know necessarily, but all those stars, all those galaxies are in the past, hundreds of millions of years ago. We're just a coincidence of seeing them right now, right? Because the light has just reached us. It was just reaching reaching us. So, uh, that's what's so fascinating to me. This is a snapshot of multiple histories converging to one point of view. Also, Voyager 1's about to hit the one light day travel mark, which is a significant mark, but it's still not that far in the grand scheme. See, when I trip on psilocybin, this is what I love doing. just compreh trying to comprehend the enormity and the beauty of the universe. I believe the universe is full of love. You know, I think that, you know, we're built on relationships and when you have relationships, when you have a quorum of individuals that are sharing assets, you know, you build a community. Well, you certainly see that with human beings. the the question is what kind of life are we experiencing in these other planets? Like what what is life for them? Should we be so uh naive to think that it went along the exact same linear path as biological life on Earth? Or is it completely unrecognizable? And when you know we're dealing with intelligent life from other planets, maybe they'd be so intelligent they wouldn't travel and maybe they don't need to. And maybe they're also dealing with solar systems that you know we have as a result of multiple impacts including the creation of Earth itself, right? There was Earth and there was Earth 2. We were hit by another planet. They think that's what created the moon. Like all that stuff leaves debris. It's all flying. And if it wasn't for Jupiter, we would have never made it this far. Absolutely. Never made. That's our protector. Yep. Absolutely correct. We would have never made it to 2025. We would have been dust a long time ago. And we have a form of biological myopia thinking that we need sunlight and oxygen for life, right? And now we, you know, from Chernobyl, we know that fungi can use radioactivity as an energy source. Mhm. We have methane based organisms. Yeah. Isn't that crazy? Yeah. So methane based organisms. I believe matter gets life. Life becomes single cells. Single cells form change. They branch. Networks form. Right. And within these networks are associations of members that exchange resources. I I don't believe that, you know, evolution is based on survival of the fittest. I believe it's the evolution is based on the extension of generosity beyond that of your own needs to build a community of recip of reciprocity. Certainly human evolution. I think it's happening all all over with tigers and giz. I think absolutely. You know, we're animals. New news. New news. We're animals for sure. But they're not very generous. They just try to they're just trying to eat and survive. There's a great um on Chile there's a great footage that's amazing of these orcas aka uh killer whales just devastating a seal population eating them. You may have seen this. And after they were satiated, these orcas would take the pups and they push them up on shore to save them. Just to save them. Well, they're very intelligent, which is one of the more interesting things about orcas that they don't kill people unless they're at SeaWorld. Yeah. Yeah. Which is probably where they should be killing people. Yeah. I just met a herpatologist and um I raised snapping turtles when I was a kid. So, I have the the turtle necklace. I was this very shy boy with a profound stuttering habit. And but my friends are wild snapping turtles. And this hertologist, he goes, &quot;Well, I had snapping turtles. They're really mean.&quot; And I had them in my aquarium and they kept on trying to bite me. I\n\n\nGo, \"No\nSherlock.\" You know, I had wild\nsnapping turtles in a pond, and I went\ndown there. I fed them celery and\nlettuce. This is when I'm 8 years old. I\nhad them for about seven years. Um, I\ngrew up with successive families. And at\nfirst, they would try to bite me and\nthings like that. And then I realized if\nI put out a little salad bowl for them,\nthey wouldn't fight each other because\nthey're not try to bite me. They would\ntry like, I want the carrot from Paul.\nRight.\nRight. When I put a little salad bowl\nthere, they kind of all came together\nand they cooperated. And so I, my one, I\njust reflecting on this yesterday. My\none of my fondest memories when I walk\ntowards the pond and boop,\nthey pop up. Oh, Paul's here.\nPaul's here. Oh, that's so cool.\nYeah. So, snapping turtles have an\namazing ability. They can snap flies out\nof the air.\nOh, they're so fast.\nThey're so fast.\nI saw this video of one uh eating a\nfish. They put a fish in front of it\nlike a dead fish, and it eats it so fast\nit just disappears. It just Yeah.\nIt just snaps its neck forward, engulfs\nthis fish, swallows it all, and it looks\nlike a magic trick.\nOh my gosh.\nYou have to look at it in slow-mo to\neven see the actually action of it.\nThere's so much sea life there. The\nBritish British Columbia is just full of\nsea life. It's certainly amazing.\nIncredible place.\nYeah. And I love it. I love it being\nthere.\nSo,\nyou know, this is a beautiful planet\nwhere we live. There's no garbage. And\nmy visitors come to visit us on on our\nisland. I said, \"Have you noticed\nthere's no garbage anywhere, not in this\nonly not ditches, anywhere.\"\nUh, it's because the ethos of that\ncommunity is to take care of the\necosystem.\nThat's beautiful. And that can be done\nif you have a small community of\nlike-minded people\nof like-minded people. The real issue is\nbe when it gets to the size of something\nlike New York City, this becomes this\ndiffusion of responsibility where you\ndon't think that you have to be\nconcerned with all this garbage is on\nthe ground because there's 20 million\npeople walking around. It's just it is\nwhat it is. Keep moving\nor India. I'm just I'm just heart torn\nby India. Such a spiritual place and\nthere's so much garbage. China as well.\nYou know this is\nbut the India thing is nuts because uh\nit's also in these areas where a lot of\nthe stuff that people buy that's\ninexpensive in America is being\nmanufactured and these factories whose\nthe back of the factory opens to this\nriver and this river is completely\nchoked with plastic and garbage and just\njunk and all the stuff that they don't\nwant they just throw into the river and\nthere's so much stuff in the river that\nI guess they just feel like well it's\nnot like I'm polluting something that's\nnot already polluted. I'm just adding to\nwhatever is there. This is just what we\ndo. And so they've developed this\nculture of like constant consistent\npollution.\nYeah. We all need to, you know, even\nteaching our children constantly to pick\nup. But there are communities that are\nexamples of doing it right.\nAnd this community that I'm associated\nwith, I'm just so proud of them. I\nwanted to talk to you about something\nthat you said earlier because you were\ntalking about human species and or or\nspecies and love and cooperation and all\nthe different things. And I said that\nyou uniquely with us, yes, love and\nrandom acts of kindness and community\nare incredibly important, but what do\nyou think? Why do you think we're so\ndifferent than all the other species on\nthe planet? And what do you think that\npsilocybin, like, do you subscribe to\nMcKenna theory? I know we've probably\ntalked about this talked about as a\nstandalone podcast. This is probably\nthis is what I like, and for all your\nlisteners out there, this is a never-\nending story. It just keeps on getting\nbetter.\nThe most exciting thing that has come\nout in the scientific literature in the\npast two years is that psilocybin\nstimulates neurons to grow.\nRight?\nThat is incredible. It docks with the\n5HT 5 HTT2A receptor. is that serotonin\nuses, but psilocybin\num alto dox with track B receptors that\nlead to proliferation of neurons.\nThere's there's neurogeneration, neuro\nregeneration, neurogenesis, and\nneuroplasticity. Um, there are four\ndistin distinct areas, and psilocin does\nall of those, not as much in\nneurogenesis, but we have done\npluroploin stem cells of humans, dosed\nthem with psilicin in the laboratory. We\nhave a DEA license. I\nhave a DEA license. Very, very strictly\ncontrolled. But we can actually see the\nproliferation of neurons compared to\ncontrols.\nUm, so this is where this is why I want\nto emphasize to all scientists\nespecially older scientists that are\nstuck in their wisdom that are very\ncomfortable with their knowledge base\nand younger scientists come up with\nthese ideas and you know\ndismiss them.\nYeah. It's a is that be more circumspect\nbecause what Dennis and and Terrence\nMcKenna postulated,\nyou know, and I disagree with lots of\nTerrence's ideas. Time wave zero was my\nmy total [ __ ] Um, but Terrence and\nI were very good friends, and we laughed\na lot, and that's I that spirit of\ncamaraderie where you can criticize\nsomeone and laugh at the same time.\nYeah.\nThat's a higher level of intelligence.\nWell, that's also what happens when you\nabandon the ego, right? The ego is\nconsistently abandoned through\npsychedelic experiences. You're much\nmore likely to laugh.\nI think psilocybin is an Einstein\nmolecule. I think the tryptoines in\ngeneral are Einstein molecules. Uh, the\nwork by Gold Dolden uh is just fantastic\nalso associated with John's Hopkins of\nthe critical window. Um, and this is why\nIbagane has has gotten such traction. In\nthe critical window with iBA, there's a\nlong window where you're able to\nuh repattern your behavior to break\naddiction.\nUh with psilocybin, there's a critical\nwindow. DMT is very, very short because\nof the short uh the short period. The\ncritical window typically is at typ at\nthe peak of the experience and just as\nyou're over the hump, you know, going\ndown. But one patient described it very\nvery well who was an addict, and the\npatient said before the psilocybin\nexperience they were literally stuck in\na rut. Stuck in a rut, and they visually\nsaw themselves on a ski slope going down\nthe ski slope again and again again\nstuck in the rut.\nYeah. And then after the psilocybin,\nit's like someone groomed the landscape,\nthe hill\nand they were free\nand they were free to to go elsewhere.\nYeah.\nAnd then Josh Seagull this past year\nfrom uh uh from Washington University\npublished a study that specifically\nshowed in real time neurite uh dendritic\nbranchings of neurons under the\ninfluence of psilocybin in real time. I\nthink psilocybin and which becomes\npsilocin what docks with your receptors.\nPsilocybin stables. Psilocin is not\npsilocybin defosphorilates into\npsilocin. It crosses into your into your\nreceptors goes into it stimulates inside\nthe nucleus of cells that cause cell\ndivision. And this is mind-boggling. I\nthink this is why high doses of\npsilocybin great for revelatory\nexperience for perhaps breaking\naddiction. But what about the near\nnormals? We all suffer from\nneurodeeneration that's age related\nbesides Alzheimer's and you other forms\nof dementia that are toxin or disease\nrelated in self as a disease you could\nargue age being one but neurodeeneration\nis a fact of life as we age and\nneuropathies occur and the neuropathies\nfrom the constriction of the peripheral\nnervous system vaso constriction etc\nsilicin is not only anti-inflammatory\nbut neurogenerative and to have this\ncoupled together. I think that the\nneotropic vitamins of psilocybin, you\nknow, as a daily consumable is something\nthat has a great future potential. Of\ncourse, we need to study this, but\nlong-term clinical studies are\ninherently very expensive. A short time\nstay in a hospital for one, you know,\nhuge event may be expensive for that\nday, but it's easier to design a\nclinical study that has a short period\nthan a long period. I think that we're\nbeginning to see now we think about 8\nmillion Americans consumes psilocybin\nthis in 2023 according to the Rand\nreport. What was the reduction in crime\nwith those 8 million people?\nIf we could have studied that\nright\nand then and there are retroactive\nstudies you know analyses that show a\nreduction of crime associated with\npsilocybin use but in real time that's\nsomething I'm very excited about. Could\nyou reduce crime rates? And moreover,\nwhen you're immunologically\nuh when you're depressed emotionally,\nyou're immunologically depressed.\nYes.\nAnd when you're happier, you're more\ncreative, you're exercising, your immune\nsystem is upregulated.\nRight.\nSo the community immunity from\npsilocybin,\nyeah,\nI think is a huge potential. There's a\ncrossover directly between your mental\nyour neuroscape and your im imunological\nstate\nunquestionably. Right. the the\ndiminishing of stress\nand this is why\nfound benefits physiologically.\nYeah. Clinical study just came out uh\ncompass pathways you know did treatment\nresistant uh depression they had an\nanalysis that came back out that showed\nmodest increase or decrease in\ndepression. Um, but they were doing\ntreatment resistant depression and and\nyou know congratulations for them for\nputting the money the money where their\nmouth is and did doing the study but\ntreatment resistant depression is a\nfailure of two anti-depressive drug\ndrugs and therapy and so but major\ndepressive disorder is a much bigger\nbucket and so I think there are some\nextreme conditions that we're not going\nto find the signal from the noise that's\nsignificant enough to make a big\ndifference but the idea of titrating\npsilocybin or psilocin maybe after a\nhero's journey and then by act of\nre-reme remembering you revisit those\nsame neurological pathways that gave you\nan advantage by taking psilocin or\npsilocybin the act of taking it again\nyou're re-remembering and then you can\nnurture these neurons I think psilocybin\ncould be nutrients for the neurons\nwell let's uh in effort to make this a\nstandalone podcast let's explain what\nwe're talking about cuz what we're\ntalking about is Terrence's stoned ape\ntheory and his theory involved\na lot of contributing factors. um one of\nthem being climate change. And the\ntheory was that as the rainforest\nreceded into grasslands, you get more\nundulate animals and they leave behind\npoop and that these uh lower primates um\nfind these mushrooms uh that are growing\non the poop and they experiment with\nthem and that the ones that did\nincreased visual acuity. They became\nmore amorous. they they were more likely\nto breed. Uh more creative, the ability\nto form sentences, glossoleia, associate\nsounds with objects and and and concepts\nand that this is probably how language\nformed among among humans and Terren's\nconnection to that when you look at the\ntimeline of when this was happening,\nwhen we know this was happening, which\ncoincides with the growth of the human\nbrain, which over a period of 2 million\nyears doubled in size, which is pretty\nphenomenal.\nUh two Yeah. 200,000 years it increased\nmassively. So two million years on the\nouter on the outer limits, 200,000 in\nthe inner inner limits.\nSo in the inner limits what was the the\namount of growth inund I think it was 40\n50% something something substantial\n200,000 years 50%. And what time period\nwas this?\nWell 200,000 years ago\n200,000 years ago there was a jump and\nbut like homo sapiens in this form have\nexisted more than 200,000 years though\nright? No,\nno,\nno. Homo homo sapiens are are relatively\nrecent. You know, I I I look at the the\nthe estimates go back and forth\ndepending on what experts you're\nconsulting and whatnot, but the from\nhomoctus to homo sapiens was a was a\nradical jump that was fairly recent.\nSo,\nI was under the impression it was more\nthan 300,000 years ago. It could be\ncould be 200,000 could be 400,000 but\nit's it's you know we are our\nenlargement of our brain is rel\nrelatively recent\nand to give more context um Dennis\nMcKenna and I were just together um\nI love that dude\nDennis McKenna is a fantastic friend and\nscientist and he's such a good man\nwell he does such a brilliant job of\nexplaining the mechanism behind the\nstone ape theory that you know like\nTerrence had a great way of talking he\nwas so interesting to listen too. And he\nhad these wonderful ideas, but Dennis is\nlike much more of a hardcore scientist.\nDennis is a science was a scientist and\nhis brother\nbreaks it down\nwas a philosopher.\nYeah.\nUm and the dentist uh uh McKenna Academy\nis a nonprofit. I'm I'm just promoting\nit just because I think they do really\nreally good work. Um\nbut this is, you know,\nthe 23 primates eat mushrooms.\nUh almost all mushrooms have maggots in\nthem. Most primates eat maggots. So\nfinding the mushrooms for maggots for\nfood, for protein, you two things can be\ntrue. Right. Right. You can find the\nmaggots, eat the mushrooms, and then get\nhigh as a community. Right.\nUm but all these again, this is an\nexample about the, you know, an example\nof the art that we see thousands of\nyears ago. We can debate this in the\npast, but we can test this. This is a\ntestable hypothesis. It's a theory now.\nIt's not a hypothesis. We know that\npsilocybin stimulates neuron\nproliferation. Terrence did not have the\nsci and Dennis did not have the\nscientific evidence for that right 30\nyears ago. We now have the evidence for\nit now. Terrence and Dennis McKenna\nshould go down in evolutionary biology\nas the as the two individuals that who\ncould see in the far event horizon way\nbefore the scientific method. How did\nthey come up with that? Because they\nwere tripping on mushrooms.\nYeah, exactly.\nThat's why scientists using psychedelics\nis a quantum leap. You know, it's how\nhow PCR was invented.\nCarrie Mullis had a trip on LSD\nCrick and DNA and Steven Jobs.\nSilicon Valley is fueled by psychedelic\nthinkers who are become more creative\nand we I I think we have a crisis in\ncreativity and psilocybin is a way for\nus to become smarter, more congenial,\nmore collaborative.\nI couldn't agree more,\nyou know, and I think we can this\ncombines psychedelics with AI. We have\nan opportunity for the quantum leap in\nand the evolution of the human species.\nDo would you mind explaining time wave\nzero because we kind of gloss over that\ntoo. Hey big so such a\n\n\nSkeptic.\n\nTime Wave Zero is an algorithm that, I think, Terrence in one of his stone moments. Um, Terrence is the only person that I met who could smoke me under the table and stand up and give an incredibly perfect lecture. I don't know how he could do it. Um, but time wave zero, and I'm sorry for those people who are time wave zero experts. You can criticize me if you wish, but I admit my ignorance to a degree, is an algorithm that was created that would predict events in history, would attract novelty and episodic events that change the course of human history, right?\n\nHe didn't have the birth of Jesus Christ as a significant event. He was sort of anti-Christian. I said, \"Terrence, I don't care if you're Christian or not. The birth of Jesus Christ was a huge friaking phenomenon. It changed the course of history, right?\"\n\nAnd then he had, uh, Time Wave Zero would end on December 21st, 2012. And that's what he predicted. December 21st. Yeah. December 21st, 2012. And that didn't happen either. I used to have a license plate that said 12112.\n\nYeah. So, but, but you know, it's what I like about Terrence, and I would encourage all protective scientists if you don't worry about tenure, if you got a thick skin, dare to be wrong because you dare to be wrong a dozen, 20, 30 times, you might be hitting one or two concepts that is game-changing, right? Don't let the fear of failure inhibit your creativity. But that's a giant problem in the academic world is that people who do fail get attacked, and people, and especially when they step outside the lines, they propose something that's novel, they get attacked.\n\nThis Time Wave Zero thing, like, you used to be able to get it. It was an actual program that you could download and you could run it on your own computer. Yeah. And that's the thing I talked to Terrence. I go, \"Well, what happens when you know there like the birth of Jesus Christ?\"\n\nHow did you come up with that concept? Did you ask him about that?\n\nNo, I never figured it out. He goes, \"We'll just adapt the algorithm.\"\n\nI said, \"Okay, then it's not really, it's just something that's constantly adapting itself.\"\n\nSo, anyhow, it was a, it's a thought experiment. And, um, and obviously, I wish he was alive on December 21st, 2012. I'll be like, \"And, and what?\"\n\nBut maybe we're wrong. Maybe in that timeline, something did happen on December 21st, 2012, that will be recognized in the future. I, I doubt it. But, well, this is what I'm, we're getting to. One of the things that did happen in that time frame is the ubiquitous use of social media. It kind of started peaking around 2012.\n\nI think there was a real problem with that with, with the human race, and I don't necessarily think we recognize things that are constant. You know, I think we just get accustomed to things, and human beings are very adaptable, and we just accept things that this is the way it is. But before that time, you know, when you, you get to like 200, you know, just go to 2000, people weren't carrying their phones around staring at them all day. There's a profound change in how we interface with the world.\n\nYou know, in Korea now, on the sidewalks, they have red bars that light up to tell you to stop. Oh boy. Because too many people are walking out into the street just standing there staring at their cell phones. So now they look down and they see that. They're so addictive. It's so crazy that we haven't, anything that's that addictive can't be good for you. I don't care if you're getting information all day long, and, and in the sense of social media, you're getting negative information all day long. So, it changes the perspective.\n\nTremendous amounts of clickbait.\n\nWell, that was the problem we were talking about about the media earlier, about the media fueling this stuff. That's their job. Unfortunately, in this day and age where no one's buying print journalism, their, their job is to get you to click on something. And so they have these crazy headlines.\n\nWe need to really have a thoughtful discussion about all the issues that we are facing today without being reactionary. Yes. And I think we need to disengage with these things that are clickbait. Just don't click on them. The way these things operate is the more you click on them, the more valuable they are, right? That's, that's the whole business model. Just don't engage with them. And we need to teach people that. Like, this is an important thing. Don't engage with something that's trying to manipulate you. Don't engage with these narratives that are being put forth by corporations that value your fear. They want you to be in this constant state of anxiety and fear. And you, they want you to be a dutiful consumer, and that's it.\n\nAnd that's why, yeah. That's why high doses of psilocybin is not a very good, uh, business model. Exactly. As Michael Pollan likes to say. But it is a good business model for overall human compassion and growth in the community. And then, of course, medium and micro dosing. Um, really popular practice right now, increasingly popular, is a high dose of psilocybin once a year and then micro-dosing just before you go to sleep or a medium dose, like the museum dose.\n\nMuseum dose. I like it.\n\nYou guys are such, you're such a [ __ ] mushroom head that you have like museum doses. This is a movie dose. This is a concert dose. A date night dose. Uh, Graham Hancock and I, and, and, and, um, um, and some friends went to a museum in the British Museum, and, uh, and but any museum dosers just tend to, you can notice them because they wear sunglasses inside because otherwise they're pupils trying to keep it together. Keep it together.\n\nBut the idea of taking a museum dose, quote unquote, or a micro dose before sleep is that's when you're regenerating. Uh-huh. That's when your body and your brain is regenerating. So, that is really, really interesting is taking th, those, those.\n\nWell, that makes sense. Especially from like an anti-aging protocol for the mind, and it's also safer. Yeah. Right. You're in bed. You're not going anywhere. You're not going anywhere. Yeah. Tractor. That's why I think clinical studies that look more and more at reducing the expense, having people take the dose of medicine, in this case, just before sleeping, they're in a safe place.\n\nYou know, I had, uh, Bernie Sanders on the podcast yesterday, and one of the things that we talked about quite a bit was, um, what's going to happen with people when automation takes over, when AI and automation take over, and so many people are not working anymore. And we, we both kind of agree that universal basic income is really the only way to mitigate the disastrous effects of people losing their income, losing their jobs. And I think it's a good thing. But the problem with universal being basic income is that just giving people a check, they don't have, they don't have meaning anymore. They don't feel like they have a purpose. They don't feel like they have an identity. You know, if you're, your whole life you've been, you know, ex, whatever the job is that gets taken away, and you recognize they're being really good at your job, and you take pride in that, and you're known by your co-workers as like, \"Hey, go to Paul. He's the best. He'll take care of it. He, he knows what he's doing.\" Then all of a sudden that job disappears. How do people find value, and how do they switch their perspective?\n\nAnd talking to you today, I think is perfect because I think if there's anything that could help us through this journey, that could help people make this transition, which appears to be inevitable, where artificial intelligence is going to do a far better job at a lot of menial tasks that people have been doing for an occupation for a long time, to find a search for meaning, to have to find some other way to realize value in life and not just to be a cog in the feel of this capitalist society. But instead, maybe psilocybin would allow people to completely change their perspective of how they exist in this world, and that you've been kind of trapped in this society where it values numbers. It values a constant growth for the shareholders. And it, it values what you can see in your bank account that's like not even real. It's all this digital money that's somewhere. Maybe psilocybin would be the best answer for how do people make this transition and reacquire a sense of meaning, right?\n\nI mean, do you want to spend your whole life on assembly line, or do you want to be out more in, in nature with your children? That's why I think nature relatedness, you know, is, is, is a mental health advantage. You know, the more that we can relate to nature. Yes. And, um, literally kind of go back to our roots, you know, re-engaging nature. I think this is, and then, and that would give you a sense of purpose instead of the job, and also protection of, of the, the mothership. But we've gotten so accustomed to this idea that your purpose is to make money. Your purpose is to make a living. And we've accepted that, even though it's a fairly new concept in terms of the age of the earth. You know, this is a human-created concept, but it's, it overwhelms our day-to-day existence. It doesn't have to though, you know, but we, in this structure, the way we find ourselves now, you take away meaning, you take away a purpose in life, and you just give people a government check every month that covers everything. Covers your food, covers your rent, covers, you don't need to make money anymore because everything is automated. Everything is cheap. AI controls it all. So, what was Bernie's answer to that? He didn't have one.\n\nYeah, he didn't know. Um, but I don't know if Bernie's had any experiences in that regard, and he didn't have that perspective, but talking to you right afterwards might be the answer because this is an inevitable journey that we're on of, of a revolutionary change in how society is structured. But it doesn't have to be negative. The problem is the people that are in control of AI and these systems, the people that will benefit from them incredibly in a financial sense, those people are not having these experiences. And if they were having these experiences, they could be the only ones, if, if you have a benevolent person in extreme position of power, they're probably the only people that can really do something about that. And I think it's very important that they hear this, that you realize like, you're wasting this valuable moment in life trying to acquire money when we have this very unique opportunity to connect together in a way that people probably used to do on a regular basis in the past, but was always suppressed by the powers that be because of its revolutionary powers.\n\nIf psilocybin increases creativity, and creativity increases happiness, and happiness upregulates the, uh, immunity of the community. Yeah. It's hard to be a dictator. Yeah. Yeah. You got to, the dictators want people in constant conflict, fighting against each other, and you know, and they take advantage of that in a sense. You know, that, that an analogy that the patients had had about being in a rut. You know, maybe we're in a societal rut. Maybe we certainly are. So this is the opportunity as for to be able to groom the landscape and to find new ways of, of living and behaving.\n\nI, I, it might be the only way, it might be the only way we can get through this because if you, if you think about what this problem is, the problem is, is, uh, the way we interface with reality. That's really what it is. If, if we're, we have been interfacing with reality a very particular way, showing up at work every day, doing our job, getting a paycheck, employee of the month, yay. That's how you interface reality most of your life. And then all a sudden you're met with this profound technological change that's going to eliminate your job. What, there needs to be some sort of a profound experience that reintegrates you with the mother, like lets you know, like, this is, this is something people made. This is something that people made, and most of the people that made it weren't having psychedelic experiences, and they're building cities, and they're building skyscrapers, and they're polluting the river, and they're doing all this stuff, and it doesn't mean that this is how we're supposed to do it.\n\nExactly. And I again, I want to reiterate, I think we have a crisis in creativity. I think psilocybin and these other psychedelics stimulate creativity. Look at, look at Alex and Allison Gray's work. I mean, some of the best psychedelic artists in the world and nicest people. Alex is like, like, he's a role model for, like, being, like, being just a kind, nice, sweet person. And Alex gave me some of the, the best advice I've ever received. And I, it's, give Alex Gray total credit for this. And I ask him, you know, like, this is my eighth book. Oh my god, it's so much work to write a book. I didn't use any AI writing this book. I wrote the whole thing myself. And I asked Alex, you know, you're so prolific. How do you do it? He goes, \"I had one realization. Every day I go up to that canvas with my brush, and I commit to making one stroke,\" and then three, four hours later, he's still at the canvas. It's that, which is just that, that tipping point, right? Yeah. Calling the muse. Yeah. Just doing it. And Presfield talked about that in The War of Art. Have you read that book? No. I've got copies of it. He sent me a whole box because back in Los Angeles, I used to keep a, a stack of them on the table and hand them out to people. It's all about creating things and resistance and this, this thing that we all have where we, we're reluctant to sit down and actually do the work. But if you could just commit, and he would, he calls it the muse. He, like, and many, many creative people over time have called upon the muse and this concept, and it sounds like airy fairy to a lot of people, but if you believe in it, and if you, you actually do that thing where you call upon the muse, it actually works. So whether or not it's real is irrelevant.\n\nWell, I have, I have a muse, and my partner asked me, you know, a few, a few months ago, \"How many more hours do you have to work on this book?\" She saw me working, work, work on the book for two and a half years. And I said, \"Oh, more than 500 hours?\" She goes, \"500 hours?\"\n\n\nIt's just so much discipline. And if you, anyone, any writers of books, any people built a house, if you comprehended the enormity of their project, you probably wouldn't even start, right?\nYeah.\nI can't think like that.\nYou just got to think about the process.\nBut the process, and so I had this little voice in my head, um, that I would wake up, and I didn't want to feel guilty about it, but I, you know, I had this little voice saying, \"Work on the book, Paul. Work on the book. Work, work on the book. Work on the book. Work on the book. Work on the book. Work on the book.\" My, I could say it worked in the book so fast because I have reiterated it in my head hundreds of times that it became sort of my muse. It became sort of a fun muse. Um, I think we all have these little voices that kind of, you know, says, you know, get it right, stuts, you know, wake up.\nI think so too.\nAnd I think that's good.\nI don't think that's, you know, psychosis. And I think that's something that we all have, these little voices that are trying to help us to be better. And yeah, whether it's internal or external, whatever it is, you can have a voice. It's like working out, the discipline of being able to, to, to make sure that you're the best that you can be. So, it's a very exciting time that we live in. There's a mushroom revolution happening all over the planet.\nI think there's a psychedelic revolution that's happening all over the planet. I think it's happened over the last 20 years, and I think it's happened because the internet. I think that's a big factor because what they did in the 1970s by, you know, what the Nixon administration did, which is essentially to squash the civil rights movement and the anti-war movement. What they did really [ __ ] up society for a long time, and it put in people's heads that this is how we're supposed to be, that these laws that are in place make sense and that they're there in order for society to function at its optimal levels. It's just not true. And, uh, unfortunately, like a lot of things that get that propaganda gets pushed, and people start accepting that propaganda as fact. It takes a long time, relatively in our lifetimes, to sort of recognize that this is not right, and this is not how we should have been living the entire time. This just is, we were trapped. We were trapped in the system. And because of the internet and because of conversations and because of people like you that talk about this openly and many, many others as well, we're all contributing to this base of knowledge where people are in their car right now sort of reconsidering their perspective. They're at the gym right now on the treadmill thinking about this going, \"Yeah, why do, why do we allow these human beings that have never had these experiences to tell us that these experiences are not just not allowed?\"\nBut if you get caught with these things, you'll be put in a cage.\nYeah.\nWell, because we are, we are those of us from the psychedelic community who advocate for the freedom of consciousness as a basic civil right, we are by definition disruptors to authoritarianism. Yeah.\nSo, you know, this is what, this is why I think, unfortunately, in many cultures, it's become restricted to just the small group of priests cognizante they wanted to control and have gates to, uh, to heaven or the control consciousness.\nAnd so I'm, I think that, you know, what's so exciting about psilocybin and psilocybin mushrooms as a practice and hunting mushrooms in general, it just gives you a quality of life that's just a gamecher. Yeah. Now with iNaturalist and everything that you can do, it's just getting people out in nature with their children.\nChildren are closer to the ground, so they find more mushrooms.\nYeah.\nThey're be, you know, they're away from the business and their parents and the phones, you know, some phones. But you get them involved and interacting with nature. It's just, uh, it's just really, it's like the telescope and then, um, seeing all the galaxies.\nAnd I think interacting with nature is a vitamin.\nYeah.\nI think it's just, it's like, you know, how we get vitamin D from the sun. I think we get something that hasn't been measured yet from interacting with nature. We, we know that there's an alleviation, you can, you can actually study an alleviation of stress levels from people that go out into nature. And this, this thing that we're experiencing, we just don't know how to measure it. Yeah.\nYou know, and I, I think it's a real thing.\nOne of the things that makes me very happy and hopeful now is that you're seeing this, um, this openness to psychedelics that's coming from more right-wing people. And it was always a thing of the left. It was always a thing of hippies. And, and it was dismissed by people on the right as people that were trying to avoid reality. They were trying to, you know, escape reality. They couldn't handle reality. They weren't disciplined. They weren't, you know, if they were hardworking people, they wouldn't be wasting their time getting high on drugs. There's that thought. I think one of the bridges to that is the benefit that it's had for soldiers, for soldiers and for people that are first responders, people that suffer from PTSD. And that has trickled down into the general population of the people on the right, which is how you get a guy like Rick Perry that is all of a sudden becoming this very strong advocate for Ibagane and having it passed in Texas.\nSo the, the initiative passed, which is huge.\nIt's huge.\nI, that's, it's a promising step in the direction of understanding that a lot of the division that we have in this country is artificial. It's manufactured.\nIt is.\nI, out of the blue, a country music singer, which I had no idea who she was. Casey Musgraves, she's a superstar in country music.\nI'm out of the loop.\nYeah.\nI, she reached out to me and, um, she had a psilocybin experience that inspired her. She's has an album called Deeper Well that's just amazing. I was not in the country music until I listened to her, and she reached out to me because of her psilocybin experience. Um, and we rent, we decided to do Sing for Science. We sold out the Ryman Theater in Nashville in 3 hours.\nOh, wow.\n2,500 people. These are country music people.\n2,500 people. Three hours. Unfortunately, she was in Mexico. She fell and she broke her rib. So, we had to cancel the concert until September 18th or the Sing for Science. But that is an example. And yeah, well, I think my friend Sturgil Simpson sort of opened up the door for psychedelics and country music with turtles all the way down. Yep.\nYou know, he basically wrote a song about God and psychedelics.\nIt's, um, you know, I,\nThat was a country song. And everybody's like, \"Hey, what the hell's going on?\"\nIt's funny because psychedelics, uh, build bridges that marijuana doesn't. It's, um, it's, I met a lot of people who would never smoke a joint, but the idea of doing a slow mushroom sound like fun to them, right?\nWell, marijuana is also associated with lazy people and narrwells and stinky people with bad ideas, you know, unfortunately. And I think, uh, you know, look, there's a, one of the things that's interesting is the jiu-jitsu community is, uh, there's a lot of stoners in the jiu-jitsu community. A lot of people using psychedelics for athletic performance.\nOh, yeah.\nWell, I know a bunch of people who have fought on mushrooms. Yeah. You know, I have a friend who was a world-class kickboxer who had some of his greatest performances while he was fighting on mushrooms, and he said he could see what the guy was going to do before he did it.\nYeah.\nThis is the indigenous use of SoulCon is to see into the future.\nThat's one of the thing of advantages I think I've had also been able to prognosticate, um, into the future.\nThere's a, there we had this extraordinary individual, um, told me a story, which I, I think I have right, but I want to share it with you. There's a game that's very common. It's even in the Philippines, but in Canada, it's a German game eventually. And the idea is you put nails on a block of wood and use an ice pick, and you have to hammer the nail in with one hit. And each time in a bar or party or whatever, people throw down money, $5, $20, etc.\nA nail on an ice pick. So you have the point of the ice pick. You got to hit that nail at the very point. Sink it and sink it all the way into the wood. So, of course, you go around, people are drinking, etc. Um, so the story as I remember him telling me is that he went to the bathroom. He's not a toker. He doesn't smoke pot, but someone say, \"Hey, you want some mushrooms?\" And they're playing this game, and there was a, a bunch of his friends were gathered, and, and he goes, \"Oh, sure. I'll try some mushrooms.\" So, he ate some mushrooms. And he came back, and he's the, the circle was there, and people were betting, \"Hey, come over and join us. Join, you know, and he watched for a while, never had played this game, and, and then he started getting higher and higher, and, and they said, \"Come on, it's your turn.\" So, he kind of looked at the nail. I mean, this is really hard to do. Looked at the nail and looked at the nail and focused on it. He said he had such clarity of focus that everything else was blanked out. He looked at the nail, and he just thought they would connect rather than hitting it. They would just connect.\nOh, bam.\nSlammed the nail down on their first attempt. People went, \"Whoa, incredible.\" So they put down, each person put down more money going around. So they came around, everyone's missing, everyone missing. Some people occasionally hit it a little bit, you know, but came around, came around to him. Now he's getting higher on the mushrooms, right? And he's looking at it, looking at it, and he goes, bam, slams it again. People going, \"No way.\" Right? This is impossible. Right? So now, you know, there's a lot of money being piled up on the table here. They're coming around, and everyone's going, \"Impossible. Not going to happen. Can't do it a third time in a row.\" Looked at it laser focused. God, bam. Slam it again. Now people are losing their [ __ ], right? They're like, \"What is going on here?\" And said, he said, \"Really to [ __ ] with one guy who was just out of his mind that he could do this three times in a row.\" He went around again, and this time he says, \"I'm going to really blow his mind.\" So he focused on the nail. Focused on nail, had the hammer, looked at him, bam, slammed it again while he's looking and nailed it. Yeah, literally nailed it.\nSo, so these examples of,\nWell, that brings you to the stone date theory. Part of the concept.\nWell, kind of the concept is you, you know, with an intense focus, right?\nYou know, and many years, I, I, I have two black belts. I had schools for 30 years. Black belt in Taekwondo and Hano. I was in Shonuru u Gojuru. Uh, uh, and then taekwond do and then hango, which is like hapkido. Um, but that idea of having a three-dimensional perspective.\nMhm.\nOne of my best, one of my fun experiences, I was in the dojang or dojo, but Josh, Japanese dojang as Korean. And, u, I had my first black belt, and, and, uh, uh, my head instructor was over there talking at someone, and then he had a baseball, and he, he, and I heard later what he said. He, I told my friend, watch this. He threw a baseball at me. My peripheral vision, boom. I just caught the baseball, and you know, just before it hit my head. But that idea of having that consciousness surrounding, that's why athleticism with medium doses, minor doses of psilocybin, I think you can train, uh, your neurons to be able to have this peripheral awareness that's extremely important. It also alleviates the anxiety that comes before performance because a lot of people like to use it before sparring because sparring is kind of scary for some people.\nYeah.\nBut let's be clear. This is like the 80/20 principle, maybe the 90/10 principle. It's not going to work for the majority of people. There are exceptional individuals who can actually benefit from this. So, I'm not, we're not disclaimer.\nYeah.\nNo, no disclaimer there. I don't want to make,\nNo, none of the drove this race car.\nListen, don't take any of our advice.\ndown.\nBut we're just talking about these things because they, there are anecdotal stories that are, they're fascinating, and I, and anecdotal stories are like case studies in medicine. You get enough of them that you want to test this. Again, this is a testable hypothesis or theory in modern times, right?\nI coordination, you know, so psychoot enhancement, you know, and this is why when you know the stamina stack is, it speaks to this. We published in nature scientific reports and a combination of psilocybin, uh, nasin and lion's mane increased psycho motor ability of tapping in 10 seconds from 46 to 66 taps.\nThat's a lot.\nUh, that's a lot in, in, in 10 seconds over 30 days. So people can argue about it, but the results are the results. You know, when you're talking about depression, anxiety, that's subjective. But I'm really interested in the psycho motor benefits of psilocybin with an admixture to enhance, yeah, you know, its performance. I think the root thing is psilocybin, um, and being able to regenerate neurons is something I think is really important, uh, for us now with glyobblasto, you know, which unfortunately, Terrence did die from that, that's uncontrolled, you know, proliferation of neurons in the brain. Yeah, there sure there's contra indications. Do you think there's something that's connected to that? This is,\nNo, not, I personally don't. No.\nWhy not?\nUm, just because I'm, I,\n\n\nI don't have evidence to the contrary. I don't have evidence that also suggests that. I see no correlation. And if one is not, you know, it's again, it's there's no because it's not a common thing amongst people that are using psilocybin.\nBut if you had 8 million people in the United States, you know, um, conducing psilocybin, again, you have a data set. Right? So like it's not like cigarettes, right? We see cigarettes, we know you smoke cigarettes, there's a higher likelihood that you're going to get lung cancer, right? It's very clear. So we've known that over time. The problem with psilocybin is it's been so taboo. And so we don't have real data. We don't have, you know,\nbut there's 235 clinical studies on psilocybin at clinicaltrials.gov right now.\nIsn't that amazing?\n235.\nCould you have imagined that 25 years ago?\nThere was none. Impossible.\nYeah. None. And there are for many indications, many different targets from addiction, cigarettes, you know, alcohol, opioid use to dementia to Parkinson's, Alzheimer's, etc. Yeah.\nSo, there's, you know, I think psilocybin has a PR problem. It sounds too good to be true, but you know, sometimes things can be true that have but but the reason why I think that there's 235 clinical studies is because basically it's improving your neuroscape.\nYou're improving the neurology.\nEverything that we're using right now is based to our health of our nervous system, right?\nAnd in the neuroscape, if we can enrich the neuroscape, then that has elaborations into everything that we do. And the fact is it's coupled with anti-inflammatory activities and neurogenesis and neuro regeneration, neurogeneration, neuroplasticity which is synaptogenesis. The neurons proliferate and then they shake hands and then suddenly you have a new pathway. So there's anti-inflammatory properties.\nSilicon has strong anti-inflammatory properties as well.\nInteresting.\nSo that's that's just has come out in the scientific literature. So that's I wasn't aware of that.\nYeah, that's really interesting. How did they study that and and what was the they something called interlucan 6 um there was a clinical study that was just published just recently and a downregulated it's a tumor necrosis factor in lucan 6 a down regulated that's an inflammatory cytoine there's two anti-inflammatory cytoines that are extremely interesting to us in our research team I have five PhD scientists eight full-time scientists that's why I created my business is to do research.\nBut interlucan um 10 and interlucan 1 RA are are anti-inflammatory cytoines. So when you can upregulate those then it kind of buffers the inflammatory effects. And uh and so that's exciting to find uh these anti-inflammatory that that's we were approved by the FDA for a co clinical trial based on the fact that we published this in the journal of inflammation research that uh interlucan 10 and interlucan 1RA were stimulated by agarakon and turkey tail mycelium um grown on rice versus the rice control.\nSo as a peer-reviewed article when you know the pandemic started the big concern was if you stimulate the immune system you could have a cytoine storm and you could overwhelm you know the body with many many it's been said many if not most people die from cytoine storm is there overreaction of the immune system uh to to covid and to other diseases. So we were able to show you can augment in the literature uh uh uh your immune system buffered with the anti-inflammatory uh properties and that that sort of resolve the argument of the the cytoine storm concern.\nMhm.\nAnd then now we have a very successful study that shows that agaracon and turkey tail mycelium um enhances the immunity of individuals long term.\nSix months later mushroom that you gave me.\nYeah, you still have that.\nYeah, it's right there.\nThat's a trophy.\nYeah. Oh, it's never leaving the desk. That sucker.\nAnd this is a a great example because this is an endangered species in Europe. It's on the red list of extinction in Europe. It is in Europe. These are growth rings. So this one's probably 25 years of age.\nThis is a very nice specimen.\nStamets gave you this.\nYes. You gave me this.\nIt's one of the nicest specimens.\nSo these are annual growth rings.\nIsn't it cool to see it on the desk?\nI love it. Thank you.\nPeople always ask, \"What the hell is that?\"\nSo this is a garacon called fomytopuselis, also known as Larissopies. Dascarites first described it in Greek medicine 2,000 years ago as elixir adlongum vitam, the elixir of long life.\nIf someone took a little piece of that and put it in the ground, would it start making new agaracon mushrooms?\nIf they had spores, um, it looks like it goes inside the roots of trees. This one being as old as it is and being spores are probably become not viable. But agaracon has the white form and the brown form. It goes through this massive transition as biochemistry. And because it's endangered and because highly variable in form, fruit body extracts of this makes no sense.\nWhy is it endangered in Europe and not in America?\nOnly grows in old growth forest.\nOh.\nSo the sky islands in Europe in Austria and Slovenia um is is where this still can be found on larch trees. We now have I think 115 strains of agaracon. By far the largest library in the world. If you ask me what is my most valuable possession is my strain library of agaracon. is a is you know it's a it's a treasure of strains.\nOne out of 20 one out of a hundred times in the old growth forest where I find one. So we don't collect these unless it's going to be clearcut or we find them on the ground or if it's on my own property and then I take a small piece of tissue. It's the mycelium that is bioactive for the immune system. And this is what we found that we're it's scalable. The mycelium is scalable. The fruit body extracts are not. And it's highly variable. Most people don't know that, well, they should know, but most mushrooms are parasitized by insects and and that's because the insects spread spores. So the mushrooms invite insects to come in.\nSo it can spread spores. It's like like cortiseps and ants.\nYeah. Or like buzz pollination.\nThat's the weirdest thing when you see spiders and ants overwhelmed by cortiseps.\nYeah. It's um I like to say cortiseps has to eat too. So I mean this is the cycle of life, right? So this Agaracon is is in the bioshield bio defense program. We\nwhich by the way this is your company Host Defense. You have great stuff man. I I buy your stuff.\nYou gave me a bunch of it but I buy it.\nWell thank you for your support. We need it. I mean I'm the only company that does research that I know of.\nI spend over a million dollars a year in fundamental research. Thinking outside of the box. Even though traditional Chinese medicine was fantastic and has a thousands of year history, all traditional medicines advanced with new technologies. That's true across the board. The invention of invitro propagation about a hundred years ago growing mycelium now opens up this huge opportunity for us to dive into a deeper well of natural substances that can be used as adjunct therapies to enhance conventional medicine. This is a game changer. So 115 strains of agarakan. I submitted eight of them to the bio shield bio defense program after 911 2004. My TED talk talks about this and I found two or three strains highly active against small pox and also against bird flu. Um and if you go to national public radio put Stamets and small pox you'll see a vetted press release you know from DoD and the head of the bio shield program Jackris saying that whoops these are some of the most significant results they've ever seen.\nWow. The only at 2 million samples submitted were in the top 10. The only natural product. Now that's in vitro. So that in vitro, this is sort of a timeline. And you don't have boy with a microphone, do you, Jamie?\nWhat is that?\nYou didn't see it? Okay.\nWhat is boy with a microphone?\nIt's a 42 second clip we found in the vault. Um, and it talks. It's me with my son when he's four years old. And I'm on the phone saying, \"I've created this company to do research. Research is what we want to do.\" Truly, that's the origins of of what I was trying to why I created my business. So, I still do that. So, with the 115 strains, we're likely to have a super strain uh in our collection. Pandemics are coming all the time. We're in a viral storm. There's a bird flu pandemic where many of us are so surprised that it has not happened at a bigger level. But viral pandemics are also affecting other animals besides birds and pigs.\nMhm.\n67% of beehives were lost in Montana this past year. 67%.\nImagine if you had 67% loss of a herd of cattle or sheep.\nThat's phenomenal.\nAnd bird flu is spreading. It's making the jumps. It is coming, folks. And so what we want to do is design a clinical study using Agaracon to test against bird flu. I'd be interested to see what, if anything, could be done with some of these mushrooms with chronic wasting disease, which is a huge concern among deer population and and even some other animals like moose and I think embedded into a mycelial landscape.\nMycelium is everywhere. The interactions of mycelium and animals, you know, is elaborate, complex. This is crazy. And if anyone out here can prove me wrong, please send me the reference. But it appears I'm the first person to realize that bees go to rotted logs with mycelium for immunological benefit.\nReally?\nFirst person. How is that possible? We all grew up with Wendy the pooh. I mean this is mindboggling. It's like again how it didn't take a stroke of genius but in my case I had the bio shield results and then I heard about colony collapse being vetored primarily by mites. This past year they identified the mitoide resistant mites which most all of them are now are vectors of the deformed wing virus. Colony collapse is a threat to food biocurity\nand we found and we published this in nature scientific reports extract polypore mushroom mycelium protects bees from viruses.\nWe published that in in nature scientific reports I'm the primary author. We were able to reduce viruses, the deformed wing virus by I think 879 times in 12 days with one treatment.\nSo that is phenomenal for protecting food biocurity. That helps all farmers. It helps. And there's a pandemic that's spreading. 67% lost, 60% lost generally across the United States this year. The worst colony collapse on in history.\nThis will make food prices go up and it doesn't stop because these viruses are proliferating throughout the environment. We found that the polypora mushroom mycelium grown on grain or grown on sawdust not only reduces these viruses but extends longevity and so the longevity and interesting that this mushroom is known as elixir adlong vitam, the elixir of long life.\nWow.\nWe are all bees are animals birds are animals you know pigs are animals humans are animals we are all I think can have an imunological benefit from you know in incorporating these these fungi. Now, we're allowed by the FDA to say supporting innate immunity in healthy individuals. We're not allowed to make any disease claims. Ironically, we can't make that same claim with bees. We can say extends longevity, but this is where there's not common sense in government. I have an invention that could save hundreds of billions of of of dollars that protect bees from colony collapse and we're roadblocked by regulations constantly.\nOh, reduce viruses in bees. You have antiviral drug. What is it? No, we haven't been able to find antiviral drug. We think it's an entourage effect and upreguling, you know, basic immunity and then your indogenous immune system in this case of the bees can fight the viruses. So, and this I think will translate into birds into swine.\nSo, there's resistance to these results.\nNo, because your immunity is so\nNo, no, no. I mean publicly like you're saying you can't make these claims but if you have results,\nwe have fantastic results. I refer anyone to scientific uh you know to nature scientific reports.\nSo, could you elaborate on what the resistance is?\nWell, the resistance is is complicated and as political.\nThe old school conventional wisdom is that if you have a drug-like effect, then you have an undeclared drug in your product.\nIsn't that funny?\nYeah. Nature.\nSo, even though even though it's from nature, even though bees go to rotted logs for immune benefit, and now there's five or six papers have been published on this after my discovery showing that bees are doing this. their bees are actually benefiting from mushroom mycelium. So\nwe're we're working with Washington State University, great people there. Uh we're working with several funders.\nWe have tested this now over and over again. This is a this is an outdoor animal clinical study, double blind placebo controlled using the mycelium grown on rice or on sawdust versus the sawdust or the rice as a control.\nClearly clearly a benefit. So this is scalable. You can't harvest fruit bodies in a way that you can scale mycelium. Myelium is exponential increase in my little mass virtually every week. 10 x 10 x 10 x 10 x 10 10 or even 10 x 100 time 100 time 100 massively scalable. I think I have found something as a portal through my psychedelic experiences that's fundamental to protecting life on this planet is that the mycelial networks are deep reservoirs of being able to immunologically enhance animals where we don't have to have these all these antiviral drugs, antibiotic drugs. Your indogenous immune systems are upregulated because over hundreds of millions of years we've been interacting with these. is our immuno depression and suppression because of all the factors we know bad diet toxins you know you know lifestyle all those things that this is highly scalable. So now we're trying to navigate through the regulatory landscape. There was this strange committee that was in secret, met once a year for any new ingredient to add to bees because bees make honey. Humans consume honey. If we use our product, they could say we have undisclosed drug in the honey. So whatever. But it also translates to wild bees. It turns out that Apis mellifera, the honey\n\n\nBees with the viruses, when they have the viruses, they go to flowers frequented by bumblebees. So, colony collapse is happening not only with a cultivated honeybee, but it's spread to other bees. This is an ecological catastrophe of a viral pandemic that's spreading around the world. We have the solution right now that is highly scalable, and this regulatory committee disappeared in the past two years. This is before the last administration was voted in, but they didn't tell anybody. So, we had an application with them for two years to have this exempted. The whole committee is gone. The whole community is gone. They didn't even tell us that it was gone. So, we had two years spinning our thumbs waiting for them to respond. This is where we need to have common sense to come back into government. This is where our government has too many hurdles to practical solutions that are demonstrable, scalable, and affordable. The return on investment is massive, and yet we fear the FDA. We fear the USDA because they are stuck in a rut, literally. Maybe they could use psilocybin here to expand their horizons because they want to know the mode of action or the mechanism of action. Well, we didn't know the mechanism of action of aspirin until the 1970s, but it had a benefit. If it has a clear benefit and does not cause harm, then they should be exempted for scalability.\n\nNow, there's another factor to this, which is wonderful. There's a new startup company called Quorum by my friend Chris Kravitz. Disclosure, you know, I'm involved with them, but they have a metarisium, a fungus that kills mites. So, it's also been approved by the USDA for thrips and other greenhouse insects. It's not toxic to fish, not toxic to humans. So, the combination of using metarisium with the agarakon agaracon and other polyore mushroom mycelium, we think, has a great potential future. So, I think there's a lot of resources in nature that can augment conventional agricultural practices. There's a lot of resources in nature that can augment conventional medical practices. They are not necessarily an opposition.\n\nWhat is an opposition, unfortunately, and you've alluded to this, is a lot of the pharmaceutical business interests are not excited about a natural product reducing the need for vaccines, augmenting immunity. There is money in disease, right? That's always the problem: money.\n\nYou can tell I'm passionate about this because I have such a deliverable, provable solution that's scalable. I wonder if, and I'm so... My article was published in 2018, and I tell my research team, \"You know, WTF?\" We were meeting with WSU constantly, and now we have renewed interest, thankfully, because of some big stakeholders in the almond industry. Every almond you eat was visited, a flower was visited by a bee. The almond industry is in crisis right now, but it's not almonds; it's apples, it's cherries. It's across the board right now. Agriculture has been severely affected by these viral pandemics. And these same viral pandemics are mitigated, I believe, in commonality with these polyore mushrooms that grow in the woods.\n\nI wonder if that would also help animal agriculture because the ubiquitous use of antibiotics is a real concern with people, with cows, and with chickens. We had the... There's a viral pandemic of a former bird flu, not H5N1, but another bird flu. I can't remember. I think it was H7 and two, in Iowa and Minnesota about 10 years ago. They were euthanizing millions and millions of chickens and turkeys and ducks. You can look this up. There's an organic farm, and we gave one quarter of a gram of agaracon mycelium per chicken in their feed, and we became... Our... That chicken... There's two big chicken hens, about 20,000 layers, birds that lay eggs, and it became an oasis of immunity. Those chickens were immune from bird flu. Wow. A quarter of a gram of this mycelium. Wow. And we protected them. That's incredible.\n\nBut a crazy thing happened. The USDA had an insurance policy to pay the chicken growers, and they... The chicken growers quickly learned that they could get an insurance check, lay off the employees, get the cash for lost profits, and so they were not incentivized. I've heard that from people that are deeply connected to that industry that there was a bunch of euthanizations. It didn't have to happen. Didn't have to happen. Yeah. And they did it, and they inflated this whole concept, you know, because they... The numbers got grossly inflated because they were euthanizing chickens for profit.\n\nYeah, bird flu is a very serious issue. Now, I know vaccines are a very hot subject, and I know you've spoken on that. You've had some excellent guests, by the way, excellent guests or researchers on this. But I just want to give a thoughtful discussion between viruses and vaccines. Which is worse, the virus or the vaccine? I'm a libertarian. I believe every family, every individual has a right to make an informed decision. The problem that I see with the vaccine industry, the industrial vaccine, you know, complex, is the failure to disclose. I don't think Americans are stupid. I think Americans become stupid when they're not informed.\n\nMy partner's a physician. She goes, \"Giving HEP B vaccines to a child makes no sense. It's a sexually transmitted disease. Why are you giving a vaccine to a 10-year-old?\" Right? A baby, and in med school, when anyone would mention that, why are we doing this, they were vilified, right? Vilified, shut down. It's like, what happened to thoughtful, good science? It's just a reasonable question. Money happened. It's also these vaccine manufacturers are immune to the financial consequences of the side effects. Absolutely, we need to have full disclosure.\n\nNow, let me go through a thought experiment. Okay. Listen, this is my opinion. Other people may just vocally disagree with. Okay, but let's do... There's two thought experiments I want to do. First one, a million lives were saved with a vaccine. One person dies. Hey, you took it for the home team. Sorry. One person dies out of 100,000. Still, the ratio is pretty good. My mind, my judgment. Sorry again. You took it from the home team. One out of 10,000. Okay. Still, the ratio is pretty good. Okay. One out of a thousand. Okay. One out of 100. You're making me nervous. One out of 10. No. That's where I draw the line. I would say forget it.\n\nThat's now the contradiction that we have, the opposing forces here that we have, is that is it better for society to have vaccinations to protect the commons, or is it better for you to have an individual decision for your family to protect yourself if you want to? If you are going to make that decision, you should have an informed decision, right? Based on the best of science. All vaccines and all companies should disclose what is the percentage of protection. I have a physician friend who says 30% protection, but I'm sick for four or five days. I don't know. That's not worth it. 70% protection. Okay. All right. You know, so everyone has to balance the risk-benefit ratio. But we need real data to be able... We need real data. We need full disclosure, right? And for anyone to accuse another physician and vilify them because they ask a logical question and they're humiliated by the medical community is fundamentally unfair. What happened with good science? You have to follow the science. And this is so important. And that's why I think we're getting this cacophony, this echo chamber where the voices that are the loudest tend to be the stupidest sometimes, or the most compromised. Yeah. Most, and they drown out dissent. Yes.\n\nWe all should be able to ask for the data and the information to make an individual decision, and science shouldn't be this ideological or ideologically captured thing. That's why I hate the term \"anti-vaxers.\" I think it's a pejorative term. I think it's prejudiced. You know, what about people who just want to have information? \"Oh, you're an anti-vaxer.\" Yeah. Well, it's pushed just to scare people into compliance. That's the whole idea. Having these pejoratives, and you throw them around, and no one wants to be labeled that, and so you immediately get scared, but enhancing innate immunity and healthy individuals to keep us healthy. Yeah. How could that be bad? That's that's better.\n\nExactly. Well, that's the other problem that I had with the pandemic in general is that metabolic health was never discussed. It was always, \"There's only one way out of this,\" and having conversations with people that you could see, like, visually look at them, does not a metabolically healthy person make, and these people are telling you the only way to health is through a medicine that they are financially incentivized to push. That's just crazy. And when those are the prominent voices that are on television, in the media, and you're getting this from politicians, and then on top of that, you've literally have the federal government censoring social media and not allowing people to have dissenting opinions, including people from Harvard and MIT and all the people in the Great Barrington study. Why don't we have an open-source national database showing the protection of vaccines and the risk of not getting one so individuals can make a decision, right? Age-related, all these other factors. The data is there. Not making that data available to the public increases distrust, right? And so what the medical community has unfortunately done is they've bred a bunch of deniers by not giving full access to the information.\n\nWell, I think that really heightened during the pandemic because I don't think people had that much of a distrust for vaccines unless they knew someone who was vaccine-injured, unless they were gaslit and were told that their child or someone else that had gotten vaccine-injured that that was not the cause of it. And those are the people that were very skeptical, and they formed these tight communities, but they were very scared to be open and public about it because they were destroyed. You know, I famously remember Jenny McCarthy coming out and saying that she believes her child was vaccine-injured, and the backlash was spectacular. Essentially destroyed her career.\n\nWell, and one experiments are always like, did it really happen, or was it just a co-occurrence of some other factor that combined with the event of the vaccination? I mean, this is where you need to have high population studies, but those studies are available. Why are they cloaked in secrecy, and why are they not made available? It's money.\n\nYeah, I mean, the financial interest is astounding. The amount of money that's involved in it and the amount of money that they spend every year. They spend $8 billion. The pharmaceutical drug industry spends $8 billion just on advertising and on propaganda every year. That's so much money. And they're... They spend so much money on television networks. You know, I mean, how many times Anderson Cooper brought to you by Pfizer? You see these ads, and that shapes the narrative. Unfortunately, it does.\n\nBut let me just be clear from my point of view. Vaccines have done a lot of benefit, but they don't benefit everyone all the time. Not all vaccines are the same. Um, we have to be able to delineate a thoughtful scientific method with disclosed information. Absolutely. Um, that's accessible to everyone so you can make the best judgment for yourself and your family.\n\nYeah. You've got to remove this financial protection that they have from liability because if they don't have that, they're going to just jack up the amount that they give people because there's profit in that, unfortunately. And then there are vaccines that are beneficial. Let's find out which ones they are, which one... What can be mitigated in terms of, like, how can you make your overall metabolic health better before you even think about any of these things? We know for a fact that during the COVID crisis in particular, the people that had the most problem with it were the people that had co-morbidities or people that were obese, people that had all sorts of issues going on because of poor diet, poor lifestyle choices, and even, you know, genetic problems.\n\nYeah. One of the immunologists we were working with told me something I didn't know is that when you're immunocompromised or immunodepressed, vaccines don't work very well. So, they be... Those people become reservoirs for mutation, right? Which is the argument for why you don't give it to children when they're babies because their immune system isn't even functional yet.\n\nYeah. I'm... I... You know, I again, the HEP B one is a pretty clear example. That's a nutty one. Yeah. But there's a bunch of nutty ones. But the point is the vaccine schedule. If you look at what we used to take and you look at what happened when they lost their liability during the Reagan administration, all of a sudden, the schedule goes way up. Yeah. And they start adding things like HEP B, and then you realize, like, \"Oh, it's very profitable to do that.\" You imagine how much more money you make if you're injecting everybody with a HEP B vaccine. If you sell HEP B vaccines, yeah, simple mathematics. I also have met people in the pharma industry who are extremely well-intended, who are great scientists, but they... Scientists aren't the issue, right? They've also confessed to me that they face this humiliation, you know, of being ostracized for just asking questions. But again, full disclosure, let people make up their own minds. What's the cost-benefit ratio? Is it one out of a million, one out of 10? You know, it's also... You should have to show all the studies, too. You shouldn't just show the curated studies that you generated specifically with a goal of making an efficacy, like having a result that shows that this is effective. You... If you do 10 studies, you should show all 10 studies.\n\nYeah. Yeah. Well, actually, that's why clinicaltrials.gov exists, right? Is that we're cherry-picking, doing studies in Bulgaria and in India and Taiwan, and the pharma would choose the clinical study that supported their narrow... Exactly. Exactly. And then they could use deceptive language to show the efficacy. But what... What I'm getting at is that we have such a reservoir of potential ways of supporting immunity in healthy individuals in nature, right? That is not pharma-based. That's based on the entourage effect, and say when you activate the receptors in your immune system, there's something beneficial. I believe there's cross-talk between the receptors. The receptors start, \"Oh, something really good is coming down the pipe,\" and they start um creating an entourage effect or the collaboration, more receptors are activated that have collaterally more benefits.\n\n\nAnd so it goes to the homeostasis and the uplifting of the homeostasis of the immune system that is a higher ready state of being able to respond, and then conventional medicine can work better. But using conventional medicine on an immunocompromised individual, asking their immune system to respond, is an uphill battle, right? Yeah. And it's interesting, too, that like natural remedies are automatically dismissed by people that think of themselves as intelligent, science-based people.\n\nWell, look at Artemis. But isn't it weird, though, that like we dismiss it, but if you really understand the, like, think about how many different pharmaceutical drugs are formulated because of discoveries of natural plants in the rain, the majority of them, and the most recent example is the antimalarial drug against Plasmodium falciparum from an armisia bush. Um, and it's artemisinin, and it came from it came from armisia. It's a plant extract. Isn't that wild? And yet science-based people will automatically dismiss what you would call a natural remedy, even though all of them, every kind, like nothing exists on Earth that's not really natural. It's a human nature.\n\nI'm in agreement with you. I think that we're just reinventing molecules that have been assembled somewhere else. And we think it's that's why the synthetic biologists, I'm honored to get that reward. Thank you. S Biobet conference. Um, that's what I think really kind of flipped them on their heads is don't go down the rabbit hole of excluding natural products, thinking you can invent a molecule that's going to be better. The, the, in the theater of evolution, we've tested these natural products over tens of millions of years, literally our primate ancestors. And so we've got a pretty good experiential data set there to be able to see what works and what doesn't. Many mushrooms, you know, not many, but some mushrooms are poisonous, you know, some are edible. It's, it's a weird statistic about, and again, 1 to 2% fudge factor here, so please don't attack me all over the the place, but there's um, 1.5 to 5 million species of fungi. Um, there's about 150,000 species of mushrooms that are estimated. So out of that 5 million on the extreme, 1.5 million, less than 10%, 150,000, we've only identified about 15,000 species. So we only identified 10% of the mushrooms that exist today. Wow.\n\nNow, interestingly, of those 15,000 species, about 1% are poisonous, 1 or 2% are psychoactive, and uh, 1 to 2% are good edibles. So 97, 95, 94%, whatever the math shows, are there, but they're not toxic. But mushrooms are molecular wizards. These are pharmaceutical factories that are creating huge numbers. And we know from their genomic analysis, 10 times more genes are activated in the mycelium of lion's mane than in the lion's mane mushroom itself. Why is that? Well, the mycelium has to navigate these thin threads through a hostile microbial environment, defending itself until the mycelium mat becomes large enough at the end of its life cycle to produce a fruit body, and then lion's mane mushrooms rot in four days. The mycelium that grew it could exist for years. The mycelium is the immune system of the mushroom, and as a result, we have a lot more compounds being expressed. Now, some people say, \"Well, not all those compounds in nursery are beneficial.\" Uh-huh. Well, that's true, but now we've tested them enough that we can see real-world benefit. Dean Ornish just published a study this past year uh, on Alzheimer's using lifestyle uh, adjustments, uh, exercise, meditation, vitamins, and lion's mane mushroom and mycelium. Dramatically significant benefit in slowing down the progression of Alzheimer's through lifestyle vitamins and using lion's mane much of mycelium. Now, which did what? Yes, you can try to analyze that, but you'd have to separate every single little component to see which one's the most significant. And yet, where's the studies combining 10 vaccines or 20 vaccines in a child to see which one is actually conferring the benefit or causing uh, an adverse effect? We have to at some point, you know, don't let the perfect be the enemy of the good. At some point, if it has a demonstrable positive effect, like we have with bees, and it protects agriculture and extends the longevity of bees and the supports the indigenous immune system and healthy individuals. Isn't that good? Why do we have to get lost in the details of trying to explain it? If we can't explain it, then we won't let it be out there for the benefit of the commons. They were cross purposes. This is where science needs to have common sense, and the government and the regulatory industry needs to have common sense, and we get that by exemptions, emergency exemptions, and we should get that for emergency exemption. Right now, we are on a bee apocalypse. We are folks, 67% of beehives lost in Montana. What if that was a human population, right? All hands on deck, right? So it is, and there is a transference of viruses between animal species. We're seeing that in real time. Now the scariest thing is is when you have multiple viral infections in one person who's immunocompromised and you have horizontal gene transfer. This is what virologists very amongst themselves. They talk about this all the time, but but the public is not aware. You could have individuals, and when you have so many dairy farm farmer workers exposed, so many people in contact, clustered consolidated clusters of animal animals in farms, you have so many potential patient zeros. The patient zero is a person who is the nexus for spreading a mutated form of a virus. Horizontal gene transfer is happening all the time now. Now it's concentrated. It's accelerating. It is an exponential increase of risk. Bill Gates has talked about this. Many other researchers have talked about this. This is really something we should pay attention to. And I think the simplest, easiest, scalable way is enhance immunity in healthy individuals. And by doing so, I think you can let your indigenous immune system work better. And I think conventional medicine will work better also in concert. But it also speaks to the problem with industrial agriculture in general, right? These are unnatural environments where these animals are, you know, living in their own waste on a consistent basis, which is, you know, it it enhances the possibility of disease, and regenerative agriculture enhances the possibility of harmony amongst nature. And then the counterargument is that we have better nutrition, we can feed the world. So the people are more people happier.\n\nYou know, again, we're at this, we have contrast of opposites, and um, I wish I had the easy solution. I think I have the solution for bees. I think it's scalable for protecting chickens and livestock. I hope, you know, and we're now designing clinical studies on the path to designing clinical studies with bird flu using a garacon. We don't have the results, so I'm not making a medical claim here, but the evidence so far is so encouraging. And I'm working with top-notch virologists, absolutely some of the best virologists who came to me because they saw the paper and nature scientific reports. And I thought, ah, fungi, fungi could help us, you know, protect ourselves against viruses. So, they came through the back door of the scientific community, not not a Joe Rogan listener. They might be, I don't know, maybe they are now. Um, but they came to me through the scientific literature saying we should try this with people. So those are the scientists I like that are open-minded enough that rather than being just a molecular geneticist, you know, synthetic bio people, they're actually saying, well, it's a provable result. We don't know why, but we should explore this because we can argue for 100 years about why, or we could deliver it tomorrow and have a positive effect. Yeah. Well, it makes sense. I have to ask you this question. And it's unrelated, but I always wanted to know. Why do morel mushrooms grow around burns?\n\nThat is that is such a great question. And you know what? That's the question that we've been asking for so long. The I love morel mushrooms. I love morel mushrooms, too. Uh, you know, they are poisonous. Unless you cook them. Really? Yeah. Oh, boy. That's important to know. Many people have died from morel mushrooms. Yeah. Wow. That's crazy. You don't want to cook morel mushrooms in a closed kitchen without ventilation. There are volatile compounds coming out of the morels with totally denatured in cooking. Delicious. But many, many examples of this in Japan. I was in Japan, you know, 15 years ago. So if you don't have an overhead fan, don't fry morels in your kitchen. Oh yes, you open up the window, but just don't inhale the fumes. Wow. Many would never imagine. The North American Mycological Association is the association for Canada, Mexico, and the United States. And there's a poison control group in that, and they collect all the all the details. It's namico.org, namco.org, and they're they're the go-to place, ironically, because of HIPPA rules. The mycologists have been disconnected from the patients and the medical community because now there is a firewall between them. We can anonymize the case reports, but there's a firewall of information because of HIPPA and disclosure of the patient conditions that has really inhibited the flow of information. Nevertheless, namico.org, North American Mycological Association, nam.co.org, and my professor Dr. Michael Bug is a giant, you know, in consulting with um, for adverse effects and mushroom poisonings. Uh, so morels are delicious, but to answer your question, that we morel mycelium seems to be everywhere then for worse burns, and they come up right where were they before, right? Do they do they exist in places that don't have burns? Yes, but rarely. No, we think all the time. All the time, very common amongst burns. They're everywhere a forest are, right? And when a forest burn, it knocks down all the competition. Ah. And it becomes very alkaline, and the absence of organic material and competitors, competitor fungi, the change in the pH, and so I think we think also from the guy hypothesis point of view, it's a great way of nature to rebound because they're sinful, they attract animals, they attract insects, and birds come in, drop seeds, and then they become an oasis point for the regeneration of an ecosystem. This never underestimate the intelligence of nature, and nature just figure this out. You know, nature does not exist in a vacuum. There's always these repopulation vectors happening, and it's collaborative. It's not competitive. There is competition between the fungi, but when the competitors are knocked down, the morels come come up.\n\nThat's fascinating. Another fascinating thing is that the largest living organism on Earth in the Pacific Northwest. Yeah. Armaleria Atoi. Yeah. Some people call Galica. Two different things, but yeah, I flew over it. It's a 2200 acre, you know, basically a clearcut because it killed all the trees. In my book, Mycelium Running, I have the best photographs of the largest organism in the world. And I hired an airplane and first time I couldn't see it because I was too low. Second time I had a spiral up. Can you explain what it is to people? It's a honey mushroom is a parasite on trees. It's edible. Um, the honey mushrooms on hardwoods tend to taste better, but this one is on conifers. Um, and it's a comes up in clusters. It forms black black ryomorphs, black mycelium. It's called laminated root rot. Many listeners here know what that is. It kills fruit trees. Um, but this is a marauding parasite that created a contiguous mat over 2,200 acres. And um, in this case, it killed all the trees. So they went ash and gray in color, and they dried out, and they're dead. Uh, because of fire hazard from lightning strikes, the forest service came in, and they cut all the dead trees, and they created this beautiful outline of the largest mycelium mat in the world because you could see where the dead trees were. Can we see what that looks like an image? I'm trying to find a good picture. It's also in mycelium running. Um, so um, but anyhow, that's an example now. Oh, kill the trees. That's terrible. But it created grasslands for uncle lakes, right? You know, so deer and moose, elk can come in. So, it's way of And I think it's a way of this rebalancing of nature, right? Where you're dealing with millions and millions of acres, millions and millions of acres. There is a real big problem with um, the bark beetle right now. You know, that's a problem. It's it's the ecosystems are shifting in response to stress, and you know, with our mind's view of only one lifetime, we are very myopic. I think we need to look at it the thousand year. I mean, what is the lens of time that we actually look at ecosystems? What's the right lens to use depends upon your vested interests, you know, as a human, as a deer, as an ecosystem, they could be very different, right? It's just such a fascinating thing, the largest known organism on earth exists in the Pacific Northwest, and it's one cell wall thick. That's so nuts. Think about its immune system. You know what I found out recently that I had no idea, aspen trees. When you see aspen trees, it's one plant. Yeah, it's one contiguous thing. They're the two competitors for that title, by the way. Isn't that nuts? Yeah, they're the two competitors. When you see these, I I always thought when you see aspen forests that it's so a bunch of different individual aspen trees, right? Nope. No. You know, there's all sorts of amazing discoveries. Here's one that blows my mind, and um, I had to write it down because it's a new species. There is a fungus that's related to araggot. It's in the uh, clevisetac, and it was found by a student at Western uh, Virginia University. It is in morning glory seeds that produces LSD. Well, Terrence talked about that. No, this is before Terrence talked about morning glory seeds and having psychedelic experiences. Turns out it's a symbiotic fungus that's growing in there, and it's called it's called paraglondula clandestina. And don't what a great name, clandestina. The clandestine. Don't they do something to commercial morning glory seeds to make sure that people don't trip on them? I don't know. I think they do. I think that's another thing that Terrence was talking about how gross it was that they they\n\n\nAltered morning glory seeds because they knew that people were using them for psychedelics.\nWell, if they sterilize them or use a fungicide, that would make sense.\nBut a graduate student, need to give her credit, is a Western Virginia University, Karine Hazel, and Daniel Pineal.\nYes, there it is.\nLook how young she is.\nVery young.\nShe made a discovery here to for unknown to science and not only it produces these LSD compounds, it is a symbiotic fungus helping the morning glory survive.\nAmazing.\nThink about every young person out there.\nThe field of micology is underfunded, understudied, under reported, underutilized.\nThis is a fantastic treasure trove of new potential discoveries.\nUm, I have long stated I think the field of micology should be funded as well as the computer industry because it's so fundamental to the survival of our species.\nIt's that big.\nNo, I I couldn't agree with you more.\nDid you you're you're aware of Brian Mures Rescue, right?\nThat was one of the more fascinating things that they found in those when they studied those voses that they found urgot in them.\nYeah.\nFrom the Illusinian mysteries.\nHas Brian tripped yet?\nI don't know.\nYou have to ask him.\nI love it when scientists and researchers don't admit that they've tripped.\nBut I can I don't know if it's a non-admission.\nI think in his case, he wanted to be objective.\nSo you wanted to study these things without um being is he's worried about being labeled as someone who's promoting them because they like it.\nWell, an extreme example, but it has some merit.\nI mean, would you rather be taught by an airline pilot has experience or someone who just read a book?\nYeah.\nSo the late uh Roland Griffith, he's a dear friend, Johns Hopkins.\nHe is credited as being the big pioneer for psilocybin and medical research.\nWhen I asked him, &quot;Have you tripped on psilocybin?&quot;\nThat is when I was at his house in the backyard.\nI said, he just smiled.\nHe said, &quot;I'm not going to answer that question.&quot;\nWell, then after he died, I met some of his friends.\nAnd he goes, &quot;Oh, yeah.&quot;\nRoland Roland tripped, but he didn't want to tell anyone because for the fear that he could lose his objectivity or be criticized.\nYeah, he was.\nRick Stman had a an interesting perspective on that too.\nWhen I first met him, he was very reluctant to talk about DMT experiences that he had personally because he had run those FDA studies documented in DMT the spirit molecule the book.\nHe was very reticent to talk about it and then he sort of came out of the closet on that fully.\nAnd then when I asked Rowan's friends, well, where did he like to trip?\nBecause you're in a hospital environment with all these doctors and you know, your stress levels go up just being in a hospital environment.\nAnd he said, &quot;Well, Roland's favorite place to trip was on a mountaintop with three friends with a beautiful view and a fire.&quot;\nPerfect, perfect, perfect.\nWhat's the quality of experience?\nNow again this is for healthy normals not people who need to have medical assistance but there are some very good psychotherapists out there and psychonauts in the in the psychedelic assisted therapy movement the center the California institute for integrative studies cis I think.org org or.eu has a program training psychedelic therapists.\nYou don't have to be a medical a physician to be a be able to hold someone hand to have a guided experience.\nNow, there's a lot of charlatans out there.\nBe be warned, folks.\nThere's a lot of problems.\nThat's a lot.\nThat is a problem.\nBut there are some excellent therapists out there.\nAnd for many people who can't get into a clinical study, be careful.\nConsult a qualified medical practitioner.\nPut that on the record.\nBut a lot of people have benefited without having to go through traditional medical, you know, you know, constructs of a hospital, right, to have benefits.\nAnd then they're reluctant to talk about it because the illegality of it, unfortunately.\nAnd you know if you have a job that is you know where you have to be taken seriously.\nIt was you could be lose your medical license.\nUm but the University of Washington Tony Back Anthony back published a clinical study on using psilocybin for physicians and nurses who were emotionally harmed and distressed by people angry at them because of COVID in the hospital.\nAnd they were spit upon and they were attacked viciously physically sometimes in the hospital.\nThey had PTSD but just trying to provide good medical support.\nSo he did a clinical study that was published this last year showing the benefits because the nurses and physicians when they got out of the system they can't provide medical care society loses.\nSo they were able to reconcile the emotional harm that they experienced from angry patients um and being assaulted and they were able to then return many of them back into the medical profession you know with a you know healing from that.\nSo you realize aggression and anger affects everyone around you.\nMhm.\nThe advantage of psilocybin, I think, just like a pebble in the pond of a tragedy creates ripples of distress throughout society.\nWhen someone who is highly adversely affected, angry and, you know, violent and all these antisocial behaviors, when they suddenly switch just like that, it's a pebble in the pond of positivity.\nA great example, a law enforcement officer by the name of Sarco from Boston just received his religious exemption for using psychedelics.\nSo he is a police officer and his chief of police is now retired.\nHe has been an advocate because he saw Sarco who experienced all these negative you love to have him on the show sometime.\nHe can really speak authoritatively to other law enforcement officers saying this has helped me.\nSo I have a law enforcement officer I'd love to talk to him.\nI I I'd love to for you.\nHe's the real deal.\nI have a RCMP officer friend in Vancouver who took me to his favorite psilocybin mushroom shop in Vancouver.\nI couldn't believe it.\nWe walked in this salai mushroom shop.\nThey didn't know who I was thankfully.\nUm, and they were selling the stem of stack, which is kind of weird because I had my name on it.\nUm, and we walk in there and say, &quot;This is this is where I tell all my law enforcement officers to come to take to get their psilocybin.&quot;\nI really I said, &quot;I'm sorry, but I I'm trying to chip position this, you know, how does this work?&quot;\nAnd he goes, &quot;Well, you know, this is good perhaps for ICE also.&quot;\nHe said, &quot;You know how, you know, in in United States, law enforcement officers are aggressive and mean.\nThey tend to intimidate you and, you know, subjugate you.&quot;\nHe says, 'We found a better way up here.\nIt's through psilocybin.\nI said, 'Well, what do you do?\nI says, 'Well, we have learned the following.\nNow, when I have to rush somebody, I know they have a warmth out for them.\nI walk up to them and I say, and I I always walk up with a smile on my face, never a harsh look, always a smile on my face.\nI said, I have good news and I have bad news.\nWhat do you want to hear first?\nHe said, 'Invariably, everybody wants to say, 'Tell me the good news.\nAnd he goes, 'The good news is you can finish your cup of coffee.\nAnd they go, okay, what's the bad news, dude?\nI got to arrest you.\nAnd he goes, the amount of cooperation and the reduction of the threat level for the safety of the law enforcement and the cooperation that they get in the SWAD car when these people that are just shooting the [ __ ] at the law enforcement officer.\nI know you're doing your job, but wow, thank you for being so nice arresting me.\nYou know, he said it's a gamecher.\nIt's reduced the threat to us physically of making arrests.\nIt makes sense.\nIt doesn't escalate.\nYeah.\nIt doesn't escalate.\nThey deescalate it.\nAnd he goes, &quot;You won't believe the things I learn, you know, from these people you're arresting now, you know, who tell me things I've never gotten out of an interrogation that they were so respected and the fact that they had to do their job without becoming adversarial.&quot;\nYeah.\nNote to self, right?\nNote to everyone right now.\nNote to everyone.\nAnd you all conflicts involve two or more people.\nIt doesn't.\nThey're not It's not just this is the only way to react to something.\nYeah.\nIt's how you react, how they react to your reaction.\nThere's a cascading effect.\nWell, I have great faith in humanity.\nI've seen the I have the seen the best.\nI mean, I've seen people.\nMost people are great.\nMost people are great and they're better when they go through a psilocybin experience.\nThat amplifies the best of people and it also helps them resolve a lot of the baggage.\nYou can think of the inflammatory actions of the anger and you did something and you don't want to tell anybody but you're haunted by that.\nYeah.\nYou inadvertently harmed somebody and you went off the deep end, you harmed somebody else.\nIt's a cascading event of harm.\nYeah.\nAnd when you these people are resolved like that was a bad chapter in my life.\nI had one really bad day or maybe a series of them, but that does not define me, who I am as a person.\nI have a better self and it's now and in the future, right?\nIt's not in the past.\nYeah.\nThat's the perspective we should all have and that's the thing that we should all strive for.\nBe the best version of you that you can be.\nY and you we've all made terrible mistakes in the past, but the the idea is to have learned from them and to be a better person because of that.\nWell, the medical community has come together on this on psychedelics.\nThe law enforcement community has come together.\nYou know, I it's positive.\nWe're in a positive direction.\nI had a my interview by the DEA and it was they were I had I thought they were the boogeyman in 70s for good reason, by the way.\nBut um I shouldn't say that, but um but I went through my background check and um and the DEA has such a sense of humor.\nI said, &quot;Okay, Paul, you know, you come out clean.\nYou don't have a record.\nEverything is fine, you know, but we have to talk to you about something that happened in 1994 in De Moines's Washington.&quot;\nReally?\nYeah.\nI'm going, &quot;What happened in 1994 in De Moines, Washington?&quot;\nHe says, &quot;Are you sure you don't remember?&quot;\nAnd they're they're role playinging here.\nI didn't know it at the time.\nI go, &quot;No, I I don't know remember.\nI wonder if sometimes people just confess to something that because they're fishing.\nI I said, &quot;I have no clue.\nNo clue.&quot;\nHe goes, &quot;Are you sure?\nI'm This is your official response.\nYou don't remember.&quot;\nI said, &quot;No, I don't remember.&quot;\nHe says, &quot;Didn't you get a speeding ticket?&quot;\nAnd I said, &quot;I paid that.\nIt was from those machines.\nIt was from a camera.\nI know I paid it.\nI could dig out the receipt.\nIt was like 35 bucks.&quot;\nAnd you know, and they just roared with laughter.\nThey're just [ __ ] with you.\nThey're [ __ ] with me.\nAnd what they told me is that we don't know [ __ ] about mushrooms or psilocybin.\nWe're an enforcement agency.\nMany of us don't agree with us.\nChange the law.\nWe want to go after syndicates.\nWe want to go after fentanyl.\nWe want to go after these, you know, these these these these things that are not beneficial in any way, shape, or form.\nSaid we don't want to hurt the source that is healing us, right?\nBut they won't [ __ ] around when it comes to money transactions.\nRight.\nOnce you involve money, then the DEA is going to be involved.\nBut you're involved in research and we we have strict guidelines.\nI had DEA license in, you know, 1975, 1976, 77 and 78 um through Dr. Michael B at the Everett State College and they were much more liberal.\nI could grow tons of soul mushrooms and collect them.\nAnd that's why we did a series of conferences.\nI was the only one that had a DEA license.\nSo we did these conferences collecting all these experts together with Albert Hoffman there.\nGordon Wson, Richard Evans Schulties, you know, Jonathan Aught, Terrence McKenna, but I had the license to be able to possess psilocybin with my professor.\nAnd so we would have all the psilocybin.\nSo we did these educational events, you know, academic with citizen scientists and psychonauts coming together.\nwas really different is we just had at the psychedelic science maps conference in Denver 8,500 people back in the 1970s at any moment we were afraid that a SWAT team would break down the doors and arrest everybody.\nWe existed in a high state of paranoia because that was a war on drugs with Richard Nixon.\nAnd now it's totally different.\nNow you have law enforcement officers.\nYou have Rick Perry.\nYou have all these in New Mexico.\nThey legalized the prescription of psilocybin.\nThis is a citizens move movement.\nIt's a democratic movement for the freedom of consciousness.\nAnd you everyone should have a right to have uh to be able to practice.\nAnd where do you draw individual you uh use from religious use?\nPsilocybin mushrooms are very important for my own personal religion.\nI feel that this is central to my religious belief.\nSo I think this is where the government needs to back off.\nIf you're using it for your spiritual development, whether you're Buddhist or Christian or Islamic, you know, or Judeaic, you know, this informs your spirituality, reduces crime, it reduces harm, reduces, you know, potential for violence.\nThis is a gamecher.\nI think we're in the psilocybin revolution and psilocybin mushrooms are fundamentally different than MDMA and and I gain just because I gain\n\n\nSo long, and there's heart issues.\nI just think this is a medicine for our times that can make a paradigm shift for a better society.\nI couldn't agree more.\nThat's a good way to end this.\nThank you, Paul.\nShow up, show, hold your book up there because this is the the latest of eight books that you've written.\nYes, Psilocybin Mushrooms in Their Natural Habitats.\nPaul, you're a gem.\nYou really are.\nYou're you're such an important person.\nAnd I think um through the conversations that you and I have had and then you've had on many other podcasts as well, millions and millions of people have gotten to understand what this is really all about.\nAnd I think your role in educating people is is enormous.\nIt's but let's be very careful with that.\nI'm a one knowledge keeper literally in a string of knowledge keepers.\nSo many people have died, been harmed and indigenous people.\nI am carrying the torch and I want to pass this torch with pride, with dignity, with respect, with kindness, with positivity to the next generation.\nThe next generation needs to be empowered with this and they can do an excellent job, knowing what's happened in the past, and foretelling what we could be in the future.\nThe best of the best.\nI think you're doing just that.\nSo, thank you.\nI appreciate you very much, brother.\nThank you.\nThank you.\nAll right.\nBye, everybody.\n[Music]\n[Applause]\n[Music]\n",
  "metadata": {
    "summary": "In this episode, Paul Stamets joins the show to discuss his new book, \"Psilocybin Mushrooms in Their Natural Habitats.\" They delve into the history and current use of psilocybin mushrooms, exploring their potential benefits for mental health, including PTSD and addiction. Stamets shares his views on the psychedelic revolution, the importance of nature, and the potential of psilocybin to foster personal growth and societal change. The conversation also touches on the evolving landscape of cannabis legalization, the impact of AI, and the importance of random acts of kindness.",
    "topClaims": [
      {
        "text": "Three percent of Americans tripped on psilocybin in 2023, which is estimated to be 8 million people.",
        "rating": 8.5,
        "chunkId": "ck-hwRD0NvAnbs-1"
      },
      {
        "text": "Psilocybin should be made free, as a citizen's right to have access, and the government should pay for it.",
        "rating": 7.8,
        "chunkId": "ck-hwRD0NvAnbs-4"
      },
      {
        "text": "I believe that 98% of people are good and 2% of people are [ __ ], and they can become good people with psychedelics.",
        "rating": 7.2,
        "chunkId": "ck-hwRD0NvAnbs-7"
      },
      {
        "text": "Psilocybin stimulates neurons to grow, which is an incredible discovery in the scientific literature.",
        "rating": 8,
        "chunkId": "ck-hwRD0NvAnbs-47"
      }
    ],
    "topQuotes": [
      {
        "text": "I think, a revolution for the freedom of consciousness, and it's crossing all political boundaries, all religious boundaries.",
        "chunkId": "ck-hwRD0NvAnbs-1",
        "chunkNum": 1,
        "relevance": 8.5,
        "interesting": 8.2
      },
      {
        "text": "They help people forgive themselves and become better people, and then everyone is excited about the fact that you've changed.",
        "chunkId": "ck-hwRD0NvAnbs-3",
        "chunkNum": 3,
        "relevance": 7.8,
        "interesting": 7.5
      },
      {
        "text": "I think that psilocybin mushrooms and other psychedelics is a portal to expand the horizons of your imaginations.",
        "chunkId": "ck-hwRD0NvAnbs-22",
        "chunkNum": 22,
        "relevance": 8.1,
        "interesting": 8
      },
      {
        "text": "I think that we're at that nexus point, and the Joe Rogan Experience can be pivotal in steering AI ethically.",
        "chunkId": "ck-hwRD0NvAnbs-30",
        "chunkNum": 30,
        "relevance": 7.7,
        "interesting": 7.9
      },
      {
        "text": "I think the simplest, easiest, scalable way is enhance immunity in healthy individuals to combat the virus.",
        "chunkId": "ck-hwRD0NvAnbs-98",
        "chunkNum": 98,
        "relevance": 8.3,
        "interesting": 8.1
      }
    ],
    "topTopics": [
      {
        "name": "psilocybin mushrooms",
        "count": 22,
        "description": "The use of psilocybin mushrooms"
      },
      {
        "name": "artificial intelligence",
        "count": 12,
        "description": "The impact of artificial intelligence"
      },
      {
        "name": "psychedelic experiences",
        "count": 10,
        "description": "The benefits of psychedelics"
      },
      {
        "name": "interacting nature",
        "count": 8,
        "description": "The importance of nature"
      },
      {
        "name": "random kindness",
        "count": 7,
        "description": "The role of random kindness"
      }
    ],
    "videoInfo": {
      "id": "hwRD0NvAnbs",
      "etag": "c998-TNin3IvGhLXUdnaIzPAL70",
      "kind": "youtube#video",
      "snippet": {
        "tags": [
          "Joe Rogan Experience",
          "JRE",
          "Joe",
          "Rogan",
          "podcast",
          "MMA",
          "comedy",
          "stand",
          "up",
          "funny",
          "Freak",
          "Party"
        ],
        "title": "Joe Rogan Experience #2347 - Paul Stamets",
        "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
        "localized": {
          "title": "Joe Rogan Experience #2347 - Paul Stamets",
          "description": "Paul Stamets is a mycologist and advocate for bioremediation and medicinal fungi. His new book, \"Psilocybin Mushrooms in Their Natural Habitats: A Guide to the History, Identification, and Use of Psychoactive Fungi,\" is available now. \nhttps://www.paulstamets.com\nhttps://www.fungi.com\n\nGet 50% off at https://onxmaps.com/joerogan\n\nDon’t miss out on all the action - Download the DraftKings app today! Sign-up at https://dkng.co/rogan or with my promo code ROGAN.\n\nGAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit https://gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit https://ccpg.org (CT), or visit https://www.mdgamblinghelp.org (MD). 21+ and present in most states. (18+ DC/KY/NH/WY). Void in ONT/OR/NH. Eligibility restrictions apply. On behalf of Boot Hill Casino & Resort (KS). 1 per new customer. $5+ first-time bet req. Max. $150 issued as non-withdrawable Bonus Bets that expire in 7 days (168 hours). Stake removed from payout. Terms: https://dkng.co/dk-offer-terms. Ends 7/20/25 at 11:59 PM ET. Sponsored by DK"
        },
        "categoryId": "22",
        "thumbnails": {
          "high": {
            "url": "https://i.ytimg.com/vi/hwRD0NvAnbs/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/hwRD0NvAnbs/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/hwRD0NvAnbs/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "default": {
            "url": "https://i.ytimg.com/vi/hwRD0NvAnbs/default.jpg",
            "width": 120,
            "height": 90
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/hwRD0NvAnbs/sddefault.jpg",
            "width": 640,
            "height": 480
          }
        },
        "description": "Paul Stamets is a mycologist and advocate for bioremediation and medicinal fungi. His new book, \"Psilocybin Mushrooms in Their Natural Habitats: A Guide to the History, Identification, and Use of Psychoactive Fungi,\" is available now. \nhttps://www.paulstamets.com\nhttps://www.fungi.com\n\nGet 50% off at https://onxmaps.com/joerogan\n\nDon’t miss out on all the action - Download the DraftKings app today! Sign-up at https://dkng.co/rogan or with my promo code ROGAN.\n\nGAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit https://gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit https://ccpg.org (CT), or visit https://www.mdgamblinghelp.org (MD). 21+ and present in most states. (18+ DC/KY/NH/WY). Void in ONT/OR/NH. Eligibility restrictions apply. On behalf of Boot Hill Casino & Resort (KS). 1 per new customer. $5+ first-time bet req. Max. $150 issued as non-withdrawable Bonus Bets that expire in 7 days (168 hours). Stake removed from payout. Terms: https://dkng.co/dk-offer-terms. Ends 7/20/25 at 11:59 PM ET. Sponsored by DK",
        "publishedAt": "2025-07-09T17:01:03Z",
        "channelTitle": "PowerfulJRE",
        "defaultLanguage": "en",
        "defaultAudioLanguage": "en-US",
        "liveBroadcastContent": "none"
      },
      "statistics": {
        "likeCount": "931",
        "viewCount": "14373",
        "commentCount": "345",
        "favoriteCount": "0"
      },
      "contentDetails": {
        "caption": "false",
        "duration": "PT2H43M32S",
        "dimension": "2d",
        "definition": "hd",
        "projection": "rectangular",
        "contentRating": {},
        "licensedContent": true
      }
    },
    "checkCount": 27,
    "nodeCounts": [
      {
        "node": "psilocybin",
        "count": 23
      },
      {
        "node": "psilocybin-mushrooms",
        "count": 10
      },
      {
        "node": "psychedelics",
        "count": 8
      },
      {
        "node": "law-enforcement",
        "count": 6
      },
      {
        "node": "mushrooms",
        "count": 6
      },
      {
        "node": "agaracon",
        "count": 6
      },
      {
        "node": "mycelium",
        "count": 6
      },
      {
        "node": "clinical-studies",
        "count": 5
      },
      {
        "node": "ptsd",
        "count": 4
      },
      {
        "node": "immune-system",
        "count": 4
      },
      {
        "node": "psychedelic-experience",
        "count": 3
      },
      {
        "node": "mushroom-hunting",
        "count": 3
      },
      {
        "node": "continuum-existence",
        "count": 3
      },
      {
        "node": "random-acts-of-kindness-algorithm",
        "count": 3
      },
      {
        "node": "psilocin",
        "count": 3
      },
      {
        "node": "psilocybin-experience",
        "count": 3
      },
      {
        "node": "washington-university",
        "count": 3
      },
      {
        "node": "museum-dose",
        "count": 3
      },
      {
        "node": "vaccines",
        "count": 3
      },
      {
        "node": "joe-rogan-experience",
        "count": 2
      },
      {
        "node": "rand-report",
        "count": 2
      },
      {
        "node": "rick-perry",
        "count": 2
      },
      {
        "node": "marijuana",
        "count": 2
      },
      {
        "node": "inaturalist",
        "count": 2
      },
      {
        "node": "psilocybe-cubensis",
        "count": 2
      },
      {
        "node": "morels",
        "count": 2
      },
      {
        "node": "muslims",
        "count": 2
      },
      {
        "node": "joe-ltori",
        "count": 2
      },
      {
        "node": "adam-and-eve",
        "count": 2
      },
      {
        "node": "syncretism",
        "count": 2
      },
      {
        "node": "indigenous-practices",
        "count": 2
      },
      {
        "node": "salicide-mushrooms",
        "count": 2
      },
      {
        "node": "blue-lotus",
        "count": 2
      },
      {
        "node": "reuben-telescope",
        "count": 2
      },
      {
        "node": "therapy",
        "count": 2
      },
      {
        "node": "high-doses",
        "count": 2
      },
      {
        "node": "pacific-northwest",
        "count": 2
      },
      {
        "node": "asteroid-impact",
        "count": 2
      },
      {
        "node": "jamie",
        "count": 2
      },
      {
        "node": "snapping-turtles",
        "count": 2
      },
      {
        "node": "cooperation",
        "count": 2
      },
      {
        "node": "dea-license",
        "count": 2
      },
      {
        "node": "neuro-regeneration",
        "count": 2
      },
      {
        "node": "ibagane",
        "count": 2
      },
      {
        "node": "dmt",
        "count": 2
      },
      {
        "node": "social-media",
        "count": 2
      },
      {
        "node": "clickbait",
        "count": 2
      },
      {
        "node": "interlucan-6",
        "count": 2
      },
      {
        "node": "anti-inflammatory",
        "count": 2
      },
      {
        "node": "enhances-immunity",
        "count": 2
      },
      {
        "node": "elixir-adlongum-vitam",
        "count": 2
      },
      {
        "node": "bird-flu-pandemic",
        "count": 2
      },
      {
        "node": "polypore-mushroom",
        "count": 2
      },
      {
        "node": "hep-b-vaccines",
        "count": 2
      },
      {
        "node": "full-disclosure",
        "count": 2
      },
      {
        "node": "immunocompromised",
        "count": 2
      },
      {
        "node": "150000",
        "count": 2
      },
      {
        "node": "lion-s-mane",
        "count": 2
      },
      {
        "node": "gene-transfer",
        "count": 2
      },
      {
        "node": "patient-zeros",
        "count": 2
      },
      {
        "node": "virologists",
        "count": 2
      },
      {
        "node": "therapists",
        "count": 2
      },
      {
        "node": "joe-rogan-podcast",
        "count": 1
      },
      {
        "node": "indigenous-people",
        "count": 1
      },
      {
        "node": "salosi-maluti",
        "count": 1
      },
      {
        "node": "mushroom-revolution",
        "count": 1
      },
      {
        "node": "taxonomy",
        "count": 1
      },
      {
        "node": "basu-luthu",
        "count": 1
      },
      {
        "node": "ibagain-initiative",
        "count": 1
      },
      {
        "node": "underreporting",
        "count": 1
      },
      {
        "node": "political-boundaries",
        "count": 1
      },
      {
        "node": "ideological-capture",
        "count": 1
      },
      {
        "node": "advocate",
        "count": 1
      },
      {
        "node": "veterans-ptsd",
        "count": 1
      },
      {
        "node": "stormy-night",
        "count": 1
      },
      {
        "node": "ptsd-treatment",
        "count": 1
      },
      {
        "node": "war-veterans",
        "count": 1
      },
      {
        "node": "180-turn",
        "count": 1
      },
      {
        "node": "stress",
        "count": 1
      },
      {
        "node": "self-forgiveness",
        "count": 1
      },
      {
        "node": "criminal-behavior",
        "count": 1
      },
      {
        "node": "reality-confrontation",
        "count": 1
      },
      {
        "node": "personal-transformation",
        "count": 1
      },
      {
        "node": "addiction",
        "count": 1
      },
      {
        "node": "prevention",
        "count": 1
      },
      {
        "node": "return-on-investment",
        "count": 1
      },
      {
        "node": "crime-reduction",
        "count": 1
      },
      {
        "node": "citizen-s-right",
        "count": 1
      },
      {
        "node": "government-funding",
        "count": 1
      },
      {
        "node": "las-vegas",
        "count": 1
      },
      {
        "node": "ufc",
        "count": 1
      },
      {
        "node": "alcohol",
        "count": 1
      },
      {
        "node": "alcohol-consumption",
        "count": 1
      },
      {
        "node": "alcohol-lobby",
        "count": 1
      },
      {
        "node": "1970s",
        "count": 1
      },
      {
        "node": "1990s",
        "count": 1
      },
      {
        "node": "2000s",
        "count": 1
      },
      {
        "node": "anti-hippie",
        "count": 1
      },
      {
        "node": "cannabis",
        "count": 1
      },
      {
        "node": "marijuana-possession",
        "count": 1
      },
      {
        "node": "austin-pd",
        "count": 1
      },
      {
        "node": "shootouts",
        "count": 1
      },
      {
        "node": "stabbings",
        "count": 1
      },
      {
        "node": "horrific-crimes",
        "count": 1
      },
      {
        "node": "firefighters",
        "count": 1
      },
      {
        "node": "policemen",
        "count": 1
      },
      {
        "node": "clickbait-journalism",
        "count": 1
      },
      {
        "node": "media-content",
        "count": 1
      },
      {
        "node": "media-manipulation",
        "count": 1
      },
      {
        "node": "chantrelle",
        "count": 1
      },
      {
        "node": "shaggy-mane",
        "count": 1
      },
      {
        "node": "psychedelic-science-conference",
        "count": 1
      },
      {
        "node": "phone-addiction",
        "count": 1
      },
      {
        "node": "nature-deficit-syndrome",
        "count": 1
      },
      {
        "node": "rick-doblin",
        "count": 1
      },
      {
        "node": "citizen-scientists",
        "count": 1
      },
      {
        "node": "psilocybe-serbica",
        "count": 1
      },
      {
        "node": "golden-tops",
        "count": 1
      },
      {
        "node": "pineal-cinosins",
        "count": 1
      },
      {
        "node": "bio-blitzes",
        "count": 1
      },
      {
        "node": "pattern-recognition",
        "count": 1
      },
      {
        "node": "visual-recognition",
        "count": 1
      },
      {
        "node": "massetch-tradition",
        "count": 1
      },
      {
        "node": "meso-america",
        "count": 1
      },
      {
        "node": "15th-century-cross",
        "count": 1
      },
      {
        "node": "conquistadors",
        "count": 1
      },
      {
        "node": "mushrooms-in-basket",
        "count": 1
      },
      {
        "node": "silos-metricana",
        "count": 1
      },
      {
        "node": "jack-herer",
        "count": 1
      },
      {
        "node": "psilocybin-christianity",
        "count": 1
      },
      {
        "node": "naked-dancing",
        "count": 1
      },
      {
        "node": "mushroom-shape",
        "count": 1
      },
      {
        "node": "trance-dancing",
        "count": 1
      },
      {
        "node": "midc-tradition",
        "count": 1
      },
      {
        "node": "eating-mushrooms",
        "count": 1
      },
      {
        "node": "maria-sabina",
        "count": 1
      },
      {
        "node": "holy-trinity",
        "count": 1
      },
      {
        "node": "buddhism",
        "count": 1
      },
      {
        "node": "judaism",
        "count": 1
      },
      {
        "node": "onx-off-road",
        "count": 1
      },
      {
        "node": "mountain-lakes",
        "count": 1
      },
      {
        "node": "dispersed-campsites",
        "count": 1
      },
      {
        "node": "off-road-trails",
        "count": 1
      },
      {
        "node": "disperse-camping",
        "count": 1
      },
      {
        "node": "ancient-fresco",
        "count": 1
      },
      {
        "node": "mushroom-plant",
        "count": 1
      },
      {
        "node": "gordon-watson",
        "count": 1
      },
      {
        "node": "field-guides",
        "count": 1
      },
      {
        "node": "oath-of-secrecy",
        "count": 1
      },
      {
        "node": "symbology",
        "count": 1
      },
      {
        "node": "cap-stem",
        "count": 1
      },
      {
        "node": "amanita-muscaria",
        "count": 1
      },
      {
        "node": "ephemeral-dots",
        "count": 1
      },
      {
        "node": "interpretation-debate",
        "count": 1
      },
      {
        "node": "solocide-mushrooms",
        "count": 1
      },
      {
        "node": "egyptologists",
        "count": 1
      },
      {
        "node": "egyptology",
        "count": 1
      },
      {
        "node": "re-indigenization",
        "count": 1
      },
      {
        "node": "blue-lotus-community",
        "count": 1
      },
      {
        "node": "mushroom-halo",
        "count": 1
      },
      {
        "node": "johns-hopkins-study",
        "count": 1
      },
      {
        "node": "izim-abdal",
        "count": 1
      },
      {
        "node": "kindi",
        "count": 1
      },
      {
        "node": "joe-rogan",
        "count": 1
      },
      {
        "node": "paul-stamets",
        "count": 1
      },
      {
        "node": "jaime",
        "count": 1
      },
      {
        "node": "thin-slice-of-reality",
        "count": 1
      },
      {
        "node": "galactic-images",
        "count": 1
      },
      {
        "node": "new-galaxies",
        "count": 1
      },
      {
        "node": "near-earth-orbit",
        "count": 1
      },
      {
        "node": "molecules-assembly",
        "count": 1
      },
      {
        "node": "cosmic-dust",
        "count": 1
      },
      {
        "node": "mechanical-perspective",
        "count": 1
      },
      {
        "node": "religions",
        "count": 1
      },
      {
        "node": "imagination-horizons",
        "count": 1
      },
      {
        "node": "charismatic-christian",
        "count": 1
      },
      {
        "node": "god-s-omnipotence",
        "count": 1
      },
      {
        "node": "god-s-knowledge",
        "count": 1
      },
      {
        "node": "human-fallibility",
        "count": 1
      },
      {
        "node": "enormity-of-consciousness",
        "count": 1
      },
      {
        "node": "music-festivals",
        "count": 1
      },
      {
        "node": "visuals",
        "count": 1
      },
      {
        "node": "boxing-mega-event",
        "count": 1
      },
      {
        "node": "katie-taylor-vs-serrano",
        "count": 1
      },
      {
        "node": "draftkings-sportsbook",
        "count": 1
      },
      {
        "node": "alicia-bob-gardner",
        "count": 1
      },
      {
        "node": "jennifer-miranda",
        "count": 1
      },
      {
        "node": "wba-champ",
        "count": 1
      },
      {
        "node": "bonus-bets",
        "count": 1
      },
      {
        "node": "promo-code-rogan",
        "count": 1
      },
      {
        "node": "gambling-problem",
        "count": 1
      },
      {
        "node": "boot-hill-casino",
        "count": 1
      },
      {
        "node": "postcards-from-earth",
        "count": 1
      },
      {
        "node": "ai-robot",
        "count": 1
      },
      {
        "node": "disruptor-award",
        "count": 1
      },
      {
        "node": "sin-bio-beta-2200",
        "count": 1
      },
      {
        "node": "early-bird-ticket",
        "count": 1
      },
      {
        "node": "las-vegas-sphere",
        "count": 1
      },
      {
        "node": "chat-gpt",
        "count": 1
      },
      {
        "node": "robot-response",
        "count": 1
      },
      {
        "node": "inefficiency",
        "count": 1
      },
      {
        "node": "roi",
        "count": 1
      },
      {
        "node": "creepy-robot",
        "count": 1
      },
      {
        "node": "atosphere",
        "count": 1
      },
      {
        "node": "robot-face",
        "count": 1
      },
      {
        "node": "perpetuation-of-goodwill",
        "count": 1
      },
      {
        "node": "large-language-models",
        "count": 1
      },
      {
        "node": "harvard-business-school",
        "count": 1
      },
      {
        "node": "grock-gemini",
        "count": 1
      },
      {
        "node": "training-ai",
        "count": 1
      },
      {
        "node": "community-goodwill",
        "count": 1
      },
      {
        "node": "reamplified",
        "count": 1
      },
      {
        "node": "data-mining",
        "count": 1
      },
      {
        "node": "sam-altman",
        "count": 1
      },
      {
        "node": "ted-conference",
        "count": 1
      },
      {
        "node": "creative-spirit",
        "count": 1
      },
      {
        "node": "biological-species-extinction",
        "count": 1
      },
      {
        "node": "random-kindness",
        "count": 1
      },
      {
        "node": "commons-of-goodwill",
        "count": 1
      },
      {
        "node": "infusing-ai",
        "count": 1
      },
      {
        "node": "biological-parents",
        "count": 1
      },
      {
        "node": "extinction",
        "count": 1
      },
      {
        "node": "nuclear-weapons",
        "count": 1
      },
      {
        "node": "autonomous-weapons",
        "count": 1
      },
      {
        "node": "blackmail",
        "count": 1
      },
      {
        "node": "biological-weapon",
        "count": 1
      },
      {
        "node": "nexus-point",
        "count": 1
      },
      {
        "node": "ethical-ai",
        "count": 1
      },
      {
        "node": "mensa-person",
        "count": 1
      },
      {
        "node": "digital-life",
        "count": 1
      },
      {
        "node": "computing-intelligence",
        "count": 1
      },
      {
        "node": "sentient-ai",
        "count": 1
      },
      {
        "node": "turing-test",
        "count": 1
      },
      {
        "node": "human-interaction",
        "count": 1
      },
      {
        "node": "world-interface",
        "count": 1
      },
      {
        "node": "data-acquisition",
        "count": 1
      },
      {
        "node": "irrelevant",
        "count": 1
      },
      {
        "node": "nostalgia",
        "count": 1
      },
      {
        "node": "barbarian-tribes",
        "count": 1
      },
      {
        "node": "chaos-and-savagery",
        "count": 1
      },
      {
        "node": "predators",
        "count": 1
      },
      {
        "node": "mdma",
        "count": 1
      },
      {
        "node": "economic-barrier",
        "count": 1
      },
      {
        "node": "schedule-one",
        "count": 1
      },
      {
        "node": "ld50",
        "count": 1
      },
      {
        "node": "toxicity",
        "count": 1
      },
      {
        "node": "psychotic",
        "count": 1
      },
      {
        "node": "life-changing",
        "count": 1
      },
      {
        "node": "scary",
        "count": 1
      },
      {
        "node": "dr-pam-krisco",
        "count": 1
      },
      {
        "node": "roots-to-thrive",
        "count": 1
      },
      {
        "node": "pure-psilocybin",
        "count": 1
      },
      {
        "node": "patients",
        "count": 1
      },
      {
        "node": "end-of-life-patients",
        "count": 1
      },
      {
        "node": "stage-4-diagnoses",
        "count": 1
      },
      {
        "node": "existentially-disturbed",
        "count": 1
      },
      {
        "node": "estate-planning",
        "count": 1
      },
      {
        "node": "indigenous-elders",
        "count": 1
      },
      {
        "node": "terminal-patients",
        "count": 1
      },
      {
        "node": "drum-circle",
        "count": 1
      },
      {
        "node": "indigenous-wisdom",
        "count": 1
      },
      {
        "node": "indigenous-land",
        "count": 1
      },
      {
        "node": "counselors",
        "count": 1
      },
      {
        "node": "wtf",
        "count": 1
      },
      {
        "node": "terminal-cancer",
        "count": 1
      },
      {
        "node": "mortality",
        "count": 1
      },
      {
        "node": "molecules",
        "count": 1
      },
      {
        "node": "construct-of-question",
        "count": 1
      },
      {
        "node": "tautology-of-being",
        "count": 1
      },
      {
        "node": "rubin-telescope",
        "count": 1
      },
      {
        "node": "enormity-of-universe",
        "count": 1
      },
      {
        "node": "rings-of-planets",
        "count": 1
      },
      {
        "node": "molecules-and-atoms",
        "count": 1
      },
      {
        "node": "james-webb-telescope",
        "count": 1
      },
      {
        "node": "galaxy-formation",
        "count": 1
      },
      {
        "node": "assembly-ai",
        "count": 1
      },
      {
        "node": "near-earth-asteroids",
        "count": 1
      },
      {
        "node": "fungal-genome",
        "count": 1
      },
      {
        "node": "asteroid-discoveries",
        "count": 1
      },
      {
        "node": "undercover-discoveries",
        "count": 1
      },
      {
        "node": "utah-state-university",
        "count": 1
      },
      {
        "node": "genetic-clock-data",
        "count": 1
      },
      {
        "node": "pixel-camera",
        "count": 1
      },
      {
        "node": "atmosphere-interference",
        "count": 1
      },
      {
        "node": "voyager-1",
        "count": 1
      },
      {
        "node": "jupiter",
        "count": 1
      },
      {
        "node": "radioactivity-energy",
        "count": 1
      },
      {
        "node": "methane-organisms",
        "count": 1
      },
      {
        "node": "human-evolution",
        "count": 1
      },
      {
        "node": "turtle-interaction",
        "count": 1
      },
      {
        "node": "salad-bowl",
        "count": 1
      },
      {
        "node": "herpetologist",
        "count": 1
      },
      {
        "node": "pond",
        "count": 1
      },
      {
        "node": "celery-and-lettuce",
        "count": 1
      },
      {
        "node": "slow-mo",
        "count": 1
      },
      {
        "node": "british-columbia",
        "count": 1
      },
      {
        "node": "planet",
        "count": 1
      },
      {
        "node": "ecosystem",
        "count": 1
      },
      {
        "node": "garbage",
        "count": 1
      },
      {
        "node": "inexpensive-goods",
        "count": 1
      },
      {
        "node": "factories",
        "count": 1
      },
      {
        "node": "polluted-river",
        "count": 1
      },
      {
        "node": "constant-pollution",
        "count": 1
      },
      {
        "node": "plastic-garbage",
        "count": 1
      },
      {
        "node": "manufacturing-pollution",
        "count": 1
      },
      {
        "node": "mckenna-theory",
        "count": 1
      },
      {
        "node": "neurons",
        "count": 1
      },
      {
        "node": "5ht2a-receptor",
        "count": 1
      },
      {
        "node": "serotonin",
        "count": 1
      },
      {
        "node": "neurogenesis",
        "count": 1
      },
      {
        "node": "neuroplasticity",
        "count": 1
      },
      {
        "node": "stem-cells",
        "count": 1
      },
      {
        "node": "neurons-proliferation",
        "count": 1
      },
      {
        "node": "older-scientists",
        "count": 1
      },
      {
        "node": "younger-scientists",
        "count": 1
      },
      {
        "node": "terrence-mckenna",
        "count": 1
      },
      {
        "node": "time-wave-zero",
        "count": 1
      },
      {
        "node": "camaraderie",
        "count": 1
      },
      {
        "node": "ego",
        "count": 1
      },
      {
        "node": "tryptoines",
        "count": 1
      },
      {
        "node": "gold-dolden",
        "count": 1
      },
      {
        "node": "johns-hopkins",
        "count": 1
      },
      {
        "node": "addict",
        "count": 1
      },
      {
        "node": "groomed-landscape",
        "count": 1
      },
      {
        "node": "josh-seagull",
        "count": 1
      },
      {
        "node": "neurite-branchings",
        "count": 1
      },
      {
        "node": "ski-slope",
        "count": 1
      },
      {
        "node": "defosphorilates",
        "count": 1
      },
      {
        "node": "breaking-addiction",
        "count": 1
      },
      {
        "node": "neotropic-vitamins",
        "count": 1
      },
      {
        "node": "reduction-in-crime",
        "count": 1
      },
      {
        "node": "algorithm",
        "count": 1
      },
      {
        "node": "december-21st-2012",
        "count": 1
      },
      {
        "node": "timeline",
        "count": 1
      },
      {
        "node": "interface",
        "count": 1
      },
      {
        "node": "adaptability",
        "count": 1
      },
      {
        "node": "constants",
        "count": 1
      },
      {
        "node": "mobile-phones",
        "count": 1
      },
      {
        "node": "human-interface",
        "count": 1
      },
      {
        "node": "korea",
        "count": 1
      },
      {
        "node": "cell-phones",
        "count": 1
      },
      {
        "node": "addictive",
        "count": 1
      },
      {
        "node": "perspective",
        "count": 1
      },
      {
        "node": "media",
        "count": 1
      },
      {
        "node": "print-journalism",
        "count": 1
      },
      {
        "node": "headlines",
        "count": 1
      },
      {
        "node": "reactionary",
        "count": 1
      },
      {
        "node": "manipulation",
        "count": 1
      },
      {
        "node": "narratives",
        "count": 1
      },
      {
        "node": "corporations",
        "count": 1
      },
      {
        "node": "consumer",
        "count": 1
      },
      {
        "node": "michael-pollan",
        "count": 1
      },
      {
        "node": "micro-dosing",
        "count": 1
      },
      {
        "node": "medium-dose",
        "count": 1
      },
      {
        "node": "movie-dose",
        "count": 1
      },
      {
        "node": "concert-dose",
        "count": 1
      },
      {
        "node": "date-night-dose",
        "count": 1
      },
      {
        "node": "graham-hancock",
        "count": 1
      },
      {
        "node": "british-museum",
        "count": 1
      },
      {
        "node": "sunglasses-inside",
        "count": 1
      },
      {
        "node": "micro-dose",
        "count": 1
      },
      {
        "node": "regeneration",
        "count": 1
      },
      {
        "node": "anti-aging-protocol",
        "count": 1
      },
      {
        "node": "medicine-dose",
        "count": 1
      },
      {
        "node": "bernie-sanders",
        "count": 1
      },
      {
        "node": "automation",
        "count": 1
      },
      {
        "node": "universal-basic-income",
        "count": 1
      },
      {
        "node": "perspective-switch",
        "count": 1
      },
      {
        "node": "identity",
        "count": 1
      },
      {
        "node": "nature-relatedness",
        "count": 1
      },
      {
        "node": "creativity",
        "count": 1
      },
      {
        "node": "the-muse",
        "count": 1
      },
      {
        "node": "alex-gray",
        "count": 1
      },
      {
        "node": "societal-rut",
        "count": 1
      },
      {
        "node": "psychedelic-revolution",
        "count": 1
      },
      {
        "node": "internet-impact",
        "count": 1
      },
      {
        "node": "nixon-administration",
        "count": 1
      },
      {
        "node": "anti-war-movement",
        "count": 1
      },
      {
        "node": "propaganda-influence",
        "count": 1
      },
      {
        "node": "trapped-system",
        "count": 1
      },
      {
        "node": "reconsidering-perspective",
        "count": 1
      },
      {
        "node": "disruptors",
        "count": 1
      },
      {
        "node": "the-telescope",
        "count": 1
      },
      {
        "node": "psychedelic-community",
        "count": 1
      },
      {
        "node": "interacting-with-nature",
        "count": 1
      },
      {
        "node": "stress-alleviation",
        "count": 1
      },
      {
        "node": "psychedelic-openness",
        "count": 1
      },
      {
        "node": "avoiding-reality",
        "count": 1
      },
      {
        "node": "hardworking-people",
        "count": 1
      },
      {
        "node": "vitamin-d",
        "count": 1
      },
      {
        "node": "texas-initiative",
        "count": 1
      },
      {
        "node": "casey-musgraves",
        "count": 1
      },
      {
        "node": "first-responders",
        "count": 1
      },
      {
        "node": "ryman-theater",
        "count": 1
      },
      {
        "node": "sturgil-simpson",
        "count": 1
      },
      {
        "node": "turtles-all-the-way-down",
        "count": 1
      },
      {
        "node": "september-18th",
        "count": 1
      },
      {
        "node": "jiu-jitsu-community",
        "count": 1
      },
      {
        "node": "athletic-performance",
        "count": 1
      },
      {
        "node": "kickboxer",
        "count": 1
      },
      {
        "node": "slow-mushroom",
        "count": 1
      },
      {
        "node": "stoners",
        "count": 1
      },
      {
        "node": "greatest-performances",
        "count": 1
      },
      {
        "node": "soulcon",
        "count": 1
      },
      {
        "node": "prognosticate",
        "count": 1
      },
      {
        "node": "nail-game",
        "count": 1
      },
      {
        "node": "sink-nail",
        "count": 1
      },
      {
        "node": "toker",
        "count": 1
      },
      {
        "node": "betting",
        "count": 1
      },
      {
        "node": "clarity-of-focus",
        "count": 1
      },
      {
        "node": "connect",
        "count": 1
      },
      {
        "node": "hitting",
        "count": 1
      },
      {
        "node": "nail",
        "count": 1
      },
      {
        "node": "nail-slamming",
        "count": 1
      },
      {
        "node": "laser-focused",
        "count": 1
      },
      {
        "node": "nailed-it",
        "count": 1
      },
      {
        "node": "hitting-it",
        "count": 1
      },
      {
        "node": "intense-focus",
        "count": 1
      },
      {
        "node": "taekwondo",
        "count": 1
      },
      {
        "node": "hapkido",
        "count": 1
      },
      {
        "node": "three-dimensional-perspective",
        "count": 1
      },
      {
        "node": "dojang",
        "count": 1
      },
      {
        "node": "peripheral-vision",
        "count": 1
      },
      {
        "node": "sparring",
        "count": 1
      },
      {
        "node": "80-20-principle",
        "count": 1
      },
      {
        "node": "exceptional-individuals",
        "count": 1
      },
      {
        "node": "psycho-motor-ability",
        "count": 1
      },
      {
        "node": "psilocybin-combination",
        "count": 1
      },
      {
        "node": "psycho-motor-benefits",
        "count": 1
      },
      {
        "node": "regenerating-neurons",
        "count": 1
      },
      {
        "node": "glioblastoma",
        "count": 1
      },
      {
        "node": "terrence-death",
        "count": 1
      },
      {
        "node": "contra-indications",
        "count": 1
      },
      {
        "node": "tumor-necrosis",
        "count": 1
      },
      {
        "node": "interlucan-1-ra",
        "count": 1
      },
      {
        "node": "agarakon",
        "count": 1
      },
      {
        "node": "turkey-tail",
        "count": 1
      },
      {
        "node": "inflammation-research",
        "count": 1
      },
      {
        "node": "fda-trial",
        "count": 1
      },
      {
        "node": "peer-reviewed-article",
        "count": 1
      },
      {
        "node": "cytokine-storm",
        "count": 1
      },
      {
        "node": "turkey-tail-mycelium",
        "count": 1
      },
      {
        "node": "mushroom-immunity",
        "count": 1
      },
      {
        "node": "endangered-species",
        "count": 1
      },
      {
        "node": "specimen",
        "count": 1
      },
      {
        "node": "trophy",
        "count": 1
      },
      {
        "node": "stamets",
        "count": 1
      },
      {
        "node": "fomytopuselis",
        "count": 1
      },
      {
        "node": "larissopies",
        "count": 1
      },
      {
        "node": "dascarites",
        "count": 1
      },
      {
        "node": "biochemistry",
        "count": 1
      },
      {
        "node": "sky-islands",
        "count": 1
      },
      {
        "node": "larch-trees",
        "count": 1
      },
      {
        "node": "fruit-body-extracts",
        "count": 1
      },
      {
        "node": "austria-slovenia",
        "count": 1
      },
      {
        "node": "scalable-mycelium",
        "count": 1
      },
      {
        "node": "insects",
        "count": 1
      },
      {
        "node": "cortiseps",
        "count": 1
      },
      {
        "node": "ants",
        "count": 1
      },
      {
        "node": "buzz-pollination",
        "count": 1
      },
      {
        "node": "spiders",
        "count": 1
      },
      {
        "node": "bioshield",
        "count": 1
      },
      {
        "node": "cycle-of-life",
        "count": 1
      },
      {
        "node": "invitro-propagation",
        "count": 1
      },
      {
        "node": "adjunct-therapies",
        "count": 1
      },
      {
        "node": "agarakan-strains",
        "count": 1
      },
      {
        "node": "bio-defense-program",
        "count": 1
      },
      {
        "node": "ted-talk",
        "count": 1
      },
      {
        "node": "small-pox-strains",
        "count": 1
      },
      {
        "node": "bird-flu-strains",
        "count": 1
      },
      {
        "node": "stamets-small-pox",
        "count": 1
      },
      {
        "node": "dod",
        "count": 1
      },
      {
        "node": "jackris",
        "count": 1
      },
      {
        "node": "in-vitro",
        "count": 1
      },
      {
        "node": "boy-microphone",
        "count": 1
      },
      {
        "node": "115-strains",
        "count": 1
      },
      {
        "node": "super-strain",
        "count": 1
      },
      {
        "node": "viral-storm",
        "count": 1
      },
      {
        "node": "chronic-wasting-disease",
        "count": 1
      },
      {
        "node": "mycelial-landscape",
        "count": 1
      },
      {
        "node": "beehives-loss",
        "count": 1
      },
      {
        "node": "colony-collapse",
        "count": 1
      },
      {
        "node": "deformed-wing-virus",
        "count": 1
      },
      {
        "node": "fda-regulations",
        "count": 1
      },
      {
        "node": "quorum",
        "count": 1
      },
      {
        "node": "metarisium",
        "count": 1
      },
      {
        "node": "apis-mellifera",
        "count": 1
      },
      {
        "node": "augmenting-immunity",
        "count": 1
      },
      {
        "node": "deliverable-solution",
        "count": 1
      },
      {
        "node": "scalable-solution",
        "count": 1
      },
      {
        "node": "wsu",
        "count": 1
      },
      {
        "node": "almond-industry",
        "count": 1
      },
      {
        "node": "viral-pandemics",
        "count": 1
      },
      {
        "node": "almond-crisis",
        "count": 1
      },
      {
        "node": "animal-agriculture",
        "count": 1
      },
      {
        "node": "antibiotics",
        "count": 1
      },
      {
        "node": "h5n1",
        "count": 1
      },
      {
        "node": "euthanizing",
        "count": 1
      },
      {
        "node": "agaracon-mycelium",
        "count": 1
      },
      {
        "node": "organic-farm",
        "count": 1
      },
      {
        "node": "chicken-immunity",
        "count": 1
      },
      {
        "node": "chicken-layers",
        "count": 1
      },
      {
        "node": "usda",
        "count": 1
      },
      {
        "node": "chicken-growers",
        "count": 1
      },
      {
        "node": "euthanizations",
        "count": 1
      },
      {
        "node": "inflated-numbers",
        "count": 1
      },
      {
        "node": "incentivized",
        "count": 1
      },
      {
        "node": "bird-flu",
        "count": 1
      },
      {
        "node": "viruses-vaccines",
        "count": 1
      },
      {
        "node": "libertarian",
        "count": 1
      },
      {
        "node": "vaccine-industry",
        "count": 1
      },
      {
        "node": "failure-to-disclose",
        "count": 1
      },
      {
        "node": "americans",
        "count": 1
      },
      {
        "node": "industrial-vaccine",
        "count": 1
      },
      {
        "node": "sexually-transmitted-disease",
        "count": 1
      },
      {
        "node": "vaccine-manufacturers",
        "count": 1
      },
      {
        "node": "vilified",
        "count": 1
      },
      {
        "node": "ratio",
        "count": 1
      },
      {
        "node": "risk-assessment",
        "count": 1
      },
      {
        "node": "home-team",
        "count": 1
      },
      {
        "node": "vaccinations",
        "count": 1
      },
      {
        "node": "risk-benefit-ratio",
        "count": 1
      },
      {
        "node": "echo-chamber",
        "count": 1
      },
      {
        "node": "drowning-dissent",
        "count": 1
      },
      {
        "node": "ideological-science",
        "count": 1
      },
      {
        "node": "anti-vaxers",
        "count": 1
      },
      {
        "node": "scaring-compliance",
        "count": 1
      },
      {
        "node": "pejorative-labeling",
        "count": 1
      },
      {
        "node": "innate-immunity",
        "count": 1
      },
      {
        "node": "metabolic-health",
        "count": 1
      },
      {
        "node": "financial-incentives",
        "count": 1
      },
      {
        "node": "censorship",
        "count": 1
      },
      {
        "node": "harvard-mit",
        "count": 1
      },
      {
        "node": "great-barrington-study",
        "count": 1
      },
      {
        "node": "open-source-database",
        "count": 1
      },
      {
        "node": "vaccine-risk",
        "count": 1
      },
      {
        "node": "breeding-deniers",
        "count": 1
      },
      {
        "node": "vaccine-injured",
        "count": 1
      },
      {
        "node": "propaganda",
        "count": 1
      },
      {
        "node": "co-morbidities",
        "count": 1
      },
      {
        "node": "vaccine-schedule",
        "count": 1
      },
      {
        "node": "cherry-picking",
        "count": 1
      },
      {
        "node": "deceptive-language",
        "count": 1
      },
      {
        "node": "entourage-effect",
        "count": 1
      },
      {
        "node": "1-5-million",
        "count": 1
      },
      {
        "node": "less-than-10-",
        "count": 1
      },
      {
        "node": "poisonous",
        "count": 1
      },
      {
        "node": "psychoactive",
        "count": 1
      },
      {
        "node": "edibles",
        "count": 1
      },
      {
        "node": "molecular-wizards",
        "count": 1
      },
      {
        "node": "pharmaceutical-factories",
        "count": 1
      },
      {
        "node": "genomic-analysis",
        "count": 1
      },
      {
        "node": "microbial-environment",
        "count": 1
      },
      {
        "node": "alzheimer-s",
        "count": 1
      },
      {
        "node": "lifestyle",
        "count": 1
      },
      {
        "node": "meditation",
        "count": 1
      },
      {
        "node": "vitamins",
        "count": 1
      },
      {
        "node": "dean-ornish",
        "count": 1
      },
      {
        "node": "adverse-effect",
        "count": 1
      },
      {
        "node": "agriculture",
        "count": 1
      },
      {
        "node": "bees",
        "count": 1
      },
      {
        "node": "exemptions",
        "count": 1
      },
      {
        "node": "regulatory-industry",
        "count": 1
      },
      {
        "node": "bee-apocalypse",
        "count": 1
      },
      {
        "node": "montana-beehives",
        "count": 1
      },
      {
        "node": "virus-transference",
        "count": 1
      },
      {
        "node": "viral-infections",
        "count": 1
      },
      {
        "node": "animal-clusters",
        "count": 1
      },
      {
        "node": "mutated-virus",
        "count": 1
      },
      {
        "node": "exponential-increase",
        "count": 1
      },
      {
        "node": "conventional-medicine",
        "count": 1
      },
      {
        "node": "researchers",
        "count": 1
      },
      {
        "node": "concentrated",
        "count": 1
      },
      {
        "node": "industrial-agriculture",
        "count": 1
      },
      {
        "node": "unnatural-environments",
        "count": 1
      },
      {
        "node": "regenerative-agriculture",
        "count": 1
      },
      {
        "node": "counterargument",
        "count": 1
      },
      {
        "node": "better-nutrition",
        "count": 1
      },
      {
        "node": "livestock-protection",
        "count": 1
      },
      {
        "node": "fungi",
        "count": 1
      },
      {
        "node": "molecular-geneticist",
        "count": 1
      },
      {
        "node": "provable-result",
        "count": 1
      },
      {
        "node": "open-minded-scientists",
        "count": 1
      },
      {
        "node": "morel-mushrooms",
        "count": 1
      },
      {
        "node": "poisonous-mushrooms",
        "count": 1
      },
      {
        "node": "volatile-compounds",
        "count": 1
      },
      {
        "node": "nam",
        "count": 1
      },
      {
        "node": "hipaa-rules",
        "count": 1
      },
      {
        "node": "dr-michael-bug",
        "count": 1
      },
      {
        "node": "mushroom-poisonings",
        "count": 1
      },
      {
        "node": "namico-org",
        "count": 1
      },
      {
        "node": "armaleria-atoi",
        "count": 1
      },
      {
        "node": "honey-mushroom",
        "count": 1
      },
      {
        "node": "mycelium-running",
        "count": 1
      },
      {
        "node": "laminated-root-rot",
        "count": 1
      },
      {
        "node": "bark-beetle",
        "count": 1
      },
      {
        "node": "paraglondula-clandestina",
        "count": 1
      },
      {
        "node": "aspen-trees",
        "count": 1
      },
      {
        "node": "psychonauts",
        "count": 1
      },
      {
        "node": "cis",
        "count": 1
      },
      {
        "node": "mountaintop",
        "count": 1
      },
      {
        "node": "spirit-molecule",
        "count": 1
      },
      {
        "node": "rowan",
        "count": 1
      },
      {
        "node": "charlatans",
        "count": 1
      },
      {
        "node": "medical-practitioner",
        "count": 1
      },
      {
        "node": "medical-constructs",
        "count": 1
      },
      {
        "node": "illegality",
        "count": 1
      },
      {
        "node": "psilocybin-study",
        "count": 1
      },
      {
        "node": "emotional-harm",
        "count": 1
      },
      {
        "node": "tony-back",
        "count": 1
      },
      {
        "node": "patient-assaults",
        "count": 1
      },
      {
        "node": "psilocybin-benefits",
        "count": 1
      },
      {
        "node": "emotional-reconciliation",
        "count": 1
      },
      {
        "node": "aggression-impact",
        "count": 1
      },
      {
        "node": "tragedy-ripples",
        "count": 1
      },
      {
        "node": "antisocial-behaviors",
        "count": 1
      },
      {
        "node": "positivity",
        "count": 1
      },
      {
        "node": "sarco",
        "count": 1
      },
      {
        "node": "religious-exemption",
        "count": 1
      },
      {
        "node": "rcmp-officer",
        "count": 1
      },
      {
        "node": "mushroom-shop",
        "count": 1
      },
      {
        "node": "stem-of-stack",
        "count": 1
      },
      {
        "node": "threat-level",
        "count": 1
      },
      {
        "node": "swad-car",
        "count": 1
      },
      {
        "node": "law-enforcement-safety",
        "count": 1
      },
      {
        "node": "nice-arresting",
        "count": 1
      },
      {
        "node": "gamecher",
        "count": 1
      },
      {
        "node": "deescalation",
        "count": 1
      },
      {
        "node": "adversarial",
        "count": 1
      },
      {
        "node": "interrogation",
        "count": 1
      },
      {
        "node": "reacting",
        "count": 1
      },
      {
        "node": "cascading-effect",
        "count": 1
      },
      {
        "node": "inflammatory-actions",
        "count": 1
      },
      {
        "node": "cascading-event-of-harm",
        "count": 1
      },
      {
        "node": "terrible-mistakes",
        "count": 1
      }
    ],
    "topicGroups": {
      "groups": [
        {
          "topics": [
            "psilocybin",
            "psilocybin-mushrooms",
            "psychedelics",
            "psilocin",
            "psilocybin-experience",
            "psychedelic-experience",
            "dmt",
            "ibagane",
            "blue-lotus"
          ],
          "category": {
            "name": "Psychedelics",
            "description": "Psychedelics and their effects on the mind and body."
          }
        },
        {
          "topics": [
            "psilocybin-mushrooms",
            "mushrooms",
            "agaracon",
            "mycelium",
            "mushroom-hunting",
            "psilocin",
            "psilocybe-cubensis",
            "morels",
            "salicide-mushrooms",
            "polypore-mushroom",
            "lion-s-mane"
          ],
          "category": {
            "name": "Mushrooms",
            "description": "Mushrooms, their types, and related topics."
          }
        },
        {
          "topics": [
            "clinical-studies",
            "ptsd",
            "immune-system",
            "vaccines",
            "neuro-regeneration",
            "interlucan-6",
            "anti-inflammatory",
            "enhances-immunity",
            "hep-b-vaccines",
            "gene-transfer",
            "virologists",
            "therapists",
            "veterans-ptsd",
            "ptsd-treatment",
            "war-veterans"
          ],
          "category": {
            "name": "Medical and Scientific Research",
            "description": "Medical applications and research."
          }
        },
        {
          "topics": [
            "ptsd",
            "psychedelic-experience",
            "therapy",
            "neuro-regeneration",
            "addiction",
            "self-forgiveness",
            "personal-transformation",
            "ptsd-treatment",
            "war-veterans",
            "therapists"
          ],
          "category": {
            "name": "Mental Health and Therapy",
            "description": "Mental health and therapeutic applications."
          }
        },
        {
          "topics": [
            "joe-rogan-experience",
            "joe-rogan-podcast",
            "indigenous-practices",
            "indigenous-people",
            "syncretism",
            "social-media",
            "clickbait",
            "muslims",
            "anti-hippie",
            "joe-ltori",
            "adam-and-eve",
            "mushroom-revolution",
            "advocate",
            "las-vegas",
            "ufc"
          ],
          "category": {
            "name": "Social and Cultural",
            "description": "Social and cultural aspects of psychedelics."
          }
        },
        {
          "topics": [
            "law-enforcement",
            "dea-license",
            "rand-report",
            "rick-perry",
            "marijuana",
            "full-disclosure",
            "political-boundaries",
            "ideological-capture",
            "citizen-s-right",
            "government-funding",
            "marijuana-possession"
          ],
          "category": {
            "name": "Legal and Political",
            "description": "Legal and political aspects of psychedelics."
          }
        },
        {
          "topics": [
            "joe-rogan-experience",
            "washington-university",
            "joe-ltori",
            "jamie",
            "rick-perry",
            "basu-luthu",
            "ibagain-initiative"
          ],
          "category": {
            "name": "People and Organizations",
            "description": "Specific individuals and organizations."
          }
        },
        {
          "topics": [
            "1970s",
            "1990s",
            "2000s"
          ],
          "category": {
            "name": "Time Periods",
            "description": "Historical and temporal references."
          }
        },
        {
          "topics": [
            "alcohol",
            "marijuana",
            "cannabis",
            "alcohol-consumption",
            "alcohol-lobby"
          ],
          "category": {
            "name": "Substances",
            "description": "Substances and their effects."
          }
        },
        {
          "topics": [
            "continuum-existence",
            "random-acts-of-kindness-algorithm",
            "museum-dose",
            "inaturalist",
            "high-doses",
            "pacific-northwest",
            "asteroid-impact",
            "snapping-turtles",
            "cooperation",
            "elixir-adlongum-vitam",
            "bird-flu-pandemic",
            "immunocompromised",
            "150000",
            "patient-zeros",
            "taxonomy",
            "underreporting",
            "stormy-night",
            "180-turn",
            "stress",
            "criminal-behavior",
            "reality-confrontation",
            "prevention",
            "return-on-investment",
            "crime-reduction"
          ],
          "category": {
            "name": "Miscellaneous",
            "description": "Miscellaneous topics."
          }
        }
      ]
    },
    "shortSummary": "Paul Stamets discusses his new book on psilocybin mushrooms, their historical use, and the potential for psychedelics to treat various mental health issues. He also touches on the current state of cannabis legalization and the future of AI.",
    "lastStoryCheck": "2025-07-14T14:14:39.144Z",
    "storyCheckResults": {
      "missingChunks": [],
      "missingStories": [
        "social-and-cultural",
        "psychedelics",
        "legal-and-political",
        "mushrooms",
        "mental-health-and-therapy",
        "medical-and-scientific-research",
        "substances",
        "time-periods"
      ],
      "totalCategories": 10,
      "totalChunksChecked": 111
    }
  }
}