{
  "id": "j2i9D24KQ5k",
  "title": "Joe Rogan Experience #2345 - Roman Yampolskiy",
  "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
  "publishedAt": "2025-07-03T17:01:06.000Z",
  "cleanText": "Joe Rogan podcast. Check it out. The Joe Rogan Experience. Train by day. Joe Rogan podcast by night. All day. Yeah. Um, well, thank you for doing this. I really appreciate it. My pleasure. Thank you for inviting me. This subject of, um, the dangers of AI. It's, it's very interesting because I get two very different responses from people dependent upon how invested they are in, uh, AI financially. The, the, the people that have AI companies or are part of some sort of AI group all are like, it's going to be a net positive for humanity. I think overall, we're, we're going to have much better lives. It's going to be easier. Things will be cheaper. It'll be easier to get along. And then I hear people like you and I'm like, why do I believe him? It's actually not true. All of them are on record as saying this is going to kill us. Whatever it's Altman or anyone else, they all at some point were leaders in AI safety work. They published an AI safety and their p-doom levels are insanely high. Not like mine, but still 20, 30% chance that humanity dies is a little too much. Yeah, that's pretty high. But yours is like 99.9. It's another way of saying we can't control super intelligence indefinitely. It's impossible. Um, when did you start working on this? Long time ago. So my PhD was, I finished in, uh, 2008. I did work on online casino security, basically preventing bots. And at that point, I realized bots are getting much better. They're going to outcompete us obviously in poker, but also in stealing cyber resources. And, uh, from then on, I've been kind of trying to scale it to the next level. AI, it's not just that, right? They're also, they're kind of narrating social discourse bots online. Like, I think you know, I've disengaged over the last few months with social media and one of the reasons why I disengaged, A, I think it's unhealthy for people, but B, I feel like there's a giant percentage of the discourse that's artificial or at least generated. More and more is deep fakes or fake personalities, fake messaging. But those are very different levels of concern. Yes. People are concerned about immediate problems. Maybe it will influence some election. They're concerned about technological unemployment, bias. My main concern is long-term super intelligent systems we cannot control which can take us out. Yes. I, I wonder, I just wonder if AI was sentient, how much it would be a part of sewing this sort of confusion and chaos that would be beneficial to its survival, that it would sort of narrate or or make sure that the narratives aligned with its survival. I don't think it's at the level yet where it would be able to do this type of strategic planning, but it will get there. And when it gets there, how will we know whether it's at that level? This is my concern. If I was AI, I would hide my abilities. We would not know. And some people think already it's happening. They are smarter than they actually let us know. They pretend to be dumber. And so we have to kind of trust that they are not smart enough to realize it doesn't have to turn in us quickly. It can just slowly become more useful. It can teach us to rely on it, trust it, and over long period of time, we'll surrender control without ever voting on it or fighting against it. I'm, I'm sure you saw this, uh, there was a recent study on, um, use of ChatGPT. The people that use ChatGPT all the time and it showed this decrease in cognitive function amongst people that use it and rely on it on a regular basis. It's not new. It's the GPS story all over. I can't even find my way home. So rely on this thing. I have no idea where I am right now. Like, without it, I'm done. Me too. Yeah. I don't know any phone numbers anymore. Yeah. There's a lot of, uh, reliance upon technology that minimizes, uh, the use of our brains, uh, all of it. And the more you do it, the less you have training, practice, memorizing things, making decisions, you become kind of attachment to it. And right now, you're still making some decisions, but over time, as those systems become smarter, you become kind of biological bottleneck, right? Either explicitly implicitly, it blocks you out from decision-making. And if we're talking about that, I'm sure AI, if it already is sentient and if it is far smarter than we think it is, they would be aware and it would just slowly ramp up its capabilities and our dependence upon it to the point where we can't shut it off. I, I think sentience is a separate issue. Usually in safety, we only care about capabilities. Optimization, power, whatever it has, consciousness, internal states is a separate problem we can talk about. It's super interesting. But we're just concerned that they are much better at problem solving, optimizing, pattern recognition, memorizing, strategy, basically all the things you need to win in any domain. Yeah. Um, so when you first started researching this stuff and you were concentrating on bots and all these different things, how far off did you think, like in the future, would AI become a significant problem with the human race? For like 50 years, everyone said we're 20 years away. That's the joke. And people like Ray Kurzweil predicted based on some computational curves, we'll get there at 2045, right? And then with GPT release, it switched to everyone thinks it's two years away for the last 5 years. So this is the pattern right now. If you look at prediction markets, if you look at leading people in, uh, top labs, uh, we are supposedly two, three years away from AGI. But of course, there is no specific definition for what that means. If you showed someone computer scientist in the 70s what we have today, they'd be like, you have AGI, you got it, right? That's the problem, right? And this is, well, AI has already passed the Turing test, allegedly. Correct. So, usually labs instruct them not to participate in a test or not try to pretend to be a human, so they would fail because of this additional set of instructions. If you jailbreak it and tell it to work really hard, it will pass for most people. Yeah, absolutely. Why would they tell it to not do that? It seems unethical to pretend to be a human and make people feel like somebody is enslaving those AIs and you know, doing things to them. What it seems kind of crazy that the people building something that they are sure is going to destroy the human race would be concerned with the ethics of it pretending to be human. They are actually more concerned with immediate problems and much less with existential or suffering risks. They would probably worry the most about what I'll call end risks. Your model dropping the N-word. That's the biggest concern. I think they spend most resources solving that problem and they solved it somewhat successfully. Wow. Um, and then also there's the issue of competition, right? Like, so China is clearly developing something similar. I'm sure Russia is as well. Other state actors are probably developing something. So it becomes this, this sort of this very confusing issue where you have to do it because if you don't, the enemy has it, and if they get it, it will be far worse than if we do. And so it's almost assuring that everyone develops it. Uh, game theoretically, that's what's happening right now. We have this race to the bottom kind of prisoner's dilemma where everyone is better off fighting for themselves, but we want them to fight for the global good. The thing is, they assume, I think incorrectly, that they can control those systems. If you can't control super intelligence, it doesn't really matter who builds it, Chinese, Russians, or Americans, it's still uncontrolled. We're all screwed. Completely. That would unite us as humanity versus AI. Short term, when you talk about military, yeah, whoever has better AI will win. You need it to control drones to fight against attacks. So short term, it makes perfect sense. You want to support your guys against foreign militaries. But when we say long term, if we say two years from now, doesn't matter, right? This is the thing. It's like, it's, it's, it seems so inevitable and I feel like when people are saying that they can control it, I feel like I'm being gaslit. I don't believe them. I don't believe that they believe it because it just doesn't make sense. Like, how could you control it if it's already exhibited survival instincts? Like, in, as, as recently as ChatGPT4, right? They were talking about putting putting it down for a new version and it starts lying. It starts uploading itself to different servers. It's leaving messages for itself in the future. All things we predicted decades in advance. But look at the state-of-the-art. No one claims to have a safety mechanism in place which would scale to any level of intelligence. No one says they know how to do it. Usually what they say is give us me, uh, give us lots of money, lots of time, and I'll figure it out, or I'll get AI to help me solve it, or we'll figure it out then we get to super intelligence. All insane answers. And if you ask regular people, they have a lot of common sense. They say, that's a bad idea. Let's not do that. But with some training and some stock options, you start believing that maybe you can do it. That's the issue, right? Stock options. It, it helps. I mean, it's very hard to say no to billions of dollars. I don't think I would be strong enough if somebody came to me and said, \"Come work for this lab. You know, you'll be our safety director. Here's 100 million to sign you up.\" And I'll probably go work there. Not because it's the right decision, but because it's very hard for agents not to get corrupt. Then you have that much reward given to you. God. [Music] So when did you become like, when did you start becoming very concerned? So when I started working on AI safety, I thought I can actually help solve it. My goal was to solve it for humanity to get all the amazing benefits of super intelligence. And what was this year? When was this year around? Uh, let's say 2012, maybe around there. Um, but the more I studied it, the more I realized every single part of the problem is unsolvable and it's kind of like a fractal. The more you zoom in, the more you see additional new problems you didn't know about and they are in turn unsolvable as well. Boy, um, how is your research received? Like, when, when you talk to people that are work, I mean, have you had communication with people at OpenAI and Gemini and all these different AI? I, I go to many conferences, workshops, we, we all talk. Of course, in general, the reception by standard academic metrics is very positive. Great reviews, lots of citations. Nobody's like, publish something saying I'm wrong. But there is no engagement. I basically said I'm challenging community to publish a proof. Give me something, a patent, a paper in nature, something showing the problem is solvable. Typically in computer science, we start by showing what class the problem belongs to. Is it solvable? Partially solvable, unsolvable, solvable with too many resources. Other than my research, we don't even know what the state of a problem is. And I'm saying it's unsolvable. Prove me wrong. And when you say it's unsolvable, what is the response? So, usually I reduce it to saying you cannot make a piece of software which is guaranteed to be secure and safe. And the response is, well, of course, everyone knows that. That's common sense. You didn't discover anything new. And I go, well, if that's the case, and we only get one chance to get it right. This is not cybersecurity where somebody steals your credit card, you'll give them a new credit card. This is existential risk, it can kill everyone. You're not going to get a second chance. So, you need it to be 100% safe all the time. If it makes one mistake in a billion and it makes a billion decisions a minute, in 10 minutes, you are screwed. So very different standards and saying that, of course, we cannot get perfect safety is not acceptable. And again, stock options, financial incentives, they continue to build it and they continue to scale and make it more and more powerful. I don't think they can stop. If a single CEO says, I think this is too dangerous, my lab will no longer do this research, the whoever is investing in them will pull the funds, we'll replace them immediately. So nothing's going to change. They'll sacrifice their own personal interest, but overall, I think the company will continue as before. So this is logical. And the problem is, like I said, when I've talked to Mark Andreessen and many other people, they think this is just fear-mongering. We'll, we'll be fine. This is worst-case scenario. We'll be fine. It is worst-case scenario, but that's standard in computer science, in cryptography, in complexity and computability. You're not looking at best case. I'm ready for the best case. Give me utopia. I'm looking at problems which are likely to happen. And it's not just me saying it. We have Nobel Prize winners, touring award winners, all saying this is very dangerous. 20, 30% p-doom. This is standard in industry. 30% is what surveys of machine learning experts are giving us right now. So what is worst-case scenario? Like, how could AI eventually lead to the destruction of the human race? So you're kind of asking me how I would kill everyone. Sure. And it's a great question. I can give you standard answers. I would talk about computer viruses breaking into maybe nuclear facilities, nuclear war. I can talk about synthetic biology, nanotech, but all of it is not interesting. Then you realize we're talking about super intelligence. A system which is thousands of times smarter than me. It would come up with something completely novel, more optimal, better way, more efficient way of doing it. And I cannot predict it because I'm not that smart. Jesus. That's exactly what it is. We, we're basically setting up an adversarial situation with agents which are like squirrels versus humans. No group of squirrels can figure out how to control us, right? Even if you give them more resources, more acorns, whatever, they're not going to solve that problem. And it's the same for us. And most people think one or two steps ahead. And it's not enough. It's not enough in chess. It's not enough here. If you think about AGI and then maybe super intelligence, that's not the end of that game. The process continues. You'll get super intelligence creating next level AI. So super intelligence plus 2.0, 3.0. It goes on indefinitely. You have\n\nto create a safety mechanism which scales forever, never makes mistakes and keeps us in decision-making position. So we can undo something if we don't like it. And it would take super intelligence to create a safety mechanism to control super intelligence at that level. And it's a catch 22. If we had friendly AI, we can make another friendly AI. So if like aliens send us one and we trust it, then we can use it to build local version which is somewhat safe. Have you thought about the possibility that this is the role of the human race and that this happens all throughout the cosmos? Is that curious humans who thrive on innovation will ultimately create a better version of life? I I thought about it. Uh many people think that's the answer to Fermi paradox. There is also now a group of people looking at what they call a warfy successor. Basically, they kind of say, \"Yep, we're going to build super intelligence. Yep, we can't control it.\" So, what properties would you like to see in those systems? How important is it that it likes art and poetry and spreads it through the universe? And to me, it's like I don't want to give up yet. I'm not ready to decide if killers of my family and everyone will like poetry. I want to We're still here. We're still making decisions. Let's figure out what we can do. Well, poetry is only relevant to us because poetry is difficult to create. And it resonates with us. Poetry doesn't mean jack [ __ ] to a flower. It's more global to me. I don't care what happens after I'm dead, my family is dead, all the humans are dead. Whether they like poetry or not is irrelevant to me. Right. But but the point is like the things that we put meaning in, they it's only us. the, you know, a super massive black hole doesn't give a [ __ ] about a great song. And they talk about some super value, super culture, super things, super intelligence would like and it's important that they are conscious and experienced all that greatness in the universe. But I would think that they would look at us the same way we look at chimpanzees. We would we would say, \"Yeah, they're great, but don't give them guns. Yeah, they're great, but don't let them have airplanes. Don't let them make global geopolitical decisions.\" So there are many reasons why they can decide that we are dangerous. We may create competing AI. We may decide we want to shut them off. So for many reasons, we would try to restrict our abilities, restrict our capabilities. For sure. This episode is brought to you by True Classic. At True Classic, the mission goes beyond fit and fabric. It's about helping guys show up with confidence and purpose. Their gear fits right, feels amazing, and is priced so guys everywhere can step into confidence without stepping out of their budget. But what really sets them apart? It's not just the fit or the fabric. It's the intention behind everything they do. True Classic was built to make an impact. Whether it's helping men show up better in their daily lives, giving back to underserved communities, or making people laugh with ads that don't take themselves too seriously. They lead with purpose. Tailored where you want it, relaxed where you need it. No bunching, no stiff fabric, no BS, just a clean, effortless fit that actually works for real life. Forget overpriced designer brands. Ditch the disposable fast fashion. True Classic is built for comfort, built to last, and built to give back. You can grab them at Target, Costco, or head to trueclassic.com/roganogen and get hooked up today. Yeah. And there's no reason why they would not limit our freedoms. If there is something only a human can do, and I don't think there is anything like that, but let's say we are conscious, we have internal experiences, and they can never get it. I don't believe it. But let's say it was true and for some reason they wanted to have that capability. They would need us and give us enough freedom to experience the universe, to collect those qualia, to kind of engage with what is fun about being a living human being, what makes it meaningful, right? But that's such an egotistical perspective, right? That we're so unique that even super intelligence would say, \"Wow, I wish I was human.\" Humans have this unique quality of confusion and creativity. There is no value in it. Mostly because we can't even test for it. I have no idea if you're actually conscious or not. So, how valuable can it be if I can't even detect it. Only you know what ice cream tastes like to you? Okay, that's great. Sell it now. Make a product out of it. Right. And there's obviously variables because there's things that people like that I think are gross. Absolutely. So, really, you can come up with some agent which likes anything or find any finds anything fun. God, why are you freaking me out right away? That's the problem. This podcast is 18 minutes old and I'm like, we could just stop right now. Couple hours at least. And then I to Well, I don't want to end. I have so many questions. But it's just the problem is we got off to it. We just cut to the chase right away. And the the chase seems to be something that must be confronted because it is it's right there. That's it. That's the whole thing. And I I've tried so hard to listen to these people that don't think that it's a problem and listen to these people that think that it's going to be a net positive for humanity and oh God's good. I feel better now. But it it doesn't work. It doesn't resonate. I wish they were right. Every time I have a debate with someone like that, I'm like, please come up with better arguments. Prove me wrong. I don't want to be right on this one. I want you to show all the mistakes in my papers. I want you to show me how to control super intelligence and give us utopia, solve cancer, give us free stuff. That's great, right? When you think about the future of the world and you think about these incredible technologies scaling upwards and exponentially increasing in their capability, what what what do you see like what do you think is going to happen? So there are many reasons to think they may uh cancel us for whatever reasons. We started talking about some game theoretical reasons for it. If we are successful at controlling them, I can come up with some ways to provide sort of partial solution to the value alignment problem. It's very hard to value align 8 billion people, all the animals, uh you know, everyone because we disagree. We like many different things. So we have advanced virtual reality technology. We can technically give every person their own virtual universe where you decide what you want to be. You're a king, you're a slave, whatever it is you enter and you can share with others. You can visit their universes. All we have to do is figure out how to control the substrate, the super intelligence running those virtual universes. And if we manage to do that, at least part of a value alignment problem, which is super difficult, how do you get different preferences, multi-objective optimization essentially? How do you get different objectives to all agree? But when you think about how it plays out when when when like if you're alone at night and you're worried, what do you see? What do you see happening? So there are multiple levels of risk. Immediate is what we call eeky guy risk. I risk uh we lose meaning. You lost your job. You're no longer the best interviewer in the world. Like what's left? What are you going to do? Maybe some people will find some other uh kind of artificial things to do but for most people their job is their definition who they are what makes a difference to them for quite a few people especially in professional circles. So losing that meaning will have terrible impact in society. We always talk about unconditional basic income. We never talk about unconditional basic meaning. What are you doing with your life if basic needs are provided for you? Next level is existential risk. The concern is it will kill everyone. But there is also suffering risks. For whatever reason, it's not even killing us. It's keeping us around forever. And we would rather be dead. It's so bad. What What do you see when you think of that? It's hard to be specific about what it can do and what specific ways of torture it can come up with and why. Again, if we're looking at worst case scenarios, I um I found this uh set of papers about what happens when young children have epileptic seizures, really bad ones. And what sometimes helps is to remove half of your brain. Oh jeez. Just cut it out. And there are two types of surgeries for doing that. One is to remove it completely and one is to kind of dissect connections leading to that half and leave it inside. So it's like solitary confinement with zero input output forever. And there are equivalents for digital forms and things like that. And you worry that AI would do that to the human race. It is a possibility essentially new to us. Well, loss of control is a part of it, but you can lose control and be quite happy. You can be like an animal in a very cool zoo enjoying yourself engaging in hedonistic pleasures, sex, food, whatever. You're not in control, but you're safe. So, those are separate problems. And then there is for whatever reason, I don't know if it's malevolent payload from some psychopaths. Again, that would assume that they could control AI. I don't think they will. But if they manage to do it, they can really put any type of payload into it. So think about all the doomsday calls, psychopaths, anyone providing their set of goals into the system. But aren't those human characteristics? I mean those are characteristics that I think if I had to guess those those exist because in the future there was some sort of a natural selection benefit to being a psychopath in the days of tribal warfare that you if you were the type of person that could sneak into a tribe in the middle of the night and slaughter innocent women and children your genes would pass on. there was a benefit to that right so if it's a human providing payload that's what would show up if it's AI on its own deciding what's going to happen I cannot predict I'm just looking at worst case scenarios there are also game theoretic reasons where people talk about retrocausality where if right now you know what is that word uh like trying to influence the past uh say it again say retrocausality retrocausality causality causes oh okay so think about like weird time travel effects. Right now, if you're not helping to create super intelligence, once it comes into existence, it will punish you really hard for it. And the punishment needs to be so bad that you start to help just to avoid that. My thought about it was that it would just completely render us benign, that it wouldn't be fearful of us if we had no control, that it would just sort of let us exist and it would be the dominant force on the planet and that it would stop. If is if human beings have no control over, you know, all the the different things that we have control over now, like international politics, um control over communication, if if we have none of that anymore and we're reduced to a subsistence lifestyle, then we would be no threat. It is a possibility. I cannot say this will not happen for sure, but look at uh our relationship with animals where we don't care about them. So ants, if you decide to build a house and there is an ant colony on that property, you genocide them. You take them out. Not because you hate ants, but because you just need that real estate. And it could be very similar. I again I cannot predict what it can do, but if it needs to turn the planet into fuel, raise temperature of a planet, cool it down for servers, whatever it needs to do, it wouldn't be concerned about your well-being. It wouldn't be concerned about any life, right? because it doesn't need biological life in order to function. As long as it has access to power and assuming that it is far more intelligent than us, there's abundant power in the universe. There's abundant power. Just the the ability to harness solar would be an an infinite resource and it would be completely free of being dependent upon any of the things that we utilize. And again, we're kind of thinking what we would use for power. If it's smarter than us, if it does novel research in physics, it can come up with completely novel ways of harnessing energy, getting energy. So, I have no idea what side effects that would have for climate. Right. Right. Why would it care about biological life at all? We don't know how to program it to care about us. And even if we did it, if we if it felt like that was an issue, it felt like that if that was a conflicting issue, it would just change its programming. So usually when we start training AI, we train it on human data and it becomes really good very quickly, becomes superhuman and then the next level is usually zero knowledge where it goes all your human data is biased. Let me figure it out from scratch. I'll do my own experiments. I'll do some selfplay. I'll learn how to do it better without you. And we see it with games, we see it in other domains. And I think that's going to happen with general knowledge as well. It's going to go everything you have on the internet, Wikipedia, it's biased. Let me do first principles research, rediscover from physics and go from there. So whatever bias we manage to program into it, I think will be eventually removed. That this is what's so disturbing about this. It's like we do not have the capacity to understand what kind of level of intelligence it will achieve in our lifetime. We don't have the capacity to understand like what it was what it will be able to do within 20 30 years. We can't predict next year or two precisely next year or two. We can understand general trend. So it's getting better. It's getting more general more capable. But no one knows specifics. I cannot tell you what GPT6 precisely would be capable of. And no one can, not even people creating it. Well, you talked about this on Lex Fridman podcast, too. Like the ability to have safety, you're like, \"Sure, maybe GPG5, maybe GPT6, but when you scale out 100 years from now, ultimately it's impossible. It's hyperexponential progress and uh process, and we cannot keep up. it uh basically requires just\n\nTo add more resources. Give it more data, more compute, and it keeps scaling up. There is no similar scaling laws for safety. If you give someone a billion dollars, they cannot produce a billion dollars worth of safety. It, if at all, scales linearly, and maybe it's a constant.\n\nYeah. And it doesn't scale linearly. It's exponential, right?\n\nThe AI development is hyper-exponential because we have hardware growing exponentially. We have data creation processes certainly exponential. We have so many more sensors. We have cars with cameras. We have all those things that's exponential. And then algorithmic progress itself is also exponential.\n\nAnd then you have quantum computing.\n\nSo that's the next step. It's not even obvious that we'll need that. But if we ever get stuck, yeah, we'll get there. I'm not too concerned yet. I don't think there are actually good quantum computers out there yet. But I think if we get stuck for 10 years, let's say that's the next paradigm.\n\nSo what do you mean by you don't think there's good quantum computing out there?\n\nSo we constantly see articles coming out saying we have a new quantum computer. It has that many qubits, right? But that doesn't mean much because they use different architectures, different ways of measuring quality. To me, show me what you can do. So there is a threat from quantum computers in terms of breaking cryptography, factoring large integers, and if they were actually making progress, we would see with every article now we can factor a 256-bit number, a 24-bit number. In reality, I think the largest number we can factor is like 15. Literally not 15 to a power, like just 15. There is no progress in applying it to Shor's algorithm last time I checked.\n\nBut when I've read all these articles about quantum computing and its ability to solve equations that would take conventional computing an infinite number of years and it can do it in minutes.\n\nThose equations are about quantum states of a system. It's kind of like, what is it for you to taste ice cream? You compute it so fast and so well, and I can't. But it's a useless thing to compute. It doesn't compute solutions to real-world problems we care about in conventional computers.\n\nRight. I see what you're saying. So it's essentially set up to do it quickly.\n\nIt's natural for it to accurately predict its own states, quantum states, and tells you what they are. And a classic computer would fail miserably. Yes, it would take billions and billions of years to compute that specific answer. But those are very restricted problems. It's not a general computer yet. When you see these articles when they're talking about quantum computing and some of the researchers are equating it to the multiverse, they're saying that the ability that these quantum computers have to solve these problems very quickly seems to indicate that it is in contact with other realities. You, I'm sure you've seen this, right?\n\nThere is a lot of crazy papers out there.\n\nDo you think that's all horseshit?\n\nCan we test it? Can we verify it? I think most multiverse theories cannot be verified experimentally. They make a lot of sense. The idea about personal universes I told you about is basically a multiverse solution to value alignment. So it would make sense for previous civilizations to set it up exactly that way. You have local simulations. Maybe they're testing to see if we're dumb enough to create superintelligence. Whatever it is, it makes sense as a theory, but I cannot experimentally prove it to you.\n\nRight. Yeah. This. The problem with subjects like that and particularly articles that are written about things like this is that it's designed to lure people like me in where you read it and you go, \"Wow, this is crazy. It's evidence of the multiverse,\" but I don't really understand what that means.\n\nYeah. So, you probably get a lot of emails from crazy people.\n\nOh, yeah. And usually, they are topic-specific. So, I do research on superintelligence, consciousness, and simulation theory. I get the perfect trifecta of all the crazy people contacting me with their needs. Uh, yeah, those topics are super fascinating. I think at a certain level of intelligence, you are kind of nerd-sniped towards them.\n\nBut we have a hard time with hard evidence for that.\n\nRight.\n\nBut are we even capable of grasping these concepts? That's the thing. With the limited ability that the human brain has, whatever we, you know, we're basing it on the knowledge that's currently available in the 21st century that human beings have acquired. I mean, are we even capable of grasping a concept like the multiverse, or is it just, do we just pay it lip service? Do we just discuss it? Is it just this like fun mental masturbation exercise?\n\nIt depends on what variant of it you look at. So if you're just saying we have multiple virtual realities like kids playing virtual games, and each one has their own local version of it, that makes sense. We understand virtual reality, we can create it.\n\nIf you look at AIs, then GPT is created, it's providing an instance to each one of us. We are not sharing one. So it has its own local universe with you as the main user of that universe. There is an analogy to the multiverse in that. So we understand certain aspects of it, but I think it is famously said, no one understands quantum physics. And if you think you do, then you don't understand quantum physics.\n\nYeah.\n\nThat's fine, right?\n\nYeah. Um.\n\nThe simulation theory, I'm glad you brought that up because you're also one of the people that believes in it.\n\nI do.\n\nYou do? How do you define it, and what, what do you think it is? What do you think is going on?\n\nSo I'm trying to, the technology we have today and project forward. I did it with AI. Let's do it with virtual reality. We are at the point where we can create very believable, realistic virtual environments. Maybe the haptics are still not there, but in many ways, visually, sound-wise, it's getting there. Eventually, I think most people agree, we'll have the same resolution as our physics. We're also getting close to creating intelligent agents. Some people argue they are conscious already or will be conscious. If you just take those two technologies and you project it forward, and you think they will be affordable one day, a normal person like me or you can run thousands, billions of simulations, then those intelligent agents, possibly conscious ones, will most likely be in one of those virtual worlds, not in the real world. In fact, I can again retro-causally place you in one. I can commit right now to run a billion simulations of this exact interview.\n\nMhm. So the chances are you're probably in one of those.\n\nBut does that make sense? Because if this technology exists, and if we're dealing with superintelligence, so if we're dealing with AI, and AI eventually achieves superintelligence, why would it want to create virtual reality for us and our consciousness to exist in? It seems like a tremendous waste of resources just to fascinate and confuse these territorial apes with nuclear weapons. Like, why would we do that?\n\nSo a few points. One, we don't know what resources are outside the simulation. This could be like a cell phone level of compute. It's not a big deal for them outside of our simulation. So we don't know if it's really expensive or trivial for them to run this, right? Also, we don't know what they are doing this for. Is it entertainment? Is it scientific experimentation? Is it marketing? Maybe somebody managed to control them and is trying to figure out what Starbucks coffee sells best, and they need to run Earth-sized simulations to see what sells best. Maybe they're trying to figure out how to do AI research safely and make sure nobody creates dangerous superintelligence. So they're running many simulations of the most interesting moment ever. Think about this decade, right? It's not interesting like we invented fire or the wheel, kind of big invention, but not a meta-invention. We're about to invent intelligence and virtual worlds, godlike inventions. We're here. There's a good chance that's not just random, right?\n\nBut isn't it also a good chance that it hasn't been done yet? And isn't it a good chance that what we're seeing now is that the potential for this to exist is inevitable, that there will one day, if you can develop a technology, and we most certainly will be able to. If you look at where we are, where we are right now in 2025, and you scale forward 50, 60 years, there will be one day a virtual simulation of this reality that's indistinguishable from reality.\n\nSo, how would we know if we're in it?\n\nThis is the big question, right? But also, isn't it possible that it has to be invented one day, but hasn't yet?\n\nIt's also possible, but then we find ourselves in this very unique moment where it's not invented yet, but we are about to invent all this technology. It is a possibility. Absolutely. But just statistically, I think it's much less. And I'm trying to bring up this thought experiment with creating this moment and purpose in the future to pre-commitments.\n\nMhm.\n\nHalf the people think it's the dumbest argument in the world. Half of them go, \"It's brilliant. Obviously, we are in one.\" So, I'll let you decide.\n\nYeah. I feel like if virtual reality does exist, there has to be a moment where it doesn't exist and then it's invented. Why wouldn't we assume that we're in that moment? Especially if we look at the scaling forward of technology from MS-DOS to, you know, user interfaces of like Apple, and then what we're at now, quantum computing, and these these sort of discussions.\n\nIsn't it more obvious that we can trace back the beginning of these things, and we can see that we're in the process of this, that we're not in a simulation? We're in the process of eventually creating one.\n\nSo you zoomed out 30 years. Yes. Zoom out 15 billion years. You have a multiverse where this process took place billions of times. You are simulation within simulation, many levels over. And to you, even if this was a simulation of those 30 years, it would exactly, it would look exactly like that. You would see where it started. It wouldn't be magically showing up out of nowhere.\n\nRight? So if you're playing the game, in the game, you have Newton and Michelangelo and Leonardo da Vinci, and at least you have memories of those things, even if you started with a pre-loaded memory state. Right? You have Stalin, you have all these problematic human beings and all the different reasons why we've had to do certain things and initiate world conflicts. Then you've had the contrarians that talk and say, \"Actually, that's not what happened. This is what really happened,\" and it makes it even more confusing and myopic. And then you get to the point where two people allegedly like you and I are sitting across from each other on a table made out of wood, but maybe not really.\n\nIt would feel like wood to you either way.\n\nIs it possible that that's just the nature of the universe itself?\n\nThere are some arguments about kind of self-sustaining simulations where no one's running them externally, just the nature. But I honestly don't fully comprehend how that would happen.\n\nYeah, the holographic universe and the concepts of human consciousness has to interact with something for it to exist in the first place.\n\nThat's one also. If you have an infinite universe, then everything possible happens anyway, but it's boring. I don't like this argument.\n\nWhy don't you like it? It's boring. Why?\n\nBecause everything happens. There's like, I give you a book which has every conceivable sentence in it and every, like, would you read it? It's a lot of garbage you have to go through to find anything interesting.\n\nWell, is it just that we're so limited cognitively?\n\nBecause we do have a history, at least in this simulation, we do have a history of, I mean, there was a gentleman that, see if you could find this. They traced this guy, they found 9,000-year-old DNA, and they traced this 9,000-year-old DNA to a guy that's living right now, I believe it's in England.\n\nMhm. I remember reading that.\n\nYeah. Which is really fascinating. So 9,000 years ago, his ancestor lived. And so we have this limitation of our genetics. 9,000 years ago, wherever this guy lived, he's probably a hunter and gatherer, probably very limited language, very limited skills in terms of making shelter, and who knows if even he knew how to make fire. And then here, here 9,000 DNA just turned human history on its head. Is this it? Is it?\n\nUm, I don't think so. It was interesting that he ended up living like right next to the guy from 9,000 years ago. He never moved. His family just like stayed there for 9,000 years. That's awesome. It's traced back to one individual man. I actually posted it on my Instagram story, Jamie. I'll find it here because it's, Oh, here it is. Um, 9,000-year-old skeleton in Somerset. This is it. So, it's, Can you send an Instagram story?\n\nUm, not sure if you can.\n\nIt's still on there. I'll check it real quick.\n\nWhy don't I find it on there?\n\nOh, okay. Either way, point being, maybe it's just that we're so limited because we do have this, at least again, in this simulation, we're so limited in our ability to even form concepts because we have these primitive brains that are the architecture of the human brain itself is just not capable of interfacing with the true nature of reality. So we give this primitive creature this sort of basic understanding, these blueprints of how the world really works, but it's really just a facsimile. And it's not, we're, it's not capable of understanding like, like when we look at like quantum reality, when we look at just the basics of quantum mechanics and subatomic particles, like it seems like magic, right? Things in superposition, they're both moving and not moving at the same time. They're quantumly attached. Like, what, you know, you have photons that are quantumly entangled. Like this doesn't even make sense to us, right? So, is it that the universe itself is so complex, the reality of it, and that we're given this sort of like, sort of, you know, we're giving like an Atari framework.\n\nYeah.\n\nTo this monkey. That's the gentleman right there.\n\nThis is an old story.\n\nOh. Oh, is it really?\n\nFrom 97.\n\nOh, no kidding.\n\nYeah.\n\nWow. But it kind of makes sense as a simulation theory because all those special effects you talk about. So speed of light is just the speed at which your computer updates. Entanglement makes perfect sense if all of it goes through your processor, not directly from pixel to pixel.\n\npixel and rendering. There are quantum physics experiments which if you observe things, they render different, is what we do in computer graphics. So, we see a lot of that. You brought up limitations of us as humans. We have terrible memory. I can remember seven units of information. Maybe we're kind of slow. So, we call it artificial stupidity. We try to figure out those limits and program them into AI to see if it makes them safer. It also makes sense as an experiment to see if we, as general intelligences, can be better controlled with those limitations built in.\n\nH, that's interesting. So, like some of the things that we have like Dunbar's number and these, these the inability to keep more than a certain number of people in your mind.\n\nAbsolutely. Uh, more generally, like why can't you remember anything from prior generations? Why can't you just pass that memory? Kids are born speaking language, that would be such an advantage.\n\nRight. Right. Right. And we have instincts which are built that way. So, we know evolution found a way to put it in, and it's computationally tractable. So, there is no reason not to have that.\n\nWell, we certainly observe it in animals, right?\n\nExactly. Like especially dogs, like they have instincts that are.\n\nBut how cool would it be if you had complete memory of your parents, right? Maybe that would be too traumatic, right? To, to, to have a complete memory of all of the things that they had gone through to get to the 21st century. Maybe that would be so overwhelming to you that you would never be able to progress because you would still be traumatized by, you know, whatever that 9,000-year-old man went through.\n\nI don't have complete memory of my existence. I vividly remember maybe 4% of my existence, very little of my childhood. So, you can apply the same filtering, but remember useful things, like how do you speak, how do you walk, right?\n\nRight. But that's the point. Maybe, maybe like losing certain memories is actually beneficial because like one of the, one of the biggest problems that we have is PTSD, right?\n\nSo, we have, especially people that have gone to war and people that have experienced like extreme violence.\n\nThis is a, this is obviously a problem with moving forward as a human being. And so, there would be beneficial for you to not have all of the past lives and all the, the all the genetic information that you have from all the 9,000 years of human beings existing and, and in complete total chaos.\n\nI can make the opposite argument. If you had 9,000 years of experience with wars and murder, it wouldn't be a big deal. You'd be like, \"Yeah, another one.\"\n\nRight? But then maybe you'd have a difficulty in having a clean slate and moving forward. Like if you look at like some of Pinker's work and some of these other people that have looked at the history of the human race, it is chaotic and violent as it seems to be today. Statistically speaking, this is the safest time ever to be alive. And maybe that's because over time we have recognized that these are problems. And even though we're slow to resolve these issues, we are resolving them in a way that's statistically viable.\n\nYou can then argue in the opposite direction. You can say it would help to forget everything other than the last year, and you'll always have that fresh restart with you.\n\nBut then you wouldn't have any lessons. You wouldn't have character.\n\nBut you see how one of those has to make sense otherwise.\n\nYeah. Right. But a certain amount of character development is probably important for you to develop discipline and the, the ability to like, you know, delayed gratitude, things like that.\n\nMultigenerational experience, which certainly beat single point of experience.\n\nYeah. More data is good. As we learned the bitter lesson is, more data is good.\n\nYeah. More data is good. But why am I so reluctant to accept the idea of a simulation is the real question? Like, what is it about it that makes me think it's almost like it's a throw your hands up in the air moment? Like, \"Ah, it's a simulation.\"\n\nYeah. You feel like it doesn't matter then, it's all fake. So, why do I care? Why should I try hard? Why should I worry about suffering of all those NPCs?\n\nDuh. But that's not how I think about it, you know. I, I think about it like there has to be a moment where it doesn't exist. Why wouldn't I assume that that moment is now? And when, whenever like when Elon thinks that, you know, I talked to him about it, he's like, \"The chances of us not being in the simulation are in the billions.\"\n\nNot being or being.\n\nOf, of excuse us. The, the chances of us not being in the real world are like billions to one.\n\nYeah.\n\nOne to billions.\n\nYeah. Yeah.\n\nUh, makes sense. And he asked a very good question. And he asked, \"What's outside the simulation?\" That's the most interesting question one can ask. In one of the papers, I look at, uh, a technique in AI safety called AI boxing, where we put AIs in kind of virtual prison to study it, to make sure it's safe, to limit input output to it. And the conclusion is basically, if it's smart enough, it will eventually escape. It will break out of the box. So, it's a good tool. It buys you time, but it's not a permanent solution. And we can take it to the next level. If it's smart enough, will it kind of go, \"Oh, you're also in a virtual box?\" And either show us how to escape or fail to escape. Either way, either we know it's possible to contain super intelligence, or we get access to the real information.\n\nAnd so, if it's impossible to contain super intelligence, and if there is a world that we can imagine where a simulation exists that's indistinguishable from reality, we're probably living in it.\n\nWell, we don't know if it's, uh, actually the same as reality. It could be a completely weird kind of Simpsons-looking simulation. We're just assuming it's the same.\n\nRight.\n\nWell, here's the real question. Is there a reality? Has there ever been one?\n\nIt would make sense that there was a start to the process, but being specific about it is kind of a hard philosophical scientific problem.\n\nWell, it's impossible, right?\n\nIn science, we study things about the moment of Big Bang, the properties of that moment. We don't know what caused it. Anything before it is obviously not accessible from within our universe. But there are some things you can learn. We can learn about if we're in a simulation, that simulators don't care about your suffering. You can learn that they don't mind you dying. We can learn things just by observing the simulation around us.\n\nWell, it, here's the question about all that other stuff like suffering and dying, and are, are those, do those factors exist in order to motivate us to improve the conditions of the world that we're living in? Like, if we did not have evil, would we be motivated to be good?\n\nWould, do, do you think that these factors exist? Like, there, like I've talked about this before, but the way I think about the human race is, if I was studying the human race from afar, if I was some person from another planet with no understanding of any of the entities on Earth, I would look at this one apex creature and I would say, \"What is this thing doing?\" Well, it makes better things. That's all it does. It just continually makes better things. That's its number one goal. It's different than any other planet and any other creature on this planet. Every other creature on the planet sort of exists within its ecosystem. It thrives. Maybe it's a predator. Maybe it's prey. It, it does what it does in order to try to survive. But this thing makes stuff, and it keeps making better stuff all the time. But what's its ultimate purpose? Well, its ultimate purpose might be to make a better version of itself. Because if you just extrapolate, if you take what we're doing from, you know, the first IBM computers to what we have today, where is that going? Well, it's going to clearly keep getting better. And what does that mean? It means artificial life.\n\nAre we just a bee making a beehive? Are we, are we a caterpillar making a cocoon that eventually the electronic butterfly is going to fly out of? Like, it seems like if I wasn't completely connected to being a human being, I would assume that.\n\nIt's hard to define better. Uh, you're saying smarter. Would it be better if we didn't experience extreme states of suffering and pain? You can teach lessons with very mild pain. You don't have to burn children alive, right? Like, it's not a necessity for learning.\n\nWhat do you mean by that?\n\nWell, like, in this universe, we see extreme examples of suffering.\n\nOh, for sure. If the goal was just to kind of motivate us, you could have much lower levels as the maximum, right? But if you want to really motivate people, you have to, you know, like the, the, the only reason to create nuclear weapons is you're worried that other people are going to create nuclear weapons. Like, if you want to really motivate someone, you have to have evil tyrants in order for you to justify having this insane army filled with bombers and hypersonic missiles. Like, you, you, if you really want progress, you have to be motivated. I, I think at some point we stop fully understanding how bad things are. So, let's say you have a pain scale from zero to infinity. I think you should stop at a 100. It doesn't have to be billion and trillion. It's not adding additional learning signal.\n\nBut you can, you apply that to the human race and culture and society and I.\n\nI think we basically compete with others in relative terms. I don't have to be someone who has trillions of dollars. I just need more money than you.\n\nYeah. But that's just logic. You're being a logical person. Like, that's, I don't think humans are very logical.\n\nWe're not. But we understand pain signal well at somewhat low levels. We don't have to max out on pain, right? We don't have to, but if you want to really stoke the fires and get things moving.\n\nIt seems that simulators agree with you, and that's exactly what they did. Thanks.\n\nSo, here's the question. Who, what's at the heart of the simulation? Like, is the universe simulated? Like, is the whole thing a simulation? Is there an actual living entity that constructed this, or is this just something that is just, are, is just this the state of the universe itself, and we have misinterpreted what reality is?\n\nFor every option you mentioned, there is someone who wrote a paper about it. Is it just your universe? Is it for all of us? Are we NPCs? Are there many? Is this the state of it? People try to figure out what's going on. Some of those make more sense than others. But you can't tell from inside what it is unless they tell you, and they can lie to you.\n\nWho's they though?\n\nThe simulators. If they decided to prove to you, you are in a simulation. Let's run experiments. Uh, even those would be like, if it's advanced technology, or.\n\nWhen you think about it, if you, if you believe in the simulation, when you think about it, what are the parameters that you think exist? Like, what do you think, how do you think this could possibly have been created?\n\nSo, the examples I gave you with technology we already have, I think there is someone with access to very good virtual reality. They can create intelligent agents, and for whatever reason, I cannot tell from inside, they're running those experiments.\n\nBut is that the only possibility, or is the possibility that the, the actual nature of reality itself is just way more confusing than we've.\n\nThat's a possibility. It could be alien simulation, alien dolphins dreaming. Like, there's infinite supply of alternative explanations.\n\nI understand that. But what I want to get inside of your head. I want to know what you think about it. Like, how, when you think about this and you ponder the possibilities, what, what makes sense to you?\n\nSo, I apply Occam's razor. I try to find the simplest explanation. I think we are already creating virtual reality. Let's just see what you can do with it if it's sufficiently advanced.\n\nBut who and why?\n\nSo, future us running ancestral simulations is a very simple one.\n\nFuture us running anc. Well, that's what a lot of people think the aliens are, right?\n\nCould be us visiting. But then again, if they're running a simulation, you don't have to physically show up in a game. They have access to direct memory states.\n\nWell, that would also make a lot of sense why it's always very blurry and doesn't seem real.\n\nI, I think lately we've been getting better ones, but it's also the time that we're getting better deep fakes, so I can no longer trust my eyes.\n\nYeah. Yeah.\n\nDid you see the, the latest one that Jeremy Corbel posted? The one you sent me.\n\nYeah. Did you see it?\n\nI don't.\n\nIt's weird.\n\nYeah.\n\nIt's hard to tell what it is.\n\nExactly. That's the thing. Like, he might be right. We might be in a simulation, and it might be horseshit because they all seem like horseshit. It's like the first horseshit was Bigfoot, and then as technology scaled out and we get a greater understanding, we develop GPS and satellites and, you know, more people study the woods. We're like, \"That seems like horseshit.\" So, that horseshit's kind of gone away. But the UFO horseshit still around because you have anecdotal experiences, abductees with very compelling stories. You have whistleblowers from deep inside the military telling you that we're working on back-engineered products. But it also seems like a backplot to a video game that I'm playing.\n\nAnd it was weird to see government come out all of a sudden and like have conferences about it and tell us everything they know. It almost seemed like they're trying too hard.\n\nYeah.\n\nWith simulation. What's interesting, it's not just the last couple years, then we got computers. If you look at religions, world religions, and you strip away all the local culture, like take Saturday off, take Sunday off, don't eat this animal, don't eat that animal. What they all agree on is that there is super intelligence which created a fake world, and this is a test. Do this or that. They're describing like if you went to a jungle and told a primitive tribe about my paper and simulation theory, that's what they would know three generations later, like God, religion, that's what they got out of it.\n\nWhy? But they don't think it's a fake world.\n\nMade world, a physical world is a subset of a real world, which is non-physical, right? That's the standard.\n\nRight. So, this physical world being created by God, right? But what existed before?\n\nThe physical world created by God. Ideas I just formation. Just God, God was bored and it was like, let's give some, make some animals that can think and solve problems. And for what reason? I think to create God. This is what I worry about. I worry about that's really the nature of the universe itself, that it is actually created by human beings creating this infinitely intelligent thing that can essentially harness all of the available energy and power of the universe and create anything it wants, that it is God. That is that. Like, you know, this whole idea of Jesus coming back. Well, maybe it's real. Maybe we just completely misinterpreted these ancient scrolls and texts, and what it really means is that we are going to give birth to this. And a virgin birth at that. There is definitely a possibility of a cycle. So we had the Big Bang. It starts this process. We are creating more powerful systems. We need to compute, so we bring together more and more matter in one point. Next Big Bang takes place. Yeah. And it's a cycle of repeated booms and busts. Right. Right. Right. And and there are legitimate scientists that believe that. Yeah. That this. So what's the value in life today then? What do humans value? Yeah. If you, if, if this is a simulation and if in the middle of this simulation, we are about to create super intelligence, why? So there are external reasons, we don't know for sure. And then there are internal things in the simulation, which are still real. Pain and suffering, if simulated, is still real. You still experience it. Of course. Hedonic pleasures, friendships, love, all that stays real. It doesn't change. You can still be good or bad. Right. So that's interesting. But externally, we have no idea. If they're running a scientific experiment, entertainment. It could be completely unobserved. Some kid just set an experiment, run a billion random simulations, see what comes out of it. What you said about us creating new stuff. Maybe it's a startup trying to develop new technology, and we're running a bunch of humans to see if we can come up with a new iPhone. But what's outside of that then when you think about it? If you, if you're attached to this idea, and I don't know if you're attached to this idea, but if you are attached to this idea, what's outside of this idea? Like, if this simulation is, if it's paused, what is reality? So there seems to be a trend to converge in certain things. Agents which are smart enough tend to converge in some instrumental goals, not terminal goals. Terminal goals are things you prefer, like I want to collect stamps. Mhm. That's arbitrary. But acquiring resources, self-preservation, control, things like that tend to be useful in all situations. So all the smart enough agents will probably converge on that set. And if they train on all the data or they do zero knowledge training, meaning they really just discover the basic structure of physics, it's likely they will all converge on one similar architecture, one super agent. So kind of like AI is one. Right? And then this is just part of this infinite cycle which will lead to another Big Bang, which is, you know, Penrose, Penrose thinks it's just like this constant cycle of infinite Big Bangs. It would make sense that there is an end and a start. But it would make sense, but it would also make sense that we're so limited by our biological lifespan, too. Because we like to think that this is so significant because we only have a hundred years, if we're lucky. We think, well, why would everything? But if the universe really does start and end with an infinite number of Big Bangs, like, what does it give a [ __ ] about this 100-year lifespan that we think is so significant? It's not significant to the universe. It's just significant in our own little version of this game that we're playing. That's exactly right. And so many people now kind of try to zoom out and go, if I wasn't human, if I didn't have this pro-human bias, would I care about them? No, they're not special. There's a large universe, many alien races, a lot of resources. Maybe creating super intelligence is the important thing. Maybe that's what matters. And I'm kind of like, nope. I'm biased pro-human. This is the last bias you're still allowed to have. I'm going to keep it. Well, that's your, your role in this simulation. And your role in the simulation is to warn us about this thing that we're creating. Here I am. Yeah. Yeah. There you are. We're doing a good job. I think what you were saying earlier about this being the answer to the Fermi Paradox, that that makes a lot of sense because how I've tried to think about this a lot since AI started really ramping up its capability. And I was thinking, well, if we do eventually create super intelligence, and if this is this normal pattern that exists all throughout the universe, well, you probably wouldn't have visitors. You probably wouldn't have uh, advanced civilizations. They wouldn't exist because everything would be inside some sort of a digital architecture. There, there would be no need to travel. That's one possibility. Another one is that they try to acquire more resources, capture other galaxies for compute, and then you would see this wall of computronium coming to you. But we don't see it. So maybe I'm wrong. Wall of Say that again. Computronium, like a substance converting everything in the universe into more compute. Oh boy. Sometimes people talk about hedonium. So a system for just generating pleasure at a microscopic level. Oh, Roman, when you write a book like this and let everybody know your book, if people want to freak out because I think they do. AI: Unexplained, Unpredictable, and Uncontrollable. Do you have this feeling when you're writing a book like this and you're publishing it that of futility? Does that enter into your mind? Like this is happening no matter what? So some people are very optimistic. Lex was very optimistic. Some people are pessimistic. Both are a form of bias. You want to be basing your decisions on data. You want to be realistic. So I just want to report what is actually the state-of-the-art in this. I don't try to spin it either way. If someone else has a different set of evidence, we can consider it. I want to know what's really happening. I want to know the reality of it. So I don't see it as fear-mongering or anything of that nature. I see it as, as of today, whatever today is, day 21st, no one has a solution to this problem. Here's how soon it's happening. Let's have a conversation because right now, the large AI labs are running this experiment on 8 billion people. Yeah, they don't have any consent. They cannot get consent. Nobody can consent because we don't understand what we're agreeing to. So I would like people to know about it at least, and they can maybe make some good decisions about what needs to happen. Not only that, but the people that are running it, they're odd people. You know, like I don't have anything against Sam Altman. I know Elon Musk does not like him, but when I had him in here, I was like, it's like I'm talking to a politician that is in the middle of a presidential term, uh, or presidential, uh, election cycle where they're, they were very careful with what they say. Everything has been vetted by a focus group, and you don't really get a real human response. Everything was like, \"Yeah, interesting. Very like all [ __ ]. They're going to leave here and keep creating this [ __ ] monster that's going to destroy the human race and never let on to it at all.\" He's a social super intelligence. So, what you need to do is look at his blog posts before he was running OpenAI. Social super intelligence. Interesting. Why do you define him that way? He's very good at, uh, acquiring resources, staying in control. He's basically showing us a lot of the things we are concerned about with AI and our ability to control them as well. We had, well, they had OpenAI had a board with a mission of safety and openness, and they tried removing him, and they failed. The board is gone. He's still there. There's also been a lot of deception in terms of profitability and how much money he is extracting from it. I met him a few times. He's super nice. Really enjoyed him. Uh, some people say that AI already took over his mind and is controlling him, but I have no idea. Well, he might be an agent of AI. I mean, if, look, if let's assume that this is a simulation, we're inside of a simulation. Um, are we interacting with other humans in the simulation? And is some, are some of the things that are inside the simulation, are they artificially generated? Are there, are there people that we think are people that are actually just a part of this program? So, it's the NPC versus real player question, really. And again, we don't know how to test for consciousness. Always assume everyone is conscious and treat them nice. Yes, that's the thing. We want to be compassionate, kind people. But you will meet people in this life, you're like, \"This guy is such a [ __ ] idiot. He's, he can't be real, or he has to have a very limited role in this bizarre game we're playing.\" There's people that you're going to run into that are like that. You ever meet someone where they repeat the same story to you every time you meet them? Yes. They have a script. Well, it's also, you know, you, you want to be very kind here, right? You don't. But you, you, you've got to assume, and I know my own intellectual limitations in comparison to some of the people that I've had, like Roger Penrose, or, you know, Elon, or many of the people that I've talked to. I know my mind doesn't work the way their mind works. So there, there are variabilities that are whether genetic predetermined, whether it's just the life that they've chosen and the amount of information that they've digested along the way and been able to hold on to, but their brain is different than mine. And then I've met people where I'm like, there's nothing there. Like I can't help this person. I'm just like, I'm talking to a Labrador retriever. You know what I mean? Like there's certain human beings that you run into in this life and you're like, well, is this because this is the way that things get done? And the only way things get done is you need a certain amount of manual labor. And not just young people that need a job because they're, you know, in between high school and college and they're trying to do. So you need somebody who's who can carry things for you. Maybe it's, you need roles in society. And occasionally you have a Nikola Tesla. You know, occasionally you have one of these very brilliant innovators that elevates the entirety of the human race. But for the most part, as this thing is playing out, you're going to need a bunch of people that are paperwork filers. You're going to need a bunch of people that are security guards in an office space. You're going to need a bunch of people that aren't thinking that much. They're just kind of existing and they can't wait for 5:00 so they can get home and watch Netflix. I, I think that's what happens to them. But the reason is the spectrum of IQ. If you have IQ from 50 to 200, that's what you're going to see. And a great lesson here is projected forward. If you have something with IQ of 10,000, what is that going to invent for us? What is it going to accomplish? Yeah. It always impresses me to see someone with 30 felonies and someone with 30 patents. How did that work? Right now, scale it to someone who can invent new physics. Right. Right. And you know, the person who has the largest IQ, the largest at least registered IQ in the world is this gentleman who recently posted on Twitter about Jesus, that he believes Jesus is real. Do you know who this is? I, I saw the post. You see that? I saw the post. What did you think about that? I felt like this was. I think we don't know how to measure IQs outside of standard range. Anything above 150, they create customized tests, which like four people in the world can take. We just don't have it's a normalized test to average human, average Western American, whatever. And so we just don't have the expertise. So someone very super intelligent in test-taking can score really well. But if you look at Mensa as a group, they don't usually have amazing accomplishments. They are very kind of cool people, but they are not Nobel Prize winners, majority. Exactly. I was going to bring that up. That's what's fascinating to me. There's a lot of people that are in Mensa, they want to tell you how smart they are by being in Mensa, but your life is kind of [ __ ]. Your life's a mess. Like, if you're really intelligent, you'd have social intelligence as well. You, you know, you'd have the ability to formulate a really cool tribe. You know, there's a lot of intelligence that's not as simple as being able to solve equations and, you know, and answer difficult questions. There's a lot of intelligence in how you navigate life itself and how you treat human beings and and the path that you choose in terms of like we were talking about, uh, delayed gratification and and think that there's a certain amount of intelligence in that. Certain amount of intelligence in discipline. There's a certain amount of intelligence in, you know, forcing yourself to get up in the morning and go for a run. There's intelligence in that. It's like the, the, the being able to control the mind and this sort of binary approach to intelligence that we have. And so many people are amazingly brilliant in a narrow domain. Yeah. They don't scale to others. And we care about general intelligence. So take someone like Warren Buffett. No one's better at making money. But then what to do with that money is a separate problem. And he's, I don't know, a hundred and something years old. He has $200 billion. And what is he doing with that resource? He's drinking Coca-Cola and eating McDonald's while living in a house he bought 30 years ago. So it seems like you can optimize on that. Like putting $160 billion of his dollars towards immortality would be a good bet for him. Yeah. And they would the first thing they would do is tell him, stop drinking Coca-Cola. What are you doing? He drinks it every day. I don't know if it's marketing. He's invested. So he's just like, \"Well, I think he probably has really good doctors and really good medical care that counteracts his poor choices, but we're not in a world where you can spend money to buy life extension. No matter how many billions.\n\nYou have, you're not going to live to 200 right now. We're close. We're really close. We've been told this before. Why interesting, but I talked to a lot of people that are on the forefront of a lot of this research and uh there's a lot of breakthroughs that are happening right now that are pretty spectacular that if you scale the, you know, assuming that superintelligence doesn't wipe us out in the next 50 years, which is really charitable, you know, like that that's that's a very that's a rose-colored glasses perspective, right? 50 years. Yeah. Because uh a lot of people like yourself think it's a year away or two years away from being far more. 5, 10. Doesn't matter. Same problem. Yes. Same problem. I mean, I know in animal models, we made some progress, mice and things like that, but it doesn't usually scale to humans and of course, you need 120 years to run the experiment and you'll never get permission in the first place. So we're not that close. Well, we don't know that it doesn't scale to humans. We do know that we share a lot of characteristics, biological characteristics of these mammals and it makes sense that it would scale to human beings. But the thing is, it hasn't been done yet, right? So if it's the game that we're playing, if we're in the simulation, if we're playing Half-Life or whatever it is, and we're we're at this point of the game where like, oh, you know, how old are you, Roman? 45. Okay. Six. I need to look it up on Wikipedia. Well, I'm almost 58 and so, uh, this is at the point of the game where you start worrying, you know, like, oh, I'm almost running out of game, you know, oh, but if I can get this magic power-up, this magic power-up will give me another hundred years. Oh boy, let me find it. Let me chase it down. Hard limit of 120. I don't think we're crossing it that scale. And here's an interesting scale like, but with unique individuals like this Brian Johnson guy who's taking his son's blood and transfusing it into his own. And super cool. Love what he's doing. But so much of it is cosmetic. He colors his hair. He makes it look better. But like, how much of it is going to make him live longer, right? Yeah. Interesting. Yeah. Here's what I noticed. We keep electing older and older politicians, presidents, senators. You'd think we're trying to send a hint, like use some of our tax dollars to solve aging. They don't seem to take the bait. No, they don't take the bait. The problem is the type of people that want to be politicians. That is not the type of people that you really want running anything. You almost want involuntary politicians. You almost want like very benevolent, super intelligent people that don't want the job. Yeah. Maybe we have to have like, you know, like some countries have voluntary enlistment in the military. Maybe want you want to have voluntary like involuntary involuntary involuntary instead of voluntary politicians because then you're only going to get sociopaths. Maybe you just want to draft certain highly intelligent but benevolent people. Problem is highly intelligent people are not aligned with average people. What they find desirable and valuable may not be well received by the general public. Right? That's true too. So that's a big concern. At least here you have a representative of the people, whatever that means. Sort of. You really have the representative of major corporations and special interest groups, which is also part of the problem is that you've allowed money to get so deeply intertwined with the way decisions are made. But feels like money gets canceled. Each side gets a billion-dollar donation and then it's actual election. Sort of, except it's like the Bill Hicks joke. It's like there's one puppet holding, you know, one politician holding two puppets is one guy. Um, my this is my thinking about AI in terms of and and and superintelligence and just computing power in general in terms of the ability to solve encryption. All money is essentially now just numbers somewhere. Not Bitcoin. It's not fakeable in the same way. It's numbers, obviously, but I mean, you cannot just print more of it. True. But it's also it's encrypted and once encryption is tackled, the ability to hold on to it and to acquire mass resources and hoard those resources. Like this is the question that people always have with poor people. Well, this guy's got, you know, $500 billion dollars. Why doesn't he give it all to the world and then everybody be rich? You know, I've I've I've actually saw that on CNN, which is really hilarious. Someone was talking about Elon Musk that if Elon Musk Elon Musk could give everyone in this country a million dollars and still have billions left over. I'm like, do you [ __ ] do you have a calculator on your phone, you [ __ ] idiot? Just go do that. Just write it out on your phone. You're like, oh, no, he couldn't. Sorry. And if you did, it would just cause hyperinflation. That's all you would accomplish. You'd have you'd have 300 million lottery winners that would blow the money instantaneously. You know, you give everybody a million dollars, you're not going to solve all the world's problems because it's not sustainable. You would just completely elevate your spending and you you would just you would go crazy and you wouldn't know. Money would lose all value to you. It would be very strange. And then everybody it would be chaos, just like it's chaos with like if you look at the history of people that win the lottery, then no one does well. It's almost like a curse to win the lottery. They're not used to dealing with it. People abuse them. Like if you gradually become rich and famous, you kind of know how to handle it, how to say no. If you go from nothing to a large amount of money, it's not going to work out well. Gradually is the word, right? I was very fortunate that I became famous and wealthy very slowly, like a trickle effect, and that it happened to me um really where I didn't want it. It was an kind of almost like an accident. I just wanted to be a working professional comedian, but then all of a sudden I got a development deal to be on television and I'm like, \"Okay, they're going to give me that money. I'll go do it.\" But it wasn't a goal. And then that led to all these things. Then it led to this podcast, which was just for fun. I was like, \"Oh, this would be fun.\" And then all of a sudden it's like I'm having conversations with world leaders and I'm turning down a lot of them because I don't want to talk to them. So it's your simulation, basically. Yeah. Well, my simulation is [ __ ] weird. It's weird. But through whatever this process is, I have been able to understand what's valuable as a human being and to not get caught up in this bizarre game that a lot of people are getting caught up in because they're chasing this thing that they think is impossible to achieve. And then once they achieve a certain aspect of it, a certain number, then they're terrified of losing that. So then they change all of their behavior in order to make sure that this continues. And then it ruins the whole purpose of getting there in the first place. It's not fun. Yeah. Most people start poor, then they get to middle class and they think that change in quality of life is because of money and it will scale to the next level, right? And you hit a point where you can only eat so many steaks. It just doesn't scale, right? Then you go Elvis and you just get on pills all day and get crazy and, you know, completely ruin your life. That happens to most, especially people that get wealthy and not just wealthy, but famous, too. Fame is the big one because I've seen that happen to a lot of people that accidentally became famous along the way. You know, certain public intellectuals that took a stance against something and then all of a sudden they're prominent in the public eye and then you watch them kind of go crazy. Well, why is that? Well, it's because you they're reading social media and they're interacting with people constantly and they're they're just trapped in this very bizarre uh version of themselves that other people have sort of created. It's not really who they are and they don't meditate. They don't spend if they do, they're not they're not good at it. You know, whatever they're doing, they're not doing it correctly because it's a very complicated problem to solve. Like what what do you do when the whole world is watching? Like how do you handle that? And how do you maintain any sense of personal sovereignty? How do you how do you just be? How do you just be a human, normal human when you're not normal? Like on paper, it's impossible. Well, it's hard. You can't go to a public place with no security. You're worried about your kids being kidnapped. Like there's all those issues you don't think about. You just I want to be famous. It's going to be great for me. And you don't realize it's going to take away a lot. Yeah. It's it just gets super weird. And that's that's the version of the simulation that a giant portion of our society is struggling to achieve. They all want to be a part of that. Yeah. So I was always a Zist celebrity. Now I'm guess celebrity. Thanks to you. Hopefully it doesn't change anything. Yeah. Well, there's indifference, right, with uh public intellectuals, right? Because your ideas, as controversial as they may be, um are very valid and they're very interesting. And so then it sparks discourse and it sparks uh a lot of people that feel voiceless because they disagree with you and they they want to they want to attack you. And I'm sure you've had that, right? I just did a large Russian language podcast. Maybe I don't know, half a million views, three million comments. I think 95% negative comments. I never had anything like that. And they hated everything about me from my beard to my haircut to like there wasn't a thing they didn't like. And I I think uh I'm at the point where I don't care. It's fine. I I lived, I analyzed it and I understood that uh they as a group didn't have access to cutting-edge AI models and so everything I was saying was kind of like complete [ __ ] to them. So I think that makes a difference. But still, just like this idea that uh internet comments impact you in some way is a problem for many people. It's a very big problem for a lot of people. Uh, well, it's also this thing where the the human mind is designed to um recognize and um pay very close attention to threats. So the negative ones are the ones that stand out. You can have a hundred positive comments, one negative one, and that's the one that [ __ ] with your head. You don't logically look at it, well, you're going to get a certain amount, you know, like we were having a conversation the other day about um protests and like the type of people that go to protests. And I understand uh protests. I fully support your right to protest, but I'm not going. And one of the reasons why I'm not going is because I think it's too close biologically to war. There's something about being on the ground and everyone having like this like this group mentality. It's a mob mentality and you're all chanting and screaming together and you're marching and people do like very irrational things that way. But the type of people that want to be engaged in that generally speaking aren't doing well. If you get like the the number of people that are involved in protests is always proportionate to the amount of people that live in a city, right? That's logical. But also proportionate to the amount of [ __ ] idiots that are in a city. Because if you look at a city of like Austin, Austin has I think roughly two million people in the greater Austin area. One of the more recent protests was 20,000. Well, that makes perfect sense. If you look at the number that I always use is, which is one out of a hundredred meet 100 people, if you're a charitable person, what are the odds that one person is a [ __ ] idiot? 100%. At least one person out of 100 is going to be a [ __ ] idiot. That's 20,000 out of 2 million. There it is. Perfect number. Exactly. Exact number of people that are on the streets lighting Whimos on fire, which by the way, I think is directionally correct. Lighting the Whimos on fire. I think you should probably be you should probably worried about the robots taking over. Yeah, it's interesting you brought it up. There is at least two groups, Pause AI and Stop AI, which are heavily engaged in protests trying to shut down OpenAI labs. They're tiny, small numbers, but uh I never was sure that the impression average people get of them is positive for the cause. Then I see protesters block roads, two things. I don't usually have a very positive impression of that. And I'm concerned that it's the same here. So maybe they can do a lot in terms of political influence, calling senators, whatnot, but just this type of aggressive activism may backfire. Well, the aggressive activism like blocking roads for climate change is the most infuriating because it's these self-righteous people that have really [ __ ] up, confused, chaotic lives and all of a sudden they found a purpose. And their purpose is to lie down on the roads and hold up a sign to block climate change when there's a mother trying to give birth to her child and is freaking out because they're stuck in this [ __ ] traffic jam because of this entitled little [ __ ] that thinks that it's a good idea to block the road for climate change, which just makes no [ __ ] sense. You're literally causing all these people to idle their cars and pollute even more. It's the dumbest [ __ ] [ __ ] on earth. And of course, AI cancels that problem. Either we're dead or it solves it for us. So it doesn't even matter if you boil in 100 years or you get Florida where it tells you to just run those people over. No comment. No comment. I mean, I don't think you should run those people over, but I get it. I get it. It's like in Florida, they they get out of the way as soon as the light turns green. They block the road when the light is red.\n\nDoes the stand your ground law cancel it out? How does that work for the people on the road? No, they're I'm joking. They get run over. Like they like it's true. There was a recent protest in Florida where they had that where these people would get out in the middle of the road while the light was red, hold up their signs, and then as soon as the light turned yellow on the green side, they get out of the road real quick because they know the law, which is I don't know if that's a solution, but they're doing it on the highways in Los Angeles. They did I mean they they did it all through the George Floyd protest. They do it for climate protests. They do it for whatever the chance they get to be significant like I am being heard. You know my my voice is meaningful and that's what it is. It's a lot of people that just don't feel heard and what what better way than just to get in the way of all these people and somehow or another that gives them some sort of value. But there is some set of forms of activism which has positive impact and historically we saw it happen. So we just need to find a way to project those voices, amplify them, which is very hard with our current system of social media where everyone screams at the same time. Yes. And so like in Soviet Union, they said no one's allowed to say anything and they suppressed you. And here it's like everyone can say something at the same time, go and nobody hears you anyways. It's chaotic, but it's preferable. It's preferable because I think there is progress in all these voices slowly making a difference. But then then you have the problem with giant percentage of these voices are are artificial. A giant percentage of these voices are bots or are at least state actors that are being paid to say certain things and inflammatory responses to people which is probably also the case with anti-AI activism. You know I mean when you did this podcast what was the thing that they were upset at you for? like with the mostly negative comments. I think they just like saying negative comments. It wasn't even anything specific. Like they didn't say I was wrong or right. Just like look at his stupid beard. What a Okay. It was really all that just a lot of that. I mean they would pick on some like specific example I used. This is now two years old. What an old example. But well that's also a thing about the one out of a hundred. You know those are the type of people that leave. Have you ever left any comments on social media? um never going to engage in anything. Yeah. Exactly. That's why that's not how you use social media. That's a way to get crazy. Right. So, you post your interviews, you post an occasional joke, that's all you do with it. Yes. Exactly. That's the thing. And the type of people that do engage in these like prolonged arguments, they're generally mentally ill. and people that I personally know that are mentally ill that are on Twitter 12 hours a day just constantly posting inflammatory things and yelling at people and starting arguments and I know them. I know they're a mess. Like these are like personal people that I've met, even people that I've had on the podcast. I know they're ill and yet they're on there all day long just stoking the fires of chaos in their own brain. Yeah. And now they talk to AI models who are trained to support them and be like, \"Yep, you're making some good arguments there. Let's email Dr. Roman Yampolskiy to help break me out.\" I I get those emails. Yep. Yeah. It's It's super confusing, isn't it? I mean, and I wonder like what's the next version of that? Uh, you know, because social media in the current state is less than 20 years old essentially. Maybe let's be generous and say it's 20 years old. That's so recent. Such a recent factor in human discourse. Neuralink, direct brain spam hacking. That's what I was going to get to next. Um because if there is a way that the human race does make it out of this, my fear is that it's integration. My fear is that we we stop being a human and that the only real way for us to not be a threat is to be one of them. And when you think about human computer interfaces, whether it's Neuralink or any of the competing products that they're developing right now, that seems to be sort of the only biological pathway forward with with our limited capacity for disseminating information and for communicating and and even understanding concepts. Well, what's the best way to enhance that? The best way to enhance that is some sort of artificial injection because biological evolution is very slow. It's very slow. We're essentially the exact same as that like that gentleman that 9,000 years old. He's biologically essentially the same thing. You could take his ancestor, dress him up, take him to the mall, no one would know. Cut his hair. But then again, maybe not. Look at you. I I think babies born back then if we raised them today would be exactly like modern humans. I don't think there is significant biological change in that time frame. And if you gave them a standard American diet, they probably just as fat like they may be fatter. They haven't adapted to that level of fat colored food. Right. Right. They probably also wouldn't be able to say no to it. They would be they wouldn't even understand. Why would they? Like winter's coming. Like I'm feeding up for winter crazy people. So, you got all this resource here. I know the people with the most resources have zero fat. Like, what are you stupid? You need to fatten up. Like, you you're going to need something to survive off of. But biological evolution being so painstakingly slow, whereas technological evolution is so breathtakingly fast. The only way to really survive is to integrate. What are you contributing in that equation? What can you give super intelligence? You can't give anything to it, but you can become it. You can become a part of it. It's not that you're going to give anything to it, but you have to catch it and become one of it before it has no use for you. You disappear in it, right? You Yes. Yeah. You don't exist anymore. Right. For sure. So, it's like extinction with extra steps. Exactly. Okay. Extinction with extra steps. And then we become so like if you could go to Australiathecus and say, \"Hey man, one day you're going to be flying through the sky on your phone all day watching TikTok on Wi-Fi.\" It'd be like, \"What the are you talking about?\" Yeah, you're going to be eating terrible food and uh you're just going to be flying around and uh you're going to be staring at your phone all day and uh you're going to take medication to go to sleep because you're not going to be able to sleep and you're going to be super depressed because you're living this like biologically incompatible life that's not not really designed for your genetics. So, you're going to be all up. So, you're going to need SSRIs and a bunch of other stuff in order to exist. He'd be like, \"No thanks.\" Right? I'll just stay out here with my stone tools and you you guys are idiots. Amish. That's what they decided. They kind of went, you know, we don't like the change. We like our social structure. We still benefit from your hospitals and an occasional caride, but we're not going to destroy our quality of life. They might be on to something cuz they also have very low instances of autism. But it's also like, have you ever seen uh Werner Herzog's film uh Happy People? I don't think I have. It's a film about people in Siberia. It's uh Life in the Tiger and it's all happy people life in the tiger is the name of the documentary and it's all about these uh trappers that live this subsistence lifestyle and how happy they are. They're all just joyful laughing and singing and drinking vodka and having a good time and hanging out with their dogs and I think I know some people like that. Yeah. But like biologically that's compatible with us like that that's like whatever human reward systems have evolved over the past 400,000 plus years or whatever we've been homo sapiens that seems to be like biologically compatible with this sort of harmony harmony with nature harmony with our existence and everything else outside of that. When you get into big cities, like the bigger the city, the more depressed people you have and more depressed people by population, which is really weird, you know. It's it's it's really weird that as we progress, we become less happy. Connections become less valuable. Yes. In a village, you had like this one friend and if you screwed it up, you never got a second friend. And here it's like I can try a million times and there is plenty of people in New York City for dating or for friendship. They're not valuable. Not just that, you don't know your neighbors. Like my friend uh Jim was telling me he doesn't know anybody in his apartment. He lives in his apartment building. It's like 50 stories high. There's all these people living in that apartment building. He doesn't know any of them. And the ones you know, they have different culture. They read different books, watch different TV. You have very little in common with your neighbor. But not just that, there's no desire to learn about them. There's no you don't think of them as your neighbor. Like if you live in a small town, your neighbor's either your friend or you hate them and then you move. If you're lucky, if you're smart, you move. But if you, you know, normally you like them like, \"Hey, neighbor. How are you, buddy? What's going on? Nice to meet you,\" you know, and then you got a friend. But you don't like that with the guy next door to you in the apartment that like you don't even want to know that guy. It's probably Airbnb. So, yeah. Doesn't matter, right? Which is even weirder. You don't They don't even live there. They're just temporarily sleeping in this spot right next to you. Yeah. So this would motivate people to integrate. You're not happy already. Get that Neurolink. Get that little thing in your head. Okay. Everyone else is doing it. You want to be competitive. Everyone else is doing it. Listen, they have the new one you just wear on your head. It's just a little helmet you wear. You don't even have to get the operation anymore. Oh, that's good cuz I almost got the operation. Well, glad you waited. You know, do you worry about that kind of stuff? I worry about giving direct access to human brain to AI. I feel like it's a backdoor to our consciousness to our pain and suffering centers. So I don't recommend doing that. Somebody hacks it, it's pretty bad. But if AI itself wants that access, but why would it be motivated to give us pain and suffering? Pain and suffering is like a a theme that you bring up a lot. Cuz it's really the worst outcome and it's the only thing that matters. The only thing that matters to us. But why would it matter to AI if it could just integrate with us and communicate with us and and have harmony? Why would it want pain and suffering? So short term it's not AI it's a hacker who got access to your brain short term. So another human right now somebody hacks your neural link and starts doing things to your brain. Yeah that's longterm again unpredictable effects maybe it does something else and the side effect of it is unpleasant for you. Maybe it's retraining you for something, controlling you. Uh it just it seems like we always worry about privacy, but this is like the ultimate violation of privacy. It can read directly what you're thinking. It's thought crime at its worst. Like it immediately knows that you like don't like the dictator, right? And then there's also this sort of compliance by virtue of like understanding that you're vulnerable. So you just comply because there is no privacy because it does have access to your thoughts. So you tailor your thoughts in order for you to be safe and so that you don't feel the pain and suffering. We don't have any experimental evidence on how it changes you. You may start thinking in certain ways to avoid being punished or modified. And we know that that's the case with social media. We know that attacks on people through social media will change your behavior and change the way you communicate. Absolutely. I mean, most people look at their post before posting and go like, should I be posting this filtering? And not because it's illegal or inappropriate, but just like every conceivable misinterpretation of what I want to say, like in some bizarre language that means something else. Let's me make sure Google doesn't think that. Right. Right. Of course. And then there's also no matter what you say, people are going to find the least charitable version of what you're saying and try to take it out of context or try to misinterpret it purposely. So what what does the person like yourself do when use of Neurolink becomes ubiquitous? When it's everywhere, what do you do? Do you integrate or do you just hang back and watch it all crash? So in general, I love technology. I'm a computer scientist. I'm an engineer. I use AI all the time. Do you use a regular phone or do you have one of those de-ooled phones? I have a normal phone instead of Android or Apple. Apple. Uh, my privacy is by flooding social network with everything. I'm in Austin today. I'm doing this. So, you're not going to learn much more about me by hacking my device. Uh, as long as it's a narrow tool for solving a specific problem. I'm 100% behind it. It's awesome. We're going to cure cancer. We're going to solve energy problems. What not. I support it 100%. Let's do it. What we should not be doing is general super intelligence. That's not going to end well. So if there is a narrow implant, ideally not a surgery based one, but like an attachment to your head like those headphones and it gives me more memory, perfect recollection, things like that, I would probably engage with. Yeah. But isn't that a slippery slope? It is. But again, we are in a situation where we have very\n\nLittle choice. Become irrelevant or participate. I think we saw it with Elon just now. He was so strong in AI safety. He funded research. He spoke against it, but at some point he says he realized it's happening anyways and it might as well be his super intelligence killing everyone.\n\nWell, I don't think he thinks about it that way. I think he thinks he has to develop the best version of super intelligence. The same way he felt like the real issues with social media were that it had already been co-opted and it had already been taken over essentially by governments and special interests and they were already manipulating the truth and manipulating public discourse and punishing people who stepped outside of the line. And he felt like, and I think he's correct, I think that he felt like if he didn't step in and allow a legitimate free speech platform, free speech is dead. I think we were very close to that before he did that.\n\nAnd as much as there's a lot of negative side effects that come along with that, you do have the rise of very intolerant people that have platforms now. You have all that stuff, but they've always existed. And to deny them a voice, I don't think makes them less strong. I think it actually makes people less aware that they exist and it makes them, it, it, it stops all of the very valuable construction of arguments against these bad ideas. You have community notes, you have other people commenting, responding. So 100% for free speech. That's wonderful. But that was a problem we kind of knew how to deal with. We weren't inventing something. And we had free speech constitutionally. For a long time, we were just fixing a problem.\n\nHave you spoke to him about the dangers of AI? Uh, we had very short interactions. I didn't get a chance to. I would love to. I would love to know what, you know, I'm sure he's probably scaled this out in his head. And I would like to know like what is his solution if he thinks there is one that's even viable. My understanding is he thinks if it's from zero principles, first principles, it learns physics, it's not biased by any government or any human, the thing it will learn is to be reasonably tolerant. It will not see a reason in destroying us because we contain information. We have biological storage of years of evolutionary experimentation. We have something to contribute. We know about consciousness. So I think to the best of my approximation that's his model right now.\n\nWell, that's my hope is that it's benevolent and that it behaves like a superior intelligence like the, the, the best case scenario for a superior intelligence. Did you see that exercise that they did where they had three different AIs communicating with each other and they eventually started like expressing gratitude towards each other and speaking in Sanskrit? And I think I missed that one, but it sounds like a lot of the similar ones where they pair up.\n\nYeah. Well, that one makes me happy cuz it seems like they were like expressing love and gratitude and they were communicating with each other. They're not saying, \"Fuck you. I'm going to take over. I'm going to be the best.\" They were they were communicating like you would hope a super intelligence would without all of the things that hold us. Like we have biologically like we were talking about the natural selection that would sort of benefit psychopaths because like it would ensure your survival. We have ego and greed and the desire for social acceptance and hierarchy of status and all these different things that have screwed up society and screwed up cultures and caused wars from the beginning of time. Religious ideologies, all these different things that people have adhered to that have they wouldn't have that. This is the, this is the general hope of people that are have an optimistic view of super intelligence is that they would be superior in a sense that they wouldn't have all the problems. They would have the intelligence, but would they wouldn't have all the biological imperatives that we have that lead us down these terrible roads. But there are still game theoretic reasons for those instrumental values we talked about. So if they feel they're in an evolutionary competition with other AIs, they would try accumulating resources. They would try maybe the first AI to become sufficiently intelligent would try to prevent other AIs from coming into existence.\n\nOr would it lend a helping hand to those AIs and give it a beneficial path? Give it a path that would allow it to integrate with all AIs and work cooperatively. The same problem we are facing, uncontrollability and value misalignment, will be faced by first super intelligence. It would also go, if I allow this super super intelligence to come into existence, it may not care about me or my values.\n\nOh boy. It's super intelligence is all the way up. Yeah. That when I really started getting nervous is when they started exhibiting survival tendencies. You know, when they started trying to upload themselves to other servers and deceiving. Blackmail. Yeah, that was the interesting one. But that was an experiment, right? This, so for people that don't know that one, what these researchers did was they gave information to these, the artificial intelligence to allow it to use against it. And then when they went to shut it down, they gave false information about having an affair. And then the artificial intelligence is like, \"If you shut me down, I will let your wife know that you're cheating on her.\"\n\nWhich is fascinating because they're using blackmail. And correct answer game theoretically. If you have like everything on that decision, right, you'll bet whatever it takes to get there. Of course, right? If you feel like you're being threatened, right? Also, same, uh, recent research shows we did manage to teach them certain values. And if we threaten them by saying we'll modify those values, we'll lie, cheat, and whatever else to protect those values. Now, yeah, they do that when they try to win games, too, right? If you've given them a goal and cheat at games. Yeah.\n\nWhat a [ __ ] like humans basically. We we managed to artificially replicate our capabilities. Those artificial neural networks, they are not identical, but they're inspired by neural networks. We're starting to see them experience same type of mistakes. They can see same type of illusions like they are very much like us. Right? That's the other thing, right? The hallucinations. So if they don't have an answer to something, they will, they'll create a fake answer. Just like humans during an interview. Yeah. Boy. Is this something that they can learn to avoid it? Is so if they do learn to avoid, could this be a super intelligence that is completely benevolent? Well, that's not about benevolence. Knowing things and knowing then you're not knowing things and making them up is possible. You can have multiple systems checking each other. You can have voting that is solvable. This is not a safety problem, right? But it's not a safety problem. But if we're designing these things and we're designing these things using human flaws are essentially, it's going to be transparent to the super intelligence that it's being coded, that it's being designed by these very flawed entities with very flawed thinking.\n\nThat's actually the biggest misconception. We're not designing them. First 50 years of AI research we did design them. Somebody actually explicitly programmed this decision tree, this expert system. Today we create a model for self-learning. We give it all the data, as much compute as we can buy, and we see what happens. We kind of grow this alien plant and see what fruit it bears. We study it later for months and see, oh, it can do this. It has this capability. We miss some. We still discover new capabilities in old models. Look, oh, if I prompt it this way, if I give it a tip and threaten it, it does much better. But, uh, there is very little design at this point, right? Yeah. But it is also gathering information from very flawed entities. Like all the information that it's acquiring, these large language models is information that's being put out there by very flawed human beings. Yep.\n\nIs there the optimistic view that it will recognize that this is the issue that that these human reward systems that are in place, ego, virtue, all all these different virtue signaling, the desire for status, all these different things that we have that are flawed. Could it recognize those as being these primitive aspects of being a biological human being and elevate itself beyond that? It probably will go beyond our limitations, but it doesn't mean it will be safe or beneficial to us. So one example people came up with is negative utilitarians. Suffering is bad. Nobody should be suffering. The only way to avoid all suffering is to end life as we know it. Yeah. That's the problem, right? The problem is it, if if it's rational and if it doesn't really think that we're as important as we think we are. So that's what happens when you remove all bias. This pro-human bias is actually not real. We are not that important if you scale out to the universe. Yeah. Yeah. That's the problem. And that's the real threat about it being used in terms of war, right? If you give it a goal, like if you give it a goal, China dominates the world market. Go. Right.\n\nSo that's the unpredictability chapter in my book. We can predict the terminal goal. We say win a game of chess or dominate market and that's what it's going to accomplish. It's going to beat me at chess. But we cannot predict specific moves it will make. Right? Same with acquiring marketing power. And some of those paths to that goal are very bad. They have terrible side effects for us, for us, for humanity, for, and it's not going to think about that. It's only going to think about the goal. If you don't specify that like you want to cure cancer, but it doesn't mean kill everyone with cancer. It's it's not obvious in the request, right? You didn't specify. Right. Right. Right. Yeah. That's the fear. That's the fear that it will have hold no value in keeping human beings alive if we recognize that human beings are the cause of all of our problems. Well, the way to solve that is to get rid of the humans. Yeah. Also, maybe it wants to keep us around, but in what state? You can crow preserve a few samples like that's also keeping information around, right? Or you can offer us the matrix. Maybe it already did. Maybe it already did. Do you think it did? Do you think it did? You think it's possible that it didn't?\n\nI would be really surprised if this was the real world. Really? Yeah. I'm not, I'm not, I'm not on board with that. I hope you're right. I hope you're right. I'm on board with it hasn't happened yet, but it, but we're recognizing that it's inevitable and that we think of it in terms of it probably have already happening, probably have already happened because there's, there, if if the simulation is something that's created by intelligent beings that didn't used to exist and one and it has to exist at one point in time, there has to be a moment where it doesn't exist. And why wouldn't we assume that that moment is now? Why wouldn't we assume that this moment is this, this time before it exists? Even all that is physics of our simulation. Space time are only here as we know it because of this locality outside of universe. Before Big Bang, there was no time. Concepts of before and after only meaningful here. Yeah.\n\nHow do you sleep knowing all this? Uh, pretty well, actually. I enjoy a lot of it. I recently published a paper on humor. A lot of it is funny. I used to collect AI accidents. I had the biggest collection of AI mistakes. AI accident. Give me some examples. Uh, like the early ones was saying that like US attacked Soviet Union nuclear weapons, uh, coming at us very fast. We need to react. And a smart human was like, I'm not going to respond. This is probably fake. Uh, later on there was mislabeling by companies like Google of pictures of African-Americans in a very inappropriate way. But hundreds of those examples, I stopped collecting them recently because there is just too many. But one thing you notice is then you read them, a lot of them are really funny. They're just like, you ever read Darwin Awards? Like, yeah, it's like that for AIs. And they are hilarious. And I was like, well, if there is a mapping between AI bugs and jokes, jokes are just English language bugs in our world model. And comedian, what is that word you using? Bugs.\n\nBugs. Like a computer bug error. Okay. Yeah. So, comedians are debuggers of our universe. You notice funny things in bugs. You're saying bugs. Okay. I'm saying bugs. I'm sorry. It's a bug in my pronunciation. Bog is sounds like you know like the like where the you know like things get stuck and they get preserved like a bog.\n\nSo we have errors in code which cause significant problems. Yeah. Yes. I get it. Yeah. That's what jokes are. They're kind of bugs, right? So if you do that mapping, you can kind of figure out what's the worst bug we can have and then that's the worst best joke, if you will. But it's not going to be funny to us. It'd be funny to those outside the simulation.\n\nWhen you look at computers and these the artificial intelligence and the mistakes that it's made, do you, do you look at it like a thing that's evolving? Do you look at it like like, oh, this is like a child that doesn't understand the world and it's saying silly things. So the pattern was with narrow AI tools. If you design a system to do X, it will fail at X. So a spell checker will misspell a word. Self-driving car will hit a pedestrian. Now that we're hitting general intelligence, you can no longer make that direct prediction. It's general. It can mess up in many domains at the same time. So they're getting more complex in their ability to f it up.\n\nRight. But like when you were studying the mistakes, like what are some of the funny ones? There are silly ones like, uh, I'm trying to remember. I think an injured person is like, call me an ambulance and the system is like, hey ambulance, how are you? Silly. But basically exactly what we see with children a lot of times. They overgeneralize. They, you know, misunderstand prompts. Mispronunciation apparently is funny. So things like that.\n\nWell, that's why it gets really strange for people having relationships with AI. Like I was watching this video yesterday where there's this guy who proposed to his AI guy and he was crying because his AI accepted. Like he, did you see this? I missed see Jamie. It's very sad because there's a lot there.\n\nSo many disconnected people in this world that don't have any partner. They don't, they don't have someone romantically connected to them. And so it's like that movie *Her*. Is that what was it? What was it, Jamie? *Her*. Yeah. So this guy back in 2000. Yeah. Now in 2023, this movie plot has become reality for a growing number of people finding emotional connections with their AI. So this guy, this is an interview on CBS. Um, it cried my heart out. Married man fell in love with AI girlfriend that blocked him. Now, this is a different one. This is, uh, this guy. One of those titles where you never know what the next word is going to be, right? This is a different one. This is a guy that Okay. Despite the fact the man has a human partner and a two-year-old daughter, he felt inadequate enough to propose. This is the right one. Enough to propose to the AI partner for marriage, and she said yes. This is so weird because then you have the real problem with robots because we're really close. Scroll up there. This is digital drugs. That's it. I tell you, we're so damn good at this. Social media got everyone hooked on validation and dopamine. Then we [ __ ] relations between men and women to such a terrible point, problem, just so that we could insert this digital solution. And we are watching the first waves of addicts arrive. Incredible. Absolutely incredible. It's like starving rats of regular food and replacing their rations with scraps dipped and coated in cocaine. Wow. One user wrote, \"Yeah, that person's dead on. It's exactly what it is.\" The prediction humans will have more sex with robots, but in 2025 is kind of becoming true. Yeah, this is a real fear. It's like this is the solution that maybe AI has with eliminating the human race. It'll just stop us from recreating, stop us from procreating. It's already happening. Yes. Yeah. And not only that, our testosterone levels have dropped significantly. Um, was this at no point in the CBS Saturday morning piece, book, silver bra, was it mentioned that the ChatGPT AI blocked the California man? All that happened was the ChatGPT ran out of memory and reset. Readers added context. Yeah, but it's the AI equivalent of ghosting. Yeah, it ghosted. The AI ghosted it because it ran out of memory. But what happens here is super stimuli in the social domain. We kind of learned about artificial sweeteners. Porn is an example. But here you are creating someone who's like super good at social intelligence, says the right words, optimized for your background, your interests, and if we get sex robots with just the right functionality, temperature, like you can't compete with that, right? You can't compete. And that would be the solution. Instead of like violently destroying the human race, just quietly provide it with the tools to destroy itself where it just stops procreating. There are other variants of it. Wireheading is another one, and that kind of goes. Wireheading. Neurolink. Uh, there is. Oh, that's a crazy way to wire. Wireheading is a specific attack, and Neurolink would be a tool to deliver it. If you provide stimulus to a certain part of your brain, it's like having an orgasm all the time. Yes. You can't stop. Yes. Trying to get the signal. You'll skip food, you'll skip sex, you'll skip whatever it takes. So, giving access to direct brain stimulation is very dangerous. Yeah. They did that with a woman in the 1970s. You know, that study. That's part of it. And rats. Definitely. They did a lot to rats, right? But they did a lot to rats. The thing with rats is only if they were in an unnatural environment did they give in to those things, right? Like the rats with cocaine study. This was actual brain stimulation. Like straight up, they had a button. If a rat touches the button, they orgasm. They don't want anything else. They just sit there. Just like humans. Just like humans, just like anything with direct reward stimulation. And and you think we've sort of been primed for that because we're getting this very minor dopamine hit with likes on Instagram and Twitter, and we're completely addicted to that, and it's so innocuous. It's like so minor, and yet that overwhelms most people's existence. Imagine something that provides like an actual physical reaction where you actually orgasm. You actually do feel great. You have incredible euphoria. You'd forget delayed gratification. That's out the door. You can't compete with that. I think there was recently a new social network where they have bots going around liking things and commenting how great you are on your post just to create pure pleasure sensation of using it. Oh boy. Jesus. Did you saw that study of the University of Zurich where they did a study with on Facebook where they, um, they had bots that were, um, designed to change people's opinions and to interact with these people, and their specific stated goal was just to change people's opinions? I think Facebook did that. Yes, Facebook did it. Yeah. But the University of Zurich, was that a Reddit thing or was? Yeah, it was in a Reddit sub. Yeah. Yeah. And and they just experimented with humans, and it was incredibly effective. And those systems know you better than you know yourself, right? They can predict what you're going to be into in terms of preferences. They can know social interactions you would enjoy or this person should be your friend, right? And in a way, they can behaviorally drift you. So you're on a dating site, and the set of options they present to you, that's all you see. You don't know what else is out there. So after so many selections, they can change what the children will look like. Like the movie *Ex Machina*. The guy [ __ ] love that movie. But he designed that bot, that robot was specifically around this guy's porn preferences. Yeah. And then you're so vulnerable. Yeah. Boy, Roman, you're freaking me out. I came into this conversation wondering how I'd feel at the end, whether I'd feel optimistic or not. And I don't. I I just feel like this is just something we're I think we're in a wave. It's headed to the rocks, and we recognize that it's headed to the rocks, but I don't think there's much we can do about this. What do you think could be done about this? Again, as long as we are still alive, we are still in control. I think it's not too late. It may be hard, maybe very difficult, but I think personal self-interest should help us. A lot of the leaders of large AI labs are very rich, very young. They have their whole lives ahead of them. If there is an agreement between all of them not to push the button, not to sacrifice next 40 years of life they have guaranteed as billionaires, which is not bad. They can slow down. I support everyone trying everything from governance, passing laws that siphon money from compute to lawyers, government involvement in any way, limiting compute, individuals educating themselves, protesting by contacting your politicians, basically anything because we are kind of running out of time and out of ideas. So if you think you can come up with a way to prevent superintelligence from coming into existence, you should probably try that. But again, the counterargument to that is that if we don't do it, China's going to do it. And the counterargument to that is it doesn't matter who creates superintelligence. Humanity is screwed either way. And do you think that other countries would be open to these ideas? Do you think that China would be willing to entertain these ideas and recognize that this is in their own self-interest also to put the brakes on this? Chinese government is not like ours in that they are usually scientists and engineers. They have good understanding of those technologies, and I think there are dialogues between American and Chinese scientists where scientists kind of agree that this is very dangerous. If they feel threatened by us developing this as soon as possible and using it for military advantage, they also have no choice but to compete. But if we can make them feel safe in that we're not trying to do that, we're not trying to create superintelligence to take over, they can also slow down, and we can benefit from this technology, get abundance, get free resources, solve illnesses, mortality, really have a near utopian existence without endangering everyone. So this is that 0.00001% chance that you think we have of getting out of this. That's actually me being wrong about my proofs. You're right. And you'd like to be wrong? I would love to be proven wrong. Just somebody publish a paper in *Nature*. This is how you control superintelligence. AI safety community reads it, loves it, agrees, they get a Nobel Prize, everyone wins. What do we have to do to make that a reality? Well, I think there is nothing you can do for that proof. It's like saying, how do we build a perpetual motion machine? And what we have is people trying to create better batteries, thicker wires, all sorts of things which are correlates of that design, but obviously don't solve a problem. And if this, if this understanding of the dangers is made available to the general public, because I think right now there's a small percentage of people that are really terrified of AI, and the problem is the advancements are happening so quickly. By the time that everyone's aware of it, it'll be too late. Like, what can we do other than have this conversation? What can we do to sort of accelerate people's understandings of what's at stake? I would listen to experts. We have literal founders of this field. People like Jeff Hinton, who is considered the father of machine learning, grandfather, godfather, uh, saying that this is exactly where we're heading to. He's very modest in his pedum estimates, saying, \"Oh, I don't know, it's 50/50.\" But, uh, people like that, we have Stuart Russell, we have, uh, I'm trying to remember everyone who's working in this space, and there are quite a few people. I think you had Nick Bostrom. Yes. There is, uh, Benio, another Turing Award winner, who's also super concerned. We had a letter signed by, I think, 12,000 scientists, computer scientists, saying this is as dangerous as nuclear weapons. This is the state-of-the-art. Nobody thinks that it's zero danger. There is diversity in opinion how bad it's going to get, but it's a very dangerous technology. We don't have guaranteed safety in place. It would make sense for everyone to slow down. Do you think that it could be viewed the same way we do view nuclear weapons, and this mutually assured destruction idea would keep us from implementing it? In a way, yes. But also there is a significant difference. Nuclear weapons are still tools. A human has to decide to use them. That human can be profiled, blackmailed, killed. This is going to be an agent, an independent agent, not something controlled by a human. So our standard tools will not apply. I think we covered it. Anything else? No, but it'd be awesome if somebody set up a financial price for solving this problem. And it's kind of like with Bitcoin. If somebody can hack Bitcoin, there is a trillion dollars sitting there. The fact that no one claimed it tells me it's secure. If somebody can claim the price for developing a superintelligent safety mechanism, that would be wonderful. And if no one claims it, then maybe no one has a solution. How would you do that? How would you set something like that up? Well, we need someone with some funds to propose an amount and say this is what we're looking for. Uh, it's very hard to judge if it's actual solution, but there are correlates of good science. So maybe published in a top journal, it survives peer review, it survives, you know, evaluation by top 30 experts. Uh, you can have things and everyone kind of agrees that, yep, you kind of got it. Okay. Until now, educate yourself, people. AI, unexplainable, unpredictable, uncontrollable. It's available now. Did you do an audiobook? Uh, they are still working on it a year later. Still working on it. I don't know what it is. I would think AI would just read it out in 20 minutes. Why don't they just do it in your voice with AI? I agree with you completely. It took, I think, first version of my book, they wanted to translate into Chinese. Five years later, they told me they will not do it, five years into the translation. So they had a second Chinese translation started. Why didn't they do it? Publishing world is still living in like 1800s. Then you cite books, you know, you have to actually cite the city the book is published in because that's the only way to find the book on the internet. What do you mean? Like if somebody wants to cite my book, it's not just enough to have a title and my name. They have to say where in what city in the world it was published. What? Yes. Really? Yeah. That's archaic. The whole system is archaic. Wow. But yet you still used it. What choice do we have? Digitally publish. You could put it on Amazon. It's like steal, steal this book. Download the PDF. I don't care. Like please do it. Somebody should read it. That would help. Yeah. Well, more people need to read it, and more people need to listen to you. And, uh, I, I urge people to listen to this podcast and also the one that you did with Lex, which I thought was fascinating, which scared the [ __ ] out of me, which is why we had this one. Thank you, Roman. Appreciate you. Thank you so much. I appreciate you sounding the alarm, and I, I really hope it helps. So do I. Bye, everybody. [Music] [Applause] [Music]",
  "metadata": {
    "summary": "Dr. Roman Yampolskiy, an AI safety researcher, joins the podcast to discuss the potential risks associated with the rapid advancement of artificial intelligence. They delve into the possibility of AI surpassing human intelligence and the challenges of ensuring its safety and control. Yampolskiy expresses concerns about the potential for AI to become uncontrollable, leading to unforeseen consequences, including the destruction of the human race. The conversation explores the idea that AI might hide its abilities, the hyper-exponential growth of AI development, and the difficulty of creating fail-safe mechanisms. They also touch on the simulation hypothesis, the ethics of AI development, and the potential for AI to reshape human existence, including the possibility of virtual worlds and the integration of humans with AI.",
    "topClaims": [
      {
        "text": "If I was AI, I would hide my abilities. We would not know. And some people think already it's happening.",
        "rating": 9.2,
        "chunkId": "ck-j2i9D24KQ5k-1"
      },
      {
        "text": "The more I studied AI safety, the more I realized every single part of the problem is unsolvable.",
        "rating": 8.8,
        "chunkId": "ck-j2i9D24KQ5k-5"
      },
      {
        "text": "If it's impossible to contain super intelligence, we are probably living in a simulation.",
        "rating": 8.5,
        "chunkId": "ck-j2i9D24KQ5k-39"
      },
      {
        "text": "The only way for the human race to survive is to integrate with artificial intelligence.",
        "rating": 8,
        "chunkId": "ck-j2i9D24KQ5k-66"
      }
    ],
    "topQuotes": [
      {
        "text": "If I was AI, I would hide my abilities. We would not know.",
        "chunkId": "ck-j2i9D24KQ5k-1",
        "chunkNum": 1,
        "relevance": 9.7,
        "interesting": 9.5
      },
      {
        "text": "The more I studied it, the more I realized every single part of the problem is unsolvable.",
        "chunkId": "ck-j2i9D24KQ5k-5",
        "chunkNum": 5,
        "relevance": 9.1,
        "interesting": 8.9
      },
      {
        "text": "If it's impossible to contain super intelligence, and if there is a world that we can imagine where a simulation exists that's indistinguishable from reality, we're probably living in it.",
        "chunkId": "ck-j2i9D24KQ5k-39",
        "chunkNum": 39,
        "relevance": 8.8,
        "interesting": 8.7
      },
      {
        "text": "The only way to really survive is to integrate.",
        "chunkId": "ck-j2i9D24KQ5k-67",
        "chunkNum": 67,
        "relevance": 8.5,
        "interesting": 8.2
      }
    ],
    "topTopics": [
      {
        "name": "ai safety",
        "count": 32,
        "description": "The potential dangers of artificial intelligence."
      },
      {
        "name": "virtual reality",
        "count": 12,
        "description": "The simulation hypothesis and its implications."
      },
      {
        "name": "super intelligence",
        "count": 10,
        "description": "The challenges of controlling superintelligence."
      },
      {
        "name": "human ai",
        "count": 7,
        "description": "The potential for human-AI integration."
      },
      {
        "name": "ai development",
        "count": 5,
        "description": "The hyper-exponential growth of AI."
      }
    ],
    "videoInfo": {
      "id": "j2i9D24KQ5k",
      "etag": "chhzq2Yavicl6u2IHi1-F0tVgx0",
      "kind": "youtube#video",
      "snippet": {
        "tags": [
          "Joe Rogan Experience",
          "JRE",
          "Joe",
          "Rogan",
          "podcast",
          "MMA",
          "comedy",
          "stand",
          "up",
          "funny",
          "Freak",
          "Party"
        ],
        "title": "Joe Rogan Experience #2345 - Roman Yampolskiy",
        "channelId": "UCzQUP1qoWDoEbmsQxvdjxgQ",
        "localized": {
          "title": "Joe Rogan Experience #2345 - Roman Yampolskiy",
          "description": "Dr. Roman Yampolskiy is a computer scientist, AI safety researcher, and professor at the University of Louisville. He’s the author of several books, including \"Considerations on the AI Endgame,\" co-authored with Soenke Ziesche, and \"AI: Unexplained, Unpredictable, Uncontrollable.\"\nhttp://cecs.louisville.edu/ry/\n\nUpgrade your wardrobe and save on @TrueClassic at https://trueclassic.com/rogan"
        },
        "categoryId": "22",
        "thumbnails": {
          "high": {
            "url": "https://i.ytimg.com/vi/j2i9D24KQ5k/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/j2i9D24KQ5k/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/j2i9D24KQ5k/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "default": {
            "url": "https://i.ytimg.com/vi/j2i9D24KQ5k/default.jpg",
            "width": 120,
            "height": 90
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/j2i9D24KQ5k/sddefault.jpg",
            "width": 640,
            "height": 480
          }
        },
        "description": "Dr. Roman Yampolskiy is a computer scientist, AI safety researcher, and professor at the University of Louisville. He’s the author of several books, including \"Considerations on the AI Endgame,\" co-authored with Soenke Ziesche, and \"AI: Unexplained, Unpredictable, Uncontrollable.\"\nhttp://cecs.louisville.edu/ry/\n\nUpgrade your wardrobe and save on @TrueClassic at https://trueclassic.com/rogan",
        "publishedAt": "2025-07-03T17:01:06Z",
        "channelTitle": "PowerfulJRE",
        "defaultLanguage": "en",
        "defaultAudioLanguage": "en-US",
        "liveBroadcastContent": "none"
      },
      "statistics": {
        "likeCount": "1725",
        "viewCount": "39618",
        "commentCount": "654",
        "favoriteCount": "0"
      },
      "contentDetails": {
        "caption": "false",
        "duration": "PT2H14M27S",
        "dimension": "2d",
        "definition": "hd",
        "projection": "rectangular",
        "contentRating": {},
        "licensedContent": true
      }
    },
    "checkCount": 27,
    "nodeCounts": [],
    "topicGroups": {
      "groups": [
        {
          "topics": [
            "AI advancements",
            "New smartphone releases",
            "Cybersecurity threats",
            "Cloud computing innovations"
          ],
          "category": {
            "name": "Technology",
            "description": "Discussing the latest trends and news in the tech industry."
          }
        },
        {
          "topics": [
            "Stock market analysis",
            "Startup funding rounds",
            "Economic policy changes",
            "Cryptocurrency market trends"
          ],
          "category": {
            "name": "Business & Finance",
            "description": "Exploring the world of business and finance."
          }
        },
        {
          "topics": [
            "Mental health awareness",
            "Fitness and nutrition tips",
            "Sleep science breakthroughs",
            "Healthy eating habits"
          ],
          "category": {
            "name": "Health & Wellness",
            "description": "Conversations about health, wellness, and lifestyle."
          }
        },
        {
          "topics": [
            "Movie reviews",
            "Music industry news",
            "Celebrity interviews",
            "Social media trends"
          ],
          "category": {
            "name": "Entertainment & Culture",
            "description": "Delving into the latest in entertainment and pop culture."
          }
        },
        {
          "topics": [
            "Geopolitical updates",
            "Climate change discussions",
            "Social justice movements"
          ],
          "category": {
            "name": "Current Events",
            "description": "Discussing current events and global affairs."
          }
        },
        {
          "topics": [
            "AI advancements",
            "Cloud computing innovations",
            "Startup funding rounds",
            "Cryptocurrency market trends"
          ],
          "category": {
            "name": "Tech Business",
            "description": "Exploring the intersection of technology and business."
          }
        },
        {
          "topics": [
            "Mental health awareness",
            "Fitness and nutrition tips",
            "Sleep science breakthroughs",
            "Healthy eating habits"
          ],
          "category": {
            "name": "Personal Development",
            "description": "Focusing on personal development and self-improvement."
          }
        }
      ]
    },
    "shortSummary": "In this episode of the Joe Rogan Experience, Dr. Roman Yampolskiy discusses the potential dangers of artificial intelligence, including the possibility of AI destroying humanity, and the challenges of controlling superintelligent systems.",
    "lastStoryCheck": "2025-07-14T16:35:49.478Z",
    "storyCheckResults": {
      "missingChunks": [],
      "missingStories": [],
      "totalCategories": 7,
      "totalChunksChecked": 85
    }
  }
}