{
  "id": "sP7saTy_mFI",
  "title": "How Alchemy Worked | STUFF YOU SHOULD KNOW",
  "channelId": "UCTb6Oy0TXI03iEUdRMR9dnw",
  "publishedAt": "2025-07-18T00:00:56.000Z",
  "cleanText": "Welcome to Stuff You Should Know, a production of iHeartRadio.\n\nHey, and welcome to the podcast. I'm Josh and there's Chuck and Jerry's here, too. And we are here to enchant you in this very special episode of Stuff You Should Know, which we like to also call the facts of life, too.\n\nYeah. I mean, alchemy, I think a very appropriate topic. Taking something mundane and turning it into something fantastic.\n\nOh, yeah. I guess we are kind of alchemists in that sense. Or were you talking about a different podcast?\n\nNo, no, no. I was talking about what I what I aim to accomplish today.\n\nHey, man. Not only do you aim it you or aim for it, you hit it right on the head.\n\nYeah. Uh, alchemy, baby. Let's do it. Clumsy attempt at a compliment. Yeah.\n\nWell, yeah. When we're talking about alchemy or alchemists, for me at least, and I would assume most people, kind of conjures images of like some some magician wearing like a a robe with stars and moons on it, maybe even a pointy hat to match.\n\nSure.\n\nHe's lit by candle light. He's in a strange little laboratory. He's doing all sorts of weird stuff to basically create some sort of magical potion or do something like that, right? If you know a little more about it, maybe you think of um charlatans who trick people into investing in their alchemical schemes of turning, you know, lead into gold. But um it turns out that there's a lot more to it than I ever realized. And the people involved were not they were a lot more interesting and a lot less dumb and fraudulent than than history has kind of cast them as.\n\nYeah. I I always thought of alchemy as um just from what I knew as a youngster which was just turning something like a a boring metal into gold like you were talking about.\n\nBut it is I think interesting that uh modern science now looks back and said and says hey you know what I mean sure it was a lot of bunk and BS involved uh but some of the foundations of modern chemistry were there even though that wasn't their intention really.\n\nYeah. And you can also make a pretty strong case that the alchemists were the ones who laid the groundwork for the scientific method.\n\nYeah, in some ways. Sure. What's cool about it too is that, you know, the Europeans, the medieval European, you know, monks and sages and scholars are the ones you typically think of, at least in the West, when you think of alchemy. But it's a I don't want to say worldwide, but it it really kind of ties together traditions from a bunch of different parts of the world into a mad pursuit for immortality and glory.\n\nYeah, totes. So we should say that um you can kind of trace the western tradition of alchemy, the Europeans as as you think of it um all the way back to Egypt. Egypt was like the starting point for the western tradition but Egypt even um seemed to get it from other places specifically even even back before Egypt. It seems like China and India uh were possibly in on the pursuit for immortality which seems to be the thing that initially gave alchemy like its birth.\n\nYeah. And they may have called it like you know the art or something like that or may maybe you know some other word that they had that meant you know some sort of transformation might be taking place.\n\nUm the word alchemy itself was first used in Arabic uh and then eventually French and English in medieval times. Uh but yeah, I think it's interesting that it followed that route. And it's also not surprising that, you know, China was one of the first to get involved in something like this because I feel like anytime we're talking about ancient um practices, China always seems to be sort of leading the way in one way or the other.\n\nIndeed. Um, one of the reasons China was so heavy into it was because the the early alchemical um like pursuits or purposes were to create an elixir for immortality. The reason they cared so much about that was because um the country had a huge dowist population and daoism is very much interested in achieving immortality one way or another. And so China and its uh alchemists put together mercury, arsenic, sulfur and said, \"Here, drink this.\" Uh, a lot of times and surely a lot of people died from drinking those things, right? I mean, you can't drink a a concoction of mercury and still, you know, just wipe your mouth with the back of your hand and walk off like time to get to work, you know?\n\nYeah. I'm sure I'm sure there were some people that suffered under uh alchemy experiments over time.\n\nUh but they also you know on the other side and this is sort of the um the plus side and minus side of some of these experiments. They also whether or not purposefully or not gave us things we still use today um like you know potassium nitrate. So they sort of accidentally discovered gunpowder and ammonium chloride which is used today as nitrogen in fertilizer like for farms and stuff like that. Mhm. So yeah, there were that is kind of a tradition in alchemy of you know they were trying to do something else but they still found useful stuff that we still you know make or use today. And China's whole jam with alchemy kind of started to dry up as Buddhism spread uh throughout the country because Buddhism is much more focused on rebirth and mellowing out about the whole immortality thing. And so the pursuit of, you know, immortality through special elixir just kind of became a moot point or a moo point. Sorry.\n\nUh yeah. I mean, I guess the Buddhists were like, \"Yeah, maybe it's really not possible to live forever. Maybe we should set our goals a little more reasonably.\"\n\nRight. Let's just pretend like we don't care about living forever. uh as far as India goes uh they were also not seeking immortality and they were also kind of like post uh Buddhist China like let's try and promote health let's try and cure some disease um maybe we can try and transfer something into gold uh but you know you'll see that kind of popping up that's why I think a lot of people the first thing they think of is turning something into gold because that was the pursuit of a lot of alchemists because gold was so revered uh either as like you know the the the best metal. Uh, go ahead and make your white snake joke.\n\nI wasn't going to. I was just thinking of of gold wearing a t-shirt that says the best metal.\n\nYeah. With like the devil's hands. The devil devil horns fingers.\n\nSure.\n\nUh, and and you know, also thinking like, you know, perhaps like drinking something that uh maybe liquid gold, but it's really not liquid gold. It just turned the color gold could make you healthier or maybe live forever. Yeah.\n\nAnd in India they were trying to make gold not to get rich but because like you were saying they were trying to um balance health, restore health like it was just associated with healthy living essentially. Gold was\n\nYeah.\n\nSo then um we reached the Mediterranean that was another ancient place and by the time Alexander the Great invaded Egypt in 322 B.C.E. um they found pretty quickly that the Egyptians had already been developing their own tradition of alchemy for a while. And the Greeks said, \"Hey, I like your style. Let's mix together our philosophy and our understanding of physics and astrology with your alchemy and let's produce something really great that medieval monks are really going to go nuts for.\"\n\nYeah. And I think this is like I know we're going to say this quite a bit, but I think they were these early scientists were taking a stab at at some at something, you know, like sure there were charlatans and stuff like that, but this was so early on in the game like science was brand new and they were like, \"Hey, let's try this thing and see if it works out.\" Uh, and maybe didn't always follow modern best practices, but you can't expect them to either. So, like, I don't know. I feel like over time on this ep on this uh podcast period, we've kind of tried to shine a little bit of light on some of this stuff is like, hey, they're they were doing their best back then, trying to get trying to get involved in science at least. Uh\n\nright, at least they were doing something, you lazy s.\n\nYeah, exactly. Um I mean, this is when the first books on it came out. There was one called uh the translation is natural and mystical things by an Egyptian named Bolos of Mende. This is around 200 B.C.E. Uh a lot of this was again about making you know um valuable metals like gold and silver but again it was uh it was the first kind of preserved writing that we have on this.\n\nYeah. Right. No for sure. And uh he was also somebody who wrote pretty straightforward about alchemy and the recipes and the processes which um would come to be very rare as alchemy developed. It became much more secretive.\n\nYeah. But this um Greco Egyptian creation, this melding of uh different traditions to create this this specific kind of alchemy, it's called henistic alchemy that laid the foundation for western alchemy to come. Um one of the other big things that came out of it or another indicator of how important it was is there was this kind of legendary figure that developed among the medieval um alchemists, the monks. Um, his name was Hermes Tris Magestos, which is a great name. Not a good hotel check-in name, but it's a it's a great name regardless.\n\nCould you spell it again, sir?\n\nLike, how many times are you going to hear that?\n\nRight. And you would say it just like that, too. Like real uncertain and unsteady like Hermes, I think. Um, so it was a combination, a straightup combination of th or toth, I think th the Egyptian god who invented writing, the one with the ibis bird head.\n\nYeah.\n\nAnd Hermes, the Greek messenger of the gods. Like this was a complete synret syncization of those two. And later medieval monks would ascribe like alchemical text having been written by Hermes T.\n\nYeah, Hermes T. That's a that's a better check-in name by far. Really?\n\nIs that tea, sir? or te e\n\nI think it means like Hermes third the best I I think is what tis meisto translates to\n\nall right that's pretty good\n\nand this is this is one of those episodes too Chuck where when we say words we might accidentally cause somebody to go poof and something either appears or disappears so everybody be prepared for something to vanish\n\nyeah I agree uh and no one knew it that you know like when you look back on stuff like this it's kind of hard to parse out like who was who was first who is influencing who it's just sort of spread around the world. There there's is a theory that um India's belief system was basically just sort of um brought over as a maybe not as a book but you know brought over wholesale from protoarans in central Asia and they were in the area between four and 5,000 years ago. So it's you know I don't I don't know if there's a lot to be gained from sort of debating who was coming up with what first you know\n\nright? Yeah. Uh yeah, I mean it does really matter. It's it's those historians, they're kind of fixated on that kind of thing.\n\nUm but you know, it is interesting to wonder like where culture came from because so much of it influences so much else, not just in alchemy but in in all things basically. But um you mentioned Bolos of Mende and he actually came after the guy who uh the western tradition of alchemy is kind of like based on like this guy was the guy. He's like, \"Here's how it's done. This is the ground rules for alchemy, okay, everybody?\" His name was Zoamos of Panopoulos.\n\nUm, and Zoamos of Penopoulos wrote something like 28 books on alchemy. And for a while, they were like, \"We've only got a couple of letters of this guy, but we knew he was brilliant.\" Um, apparently they've been finding his stuff all over the Arabic world um in libraries uh that they didn't realize they had it before, but a lot of his writings have recently been rediscovered. Yeah. And his stuff, he's another one of those that was pretty detailed in his writing. And to have like stuff like this preserved is is pretty amazing.\n\nUh he was because he was an alchemist, obviously transforming metals or or you know, trying to transform metals. Uh but he like I said, he was pretty specific. He would have uh writeups on like exactly what tools he was using, on what methods he was using. Uh, a lot of this stuff was obviously uh repurposed from the kitchen like kind of cooking stuff or maybe craft work, not the van, uh, but you know, crafting and, uh, like like a bedazzler.\n\nYeah, like a bedazzler or perfume making. And he credited a lot of this stuff with a a Jewish woman named uh, Maria. And he was like, you know, a lot I've taken a lot of her methods and a lot of her methods also transferred over to early methods of uh of cooking, like you know, French and Italian cooking methods.\n\nYeah. Like a water bath. A balmarie or a bano Maria is, you know, like you know when you melt chocolate chips in a pan that's inside a pan that has water in it.\n\nYeah. So you don't scorch it, right?\n\nExactly. You can thank the Jewish woman named Maria who has lost a history aside from Zoamos of Penopoulos's writings, but she apparently taught him.\n\nYeah. And he he said, \"Hey, you can use a lot of this stuff to to not make gold from lead.\"\n\nYeah. I mean, he he definitely came up with some processes that he figured out himself. And like you said, these people were taking a stab at it. They were like, \"What happens if I do this and what what happens if I if I try that same thing with a different metal or a different powder or something like that?\" So they were experimenting. They were starting the beginnings of experimentation that would lead to what we understand it as a science. Zozimos was doing this. Like he was one of the first to to do this. Um I also saw a definition. I'm not sure if I sent it to you or not, but he had an explanation or a definition of what alchemy is. He said it was the study of the composition of waters, movement, growth, embodying and disemboding, drawing the spirit from bodies and bonding the spirits within bodies. And what he was saying, like if you stop and think about it, it's actually pretty comprehensible. Yeah. He he's saying alchemy is the study of, you know, all the things we've observed about the world around us trying to figure out how that stuff works. Like how does a soul come into a body and become attached to it\n\n\nHow does it leave after death? What's the deal with water? Uh, that kind of stuff. So, like, it was just them seeking to apply essentially a protoscientific understanding of the world as they understood it.\n\nYeah. Like, what happens if I distill this thing down to its base form or uh, create, you know, you're going to hear a lot of talk about vapors. Um, like, you know, boil something or heat something to create a vapor and then smash it together with this thing. And now I've just learned, you know, I'm trying to make gold maybe, but I've all of a sudden discovered that uh, it changes properties of both materials if I combine these two things. And while they may not have understood what the heck that meant, chemistry later on would say, \"Oh, actually what they were doing was this.\"\n\nRight. Exactly. Yeah. So, um, this whole, this whole jam that was laid down by Zamos and Bolos and the the early Egyptians who eventually kind of combined their stuff with the Greek understanding of the world, which is really important because Aristotle's thoughts about, you know, what made matter up, like earth, wind, fire, and air, the four elements, that was the understanding of the world that they were working from. They were trying to figure things out within that context. So, Aristotle had a huge contribution to alchemy early on, which as science would later kind of um, decide was just a huge wrong turn at the outset, especially considering that Democratus, who was around the same time as Aristotle. Remember him? He was the one who's like, everything's made up of atoms. I just am not going to use the word atoms yet.\n\nRight. Exactly. Uh, good place for a break. Yeah, I think so. All right, we'll take a break and we'll uh, talk a little bit about the move into Europe right after this.\n\n[Music]\n\nOkay, Chuck. So, things were just kind of hanging around from, you know, 300s BCE, um, where the Egyptians and the Greeks had kind of come together and created that version of alchemy. Um, and eventually the Arab world started to rise, and it started to go over here and go over there, and wherever it went, it kind of took this and that from each culture that it found interesting. And one of the things that they did, they showed up in Egypt and um, they said, \"Hey, I like this alchemy stuff you guys have been doing for the last few hundred years. Teach that to us.\" And that actually helped lay the the groundwork for the incredible amount of learning that took place around this time in the Arab world.\n\nYeah. And you know, logging stuff, describing stuff, uh, that would later on, again, you know, lay the foundation for for legit chemists of the future. Uh, and one of their theories was that production of uh, different kinds of matter starts out basically, you know, with the basics, which are heat, coldness, dryness, moisture, and combining these in different ways are going to have different outcomes, uh, like to produce those vapors. You're going to have uh, cold water basically and combine that with some sort of uh, hot moist air to create a vapor. And they would, you know, mix these things together, and they would combine it with uh, mercury or sulfur or something like that and trying to make gold once again, right? I think it's called chrysio pouya.\n\nYeah, that's the the technical term, I think, for for trying to make gold.\n\nYeah, exactly. Um, and there are a couple of big, big names. There are a few big names, but two that still made it all the way through history: Razis, who's known as the greatest physician of the Muslim world at the time. He was an alchemist. Uh, a contemporary, I believe, of his named Jabir. Uh, he was well known as a a early scientist. Some people call him the father of chemistry. Um, and these guys were, they were contributing by saying, like, hey, don't just throw a handful of powder at something, like, you know, do a thumbnail and and use the same amount every time. Just, just little contributions like that. Um, what was a huge contribution, too, was that they took a lot of these ancient texts, translated them into Arabic, and then those were eventually translated into Latin, which is when things started to spread like wildfire throughout Europe in like the 12th century.\n\nYeah, I promised talk of Europe, and I just forgot we had to stop by Arabia first. Mhm.\n\nBut this is beginning in about the 12th century when it moved into Europe. And this was a time when uh, Europe was shifting, you know, to a university sort of a more academic uh, way of looking at things and away from the monasteries, who were, I guess, some of the more early, you know, science-minded people.\n\nYeah, and Christian scholars at the time in Europe, um, they started to become a little more open to say, like, hey, maybe we should, you know, uh, look to other texts, ancient texts, even look, look from other cultures to try and see if we can learn something from them, and so they started experimenting with uh, mineral acids, uh, boric acids, sulfuric acid, stuff like that, uh, and trying to develop um, elixirs, and this is where you'll hear more about things like, you know, um, immortality, like the elixir of life, philosopher stone, which we'll get into, and stuff like that.\n\nYeah. And we should say, now that I think of it, I'll bet a lot of this transfer of knowledge came from the Crusades. Europe just showed up and was like, \"Give us everything,\" including all of your books on alchemy. You know, that would be my guess. But yeah, around this time, so I, I read that the European alchemists, following this tradition, believed that in the ancient world, they had already um, found what was called the philosopher's stone, which just sounds so cool. It'd make a really cool, like, title for a Harry Potter book or a Willie the Wizard book or something, you know? Are you making philosopher's stone?\n\nUm, no, I think it's just kind of like, it, it's just na, it fits naturally, you know.\n\nWell, that was the original title of the Harry Potter book. Uh, sorcerer stone.\n\nOkay. I, That's why I asked if you were joking.\n\nNot the sorcerer stone. It's the philosopher's stone, wasn't it?\n\nNo, they changed it to the sorcerer stone from the philosopher's stone.\n\nWhat a ripoff.\n\nOkay. Well, we're talking about the philosopher's stone, and that was a term for this substance that supposedly was all over the place, but we just didn't recognize the the magical properties of it that you could turn immediately anything into, like, gold or whatever the perfect version of that thing was.\n\nBecause that was the thing. Gold to the alchemists was the perfect version of a metal. And all other metals, whether it's lead, tin, silver, whatever, are we, we're seeing them in the process of moving naturally into gold. That's how they understood it. What they were trying to do is figure out how those processes worked so they could speed it up, right? And do it, do it by, like, that's where they got the idea of taking lead and turning it into gold. That's what they were trying to do was move lead into its more perfect natural state, which was gold. And the way that they thought you could do that was with the philosopher's stone, which would make that happen automatically.\n\nYeah. And you mentioned earlier that um, that they would operate a little more in secrecy later on, and this is kind of where we are now, uh, now is they would operate, maybe they would have their apprentices and stuff like that, but it was kind of shrouded in secrecy a lot of times. Uh, they would use, like, codes and symbols and metaphor and stuff when they were uh, like, recording their experiments. Uh, and there were a handful of u, European alchemists that, you know, we should probably go over a little bit. Uh, the first of which is Albertus Magnus or Albert the Great. He was a German philosopher in the 13th century, and he was a friar, a Dominican friar, and he studied the the work of these Arab alchemists because, like we said, it kind of came over from there and the ancient Greek philosophers, which, you know, as we mentioned, kind of melded those two worlds of philosophy and science or this kind of science.\n\nRight. Right. So, um, there was another guy, I mean, there's a bunch that we could talk about: John D, Arthur D, Roger Bacon. They were all alchemists who contributed to our understanding of the world. Um, one I hadn't heard of was Jealad Tad.\n\nJealad, I think I got it that second time.\n\nIt sounds good to me, but German is my non-spe.\n\nHe was um, he was uh, he was trying to figure out chrysopou chrisopooya, um, which is again, transforming things into gold. The thing is, and this is a really good example or way to point this out, he was a Franciscan monk. He didn't care anything about getting rich. As a matter of fact, he had taken a vow of poverty. Um, so, so many times the alchemists are like, all they wanted to do is, like, just make gold and be rich. They were just greedy magicians essentially.\n\nNo, that's not the case. They wanted to create gold to end poverty. They wanted to find the elixir of life to end disease. Like, they had really big, big goals that they were trying to reach, and he was a good example of that. He wanted to give the Catholic Church the ability to make gold so that they could fund themselves better, essentially.\n\nYeah. I took a vow of poverty in my 20s. I think you did, too.\n\nOh, yeah. Yeah. It was forced on me.\n\nUh, so one of the things that he did, too, which is pretty interesting, I think, is he God talked about sort of distilling things down to their purest form. Mhm.\n\nHe did that with booze, and he distilled it down to aqua, uh, how would you pronounce that? Vita\n\naqua vite.\n\nAqua vite. Um, he called it the fifth essence of wine or the uh, quinta essentia. And this goes back to Aristotle again. This idea that um, you know, it's something different than those four classical elements that we're talking about. And I, I forgot how he pronounced his name, but let's just call him Dr. R. uh, said that, hey, when I create this distilled wine down to its purest form of alcohol and I put meat in that stuff, the meat just kind of stays like it is. It stops this decay. And it, he wasn't, he didn't think he had tapped into a new way to preserve meat. He thought, like, hey, maybe this stops things from aging, and maybe this alcohol is a cure-all, right? He went on to create the Mai.\n\nOh, nice.\n\nAnother one. This guy's my favorite, Pariselus. Uh, his real name was Philipus Theoprastus Orololis Bombastus Von Ho Hohheim, but we'll call him Phil Hohenheim.\n\nHoenheim.\n\nYeah. Well, he went by Paracelis. I think we talked about him in our poison episode or there was some episode because he was famous for saying uh, the dose makes the poison, like, you can take enough of anything and it's going to kill you, which is a really important understanding at the time. But he was one of the ones who led the way of secrecy because he believed that what the alchemists were doing was dealing in, like, the nature of the universe and that this information was way too potent to just have out there. So, he was one of the ones that led the charge in that. He also was known as um, questioning Galen's thousand-year-old idea of the four humors being the cause of disease.\n\nParacelis was like, \"No, I think that there's, like, external factors involved, like, maybe even little tiny bugs or something like that that get in your throat and then into your stomach and then just really screwed things up down there.\" Yeah.\n\nUm, that's me paraphrasing him. That was Paracelis. So, he was a a straightup genius for his time. I'm a big fan.\n\nYeah. I'm sure they came right back at him and said, \"No, no, silly man. It's just black bile. That's the problem.\"\n\nHe's like, \"You sure? Like, this other stuff could be making us sick.\" He's like, again with the bile.\n\nUh, there was also Nicholas Flamel, I guess, or Flaml, I'm not sure how you would pronounce that, but\n\nI think I think Fl Okay. Um, he is the one who is credited to have discovered the philosopher's stone. Uh, he was just a mere book seller in the 14th and I guess uh, 15th centuries, and he said, I got a book, I got, I purchased a book, and it was in a language that was so hard to translate. It took me 21 years, but once I finally cracked that code, in that book was the information on how to produce the philosopher's stone. And this is what I don't understand. He got rich, but did he get rich off of selling this? Like, that's what I couldn't figure out.\n\nNo, the the later alchemists, like, starting around the 17th century, they created a legend about him saying that he had created the philosopher's stone. So, now he could turn anything into gold, and that's how he got rich.\n\nYeah. But how did he, where, how did he get rich? I still don't get\n\nfrom\n\nbecause he wasn't turning stuff into gold.\n\nNo. From what I saw, his wife was rich.\n\nOh,\n\nthat's the likeliest explanation. But this legend grew up around him because he really was well known. He's recorded historically as being very rich. Kind of suddenly, uh, they, they endowed, like, a ton of hospitals, a bunch of um, schools, churches, um, that are some of them are still around today. And he was known for putting alche, alchemical messages um, kind of encoded in the buildings, like, on plaques or in archways or something like that. Yeah.\n\nSo, he definitely was an alchemist. He definitely was rich, but it was this legend that grew up around him that he was one of the few who actually found the the philosopher's stone. I almost said sorcerer stone, man.\n\nSee,\n\ngets in there.\n\nUh, another legend is that he perhaps maybe lived to be 114, but um, records say he was between 80 and 114. So, that's a pretty big uh, gap there. A wide range.\n\nYeah.\n\n34 years.\n\nIt is pretty, pretty wide. But even 80 back in the 1400s, early 1400s is pretty respectable, I guess.\n\nNo, agreed.\n\nSo, we talked a little bit about the philosopher's stone. That was one thing that, as far as we know, no one ever created, right? But all of the alchemists in Europe were after this, trying to figure this out. While at the same time also performing all these other experiments just in case they didn't figure out how to do the philosopher's stone, they were figuring out how to do it the hard way, too. Um, there was also another thing that they were famous for trying to create, which are called homunculi, which are essentially artificial people in miniature, uh, that they\n\n\nI wanted to create so that they could study how life begins or um or like Zazamos had said, you know, how the how the the spirit bonds to the body. Like that's the kind of thing they were trying to figure out by creating many humans, and they had all sorts of, I think it's fair to call it, wacky ideas of how to create a homunculus.\nI think it's pretty fun. I mean, the word homunculus is fun in and of itself, but uh yeah, there's something called the book of the cow. Uh, this is an Arabic book in the 9th century uh that apparently Plato had something to do with. And there was a recipe for a homunculus in there, which is one hunculi.\nAnd it involved in siminating a a U, which is I guess that's a female sheep, right?\nMhm.\nWith human sperm. Don't ask how. I'm not really sure how that happened, but I'm sure they had not too many ways to do that back then. I'm sure they had their methods, and you would have a birth, and it would be some sort of shapeless form at that point. And then you need to treat it with specific stuff, uh, materials, put it in a glass container, and then it grows into a tiny person.\nYeah. I don't think that this ever worked, but they some I I guarantee some people tried it for sure.\nOh, I bet. I mean, you have to have some excuse for when you're found with the sheep, right? Oh yeah. Oh my god. Oh.\nUh, that's going to stay with me like sorcerer stone. Chuck, every time I see the word you, ew we, it reminds me there was this Happy Days episode where Richie was writing in chalk on the sidewalk a message to some girl that he liked.\nWell, in a place where he knew that she was going to walk home from high school, right?\nI remember this. And he he drew I and then the heart and then the U like a sheep, and the girl comes up on him while he's s sitting there finishing it, and she's like, \"I love sheep,\" and he's like, \"It's a you, I love you,\" but the way that she said, \"I love sheep,\" just always it stuck with me like the weird thing you said about um inciminating sheep and sorcerer stone will always stuck with me, and and it probably taught you the lesson like never put yourself out there with a\nThat's right. Yeah, that was definitely the line you got from Richie Cunningham. For sure.\nI to I I had forgotten completely about that, and as you started to tell that story, I completely remembered it. Just like flooded back to me. That's funny.\nThere there's one other one, too. This was a Brady Bunch one that I always think of whenever I think of Ihe Heart Sheep when I see the word you. So, we're like three or four inceptions from this original thing.\nUm, there was a a Brady Bunch where Greg and his friend stole a rival school's mascot, which was a goat.\nOkay, I remember that.\nIt just so happened that like a bunch of officials from the school were came over for coffee to the Brady house while the goat was there. And they had to move it from room to room and hide it. And Greg finally gets discovered with the goat in a closet holding it in this really awkward position. And the face he makes when they open the the closet door. It's I I can't imagine how many takes they did to get it just that perfect. But it's a it's one of the great alltime shots of 70s television if you ask me.\nDid the goat Was he wearing like a like a cape or something?\nYeah.\nYeah. Yeah, I remember that.\nYeah. I'm going to send you that clip because it's worth watching.\nAll right. So, I guess we need to take our second break.\nYes.\nAnd then we'll come back with more talk of 70s television right after this.\n[Music]\nAll right. So um we have talked um sort of hinted at the fact that alchemy is not looked back as it was for many years, and there's a more modern sort of view of it as like that, hey, they were doing the best they can, at least that's what Chuck said, and some of the foundations they laid for modern chemistry are actually kind of valuable.\nUh and that's kind of where we're at now. Um, a lot of like metallergical processes were created that were legitimate. Um, maybe accidentally creating medicines or things that led to medicines happened, which is also valuable.\nMhm.\nWhat else?\nOh, uh, well, I mean, just the very fact that these guys were carrying out experiments like before then philosophers just said like Aristotle, like this is what everything's made of. Earth, wind, fire, water.\nTrust me.\nNo one asked him exactly. No one asked him how do you know that or anything like that, and he really, you know, I'm not saying he was a fraud or anything, but he didn't use any scientific experimentation. It was the Alchemists who started that. They they were the ones who started working in the lab with specific measures of materials and then very importantly recording their results. Um, so they were documenting what they were finding. These are all just the the basic outlines of the scientific method today.\nYeah. And I mean, the word chemistry actually comes from alchemy uh in about the 1780s, which is pretty interesting.\nAnd alchemy is also like the other definitions of alchemy, um, doesn't it also mean like some sort of romantic chemistry that can happen?\nYeah. You know, like romantic chemistry, right? So, a romcom, what they have in there, romantic chemistry, that understanding and use of the term chemistry actually predates the use of the word chemistry as far as the scientific discipline goes by almost 200 years.\nYeah, it's a good point. And there were also some pretty major players that we, you know, revere as our scientific forebears that were involved in stuff like this who maybe tried to keep a little quiet like Isaac Newton. And this is like well into the 18th century when Isaac Newton was doing his thing, and he was like, \"Yeah, maybe we could make gold from other materials, and maybe I'm not going to, you know, I'm also into some occult and spiritual con concepts, but I'm going to kind of play that down and keep that all under the table for now, and it will only be discovered later.\"\nYeah. Underneath his ruffled puffy pirate shirt, he had the best metal t-shirt on. Well, and people that were in charge of sort of keeping up with his story and his records, they kind of buried that stuff over the years to protect his image, didn't they?\nYeah. Newton was such a genius that he was pursuing two lines of inquiry into the nature of the universe. One like the the physics genius, the mathematician that we know and love is like the world's first true scientist.\nAt the same time, he was pursuing alchemy as well. Like he was looking into the whole thing like hedging his bets.\nYeah. Essentially he was trying to figure it out. He he apparently believed or his paper said that he thought alchemy was this ancient wisdom that God had directly given humans and that alchemists were figuring out, were learning, like that this was like divine a divine delivery of like knowledge essentially, and like like you said, his papers were kept private just to preserve his image for centuries, and then finally they started to get published, and people started to understand him a little more, and I saw a really interesting quote at some point that one of his biographers said that Isaac Newton was not the first scientist. He was the last alchemist.\nWhoa.\nYeah. And I mean, it doesn't necessarily make sense to you if you when you first hear, but it's very much like how um say a bird evolved out of a dinosaur bird. The dinosaur bird was not a true bird. The first bird was the first true bird.\nYeah. And in that same way, the point they were making was Newton was the thing that the first real scientists evolved out of, but he was not that. He was part alchemist, too.\nYeah, it's a good point. Uh there were, you know, even some more modern world leaders that were like, you know, these guys were trying to make gold, and I know it didn't work out, but like maybe we could try because it'd be great if we had a lot of gold. um Maxmillian II and Rudolph II. And this was 16th and 17th century uh Holy Roman Empire stuff where they were like, \"Hey, why don't we just sort of uh help financially support these alchemists because you never know, maybe they can maybe they can tap into this elixir of life or get us untold amounts of gold.\"\nYeah. I also saw Henry V 6 um not only uh gave some like I think 15 or 16 alchemists official royal licenses to produce alchemical gold. He took what they used and minted it into coins. So supposedly there are coins.\nNo, it was a combination of mercury and copper sulfate with a little bit of water, and it produces some alloy once you clean it up that looks a lot like gold, but it's much lighter. He he like there's coins out there still today to collect that were basically alchemy gold that that Henry the 6 um commission and that Britain's gold coins were made out of for a little while\nwhich ironically are probably worth a lot of money\nI would guess so, and that is ironic, isn't it?\nyeah a little bit, don't you think?\nyeah I would even say more than a little bit, I'd say a lot of bit\nokay uh the Academy Royale de Sciences in France is founded in 1666. And that's when they said, \"All right, um, this philosopher stone stuff is not going to be in our curriculum anymore. We're not going to look at astrology. We're going to move into the modern era, uh, of the 17th century version of the modern era.\"\nAnd that's what they did. They kind of shut all that stuff down um, as like the official scientific as far as official scientific pursuit academically goes.\nYeah. And the whole thing kind of continued on. The 19th century still had alchemists in it. Um, the upshot of that whole thing was that they were frauds, charlatans, and they were really the ones who gave alchemy a bad name to our modern ears. But also, science when it was really when it really developed, it it had a tendency to turn on its predecessors, the things that it evolved out of, like witches, herbalists, that kind of thing. Um, same thing with alchemist. Like, it was just so dumb and and backward. Science is the the the truth. Um it just basically disavowed alchemy even though it directly evolved out of alchemy.\nYeah.\nBut now it is nice kind of refreshing that today science is ready to be like, yes, it's a little embarrassing, but this is our grandfather.\nYeah. Well, you know, I I feel like grandfather is usually less embarrassing than father.\nI don't know. It depends on the era the grandfather's from because they can say some really inappropriate stuff at Thanksgiving, you know.\nYeah. I I strive to be, if I ever am a grandfather, just to be the sort of sweet daughtering old guy that everyone just thinks is is fun and funny.\nYou definitely will be, man. No doubt about it.\nI think you're also though one of those grandfathers who's also a beloved dad, too, which is\nWell, so far so good.\nThat's hard to do.\nYeah.\nUh, one more thing about alchemy. I when I was studying listened to a bunch of dungeon synth. I know I've mentioned it before,\nokay? But in particular, I was listening to albums by Witchbolt.\nOkay.\nIt's really good stuff, man. If you're into any kind of like instrumental synth music,\nI am.\nYou could do a lot worse than listening to Witchbolt.\nAll right.\nAnd then it also joged my memory. Um I when I mentioned Dungeon Synth a couple years ago, uh we got an email from somebody named the Lone Enchanter who has a Dungeon Synth label called High Mage Productions. And you can go check them out on Band Camp. But they sent us a couple of jingles that apparently were lost because I sent them to Jerry, and she's like, \"I have never heard either of these.\" So,\nwe can look for some High Mage Production jingles coming in in the future. Thank you very much for that.\nYou\nfantastic. I'm going to check out Witchbolt. What a great name.\nIt really is. And their album covers are amazing, too.\nOh, I bet.\nOkay. Well, that's it for Alchemy, everybody. We did it, Chuck. And we're done. And that means it's time for listener mail.\nUh, this is a correction on me. I can't believe I missed this. I feel um like a dummy. Hey guys, when you mentioned Heavy Metal Parking Line on the Sunset Strip episode, the greatest heavy metal short documentary of all time, uh, Chuck attributed it to Penelopey Spirus, uh, she made Decline of the Western Civilization.\nMhm.\nSo, I I goofed that up. I was totally thinking of uh, Decline of Western Civilization. Another great documentary. But have you seen Heavy Metal Parking Lot then?\nI have. I just misattributed the the filmmaker. Apparently, uh Jeff Krulick and John Hayne made heavy heavy metal parking lot. It's beyond satire and encapsulates a moment in time that was magical. Uh they also made and this I didn't know. Uh they also made a documentary called Neil Diamond Parking Lot. No. So that's pretty fun. I'm going to have to check that one out. Uh that is from uh that's with best regards from Matthew T from Cleveland, Ohio with a PS. I love you both very very much.\nThanks a lot, Matthew T. Right back at you. Uh and if you want to be like Matthew T and correct Chuck. Chuck loves that kind of thing. You can wrap it up, spank it on the bottom as an email and send it off to stuff podcastartradio.com.\n[Music]\nStuff You Should Know is a production of iHeart Radio. For more podcasts, iHeart Radio, visit the iHeart Radio app, APPLE PODCASTS, or wherever you listen to your favorite shows.\n[Music]\n",
  "metadata": {
    "summary": "The podcast episode explores the world of alchemy, dispelling common misconceptions and highlighting its significant contributions to the development of science. The hosts discuss the alchemists' ambitious goals, such as curing poverty and achieving immortality, and how their experiments laid the groundwork for the scientific method. The episode traces the origins of alchemy from ancient Egypt to its spread through various cultures, including China and India, and its evolution in the Arab world and Europe. Key figures like Zoamos of Panopolis, Maria the Jewess, and Nicholas Flamel are discussed, along with the creation of the philosopher's stone and homunculi. The episode also touches on the connection between alchemy and the scientific method, and the influence of figures like Aristotle and Isaac Newton.",
    "topClaims": [
      {
        "text": "And you can also make a pretty strong case that the alchemists were the ones who laid the groundwork for the scientific method.",
        "rating": 8.5,
        "chunkId": "ck-sP7saTy_mFI-3"
      },
      {
        "text": "China and its uh alchemists put together mercury, arsenic, sulfur and said, \"Here, drink this.\"",
        "rating": 7.8,
        "chunkId": "ck-sP7saTy_mFI-6"
      },
      {
        "text": "So they sort of accidentally discovered gunpowder and ammonium chloride which is used today as nitrogen in fertilizer like for farms and stuff like that.",
        "rating": 8,
        "chunkId": "ck-sP7saTy_mFI-7"
      },
      {
        "text": "Isaac Newton was not the first scientist, he was the last alchemist.",
        "rating": 7.5,
        "chunkId": "ck-sP7saTy_mFI-43"
      }
    ],
    "topQuotes": [
      {
        "text": "When we're talking about alchemy or alchemists, for me at least, and I would assume most people, kind of conjures images.",
        "chunkId": "ck-sP7saTy_mFI-1",
        "chunkNum": 1,
        "relevance": 9.1,
        "interesting": 8.2
      },
      {
        "text": "But it is I think interesting that uh modern science now looks back and said and says hey you know what I mean sure it was a lot of bunk and BS involved uh but some of the foundations of modern chemistry were there even though that wasn't their intention really.",
        "chunkId": "ck-sP7saTy_mFI-2",
        "chunkNum": 2,
        "relevance": 8.8,
        "interesting": 7.9
      },
      {
        "text": "China and its uh alchemists put together mercury, arsenic, sulfur and said, \"Here, drink this.\"",
        "chunkId": "ck-sP7saTy_mFI-6",
        "chunkNum": 6,
        "relevance": 9,
        "interesting": 8.5
      },
      {
        "text": "They wanted to create gold to end poverty, and they wanted to find the elixir of life to end disease.",
        "chunkId": "ck-sP7saTy_mFI-28",
        "chunkNum": 28,
        "relevance": 8.1,
        "interesting": 7.7
      },
      {
        "text": "Isaac Newton was not the first scientist, he was the last alchemist.",
        "chunkId": "ck-sP7saTy_mFI-43",
        "chunkNum": 43,
        "relevance": 8.5,
        "interesting": 8
      }
    ],
    "topTopics": [
      {
        "name": "history alchemy",
        "count": 10,
        "description": "The ancient practice of alchemy and its goals."
      },
      {
        "name": "immortality pursuit",
        "count": 7,
        "description": "The pursuit of immortality through alchemy."
      },
      {
        "name": "philosophers stone",
        "count": 6,
        "description": "The creation of the philosopher's stone."
      },
      {
        "name": "scientific method",
        "count": 5,
        "description": "The scientific method and its origins."
      },
      {
        "name": "creating homunculi",
        "count": 4,
        "description": "The creation of artificial humans."
      }
    ],
    "videoInfo": {
      "id": "sP7saTy_mFI",
      "etag": "irWOUnI2LhipeANGENQ1lsWbVS4",
      "kind": "youtube#video",
      "snippet": {
        "tags": [
          "Stuff You Should Know",
          "Stuff You Should Know Podcast",
          "Stuff You Should Know About",
          "Stuff You Should Know Hosts",
          "Best Stuff You Should Know Episodes",
          "Stuff You Should Know Trivial Pursuit",
          "Josh Clark",
          "Chuck Bryant",
          "HowStuffWorks",
          "how stuff works",
          "josh and chuck",
          "stuff you should know",
          "podcast",
          "chuck",
          "josh",
          "podcasting",
          "stuff",
          "iHeartRadio podcast",
          "podcast network",
          "podcast show",
          "radio podcast",
          "podcast interview",
          "SYSK"
        ],
        "title": "How Alchemy Worked | STUFF YOU SHOULD KNOW",
        "channelId": "UCTb6Oy0TXI03iEUdRMR9dnw",
        "localized": {
          "title": "How Alchemy Worked | STUFF YOU SHOULD KNOW",
          "description": "🛎  If You're New Subscribe ► https://bit.ly/SYSKSubscribe\n\nHow Alchemy Worked | STUFF YOU SHOULD KNOW\n\nAlchemy evokes sorcerers working by candlelight combining potions to create magical items, real Dungeons & Dragons stuff. But alchemy gets a bad rap. Alchemists had lofty goals like curing poverty and their work laid the foundation for science to come.\n\nOriginal Air Date: July 17, 2025\n\n❤️ iHeartRadio » https://ihr.fm/3DyBDna\n📢 APPLE PODCASTS » https://apple.co/3SKFZMe\n📢 AMAZON MUSIC » https://amzn.to/3WgBVq1\n🟢 SPOTIFY » https://spoti.fi/3zvX3ij\n🎥 PREVIOUS VIDEO » https://youtu.be/NRHHxtI74Zk\n📕 GRAB YOUR COPY of Stuff You Should Read » https://bit.ly/3N9DuSm\n\n✨ KEEP IN TOUCH WITH :\nFACEBOOK » https://bit.ly/3DeXKxB\nTWITTER » https://bit.ly/3NbH9PM\nINSTAGRAM » https://bit.ly/3N9rosu\nGOOGLE+ » https://bit.ly/3TJW6v0\n\nIf you've ever wanted to know about champagne, satanism, the Stonewall Uprising, chaos theory, LSD, El Nino, true crime and Rosa Parks, then look no further. Josh and Chuck have you covered, a podcast by iHeartRadio.\n\nNew episodes daily on iHeartRadio.\n\n#StuffYouShouldKnow #StuffYouShouldKnowPodcast #StuffYouShouldKnowAbout #StuffYouShouldKnowHosts #BestStuffYouShouldKnowEpisodes #StuffYouShouldKnowTrivialPursuit"
        },
        "categoryId": "28",
        "thumbnails": {
          "high": {
            "url": "https://i.ytimg.com/vi/sP7saTy_mFI/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/sP7saTy_mFI/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/sP7saTy_mFI/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "default": {
            "url": "https://i.ytimg.com/vi/sP7saTy_mFI/default.jpg",
            "width": 120,
            "height": 90
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/sP7saTy_mFI/sddefault.jpg",
            "width": 640,
            "height": 480
          }
        },
        "description": "🛎  If You're New Subscribe ► https://bit.ly/SYSKSubscribe\n\nHow Alchemy Worked | STUFF YOU SHOULD KNOW\n\nAlchemy evokes sorcerers working by candlelight combining potions to create magical items, real Dungeons & Dragons stuff. But alchemy gets a bad rap. Alchemists had lofty goals like curing poverty and their work laid the foundation for science to come.\n\nOriginal Air Date: July 17, 2025\n\n❤️ iHeartRadio » https://ihr.fm/3DyBDna\n📢 APPLE PODCASTS » https://apple.co/3SKFZMe\n📢 AMAZON MUSIC » https://amzn.to/3WgBVq1\n🟢 SPOTIFY » https://spoti.fi/3zvX3ij\n🎥 PREVIOUS VIDEO » https://youtu.be/NRHHxtI74Zk\n📕 GRAB YOUR COPY of Stuff You Should Read » https://bit.ly/3N9DuSm\n\n✨ KEEP IN TOUCH WITH :\nFACEBOOK » https://bit.ly/3DeXKxB\nTWITTER » https://bit.ly/3NbH9PM\nINSTAGRAM » https://bit.ly/3N9rosu\nGOOGLE+ » https://bit.ly/3TJW6v0\n\nIf you've ever wanted to know about champagne, satanism, the Stonewall Uprising, chaos theory, LSD, El Nino, true crime and Rosa Parks, then look no further. Josh and Chuck have you covered, a podcast by iHeartRadio.\n\nNew episodes daily on iHeartRadio.\n\n#StuffYouShouldKnow #StuffYouShouldKnowPodcast #StuffYouShouldKnowAbout #StuffYouShouldKnowHosts #BestStuffYouShouldKnowEpisodes #StuffYouShouldKnowTrivialPursuit",
        "publishedAt": "2025-07-18T00:00:56Z",
        "channelTitle": "Stuff You Should Know",
        "defaultAudioLanguage": "en",
        "liveBroadcastContent": "none"
      },
      "statistics": {
        "likeCount": "8",
        "viewCount": "114",
        "commentCount": "1",
        "favoriteCount": "0"
      },
      "contentDetails": {
        "caption": "false",
        "duration": "PT43M29S",
        "dimension": "2d",
        "definition": "hd",
        "projection": "rectangular",
        "contentRating": {},
        "licensedContent": true
      }
    },
    "checkCount": 7,
    "nodeCounts": [
      {
        "node": "alchemy",
        "count": 19
      },
      {
        "node": "alchemists",
        "count": 13
      },
      {
        "node": "philosopher-s-stone",
        "count": 7
      },
      {
        "node": "immortality",
        "count": 6
      },
      {
        "node": "chemistry",
        "count": 5
      },
      {
        "node": "chuck",
        "count": 4
      },
      {
        "node": "podcast",
        "count": 3
      },
      {
        "node": "aristotle",
        "count": 3
      },
      {
        "node": "sorcerer-stone",
        "count": 3
      },
      {
        "node": "iheartradio",
        "count": 2
      },
      {
        "node": "charlatans",
        "count": 2
      },
      {
        "node": "elixir",
        "count": 2
      },
      {
        "node": "bolos-of-mende",
        "count": 2
      },
      {
        "node": "alchemy-writing",
        "count": 2
      },
      {
        "node": "western-alchemy",
        "count": 2
      },
      {
        "node": "hermes",
        "count": 2
      },
      {
        "node": "experimentation",
        "count": 2
      },
      {
        "node": "elixir-of-life",
        "count": 2
      },
      {
        "node": "harry-potter",
        "count": 2
      },
      {
        "node": "paracelis",
        "count": 2
      },
      {
        "node": "homunculi",
        "count": 2
      },
      {
        "node": "70s-television",
        "count": 2
      },
      {
        "node": "isaac-newton",
        "count": 2
      },
      {
        "node": "josh",
        "count": 1
      },
      {
        "node": "jerry",
        "count": 1
      },
      {
        "node": "clumsy-compliment",
        "count": 1
      },
      {
        "node": "magician",
        "count": 1
      },
      {
        "node": "pointy-hat",
        "count": 1
      },
      {
        "node": "laboratory",
        "count": 1
      },
      {
        "node": "magical-potion",
        "count": 1
      },
      {
        "node": "bunk",
        "count": 1
      },
      {
        "node": "medieval-european",
        "count": 1
      },
      {
        "node": "traditions",
        "count": 1
      },
      {
        "node": "transformation",
        "count": 1
      },
      {
        "node": "europeans",
        "count": 1
      },
      {
        "node": "arabic",
        "count": 1
      },
      {
        "node": "medieval-times",
        "count": 1
      },
      {
        "node": "alchemical-pursuits",
        "count": 1
      },
      {
        "node": "daoism",
        "count": 1
      },
      {
        "node": "dowist-population",
        "count": 1
      },
      {
        "node": "mercury-arsenic-sulfur",
        "count": 1
      },
      {
        "node": "alchemy-experiments",
        "count": 1
      },
      {
        "node": "potassium-nitrate",
        "count": 1
      },
      {
        "node": "ammonium-chloride",
        "count": 1
      },
      {
        "node": "fertilizer",
        "count": 1
      },
      {
        "node": "buddhism",
        "count": 1
      },
      {
        "node": "rebirth",
        "count": 1
      },
      {
        "node": "special-elixir",
        "count": 1
      },
      {
        "node": "buddhists",
        "count": 1
      },
      {
        "node": "white-snake-joke",
        "count": 1
      },
      {
        "node": "gold-t-shirt",
        "count": 1
      },
      {
        "node": "devils-hands",
        "count": 1
      },
      {
        "node": "devil-horns",
        "count": 1
      },
      {
        "node": "mediterranean",
        "count": 1
      },
      {
        "node": "astrology",
        "count": 1
      },
      {
        "node": "medieval-monks",
        "count": 1
      },
      {
        "node": "early-scientists",
        "count": 1
      },
      {
        "node": "best-practices",
        "count": 1
      },
      {
        "node": "podcast-episode",
        "count": 1
      },
      {
        "node": "alchemy-books",
        "count": 1
      },
      {
        "node": "mystical-things",
        "count": 1
      },
      {
        "node": "valuable-metals",
        "count": 1
      },
      {
        "node": "alchemy-recipes",
        "count": 1
      },
      {
        "node": "secretive-alchemy",
        "count": 1
      },
      {
        "node": "greco-egyptian-creation",
        "count": 1
      },
      {
        "node": "melding-traditions",
        "count": 1
      },
      {
        "node": "henistic-alchemy",
        "count": 1
      },
      {
        "node": "hermes-tris-magestos",
        "count": 1
      },
      {
        "node": "toth",
        "count": 1
      },
      {
        "node": "ibis-bird-head",
        "count": 1
      },
      {
        "node": "medieval-alchemists",
        "count": 1
      },
      {
        "node": "synret-syncization",
        "count": 1
      },
      {
        "node": "alchemical-text",
        "count": 1
      },
      {
        "node": "meisto",
        "count": 1
      },
      {
        "node": "protoarans",
        "count": 1
      },
      {
        "node": "historians",
        "count": 1
      },
      {
        "node": "debating-origins",
        "count": 1
      },
      {
        "node": "culture-origins",
        "count": 1
      },
      {
        "node": "zoamos-of-panopoulos",
        "count": 1
      },
      {
        "node": "arabic-libraries",
        "count": 1
      },
      {
        "node": "historical-preservation",
        "count": 1
      },
      {
        "node": "transforming-metals",
        "count": 1
      },
      {
        "node": "tools",
        "count": 1
      },
      {
        "node": "kitchen-tools",
        "count": 1
      },
      {
        "node": "bedazzler",
        "count": 1
      },
      {
        "node": "perfume-making",
        "count": 1
      },
      {
        "node": "balmarie",
        "count": 1
      },
      {
        "node": "bano-maria",
        "count": 1
      },
      {
        "node": "chocolate-chips",
        "count": 1
      },
      {
        "node": "zozimos",
        "count": 1
      },
      {
        "node": "penopoulos",
        "count": 1
      },
      {
        "node": "scientific-processes",
        "count": 1
      },
      {
        "node": "disemboding",
        "count": 1
      },
      {
        "node": "embodying",
        "count": 1
      },
      {
        "node": "protoscientific",
        "count": 1
      },
      {
        "node": "distill",
        "count": 1
      },
      {
        "node": "vapors",
        "count": 1
      },
      {
        "node": "boil",
        "count": 1
      },
      {
        "node": "properties",
        "count": 1
      },
      {
        "node": "zamos",
        "count": 1
      },
      {
        "node": "bolos",
        "count": 1
      },
      {
        "node": "democritus",
        "count": 1
      },
      {
        "node": "atoms",
        "count": 1
      },
      {
        "node": "egyptians",
        "count": 1
      },
      {
        "node": "egyptians-greeks",
        "count": 1
      },
      {
        "node": "cultural-exchange",
        "count": 1
      },
      {
        "node": "alchemy-stuff",
        "count": 1
      },
      {
        "node": "logging-stuff",
        "count": 1
      },
      {
        "node": "legit-chemists",
        "count": 1
      },
      {
        "node": "heat-coldness-dryness-moisture",
        "count": 1
      },
      {
        "node": "produce-vapors",
        "count": 1
      },
      {
        "node": "cold-water-hot-moist-air",
        "count": 1
      },
      {
        "node": "mercury-sulfur",
        "count": 1
      },
      {
        "node": "chrysio-pouya",
        "count": 1
      },
      {
        "node": "razis",
        "count": 1
      },
      {
        "node": "jabir",
        "count": 1
      },
      {
        "node": "arabic-translations",
        "count": 1
      },
      {
        "node": "latin-translations",
        "count": 1
      },
      {
        "node": "12th-century-europe",
        "count": 1
      },
      {
        "node": "academic",
        "count": 1
      },
      {
        "node": "monasteries",
        "count": 1
      },
      {
        "node": "christian-scholars",
        "count": 1
      },
      {
        "node": "ancient-texts",
        "count": 1
      },
      {
        "node": "mineral-acids",
        "count": 1
      },
      {
        "node": "arabia",
        "count": 1
      },
      {
        "node": "crusades",
        "count": 1
      },
      {
        "node": "willie-the-wizard",
        "count": 1
      },
      {
        "node": "magical-properties",
        "count": 1
      },
      {
        "node": "metals",
        "count": 1
      },
      {
        "node": "secrecy",
        "count": 1
      },
      {
        "node": "albertus-magnus",
        "count": 1
      },
      {
        "node": "dominican-friar",
        "count": 1
      },
      {
        "node": "greek-philosophers",
        "count": 1
      },
      {
        "node": "roger-bacon",
        "count": 1
      },
      {
        "node": "jealad-tad",
        "count": 1
      },
      {
        "node": "chrysopooya",
        "count": 1
      },
      {
        "node": "franciscan-monk",
        "count": 1
      },
      {
        "node": "vow-of-poverty",
        "count": 1
      },
      {
        "node": "poverty-vow",
        "count": 1
      },
      {
        "node": "distilling",
        "count": 1
      },
      {
        "node": "aqua-vitae",
        "count": 1
      },
      {
        "node": "quinta-essentia",
        "count": 1
      },
      {
        "node": "meat-preservation",
        "count": 1
      },
      {
        "node": "mai",
        "count": 1
      },
      {
        "node": "philipus-theoprastus-orololis-bombastus-von-ho-hohheim",
        "count": 1
      },
      {
        "node": "phil-hohenheim",
        "count": 1
      },
      {
        "node": "four-humors",
        "count": 1
      },
      {
        "node": "tiny-bugs",
        "count": 1
      },
      {
        "node": "black-bile",
        "count": 1
      },
      {
        "node": "nicholas-flamel",
        "count": 1
      },
      {
        "node": "book-seller",
        "count": 1
      },
      {
        "node": "hospitals",
        "count": 1
      },
      {
        "node": "alchemical-messages",
        "count": 1
      },
      {
        "node": "plaques",
        "count": 1
      },
      {
        "node": "archways",
        "count": 1
      },
      {
        "node": "lifespan",
        "count": 1
      },
      {
        "node": "gap",
        "count": 1
      },
      {
        "node": "1400s",
        "count": 1
      },
      {
        "node": "alchemists-europe",
        "count": 1
      },
      {
        "node": "creating-humans",
        "count": 1
      },
      {
        "node": "wacky-ideas",
        "count": 1
      },
      {
        "node": "plato",
        "count": 1
      },
      {
        "node": "homunculus-recipe",
        "count": 1
      },
      {
        "node": "simulating-u",
        "count": 1
      },
      {
        "node": "human-sperm",
        "count": 1
      },
      {
        "node": "shapeless-form",
        "count": 1
      },
      {
        "node": "glass-container",
        "count": 1
      },
      {
        "node": "richie",
        "count": 1
      },
      {
        "node": "chalk-message",
        "count": 1
      },
      {
        "node": "incriminating-sheep",
        "count": 1
      },
      {
        "node": "richie-cunningham",
        "count": 1
      },
      {
        "node": "brady-bunch",
        "count": 1
      },
      {
        "node": "greg",
        "count": 1
      },
      {
        "node": "goat-mascot",
        "count": 1
      },
      {
        "node": "goat",
        "count": 1
      },
      {
        "node": "cape",
        "count": 1
      },
      {
        "node": "metallurgical-processes",
        "count": 1
      },
      {
        "node": "medicines",
        "count": 1
      },
      {
        "node": "philosophers",
        "count": 1
      },
      {
        "node": "romantic-chemistry",
        "count": 1
      },
      {
        "node": "occult-concepts",
        "count": 1
      },
      {
        "node": "18th-century",
        "count": 1
      },
      {
        "node": "protecting-image",
        "count": 1
      },
      {
        "node": "scientific-forebears",
        "count": 1
      },
      {
        "node": "scientist",
        "count": 1
      },
      {
        "node": "dungeon-synth",
        "count": 1
      },
      {
        "node": "witchbolt",
        "count": 1
      },
      {
        "node": "high-mage-productions",
        "count": 1
      },
      {
        "node": "heavy-metal-parking-lot",
        "count": 1
      },
      {
        "node": "maximillian-ii",
        "count": 1
      },
      {
        "node": "rudolph-ii",
        "count": 1
      },
      {
        "node": "neil-diamond-parking-lot",
        "count": 1
      },
      {
        "node": "stuff-podcastartradio-com",
        "count": 1
      },
      {
        "node": "matthew-t",
        "count": 1
      },
      {
        "node": "cleveland-ohio",
        "count": 1
      },
      {
        "node": "apple-podcasts",
        "count": 1
      }
    ],
    "topicGroups": {
      "groups": [
        {
          "topics": [
            "alchemy",
            "alchemists",
            "philosopher-s-stone",
            "elixir",
            "alchemy-writing",
            "western-alchemy",
            "hermes",
            "elixir-of-life",
            "paracelis",
            "alchemical-pursuits",
            "alchemy-experiments",
            "secretive-alchemy",
            "henistic-alchemy",
            "hermes-tris-magestos",
            "alchemical-text",
            "medieval-alchemists",
            "transforming-metals",
            "zoamos-of-panopoulos",
            "zozimos"
          ],
          "category": {
            "id": "alchemy",
            "name": "Alchemy",
            "description": "The history and practice of alchemy."
          }
        },
        {
          "topics": [
            "aristotle",
            "bolos-of-mende",
            "isaac-newton",
            "paracelis",
            "hermes",
            "hermes-tris-magestos",
            "toth",
            "ibis-bird-head",
            "zoamos-of-panopoulos",
            "zozimos"
          ],
          "category": {
            "id": "historical-figures",
            "name": "Historical Figures",
            "description": "Historical figures and their contributions."
          }
        },
        {
          "topics": [
            "alchemy",
            "philosopher-s-stone",
            "immortality",
            "elixir",
            "elixir-of-life",
            "homunculi",
            "transformation",
            "rebirth",
            "special-elixir",
            "valuable-metals",
            "transforming-metals",
            "disemboding",
            "embodying"
          ],
          "category": {
            "id": "goals-and-concepts",
            "name": "Goals and Concepts",
            "description": "Concepts and goals within alchemy."
          }
        },
        {
          "topics": [
            "chemistry",
            "astrology",
            "daoism",
            "buddhism",
            "protoarans",
            "perfume-making"
          ],
          "category": {
            "id": "related-fields",
            "name": "Related Fields",
            "description": "Related fields and practices."
          }
        },
        {
          "topics": [
            "podcast",
            "chuck",
            "josh",
            "jerry",
            "podcast-episode",
            "iheartradio"
          ],
          "category": {
            "id": "podcast",
            "name": "Podcast",
            "description": "Podcast and episode details."
          }
        },
        {
          "topics": [
            "mercury-arsenic-sulfur",
            "potassium-nitrate",
            "ammonium-chloride",
            "experimentation",
            "distill",
            "vapors",
            "boil",
            "properties",
            "laboratory",
            "tools",
            "kitchen-tools",
            "balmarie",
            "bano-maria"
          ],
          "category": {
            "id": "materials-and-processes",
            "name": "Materials and Processes",
            "description": "Materials and processes used in alchemy."
          }
        },
        {
          "topics": [
            "medieval-european",
            "europeans",
            "arabic",
            "medieval-times",
            "daoism",
            "buddhism",
            "mediterranean",
            "medieval-monks",
            "greco-egyptian-creation",
            "protoarans",
            "culture-origins",
            "arabic-libraries",
            "historical-preservation",
            "melding-traditions",
            "synret-syncization"
          ],
          "category": {
            "id": "historical-context",
            "name": "Historical Context",
            "description": "Historical and cultural contexts."
          }
        },
        {
          "topics": [
            "charlatans",
            "bunk",
            "clumsy-compliment",
            "devil-horns",
            "devils-hands"
          ],
          "category": {
            "id": "skepticism-and-criticism",
            "name": "Skepticism and Criticism",
            "description": "Elements of skepticism and criticism."
          }
        },
        {
          "topics": [
            "harry-potter",
            "sorcerer-stone",
            "70s-television",
            "magician",
            "pointy-hat",
            "white-snake-joke",
            "gold-t-shirt",
            "clumsy-compliment"
          ],
          "category": {
            "id": "pop-culture",
            "name": "Pop Culture",
            "description": "Fictional and pop culture references."
          }
        },
        {
          "topics": [
            "chemistry",
            "experimentation",
            "early-scientists",
            "scientific-processes",
            "protoscientific"
          ],
          "category": {
            "id": "science",
            "name": "Science",
            "description": "Related to the study of science."
          }
        },
        {
          "topics": [
            "alchemy-books",
            "alchemy-recipes",
            "fertilizer",
            "bedazzler",
            "chocolate-chips"
          ],
          "category": {
            "id": "practices-and-items",
            "name": "Practices and Items",
            "description": "Items and practices of the time."
          }
        },
        {
          "topics": [
            "alchemists",
            "magician",
            "historians",
            "medieval-alchemists",
            "dowist-population",
            "buddhists",
            "penopoulos",
            "meisto",
            "zamos"
          ],
          "category": {
            "id": "people",
            "name": "People",
            "description": "People and their roles."
          }
        },
        {
          "topics": [
            "mystical-things",
            "rebirth",
            "daoism",
            "buddhism",
            "toth",
            "ibis-bird-head"
          ],
          "category": {
            "id": "mystical-and-spiritual",
            "name": "Mystical and Spiritual",
            "description": "Mystical and spiritual aspects."
          }
        },
        {
          "topics": [
            "debating-origins",
            "melding-traditions",
            "synret-syncization",
            "best-practices"
          ],
          "category": {
            "id": "discussions-and-debates",
            "name": "Discussions and Debates",
            "description": "Discussions and debates."
          }
        }
      ]
    },
    "shortSummary": "This episode of Stuff You Should Know delves into the history and practice of alchemy, exploring its goals, methods, and lasting impact on science.",
    "lastStoryCheck": "2025-07-18T02:04:27.343Z",
    "storyCheckResults": {
      "missingChunks": [],
      "missingStories": [],
      "totalCategories": 9,
      "totalChunksChecked": 46
    }
  }
}