{
  "episode": {
    "id": "cp1lprZUQcE",
    "title": "James Holland: World War II, Hitler, Churchill, Stalin & Biggest Battles | Lex Fridman Podcast #470",
    "publishedAt": "2025-05-24T19:55:21.000Z",
    "description": "James Holland is a historian specializing in World War II. He hosts a podcast called WW2 Pod: We Have Ways of Making You Talk.\nThank you for listening ❤ Check out our sponsors: https://lexfridman.com/sponsors/ep470-sb\nSee below for timestamps, transcript, and to give feedback, submit questions, contact Lex, etc.\n\n*Transcript:*\nhttps://lexfridman.com/james-holland-transcript\n\n*CONTACT LEX:*\n*Feedback* - give feedback to Lex: https://lexfridman.com/survey\n*AMA* - submit questions, videos or call-in: https://lexfridman.com/ama\n*Hiring* - join our team: https://lexfridman.com/hiring\n*Other* - other ways to get in touch: https://lexfridman.com/contact\n\n*EPISODE LINKS:*\nJames's Books: https://amzn.to/4caapmt\nJames's X: https://x.com/James1940\nJames's Instagram: https://instagram.com/jamesholland1940\nJames's Substack: https://james1940.substack.com\nWW2 Pod (Podcast - Apple): https://apple.co/4l93Dl3\nWW2 Pod (Podcast - YouTube): https://www.youtube.com/@wehaveways\nWW2 Pod (Podcast - Spotify): https://open.spotify.com/show/34VlAepHmeloDD76RX4jtc\nWW2 Pod (Podcast - X): https://x.com/WeHaveWaysPod\n\n*SPONSORS:*\nTo support this podcast, check out our sponsors & get discounts:\n*Shopify:* Sell stuff online.\nGo to https://lexfridman.com/s/shopify-ep470-sb\n*LMNT:* Zero-sugar electrolyte drink mix.\nGo to https://lexfridman.com/s/lmnt-ep470-sb\n*AG1:* All-in-one daily nutrition drink.\nGo to https://lexfridman.com/s/ag1-ep470-sb\n*Notion:* Note-taking and team collaboration.\nGo to https://lexfridman.com/s/notion-ep470-sb\n\n*OUTLINE:*\n0:00 - Episode highlight\n0:26 - Introduction\n1:13 - World War II\n11:11 - Lebensraum and Hitler ideology\n18:23 - Operation Barbarossa\n34:36 - Hitler vs Europe\n56:22 - Joseph Goebbels\n1:06:17 - Hitler before WW2\n1:11:12 - Hitler vs Chamberlain\n1:33:18 - Invasion of Poland\n1:37:55 - Molotov–Ribbentrop Pact\n1:45:56 - Winston Churchill\n2:09:56 - Most powerful military in WW2\n2:32:18 - Tanks\n2:42:17 - Battle of Stalingrad\n2:55:09 - Concentration camps\n3:04:40 - Battle of Normandy\n3:18:32 - Lessons from WW2\n\n*PODCAST LINKS:*\n- Podcast Website: https://lexfridman.com/podcast\n- Apple Podcasts: https://apple.co/2lwqZIr\n- Spotify: https://spoti.fi/2nEwCF8\n- RSS: https://lexfridman.com/feed/podcast/\n- Podcast Playlist: https://www.youtube.com/playlist?list=PLrAXtmErZgOdP_8GztsuKi9nrraNbKKp4\n- Clips Channel: https://www.youtube.com/lexclips\n\n*SOCIAL LINKS:*\n- X: https://x.com/lexfridman\n- Instagram: https://instagram.com/lexfridman\n- TikTok: https://tiktok.com/@lexfridman\n- LinkedIn: https://linkedin.com/in/lexfridman\n- Facebook: https://facebook.com/lexfridman\n- Patreon: https://patreon.com/lexfridman\n- Telegram: https://t.me/lexfridman\n- Reddit: https://reddit.com/r/lexfridman"
  },
  "channel": {
    "id": "UCSHZKyawb77ixDdsGog4iWA",
    "name": "Lex Fridman",
    "slug": "@lexfridman",
    "url": "https://www.youtube.com/@lexfridman"
  },
  "transcript": "And you see that manifest itself on D-Day, where you've got 6,939 vessels, of which there are 1,213 warships, 4,127 assaultcraft, 155,000 men landed and dropped from the air in a 24-hour period.\nIt is phenomenal.\nIt is absolutely phenomenal.\nThe following is a conversation with James Holland, a historian specializing in World War II, who has written a lot of amazing books on the subject, especially covering the Western Front, often providing fascinating details at multiple levels of analysis, including strategic, operational, tactical, technological, and of course, the human side, the personal accounts from the war.\nHe also co-hosts a great podcast on World War II called We Have Ways of Making You Talk.\nThis is a Lex Fridman Podcast.\nTo support it, please check out our sponsors in the description or at lexfreeman.com/sponsors.\nAnd now, dear friends, here's James Holland.\nIn volume one of the war in the west, your book series on World War II, you write, \"The Second World War witnessed the deaths of more than 60 million people from over 60 different countries.\nEntire cities were laid waste.\nNational borders were redrawn.\nAnd many millions more people found themselves displaced.\nOver the past couple of decades, many of those living in the Middle East or parts of Africa, the Balkans, Afghanistan, and even the United States may feel justifiably that these troubled times have already proved the most traumatic in their recent past.\nYet, globally, the Second World War was and remains the single biggest catastrophe of modern history.\nIn terms of human drama, it is unrivaled.\nNo other war has affected so many lives in such a large number of countries.\nSo what to you makes World War II the biggest catastrophe in human drama in modern history and maybe from a historian perspective the most fascinating subject to study?\"\nThe thing about World War II is it really is truly global.\nYou know, it's fought in deserts.\nIt's fought in the Arctic.\nIt's fought across oceans.\nIt's fought in the air.\nIt's in jungle.\nIt's in the hills.\nIt is on the beaches.\nIt's also on the Russian step and it's also in Ukraine.\nSo it's that global nature of it.\nAnd I just think, you know, where there's war, there is always incredible human drama.\nAnd I think for most people, and certainly the true in my case, you get drawn to the human drama of it.\nIt's that thought that, you know, gosh, if I'd been 20 years old, how would I have dealt with it?\nYou know, would I have been in the army?\nWould I have been in the air force?\nWould I been on a Royal Navy destroyer, or you know, how would I have coped with it and how would I have dealt with that separation?\nI mean, I've interviewed people who were away for four years.\nI remember talking to a tank man from Liverpool in England called Sam Bradshaw, and he went away for four years, and when he came home, he'd been twice wounded.\nHe'd been very badly wounded in North Africa, and then he was shot in the neck in Italy.\nEventually got home, and when he came home, his mother had turned gray.\nHis little baby sister, who had been, you know, 13 when he left, was now a young woman.\nHis old school had been destroyed by Luftwaffer bombs.\nHe didn't recognize the place.\nAnd do you know what he did?\nHe joined up again, went back out of Europe and was one of the first people in Bellson.\nSo, you know, what was his justification for that for joining right back?\nHe just felt completely disconnected to home.\nHe felt that the gulf of time, his experiences had separated him from all the normalities of life.\nAnd he felt that the normalities of the life that he had known before he'd gone away to war had just been severed in a really kind of cruel way that he didn't really feel he was able to confront at that particular point, but he decided to rejoin.\nCouldn't go back to the Third World Royal Tank Regiment.\nSo, it went back to a different unit.\nWent from kind of the Italian campaign to European theater.\nDidn't see so much action at the end, but you know, like a lot of British troops, if you were in a certain division at a certain time, you know, you ended up passing very close to Bellson, and you know, you suddenly realized, okay, this was the right thing to do, you know, we did have to get rid of Nazism, we did have to do this because this is the consequence.\nIt's not just the oppression, it's just not just the secret police, it's not just the expansionism of Nazism, it is also, you know, the Holocaust, which hadn't been given its name at that point, but you know, you're witnessing this kind of untold or cruelty.\nAnd I always, you know, I've always sort of I think a lot about Sam.\nI mean, he's no longer with us, but um, he was one of the kind of first people that I interviewed, and I interviewed him at great length.\nAnd, um, and I know you like a long interview, Lex.\nAnd, um, and I totally, totally get that because when you have a long interview, you really start getting to the nuts and bolts of it.\nOne of the frustrations for me when I'm looking at oral histories of Second World War vets is usually they're kind of, you know, they're put on YouTube or they're put on a museum website, they're 30 minutes, you know, an hour if you're lucky, and there you're just scratching the surface.\nYou never, you never really get to know it, and you feel that they're just repeating kind of stuff they've read in books themselves after the war and stuff.\nAnd you know, I was kind of leave feeling frustrated that that I haven't had a chance to kind of grill them on the kind of stuff that I would grill them on if I was put in front of them.\nSo, Tank Man, what was maybe the most epic, the most intense, or the most interesting story that he told you?\nWell, I do remember him telling me, uh, funny enough, it's not really about the conflict.\nI remember him telling me about the importance of letters.\nAnd there was this guy who literally every few weeks, you know, post would arrive intermitt\n\n\nApparently, there was no kind of sort of regular post.\nSo it was supposed to be regular, but it didn't come around regularly.\nSo you might suddenly get a flurry of five all in one day.\nBut he said it was this guy and um in his tank, a member of a different tank troop.\nIt was a good friend of his in the same squadron.\nGet British Huff Squadrons for their armor and uh which as Americans would have a company.\nI should say that in your book, one of the wonderful things you do is you use the correct term in the language.\nFor the particular army involved, whether it's the German or the British or the American.\nWell, that's not to be pretentious.\nThat's really just so it because you're dealing with so many numbers and different units and it can go over your head and you can get sort of consumed by the detail if you're not careful.\nAnd as a reader, it can be very unsatisfying because you just can't keep pace of everything.\nUm, so one of the things about writing in the vernacular German or or in the American spelling armore rather than ar maua as we would Brits would um spell it is it just immediately tells the reader, okay, this is American, okay, I've got that or this is German, I've got that or Italian or whatever it might be.\nBut yeah, to go back to Sam.\nSam, this there was this guy in in in his squadron and he'd get his letters from his girlfriend, his wife, and he said it was like it was like a soap opera.\nHe said we all just waited for his letters to come in so we could find out, you know, whether his, you know, his daughter had, you know, got to school, okay, or something, you know, won the swimming contest or whatever it was.\nYou know, the sort of details of this sort of day-to-day kind of benile life was just absolute catnip to these guys.\nThey absolutely loved it.\nAnd then the letter arrived, the Dear John letter, saying, \"Sorry, I found someone else and and it's over.\"\nAnd his friend was just absolutely devastated.\nIt was the only thing that was keeping him going.\nThis sort of sense of this sort of continuity of of home, this sort of this this foundation of his life back at home.\nAnd Sam said he could see was in a really really bad way.\nMhm.\nAnd he thought, uh, he's going to do something stupid.\nAnd he went up to him and he said, \"Look, you know, I know it's bad and I know it's terrible and I know you're absolutely devastated, but you got your mates here.\nJust don't do anything silly.\nJust, you know, maybe, you know, when it's all over, you can patch things up or sort things out.\"\nAnd he said, you know, you got to understand it from her point of view.\nYou know, it's a long way.\nYou haven't seen you for 2 years.\nThis kind of stuff, you know, so just just don't do anything rash.\nAnd of course, the next next engagement, two days later, he was killed.\nAnd he said it was just a kind of he could he just knew that was going to happen.\nHe said it was a sort of self-fulfilling prophecy.\nThat's something I've never forgotten that story.\nAnd I just thought, you know, it's about human drama.\nYou know, that's that's that's the truth of it.\nAnd how people react to this totally alien situation.\nYou know, for the most part, the Second World War is fought by ordinary everyday people doing extraordinary things.\nAnd I think that's something that's so fascinating.\nI suspect I I think I instinctively I'm quite slap dash I think.\nSo I think I would have I'd have bought it literally.\nI don't think it would have ended well for me.\nI just I'm just a bit careless.\nYeah.\nI think I also have an element in me where I can believe in the idea of nation and fight for a nation especially when the conflict is as grand.\nThere are things worse than death.\nYes.\nAs as the propaganda would explain very clearly but also in reality.\nYes.\nSo a nation you know France, Britain was you know maybe facing the prospect of being essentially enslaved.\nThe Soviet Union was facing the prospect of being enslaved literally.\nI mean it was very very clearly stated what they're going to do.\nThey're going to repopulate the land with Germanic people.\nSo well they're not just going to do that.\nThey're also going to starve lots and lots of um Soviet individuals to death by the hunger plan, for example, which is planned, you know, really very casually and not by the, you know, this is not SS units or anything like this.\nThis is the Vermach.\nThis is the economic division of the Obert Commando de Vermac, the German combined general staff.\nGeneral Gayorg Thomas comes up with you know and Herman Baka they come up with the uh who's the kind of minister for food they come up you know what are we going to do you know we haven't got enough food you know largely because German um farming is inefficient and they think well you know this is part of we'll go in and we'll take the food and there's been this colossal urbanization of the Soviet Union since the revolution in 1917 so they're just not going to get their food you know these these people in these cities cuz we're going to take it all and that's going to lead to that's going to lead to a lot of deaths.\nYou know, teen millions is the phrase that Gail Thomas used.\nSo, let's talk about the hunger plan.\nHow important was the hunger plan and lab to Nazi ideology and to the whole Nazi war machine?\nIt's central to the whole thing.\nThis is all about this notion that is embedded into Hitler's mind and into the minds of the Nazi party right from the word go is there is a big sort of global conspiracy the Jewish bolevik plot I mean completely misplaced that Jews and Bolsheviks go hand in hand somehow dovetail they don't obviously and the whole ideology is to crush this you know part of the way the Nazis think the way Hitler thinks is there is them and there's us.\nWe are the white northern European Aryans.\nWe should be\n\n\nThe master race. We've been threatened by a global Jewish bulvic plot. We've been stabbed in the back in 1918 at the end of the First World War. We need to overcome this. This is an existential battle for future survival. It's a terrible task that has befallen our generation, but we have to do this. We have to overcome this or else we have no future. We will be crushed. It's absolutely cut and dry. And one of the things about Hitler is that he is a very kind of black and white, them or us, either or kind of person. It's always one thing or the other. It's a thousand-year Reich or it's Armageddon. There is no middle ground. There's no gray area. It's just one or the other. And that's how that's his worldview. And the reason he came to the four was because of the crystal clear clarity of his message, which is we've been stabbed in the back. There is a global plot. We have to overcome this. We are naturally the master race. We have to reassert ourselves. We have to get rid of global jewelry. We have to get rid of global Bolshevism, and we have to prevail or else. But if we do prevail, what an amazing world it's going to be. So, so he starts with this, you know, every speech he does always starts with the same way. Always starts from a kind of negative and always ends with an incredible positive, this sort of rabble-rousing crescendo of, of, of, if you're in the front row, spittle halattosis and justiculation. I mean, you've seen pictures of him. I mean, I don't know if you've ever seen, but he's, he's, he's almost, he wants to grab the air and clutch it to him. Um, you know, you can see the kind of the venom coming out of his mouth just in a single still photograph. I mean, it, it, it's amazing. There's um, apps you can get now where where you can translate his speeches, you know, just, and it just sounds, you know, by today's standards, you would just think what a load of absolute wibble. I mean, just total nonsense. But, but you have to kind of put yourself back in the shoes of people listening to him in 1922 or 23 or indeed 1933 and see how kind of captivating that is to a certain part of the part of the population. So yes, so, so the, so to go back to your original point, Lebensraum is absolutely part of it. So what you do is you crush the Bolsheviks, you crush world jewelry, then you expand, you know, Britain has had this incredible empire, global empire, you know, Germany needs that too. Germany's stuck in Europe. It doesn't have access to the world's oceans. So, we're not going to be a maritime empire. We're going to be, we're going to be a land mass empire, the whole of land mass of Europe and into Asia. That's going to be us. And we're going to take that land. We're going to take the bread basket of Ukraine. We're going to use that for our own ends. We're going to spread our, our, uh, we're going to make ourselves rich, but we're also going to spread our peoples. We're going to spread the Aryan northern master race throughout, um, throughout Europe and into the traditional Slavic areas, and we will prevail and come out on top. And so you have to understand that that that everything about Operation Barbarossa, the planned invasion of the Soviet Union in June 1941, is totally wrapped up in the Nazi ideology. And people, you know, I, I've read it that historians go, if only Hitler had realized that, you know, the Ukrainians had been quite happy to kind of fight on his side. You know, if only he'd actually brought some of these Jewish scientists and kind of into the Nazi fold, then Germany might have prevailed in World War II. And you kind of think, well, you're missing the entire point. That's just never going to happen because this is an ideological war. Yeah. This is not a pragmatic, rational leader. No, I mean part of his effectiveness, we should say, is probably this singular belief in this ideology. There's pros and cons for an effective military machine, probably having that singular focus is effective. Yes. Except that when you're making military decisions, if those decisions are always being bracketed by an ideology which is fundamentally flawed from a pragmatic point of view as much as a kind of ethical, you know, a kind of reasonable point of view, um, you're kind of opening yourselves up for, for trouble. I mean, this is this is a problem he has with Barbarossa. You know, they, they realize very early on in 1941 when they're, when they're wargaming this whole operation that it's not going to work. And so, you know, there people like, like General Pow who's on the uh, general staff at the time, you know, he's, he's given a kind of, you know, he's in charge of kind of wargaming this and he goes, \"This isn't going to work.\" And Keitel, who is the uh, chief of the OKW, goes, \"No, no, no, no, no. Go back and make it work.\" He goes, \"Okay.\" So he comes up with a plan that does work, but it's bogus. I mean, it's just, it doesn't work because they don't have enough. They don't have enough motorization. You know, they go into Barbarossa with 2,000 different types of vehicle. You know, every single one of those vehicles has to have, you know, different distributor caps and different leads and plugs and all sorts of different parts. You know, there's the interoperability of the of the German mechanized arm is super inefficient. And so you've got huge problems because they kind of think, well, you know, we, we took France in 1940 and that's kind of one of the most modern countries in the world with, you know, one of the greatest armies and armed forces in the world, and we did that in six weeks. So, you know, Soviet Union, look, they struggled against Finland for goodness sake.\n\n\nI mean, how hard can it be, you know, but what you're failing to understand is that attacking the Soviet Union is over a geographical land mass 10 times the size of France just on the frontage, and you haven't really got much more mechanization than you had in May 1940 when they attacked the low countries in France, and you've actually got less Luftwaffe aircraft to support you, and you just do not have the operational mechanics to make it work successfully.\nI mean, it is largely down to incompetence of the Red Army and the Soviet leadership in the summer of 1941 that they get as far as they do.\nI mean, you know, Barbarossa should never have come close to being a victory.\nLet's talk through it.\nSo, Operation Barbar Roa that you're mentioning, and we'll go back.\nYes.\nWe jump straight into it.\nI've eaten off two years of war.\nSo this is June 1941, Operation Barbar Roa, when Hitler invades the Soviet Union with I think the largest invading force in history up to that point collectively.\nYeah.\nAnd there's three prongs: Army Group North, Army Group Center, Army Group South.\nNorth is going to Leningrad.\nCenter is going, uh, it's the strongest group going directly towards Moscow.\nAnd South is going and targeting Ukraine and the caucus.\nSo can you linger on that on the details of this plan?\nWhat was the thinking?\nWhat was the strategy?\nWhat was the tactics?\nWhat was the logistics?\nNow we should, there's so many things to say, but one of them is to say that you often emphasize the importance of three ways to analyze military conflict: the strategic, the operational, and the tactical.\nAnd operation of those is often not given enough time attention, and it's the logistics that make the war machine really work successfully or fail.\nYeah, that's absolutely, um, absolutely spot on.\nAnd it's interesting because the vast majority of, uh, general histories of World War II tend to focus on the strategic and the tactical.\nSo what do I mean by that?\nWorld strategic, just for the, for those who don't know, that's your overall war aims, you know, get to Moscow, whatever it might be, conquer the world, that's your strategy.\nThe tactical side of things is that's the coalace of war, that's the attritional bit, that's the following his spitfire, the tank crew, the soldier in his foxhole, it's the actual kinetic fighting bit.\nThe operational bit is the level of war that that links the strategic to the tactical, so it is absolutely factories, it's economics, it's shipping, it's supply chains, it's how you manage your war.\nAnd one of the things where I think people have been guilty in the past, historians have been guilty in the past is by judging warfare all on the same level.\nBut obviously every competent nation has a different approach to war because of the nation they are, the size they are, their geographical location.\nSo Britain, for example, is an island nation.\nIts priority is the Royal Navy, which is why the Royal Navy is known as the senior service.\nAnd you know, in 1939, it's easy to forget it now when you see how depleted Britain is today, but 1939, it has comfortably the world's largest, um, navy, something like 194 destroyers, uh, um, I think it's 15 battleships, seven aircraft carriers, and another kind of six on the way.\nAmerica, it's got Pacific Ocean, it's got the Atlantic Ocean, it's got two seabboards, you know, it has the second largest navy in the world, but a tiny army.\nI mean, the army, the US army in September 1949 is the 19th largest in the in the world, sandwiched between Portugal and Uruguay.\nAnd it's just incredible.\nIt's like 189,000 strong, which might seem reasonably large by today's standards, but is absolutely tiny by 1939 standards, you know.\nWhereas, you know, Germany's got an army of, you know, 3 and a half million in 1939.\nSo, you know, these are big, big, big differences, but but America's coming at it from a different perspective.\nBritain's coming up about it from a different perspective.\nYou know, Britain's, Britain's empire is all about, you know, it's, it's a shipping, it's a, it's a seaborn empire.\nWhereas there's also another point which, which is having large armies is actually inherently impractical and inefficient because the larger army, the more people you got to feed, the more kind of barracks you've got to have, the more space you've got to have for training, the more people you're taking out of your workforce to produce tanks and shells and all the rest of it because they're tramping around with rifles, you know.\nSo there's an argument saying, saying actually it's really not, not a very good way of doing things.\nSo, you know, very much the, uh, the British way and and subsequently the United States way and way of Britain's dominions and and and empire is to use kind of steel, not our flesh as a as a principle.\nThis is the idea is that you use technology, mechanization, modernity, global reach to do a lot of your hard yards.\nThat's the sort of basic principle behind the the strategic air campaign.\nWhen we talk about the strategic air campaign, we're talking about strategic air forces which are operating in isolation from other armed forces.\nSo a tactical air force, for example, is is an air force which is offering close air support for ground operations.\nA strategic air force has got nothing to do with ground operations.\nIt's just operating on its own.\nSo that's your bomber force or whatever, you know, that's your your your B7s and B244s of the Aair force flying out of East England bombing the rural industrial complex of Germany or whatever it might be.\nSo it's important to understand that when you compare, you have to have the back of your mind that Britain compared to Germany, for example, is coming at it from a completely different perspective.\nAnd I would say one of the failures of Hitler is that he always views everybody through his own very narrow worldview, which is not particularly helpful.\nYou know, you want to get inside the head of your enemy, and you know, he's he's sort of guilty of not doing that.\nSo when you're talking about operation Barbarasa, to go back back to your original question, next, you're dealing with an operation on such a vast scale that that operational level of war is absolutely vital to its chances of success or failure.\nDoesn't\n\n\nNo matter how good your individual commanders are at the front. If you haven't got the backup, it's not going to work. And the problem that the Germans have is, yes, they've got their kind of, you know, three million men on the front, and they've got their kind of, you know, 3,000 aircraft and all the rest of it. But actually, what you need to do is break it down and who is doing the hard yards of that. And the way the German war machine works is that the machine bit is only the spearhead. So people always talk about the Nazi war machine. In a way, it's a kind of misnomer because you're sort of suggesting that it's highly mechanized and industrialized and all the rest of it. And nothing could be further from the truth. The spearhead is, but the rest of it is not. And this is the kind of fatal flaw of the German armed forces in the whole of World War II really, but even in this early stage because in Operation Barbarossa, you're talking about 17 Panzer divisions out of, you know, 100 odd that are involved in the initial attack. Well, 17 that a Panzer division is not a division full of panzers tanks. It is a combined arms motorized outfit. So scouts on BMWs with side cars, uh, armored cars, infantry, grenadiers, panzer grenadiers, which are infantry in halftracks and trucks, mechanized, um, it is motorized artillery, it is motorized anti-aircraft artillery. It is motorized anti-tank artillery. And of course, it is tanks as well, panzers. But those are a really, really small proportion of, you know, you're talking less than 20% of your attacking force are those spearhead forces, and inevitably they are going to be attritted as they go. You know, you are going to take casualties, and not only that, you're not going to just take battlefield casualties, you're also going to have mechanical casualties because of the huge spaces involved. You just simply can't function. So what you see is in the initial phases of Operation Barbarossa, they surge forward. The Red Army's absolutely no answers to anything. Stalin, weirdly, hasn't heeded the all the warnings that this attack is brewing, and there have been plenty, incidentally. Smolensk falls on the 15th of July, you know, in less than four weeks. It's just incredible. Three and a half weeks has gone, you know, they've done overwhelmed the rest of what had been Poland. They surged into what is now Belarus, taken all, you know, this is Army Group Center. Uh, Army Group North is thrust up into the Baltic. It's all going swimmingly well, but then the next several months, they barely go 100 miles, and that's because they're running out of steam. And the 16th Panzer division, for example, by the time it's taken Smolensk, involved in taking Smolensk on the 15th of July 1941, the following day it's got 16 tanks left, 16 out of, you know, should have 180. So it's just being attritted. They can't sustain it, and they can't sustain it because as the Russians fall back, as the Soviet Red Army falls back, they do their own scorched earth policy. They also discover that the railway line is kind of a different loading gauge. So, they've got to change it. So, it's slightly, the Russian loading gauge is slightly wider. So, every single mile, every yard, every foot, every meter of that they're capturing of Russian railway has to be moved a couple of inches to the left to make it fit the German criggs lock in the standard train of locomotive of the Reichkes bar. Just imagine what that's like. And also, Soviet trains are bigger, so they can take more water, which means the water stops in between are fewer and far between. So they have to, the Germans when they come in, their trains, their creeks lock are smaller, so they have to be rewatered more often and recalled more often. So they have to, I mean, it's it's absolutely boggling just how complicated it is and how badly planned it is because they haven't reckoned on this. They're having to kind of think on their feet. I love the logistical details of all this because yes, that's a huge component of this, especially when you cover that much territory. But there is a notion that if Hitler didn't stop Army Group Center, it could have pushed all the way to Moscow. It was it was only maybe a 100 miles away from Moscow. Is that is that a possibility? Cuz it had so much success in the early days pushing forward. Do you think it's possible that if Hitler, as we mentioned from a military blunder perspective, didn't make that blunder that uh, they could have defeated the Soviet Union right there and then? Well, my own view is that they should never have got close. The Red Army has plenty of men to be able to see off anything that the Germans can do. The capture of Kyiv, for example, in September 1941 was a catastrophe for the Soviet Union and should never have happened. I mean, Zhukov is saying to Stalin, we got to pull back across the Denipo. Stalin can't possibly do that. You can't abandon Kyiv. It's like third city in Soviet Union. No way. No, absolutely not. And he goes, well, we just, we are just going to be overwhelmed. You know, we, we can't hold this. And and he says, you know, either back me or or farm me. Back me or sack me. So Stalin sacks him. Uh, uh, yeah, obviously, as we know, Zhukov gets um, rehabilitated in pretty quick order, and Stalin does learn very quickly after thereafter to learn the lessons, but the opening phase of Operation Barbarossa has been a catastrophe. And so as a consequence of Stalin refusing to let his men retreat back across the Dunipa, which is a substantial barrier and would have been very difficult for the Germans to overwhelm had they not had they moved back in time. Um, you know, that's another kind of 700,000 men put in the bag. I mean, that's just staggering numbers. Um, but yeah, I mean, there's so many things wrong with the Barbarossa plan. You know, too much over. It's just such a vast area. I mean, you're talking about kind of, you know, 2,500 miles or something, you know, of frontage.\n\n\nYou know, maybe if you kind of put your your your Panzer groups, which are these spearheads, and you put them all in one big straight across on a kind of, you know, much more narrow front of, let's say, kind of 400 miles rather than 1,200, then they might have got, you know, they might have just sort of burnt away straight through to Moscow.\nThey really caught the Red Army unprepared.\nYeah.\nIs there um something to be said about the the strategic genius of that or was it just luck?\nNo, I don't think so.\nI mean, I think what's happened is you've had the you've had the the Soviet purges of the of the second half of the 1930s where they've you know they have executed or imprisoned 22 and a half thousand officers of which you know three out of five marshals um you know god knows how many army commanders um etc etc.\nSo so you know you've completely decapitated the Red Army in terms of its command structure.\nSo before that, would it be fair to say it was one of, if not the greatest army in the world?\nWell, there was a lot of experience.\nThere's a lot of experience there that but also technology material.\nYeah.\nThe size of the army, the number of people that they're mobilized.\nYeah.\nAnd they're the first people to kind of adapt, you know, create airborne troops, for example.\nSo yes, I think there is an argument to say that.\nBut the decapitation is is is absolutely brutal.\nIf you've decapitated an army, you've then got to put new guys in charge.\nAnd someone who who looks on paper like a a halfdecent peace time commander might not be a very good wartime commander.\nThey're different disciplines and different skills.\nAnd what comes to you don't know that until you're tested.\nIt's very hard to kind of judge.\nAnd of course, you know, Stalin is existing in a sort of, you know, a vacuum of of paranoia and suspicion all the time, which is unhelpful when you're trying to develop a strong armed forces.\nSo they go into Finland in in back end of 1939 and they get there, you know, they get really badly hammered.\nThey do take about, you know, they get the Corellia um peninsula and they do take some ground, but at huge cost.\nI mean, the casualties are five times as bad as those of the Fins and it's a humiliation.\nSo Hitler sees that and thinks, okay, we're not up to much cop.\nThen Hitler loses the Battle of Britain and he thinks I can't afford to fight a war on two fronts.\nThat's one of the reasons why Germany loses World War II is fighting on the eastern front but also fighting on, you know, the western front at the same time.\nWe've got to avoid that.\nBut I've got to get rid of Britain.\nAnd Britain hasn't come out of the fight.\nBritain is still fighting in the back end of 1940 having won the Battle of Britain.\nAnd so maybe I'll go into the Soviet Union now while the Red Army is still weak.\nYou know, we're not 100% ready ourselves, but but let's hurry the whole thing forward because originally he'd been thinking of planning an operation in 1943 or 1944.\nSo the idea is you take Poland out, you take out France and the low countries, you conquer most of Europe, you you knock out Britain.\nSo therefore, you don't have to worry so much about the United States because they're over the other side of the Atlantic.\nThat then gives it buys him the time to kind of rebuild up his strength for the allout thrust on the Soviet Union.\nThe failure to subdue Britain in 1940 changes all those plans and makes him think actually I'm going to go in early.\nAnd he's also been kind of, you know, he's hoisted by his own petard because he he starts to believe his own genius.\nYou know, he everyone told him that, you know, he wouldn't be able to, you know, he wouldn't be able to beat France and the low countries.\nEveryone told him that, you know, it wouldn't work out when he went into Poland.\nEveryone was really nervous about it.\nYou know, well, go hang you, you cautious, awful aristocratic Prussian generals.\nYou know, I'm I'm the best at this.\nI've told you.\nI've shown you.\nI'm the genius.\nUm, I can do it.\nHe starts to believe his own hype.\nAnd of course, this is a problem.\nYou know, he's surrounded by sick of fans and people who constantly telling him this he's this incredible genius.\nSo, he starts to believe it and he thinks everything is possible and and he's very much into this idea of of the will of the German people.\nYou know, this is our destiny and either will, as I say earlier on, you know, it's the thousand-y year Reich of Armageddon, but momentum is with us and we need to strike it and only by by gambling, only by being bold will will the Germans prevail and all this kind of nonsense.\nAnd so that's why he goes into into Soviet Union in June 1941 rather than you know a couple of or even three years later.\nYeah.\nHe really hated the Prussian generals.\nHuh.\nYeah.\nHe hated them.\nIs there a case to be made that there he was indeed at times a military genius?\nNo, I don't think so.\nCuz none of the plan I mean even the plan for the invasion of France and the low countries isn't his.\nIt's a the the concept is is von Mannstein's and the execution is Gerian Hines Gadderian.\nSo heiscoded is is a kind of he's the pioneer of of of the panza force the panzer thrust this idea of the ultra mechanized combined arms panzer arm spearhead doing this kind of lightning fast thrust um it's not Hitler's idea he adopts it and and takes it as his own because you know he's a fury he can do what he likes um but but it isn't his so it's not you know and up until that point until that comes into being till that that plan is put forward to France Halder who is the chief of staff of the German army at that time you know how is just thinking how do we get out of this mess this is just a nightmare because they know that France has got a larger\n\n\nArmy, they know that.\nFrance has got more tanks and know that\nFrance has got double the number of\nartillery pieces.\nIt's got par in terms\nof air forces.\nThen you add Holland, then\nyou add Belgium, then you add Great\nBritain, and that looks like a very, very\ntough nut to crack.\nI mean, the reason why\nFrance is subdued in 1940 is\n50% brilliance of the Germans and their\noperational art in that particular\ninstance and 50% French failure, really,\nand incompetence.\nI mean, there is a kind\nof genius to be able to see and take\nadvantage and set up the world stage in\nsuch a way that you have the appeasement\nfrom France and\nBritain.\nKeep the United States out of\nit.\nJust set up the world stage where\nyou could just plow through everybody\nwith no, with very little resistance.\nI mean, there is a kind of, well, yes, if\ngeopolitical genius, if it works, but it\ndoesn't, you know, that's that's a\nproblem.\nI mean, you know, I mean, he goes\ninto Poland on the assumption that\nBritain and France will not declare war.\nYou know, he\nhe is not prepared for Britain and\nFrance declaring war on Germany.\nRight.\nHe thinks they won't.\nThat's right.\nSo, miscalculation, blunder.\nBut then France does, right?\nAnd\nthen that doesn't, you know, France does\nnot successfully do anything with this\nincredible army that it has.\nIt has a\nsize, but one of the problems that\nFrance has is that it's very, very\ntopheavy.\nIt's it's very cumbersome in\nthe way it operates.\nUm, there's no\nquestion that that it's got some\nbrilliant young commanders, but, but at\nthe lot, the top, the commanders are very\nold.\nMost of them are First World War\nveterans, you know, whether you, I mean,\nVegan Gamlan, General George.\nUm, these\npeople, they're all well into their 60s.\nUm, General George is the youngest army\ncommander and he's 60.\nYou know, it's\ntoo old to be an army commander.\nYou\nneed to be in your kind of late 40s,\nearly 50s.\nAnd they're too just consumed\nby conservatism and the old ways.\nAnd\nwhat, what they assume is that any future\nwar will be much like the First World\nWar.\nIt'll\nbe attritional, long and drawn out, but\nstatic.\nBut actually, they're right on\ntwo parts of it.\nIt is, as it turns out,\nit is going to be long and drawn out and\nattritional, but it's going to be mobile\nrather than static.\nAnd that's a big\nmiscalculation.\nSo, here's, here's my\nquestion.\nI think you're, you're being\ntoo nice on France here.\nSo, when, when\nGermany invaded Poland,\nit, correct me if I'm wrong, but it feels\nlike France could have just went\nstraight to Berlin.\nYeah, they\nabsolutely could have, and they, and I\nknow you said it's very topheavy, and\nyou're saying all of these things, but\nthey literally did basically nothing.\nYeah, they were pulling.\nSo, like that, uh,\nand I think a part of that, and I think\nyou described as well, maybe you can\nspeak to that, is the insanity that is\nHitler creating this psycholog with the\npropaganda, creating this feeling that\nthere's this Nazi force that's\nunstoppable.\nSo, they're, they're France\njust didn't want to like step into that.\nMaybe they were like legitimately, I, I,\nI hesitate to say these words, but scared\nof war.\n100% they are.\nThat, you know,\nbecause France has been totally\ntraumatized by the First World War.\nIt's\nfought on their land.\nIt's fought in\ntheir industrial heartland.\nYou know,\nthey lose three times the amount of\npeople killed that that Britain does.\nBritain's traumatized by it, but, but, but\nnot to the same degree that France is.\nFrance, you know, there is just no\nstomach to do that again.\nAnd so that\nmakes them risk averse.\nAnd by being\nriskaverse, you're actually taking a far\ngreater risk.\nThat, that, that's the\nirony of it.\nAnd the truth is also there\nisn't the political will.\nAnd a, a\nsuccessful military can only be\nsuccessful if there is a political will\nat the top.\nAnd the problem with France\nin the 1930s is it's very politically\ndivided.\nIt's, uh, it's, it's a time of\nmultiple governments, multiple prime\nministers, um, uh,\ncoalition\ngovernments, really extreme coalition\ngovernments from the sort of drawn from\nthe left and the right as well as the\ncenter, and you know, this is not a\ncoalition of of two parties.\nThis is a\ncoalition of multiple parties, and no one\ncan ever agree anything.\nI mean, that's\nthe problem.\nIt's amazing that the MNO\nline is even agreed, you know, this\nincredibly strong defensive position\ndown the western side of France of\nborder with, um, with Germany, which is\nkind of largely impregnable, but the\nproblem is the bit that's not\nimpregnable, which is the hinge where the\nMno line ends, and it sort of basically\nstarts turning kind of towards in a kind\nof north noy direction and the border\nwith Belgium.\nAnd you know, what they should have done\nis built kind of border defenses all\nalong the northern coast with Belgium\n'cause Belgium refused used to kind of, uh,\nallow any Allied troops into, into his\nterritory.\nIt was neutral.\nAnd France\nshould have said, \"Okay, fine.\nWell,\nthen we'll defend our, you know, we're\nnot going to come to your rescue if you\nget invaded.\nThat's your, that's your,\nwhat, that, that's that's the payoff.\"\nAnd\nand a consequence of that, we are going\nto stockpile everything that we're not\ngoing to be drawn into the neutral\nterritory should Germany invade from the\nWest.\nBut they don't do that because of\nthe psychological damage of having\nfought a war in exactly that area a\ngeneration earlier.\nAnd and that's the\nproblem.\nSo, when the, you know, there is\nGermany is so weakened by the invasion\nof Poland, there is literally nothing\nleft.\nYou know, the back door from into\nwestern Germany is completely open.\nAnd\nso they do what they call the SAR\noffensive, but it's not.\nIt's a kind of\nreconnaissance in force where they kind\nof go across the border, kind of pick\ntheir noses for, for a few days and then\nkind of trundle back again.\nAnd it's\njust it's embarrassing.\nAnd and that is\nwhat you're seeing there is is a nation\nwhich is just not ready for this, which\nis scared, which is politically divided,\nwhich is then having a knock-on effect\non, on the decision-m process, and which\nis just consumed by military\ncomplacency.\nAnd that's the big problem.\n\n\nThere is this, you know, the commanders at the very top of the French regime are complacent.\nThey haven't bought into kind of modern ways.\nThey haven't looked at how contemporary technology could help them.\nI mean it is absurd for example that there isn't a single radio in the chat Devalsen, which is you know the headquarters of the commander-in-chief of the French armed forces, which is General Marshall Morris Gamalan.\nI mean it's just unbelievable, but that is the case and there's no getting away from that.\nIt is all the more ironic when you consider that France is actually the most automotive society in Europe.\nIt's the second most automotive society in the world after the United States by some margin.\nIt has to be said as well, you know, has a fantastic transportation system.\nRailway network is superb.\nIt there are eight people for every motorized vehicle in France, which is way above Germany, which is in 1949 that figure is 47, for example.\nIt's 106 in Italy.\nSo France is very mechanized, like very mechanized.\nSo come on guys, put your finger out, get it together, and they just don't.\nThey're incredibly slow and cumbersome.\nWhat they think is when what will happen is the Germans won't think of going, you know, they won't do a pinser movement because you can't possibly take motorized forces through the Arden.\nThat just is not possible, which is the hinge area between the end of the Majinow, the northern part of the Majino line, which runs down the western, sorry, the eastern border of France and the northern bit.\nSo what we'll do with that hinge around the town of Sedan, we'll move into Belgium.\nWe'll meet the Germans before they get anywhere near France.\nWe'll hold them and while we're holding them, we will bring up our reserves and then we'll counterattack and crush them.\nThat's the idea behind it.\nBut the problem is is they don't have a means of moving fast and their communication systems are dreadful.\nAbsolutely dreadful.\nThey're dependent on conventional telephone lines which you know dive bombers and whatever are just kind of absolutely wrecking.\nSuddenly the streets are clogged with refugees and people can't move.\nSo, you know, telephone lines are down.\nThere's no radios.\nSo, you're then dependent on sending dispatch riders on little motorbikes.\nYou know, General Morris Gamalan sends out a dispatch rider at 6:00 in the morning.\nBy 12:00 he hasn't come back.\nSo, you then send another one.\nFinally, the answer comes back kind of 9:00 at night, by which time the Germans advance another 15 miles and the original message that you sent at 6:00 that morning is completely redundant and has passed its sell by date.\nThat's happening at every step of the way, you know.\nSo you've got overall commander headquarters, then you've got army group, then you've got army, then you've got core, then you've got division.\nSo the consequence of all that is that French just can't move.\nThey're just stuck.\nThey're rabbits in headlights and the Germans are able to kind of move them, destroy them in isolation.\nMeanwhile, they're able to use their excellent communications to very very good effect.\nYou were talking about the genius of war.\nIt's not Hitler that's a genius.\nIf anyone's a genius, it's Gerbles, the propaganda chief.\nIt is their ability to harness that they are the kings of messaging.\nYou know, they don't have X, they don't have social media.\nBut they do have new technology.\nThat new technology, that new approach is flooding the airwaves with their singular message, which is always the same and has been ever since the Nazis come into power.\nIt is using radios.\nI think radios are really really key to the whole story because there is no denser radio network anywhere in the world including the United States than Germany in 1939.\nSo while it's really behind the times in terms of mechanization, it is absolutely on top of its game in terms of coms.\nSo 70% of households in Germany have radios by 1939, which is an unprecedented number that is only beaten by United States and only just.\nSo it is greater than any other other nation in Europe.\nIn terms of flooding the airwaves, it is the densest because even for those who the 30% who don't have radios, that's not a problem because we'll put them in the stairwells of apartment blocks.\nWe'll put them in squares.\nWe'll put them in cafes and bars.\nThe same stuff the state, the the Nazi state controls the radio airwaves as it does the movies as it does newspapers.\nAll aspects of the media are controlled by Gerbles and the propaganda ministry and they are putting out the same message over and over again.\nIt's not Hitler's ranting.\nIt's entertainment, light entertainment, some humorous shows.\nIt is also Vagner of course and Richard Strauss.\nIt's a mixture but the subliminal message is the same.\nWe're the best.\nWe're the top dogs.\nJewish Bolevik plot is awful.\nThat needs to be, you know, that's the existential threat to us.\nWe have to overcome that.\nWe're the top dogs militarily.\nWe're the best.\nWe should feel really good about ourselves.\nWe're going to absolutely win and be the greatest nation in the world ever.\nHitler's a genius.\nThat is just repeated over and over and over and over again.\nYou know, for all the modernity of the world in which we live in today, most people believe what they're told repeatedly.\nYeah.\nThey still do.\nIf you just repeat repeat repeat over and over again, people will believe it.\nYou know, if you're a if you're a diehard Trump supporter, you you want to believe that and you'll believe everything he says.\nIf you are a diehard Bernie Sanders man, you know, you're from the left, you'll believe everything he says because it's reinforcing what you already want to what what you already want to believe.\nBut the scary thing is, you know, radio is the technology of the day.\n\n\nThe technology of the day today, which is a terrifying one for me, is, uh, um, I would say AI on social media.\nSo, bots, you can have basically bot farms, which I assume is used by Ukraine, by Russia, by US.\nI would love to read the history written about this era about the information wars.\nWho has the biggest bot farms?\nWho has the biggest propaganda machines?\nAnd when I say bot, I mean both automated AI bots and humans operating a large number of smartphones with SIM cards that are just able to boost messages enough to where they become viral, and then real humans with real opinions get excited.\nAlso, it's like this vicious cycle.\nSo, if you support your nation, all you need is a little boost, and then everybody gets real excited, and then now you're chanting, and now you're in this mass hysteria, and now it's the 1984 2 minutes of hate, and the message is clear.\nI mean, that's what propaganda does; it really clarifies the mind, and that is exactly what Hitler and the Nazis and Joseph Goebbels are doing in the 1930s.\nWell, they're doing it in the 1920s as well, but more effectively once they come into power, of course.\nAnd Hitler is so fortunate that he comes, he takes over the chancellorship in January 1943 at a time where the economy is just starting to turn, and he's able to make the most of that.\nAnd you know, if you're Germans and you've been through hyperinflation in the early 1920s, you've been through the humiliation of the Versailles Treaty, which was a terrible error in retrospect, and you've been through then having got through that, you've emerged into a kind of democratic Weimar Republic, which is based on manufacturing, you know, Germany's traditional genius at engineering and manufacturing and production of high-quality items.\nThey're merging through that.\nThen you have the Wall Street crash and the loans that are coming in from America, which is propping up the entire German economy, suddenly get cut off, and you've suddenly got depression again and massive unemployment.\nAnd suddenly Hitler comes in, and everyone's got jobs, and they're rebuilding, and they're growing their military, and the message that's coming out is, \"We're the greatest, we're the best, we're fantastic.\"\nYou know, I was telling you earlier on about pillar speeches, starting with the dark, starting dark and ending in hope and light and the sunlit uplands.\nYou know, that's what you're getting.\nYou're suddenly getting this vision of hope.\nThis sort of, you know, by God, actually, this is really working.\nYou know, okay, so, you know, I'm not sure that I particularly buy into the kind of anti-Semitic thing, but, you know, we'll sweep that under the carpet because overall, I've now got a job, I've got money, I've got my new radio, you know, and then this is the genius about the radios, for example.\nSo, they have the, uh, they have the German receiver to start off with, the Deutsche Fanger, and then they have the Deutsche Klein and Fanger, which is the German little receiver, little radio.\nThese are genius.\nThis is as outrageous as the arrival of the iPod.\nI mean, remember that, you know, suddenly you don't have to have a Sony Walkman anymore.\nYou can have something really, really small and miniature and listen to thousands and thousands and thousands of songs all at once.\nWhat a what an amazing thing.\nAnd the Deutsche Klein Fanger is 9 in x 4 in x 4 in.\nIt's made of bake light, and everyone can have one 'cause it's super cheap.\nIt's just incredible.\nAnd no one else said that because up until that point, radios, generally speaking, are aspirational.\nYou know, they've got sort of walnut lacquer at the front, and you know, you have them if you're middle class, and you show them off to your neighbors to show how kind of, you know, affluent and well-to-do you are.\nUm, but suddenly everyone can have one, and if everyone can have one, then everyone can receive the same message, and you can, and you can also, this is the whole point about the Hitler Youth as well, you know, the young guys, that's where they're, they're most impressionistic, they're, they're least risk-averse, so they're most gung-ho, they're, they're most full of excitement for the possibilities of life, and they're also their minds are the most open to suggestion, so you get the youth, you hang on, you get them, and so a whole generation of young men are brought up thinking about the genius of Hitler and how he's delivering us this much better nation and returning our, um, overhauling the humiliations of the First World War, where overcoming the back, the stab in the back that happened in 1918, etc., etc.\nAnd you know, as a young 16-year-old German, you're thinking, \"Yeah, I want a piece of that,\" and, \"Hey, guess what?\nThey got really cool uniforms,\" and, \"You know, come and join the SS,\" and, \"You know, get the throw line, what's not to like?\"\nYou know, you can see why why it's so clever.\nAnd what's so interesting is propaganda today is still using those those tenets that Joseph Goebbels was using back in the 1930s.\nAnd this is why I was say say that, you know, history doesn't repeat itself.\nOf course, it doesn't.\nIt can't possibly repeat itself because we're always living in a constantly evolving time.\nBut patterns of human behavior do.\nAnd what you always get after economic crisis is political upheaval.\nAlways, always, always, because some people are in a worse off position than they were financially before.\nThey're thinking, \"Hmm, well, you know, the current system doesn't work.\nWhat's the alternative?\"\nSo, you know, in the case of now, we in the West, you know, we face, first of all, we faced the crisis of 2008, the financial crisis of 2008.\nThen we've had the kind of double whammy of COVID, and that has been incredibly unsettling.\nAnd so, we're now in a situation of political turmoil.\nAnd whether you're whether you're whether you're pro-Trump or anti-Trump, what he's offering is something completely different.\nAnd you know, it's say, you know, he, he's saying the old ways don't work.\nYou know, I'm going to be, I'm just going to say what I think.\nI'm just going to, I'm going to come out.\nI'm not going to bother with all the sheen of diplomacy.\n\n\nAnd kind of, you know, meymouth words that politicians always use, you know, which where you can't trust anyone.\nI'm just going to tell you as it is.\nAnd obviously people respond to that.\nYou know, you you can understand why that has an appeal.\nAnd if the country already feels broken and here's someone who is going to be a disruptor and going to change the the way you go about things, you can see why a a reasonably large proportion of the population is going to go, \"I'll have a piece of that.\"\nThank you very much.\nAnd especially uh when the country is in a economic crisis like Germany was, I think you've written that the the Treaty of Versailles created Hitler and the uh the Wall Street crash and the great depression brought him to power.\nYes.\nAnd of course the propaganda machine that you describe is the thing that got everybody else in Germany on board.\nYeah.\nIt's it's it's amazing how he cuz he comes in with 33% of the vote.\nHe had 37% of the vote of the vote in July 1942.\nSo again, this is another period of of turmoil just like it is in France where you're having constant different kind of coalitions and you know different chancellors leaders of Germany.\nSo, it's very possible he he he wouldn't have come to power.\nWell, he said he he said, \"I will only, you know, we will only take our seats if if if I can be chanced.\nOtherwise, forget it.\nI'm not coming into any coalition.\"\nSo, then the uh the government falls again in January 1943.\nThey have the they have the election.\nThe Nazi vote is down from where it was the previous summer.\nBut this time, they go, \"Okay, Heather can be chancellor, but we'll manipulate him.\"\nHow wrong they were.\nYou know, he's manipulating everyone and then Hinderberg who is the president dies the following summer and uh he's able to get rid of the presidency.\nThere is no more president of Germany.\nThere is just the furer him and he gets rid of uh he has a enabling act which is where all other uh political parties have disbanded and suddenly you've got a total inherent state just like that.\nI think there's a lesson there.\nUh there's many lessons there, but one of them is don't let an extremist into government.\nYes.\nAnd assume you can control them.\nYes.\nThe arrogance of the existing politicians who just completely screwed it up.\nI mean, there is a real power to an extremist.\nLike there's uh a person who sees the world in in black and white can really gain the attention and the support of the populace.\nYes, especially when there's a resentment about like Treaty of Versailles, when there's economic hardship and if there's effective modern technology that allows you to do propaganda and sell the message.\nThere's something really compelling about the black and white message.\nIt is because it's simple and and what Hitler does throughout the 1920s is he sticks to this there there is actually when he comes out of prison in so he there's the bhole p in November 1923 he gets uh charged with treason which he has been because he's attempting a coup and he gets sentenced to 5 years which is pretty lenient for what he's done and he then gets let out after 9 months.\nThe Nazi party is is is banned at that point, but then comes back into being.\nAnd the year that follows, there is then a substantial debate about where the party should go.\nAnd there are actually a large number of people who think that actually they should be looking at how the Soviets are doing things and taking some of the some of the things that they consider to be positive out of the communist state and applying those to the Nazis.\nAnd Hitler goes, \"No, no, no, no, no, no.\nWe we we've just got to stick to this kind of Jewish bosshit thing.\nThis is this is how we're going to do it.\nThis we're going to do it.\"\nJoseph Goebbels, for example, who is who is very open.\nHe's he's very very Joseph Goebbels is a he's a he's a not very successful um journalist.\nHe is uh but he does have a PhD in German literature.\nHe's very disaffected because he was born with talipes, which is, you know, more commonly known as a club foot.\nHe's disabled.\nCan't fight in the First World War.\nHe's very frustrated by that.\nHe's in a deep despair about about the state of Germany in the first part of the early 1920s.\nHe's looking for a uh um a a political messiah as a sort of quai religious messiah.\nThinks it's Hitler, then discovers that Hitler's not open to any ideas at all uh about any deviation, but then sees the light.\nHitler recognizes that this guy is someone that he wants on his side.\nAnd so then goes to him, makes a real special effort.\nCome on, come to dinner.\nI think you're great.\nYou know, all this kind of stuff.\nWins him about over and Goebbels has this complete vault fast.\nDiscards his earlier kind of yeah, you know, Hitler's right.\nI was wrong.\nHitler is the kind of messiah figure that that I want to follow.\nI want to follow the hero hero leader.\nAnd they come on board and they absolutely work out.\nHitler completely wins out.\nAll dissenters within the what had been the German Workers Party drop becomes the German National Socialist Party becomes the Nazis.\nUm he comes out emerges as the absolute undisputed furer of that leader of that that party and what he says goes and everyone toes him behind it and part of the genius of that you know Hitler does have some genius.\nI just don't think it's military, but he does have some genius.\nThere's no question about it.\nIs this the simplicity of message what he's doing is it's that kind of us and them thing that we were talking about earlier on.\nIt's the kind of either or.\nIt's kind of it's my way or the highway.\nIt's kind of this is the only way.\nThis is how we get to the sunlet uplands.\nThis is how we we create this amazing master race of the this unification of German peoples which dominates the world which is the preeminent power in the world for the next thousand years or\n\n\nIt's decay and despair and being crushed by our enemies, and our enemies are the Jews and the Bolsheviks, the communists. And what he taps into as well is Frontgemeinschaft and Volkstumschaft. And these are, there's no direct English translation of Volkstumschaft or indeed Frontgemeinschaft, but in its most basic form, it's community, it's people, community, or front veterans community. So the Frontgemeinschaft is, we are the guys, we're bonded because we were in the trenches, you know, we were in the First World War. We were the people who bravely stuck it out, saw our friends being slaughtered and blown to pieces. We did our duty as proud Germans, but we were let down by the elites, and we were let down by this Jewish Bolshevik plot. You know, we were stabbed in the back. The myth of the stabbing in the back is very, very strong. So, we're bound, we're bonded by our experiences of the First World War and the fact that we did what we should and what we could, and we were, we didn't fail in what we were doing. We were failed by our leaders, um, and by the elites. So that's Frontgemeinschaft. Volkstumschaft is this sense of national unity. It's a cultural, ethnic bonding of people who speak German, who have a similar outlook on life. And again, that just reinforces the us and them, good and evil. It reinforces the black and white worldview. And then you add that to this very simple message, which Hitler is repeating over and over again: Communists are a big threat. Jews are a big threat. They're the enemy. You have to have an opposition in the them and us kind of process. And that's what he's doing. And people just buy into it. They go, \"Yeah, we're together. We're Germans. We're, you know, we're a brotherhood.\"\n\nWe've got our Volkstumschaft, and so he cleverly ties into that and taps into that, but they're an irrelevance by the late 1920s, you know, by 1928, you know, the, he's not going to get a deal for *Mein Kampf* part two, you know, he, he's, he's impoverished, the party's impoverished, you know, numbers are down there, they're a kind of, you know, a best, and, and a relevance, we should say. He wrote *Mein Kampf* at this time when he was in prison. He writes, he writes most of *Mein Kampf* in prison in Landsberg prison. And then he writes the rest of it in what becomes known as the Campfousel, which is this little wooden hut in the Oberalssburg, and you can still see the remnants of that, and unfortunately, there's still little candles there and stuff in the woods and, you know, by neo-Nazis and what have you, but that's where he wrote, wrote the rest of it. Um, I mean, it was John Jacqu Russo who says, \"Man has his greatest force when surrounded by nature.\" That was something that kind of Hitler took very much to heart. Um, there was a, there was a mentor of his called Dietrich Eckart. Dietrich Eckart introduced him to the Obisalsburg and the beauty of the southwest, southeast Bavarian Alps around Burkis Garden, and, um, and that was his favorite place on the planet, and, um, that's where he, that's where he eventually bought the, um, the, uh, the Burhoff with the royalties, it has to be said, from *Mein Kampf*, which went from being, you know, almost pulp to suddenly being a runaway bestseller, unfortunately.\n\nCan you actually comment on that? It's a shitty manifesto as far as manifestos go. I think there's a lot of values to understand from a first-person perspective the words of a dictator of a person like Hitler, but it just feels like that's just such a shitty. Yeah. I mean, you know, it's banned in a number of countries. You don't need to, 'cause no one's going to read it because it's unreadable, you know. Um, I mean, it's very untidy. It's, it's very incoherent. It's, it's got no, um, there's no narrative arc to use a kind of, you know, a writer's phrase. I mean, it's just, it's, but, but, but it does give you a very clear, you know, the overall impression you get at the end of it is, is the kind of communists and the Jews are to blame for everything. Yeah. But there's also the component of, you know, predicting basically World War II there. So it's not just they're to blame. He's, he's hungry for war. He, he thinks that this is, this is the natural state, that we have to have this terrible conflict, and once the conflict's over, Germany will emerge victorious, and then there will be the thousand-year Reich. I mean, you...\n\nI, I'm finding myself in, in talking to you, I keep saying this kind of, you know, it's Armageddon, all the thousand-year, right? It's because it comes up. It's, it's unavoidable because that's how he's speaking the whole time. It's just this same message over and over and over and over again. It's a pretty unique way of speaking, sort of allowing, uh, violence as a tool in this picture, that there's a hierarchy, that there's a superior race and inferior races, and it's okay to destroy the inferior ones. Yeah, usually politicians don't speak that way. They just say, \"Well, here's good and evil. We're the good guys.\" And yeah, maybe we'll destroy the evil a little bit. No, here is like there's a complete certainty about a very large number of people, the Slavic people, they just need to be removed. Well, they need to be made an irrelevance. You know, we have to take it, we have to take it, and if that, if that kills millions of them, fine. Then, then they can sort of squish their way over to Siberia. It doesn't matter where they go or whatever they go. I don't care. We just need to populate this land that belongs to the German people. Yeah. 'Cause they're the superior people. There's no question that he glorifies violence and war. You know, he's absolutely chomping at the bit. And in a way, I think he's a bit disappointed that in the 1930s, the conquests that he does undertake are...\n\n\nAlso peaceful.\nYou know, March 1948 goes straight into Austria.\nThere's the Angelus.\nYou know, not a shot is fired.\nYou know, 1946 goes into Rhineland.\nHe reconquers that, retakes that over that from the occupying allies, not a shot is fired.\nYou know, he takes the Sudan land, not a shot, barely a shot is fired.\nUm and then goes into the rest of Czechosvaka in March 1939 and again, barely a shot is fired.\nAnd you know, it's a bit disappointing.\nYou know, he wants to be tested.\nHe wants to kind of have the wartime triumph.\nYou could see him being frustrated about this in the Munich crisis in 1948.\nHe wants to fight.\nHe's absolutely spoiling for it.\nHe's desperate to go in.\nHe's all ready and gung-ho.\nHe's built his luftwaffer.\nHe's got his panzas now.\nHe's got his massive armed forces.\nYou know, he wants to test them.\nHe wants to get this show on the road and prove it.\nYou know, he is a he's an arch gambler.\nHiller, you make it seem so clear.\nBut uh all the while to the rest of the world, to Chamberlain, to France, to Britain, to the rest of the world, he's saying he doesn't want that.\nHe's making agreements.\nEverything you just mentioned, you just went through it so quickly.\nBut those are agreements that were made that he's not going to do that.\nUh and he does it over and over.\nHe violates the Treaty of Versailles.\nHe violates every single treaty, but he still is doing the meeting.\nSo may maybe can you go through it the leadup to the war September 1st 1939 like what are the different agreements what is the signaling he's doing what is he doing secretly in terms of building up the military force yes so he you know part of the treaty of size you're not you know you're allowed a very very limited um uh armed forces there's restrictions on naval expansion there's restrictions on the size of the army there's restrictions on the weapons you you can use.\nThere are um you're not allowed an air force.\nBut he starts doing this all clandestinely.\nUm you know there are people in um crop has got for example which is in the rur a sort of big um armous manufacturer they are producing tanks in elsewhere and parts elsewhere in in say the Netherlands for example and then shipping them back into back into Germany.\nThey're doing Panza training exercises actually in the Soviet Union at this time.\nThere's all sorts of things going on.\nThe Luftwaffer is being announced to the world in 1935, but it's obviously been in the process of of developing long before that.\nThe Meshmit 109 single engine fighter plane, for example, is created in 1934.\nSo that they're doing all these things against it.\nAnd and the and the truth is is he's just constantly pushing what what can I get away with here?\nWhat what will pro you know and and of course Britain, France, the rest of rest of the world, rest of the allies, you know, they're all reeling from from the Wall Street crash and and the depression as well.\nSo, have they got the stomach for this?\nNot really.\nYou know, and perhaps actually on reflection the terms of Versail are a bit harsh anyway.\nSo, you know, maybe we don't need to worry about it.\nAnd this just no political will.\nThere's no political will to kind of fight against what Germany's doing.\nThen he gets away of it.\nSo he suddenly starts realizing that that that that actually he can push this quite a long way because no one's going to stand up to him which is why he makes a decision in 1946 to go back into the you know into the rhin land you know which has been occupied by by French you know um um allied troops at that point he just walks in do your worst and no one's going to do anything cuz there isn't the stomach to do anything that was a big step in 1936 remilitarizing the Ryland I mean that that's a huge huge step of like, oh, I don't have to follow anybody's rules and they're gonna do nothing.\nAnd and he's looking at his military and he's and and he's also looking at response.\nSo, one of the things they do is they, you know, it's really it's very clever.\nSo, they get over the head of the uh army of the air, army dea, which is the um French air force, and they invite him over and they milk, who is the uh second command of the Luftwaffer, invites him over.\nSo, come and see what we're what we're up to.\nYou know, we want to be, you're our European neighbors.\nWe're all friends together, this kind of stuff.\nCome and see what we've got.\nAnd he takes him to this airfield.\nThere's a row of measures 109's all lined up, like sort of 50 of them.\nAnd the the head of the army of the air sort of looks at him and goes, &quot;G, that's impressive.&quot;\nAnd and Mil goes, &quot;Well, let me go and take you to another airfield.&quot;\nAnd they they go off the sort of the bat route out of the airfield and a long securitous route in the Mercedes.\nMeanwhile, all the measurements take off from that airfield, going to land in the next airfield.\nHere's another.\nAnd they're all the same aircraft and the commander and chief of the army of the aircraft goes back to France and goes we're never going to be able to eat Germany.\nSo you would earlier you were you were alluding to this earlier on you know how much is this sort of this this this just this hutzbar of this ability to kind of portray the the the the mechanized mollock.\nUm yeah it absolutely cows the enemy.\nSo, so they're they're they're increasing the effectiveness of their armed forces purely by propaganda and by by mind games and by talking the talk.\nAnd you know, you look at we might all think these military parades that the Nazis have looked rather silly by today's standards, but you look what that looks like if you're the rest of the world.\nYou're in Britain and you're still reading from the depression\n\n\nAnd you see the Triumph of the Will. You see some of that footage, and you see these automatons in their steel helmets, and you see the swastikas, and you see hundreds of thousands of people all lined up, and see Kyling and all the rest of it. You're going to think again before you go to war with people like that. It's also hard to put yourself in the mind of those leaders now, now that we have nuclear weapons. So nuclear weapons have created this kind of, uh, cloak of a kind of safety from mutually assured destruction. They that you think, surely you will not do, you know, a million or two million, uh, soldier army invading another land, right? Just full-on gigantic hot war. Uh, but at that time, that's the real possibility. You, you remember World War I. You remember all of that. So, you know, yeah, okay, there's a mad, uh, guy with a mustache. Uh, he's making statements that this land belongs to Germany anyway, cuz it's mostly German, uh, populated. So, and like you said, the Treaty of Versailles wasn't really fair. And you can start justifying all kinds of things yourself. And maybe they got a point about the dancing corridor. You know, they are mainly Germans, German-speaking people there. And you know, it's disconnected from East Prussia, which is just saying, you know, I can, I sort of get it, you know, maybe they've got a point, you know, and is Poland really a kind of thriving democracy anyway? Not really. By 1930, late 1930s, it's not. It's to all intents and purposes a dictatorship in Poland at that time. I mean, it, it's not right that you just go and take someone else's country. Of course, you, you can't do that. But, but you can see why in Germany people are thinking they've got a point. You can also see why in France and Britain, they're thinking, well, you know, do we really care about the polls? I mean, you know, is it worth going to war over? Um, but there's kind of bigger things at play by this point. That, that's the point. Yeah. But before we get to Poland, there is this meeting, September 1938. Uh, so Chamberlain made three trips to meet with Hitler. Yeah. Uh, which culminated in the Munich conference. Yeah. On the 30th of September. Yeah. Where was Chamberlain, Hitler, Mussolini, and Daladier, prime minister of France? They met to discuss Czechoslovakia without any of the government officials of Czechoslovakia participating. And Hitler promised to make no more territorial conquest. And Chamberlain believed him. He chose to believe him, I think, is the thing, is the point. So, so it's very interesting. So, so Chamberlain gets a very bad press. Um. Uh-oh. Well, no, I'm not. No, it's not really. Uh oh. It's, it's, I, I, I just think there's too much retrospective view on this. And, and that's fine because we, the whole point of history is you can look back and you can judge decisions that were made at a certain point through the prism of what subsequently happened, which of course the people that are making the decisions at the time can't, because they're in that particular moment. So I don't think Chamberlain did trust Hitler, but he wanted to give him the benefit of the doubt. Britain was not obliged to Czechoslovakia at all. France was. France had signed a treaty with Czechoslovakia in 1924, but, but Britain had not. So there was no obligation at all for Britain to do this. The only reason why Britain would go to war over Czechoslovakia is because of the threat of Nazism and what the ramifications of not going to war with him. But the problem is, is that Chamberlain's interesting because in 1935, he was, he was Chancellor of the Exchequer, and when they started to sort of think, okay, we really do need to rearm, um, he was very much in favor of, of substantially, um, expanding and rehabilitating the navy, so updating existing battleships, um, and so on, and also developing the air force. Mhm. There's not really much argument for having a large army because if you have a large army, you've got to maintain it. Britain is a small place. Where do you put them? You've also got to transport them. That's complicated. Um, you've got to train them. You got to embarrass. You got to feed them. All this kind of stuff. It's there's a kind of sort of impracticality about having a large army. Whereas navies are great because you can keep them at sea and they can be, you know, on the water. Air Force is slightly different. Air power is viewed in very much the same way that, that naval power is viewed. That this is, we're an island nation. We have a global, global assets, and airpower gives us a flexibility that an army doesn't. So he is all for backing the expansion of the, of the army of the air force and the navy in 1930s. Then he subsequently becomes prime minister and sticks his guns on that. It is he that enables the air force and, and the air ministry to develop the first fully coordinated air defense system anywhere in the world. There is not an air event system in Poland, nor Norway, nor Denmark, nor the Netherlands, nor Belgium, nor France. There is in Britain. Britain is the only one. And frankly, it pays off big time in the summer of 1940. So you have to give him credit for that. Britain, interestingly, is also the world's leading armaments exporter in the 1930s, which is amazing really when you think everyone complains about the fact that we weren't rearming enough. Actually, we were when we had all the infrastructure there, and, and we were expanding that infrastructure dramatically. I say we, I'm only saying that because I'm British. Uh, um, so they were doing that, but in 1938, Britain wasn't ready for war. Now you can argue that Germany wasn't ready for war either. But Chamberlain was prime minister in a democracy, a parliamentary democracy where 92% of the population were against going to war in 1938. There is, there is not a single democratic leader in the world that would go against the wishes of 92% of the population. Now you could say, well, he should have just argued it better and presented his case better and all the rest of\n\n\nIt, but at that point, there was no legal obligation to go to the defense of Czechoslovakia. You know, Czechoslovakia been was a number of these new nations have been created out of out of 1919 in the Versail treaty. You know, who was to say, you know, we in Britain are able to judge the rights and wrongs of that. You know, how fantastic it would be to go to war with a nation a long way away for people whom we know very little, etc., etc. I'm paraphrasing his quote, but I'm not saying it was the right decision. I'm just saying I can see why in September 1948, he is prepared to give him the chance. Now I do think he was a bit naive and it and what he also does is this really interesting thing is he goes over to Hitler's flat, completely ambushes him, goes to his flat on the afternoon of 30th September and says to Hitler, \"Look, I've got this, I've drawn up this agreement here, and this is to continue the naval agreement that we've already made, and by signing this, you are saying that Germany and Britain should never go to war with one another.\" And he goes, \"Yeah, whatever,\" you know, signs it. Yeah. Chamberlain comes back, lands a hand and waves his little piece of paper, you know, \"peace in our time\" and all the rest of it, which obviously comes back to bite him in a very big way. But it's interesting that when Hitler then subsequently goes and moves in, you know, that they, France and Britain, decide in rather the same way that there's been discussion about deciding that large portions of Ukraine should just be handed back to Russia without consulting Ukraine a few weeks ago.\n\nUm, it is incredible, I think, that France and Britain and Italy with Germany are deciding that yes, it's fine for Germany to go in and take the Sudatan land, you know, without really consulting the checks. It's a sort of similar kind of scenario, really, and it's equally wrong. Um, but when Germany does then go and take over the whole of Czechoslovakia in March 1939, that is that's the bottom line. That is that's the point where Chamberlain goes, \"Okay, I've given him the benefit of the doubt. No more benefits of doubt. That's it. That is he's crossed the line.\" And so you reinforce your agreement with Poland. You do a formal agreement. You go, \"Okay, we will uphold your sovereignty. You know, if you are invaded, we will go to war with you.\" You know, and that is that is a ratcheting up of diplomacy and politics in a very, very big way. And it is a it is that decision to make a treaty with the Poles is not heeded by Hitler, but it's heeded by literally every one of his commanders. And it's also heeded by Guring, who is his number two and who is obviously the commander-in-chief of the Luftwaffer and is president of Prussia and you know, and all the rest of it, and you know, is the second most senior Nazi, and you know, he's going, \"This is a catastrophe. This is the last thing we want to be doing is going to war against Britain and indeed France.\"\n\nThe Munich conference is a pretty interesting moment, I would say, in all of human history because you got the leaders of these bigger than life nations and the most dramatic brewing conflict in human history. Yeah. Chamberlain, Hitler, Mussolini, Dier. It's interesting when these bigger than life leaders are in the room together. Is there something that you know about about their interactions? Yeah, I think there's I think one of the things that's interesting is that Hitler's got home advantage, cuz it's on his turf, and you know, to start off with, the first meeting is at the burg, his beloved place in the Oasisburg overlooking Burkus garden in the Alps. So he's pretty confident because this is my mana, this is my turf, you know, I'm not going to be bossed around by these guys. But Chamberlain, for example, is going there thinking, \"I've been around the blocks. No one can teach me anything. I've been a politician for ages. You know, I'm not going to be kind of capped out by this this sort of, you know, Austrian upstart.\" So, they're both coming at it with a kind of sort of slight kind of superiority kind of conflict.\n\nUm, interestingly, when you get to the actual meetings at the Bernabau in in Munich, um, a couple of weeks later, Chamberlain is cheered by the crowds when his car comes in, when he goes to his hotel, when he's moving from his hotel to the burnabout, you know, there are cows cheering him, we know, waving uni jacks, all this kind of stuff. Hillary does not like that at all. Not at all. Puts him on the back foot. And that's because the German people don't want war. In the same way that the British people don't want war, nor do the German people. The difference is that Hitler is a dictator and an autocrat and has the devotion of the people. So he can do what he wants in a way that Chamberlain can't. Chamberlain's hands are tied because he is an elected prime minister, an elected leader, political leader, and he's not head of state. So there is no question that it is Hitler and Chamberlain that are the top dogs in this particular discussion. You know, Delier takes a backseat. Even Mussolini, although he's there, he doesn't want war either. You know, he wants to be left alone to do his own thing without anyone getting in the way, but he doesn't want he doesn't want to sort of it's not in his interest to have a European war. So, he's trying to avoid it. So, it is really you you see that the kind of alpha males in the room are Chamberlain and and Hitler. And it's really interesting because Hitler's got this sort of slightly jealous voice and and very kind of pale blue eyes and such distinct things. Quite a long nose and you know he always says this is why he has mustache to kind of you know disguise the big nose you know. So I was saying to you earlier on before we started recording he does have a sense\n\n\nOf humor.\nIt's not maybe not one that you and I would kind of tap into, but he does have one.\nWhereas Chamberlain is just sort of, you know, he sounds like a sort of, you know, bit like an old man, you know, he's sort of silverhead and he looks like your sort of archetypal kind of British gentleman with his rolled up umbrella and his, you know, and his homberg hat and all the rest of it.\nSo they they're both sort of caricatures in a funny sort of way.\nAnd yet the consequence of that, these discussions, you know, these these great events happening, you know, you are you're absolutely going even which way the Munich crisis comes out, you're taking a step closer to war.\nIt's just whether the war is going to happen kind of next week or whether it's going to happen a year hence, but it's you know, the Munich crisis obviously doesn't stem the inevitability of war at all, it just heightens it.\nDo you think uh there are words that Chamberlain should have said, could have said that uh put more pressure on Hitler, intimidate Hitler more?\nYeah, it's a really tricky one.\nIt's such a difficult one because you're always looking at it through, you know, the enemy has a vote and you don't know what that vote is going to be and you don't know what it's going to look like.\nThere's no question that that Europe, the rest of Europe is is is cowed by the um kind of impression of military might that the Germans have put out, that they they certainly fear they are stronger than they actually are.\nAnd then on the other hand, they're also going, \"Yeah, but you know, Germany doesn't have natural resources, doesn't have access to the world's oceans.\nYou know, it's it's it's kind of, you know, it shouldn't be able to win a war.\"\nAnd so so they're kind of contradicting themselves at the same time, you know.\nSo on one minute they're sort of, oh god, you don't want to take on those all those Nazis and all those swastikas and those automatan stormtroopers.\nBut on the other hand, they're then saying, but actually Germany doesn't have much in its kind of, you know, in its basket.\nYou know, it's it's got actually quite a lot of weaknesses and we should be able to kind of prevail blah blah blah.\nWe'll just impose an economic blockade and then it'll be stuffed.\nAnd Britain is not ready to fight a war in in 1948, but nor is Hitler, you know, nor is Germany.\nSo, you know, one is sort of striking out the other, but it's very easy to say that in hindsight, but at the time, you know, with people kind of digging trenches in High Park in the central London and barish balloons going up over London and, you know, children being evacuated from the cities and 92% of the population not wanting to go to war.\nYou can see why he takes the course he does.\nI suppose that's that's what I'm saying.\nI'm not saying it's necessarily the right decision, but I I think it's an understandable decision.\nBut what about even just on the human level?\nIf I go into a room with a British gentleman versus go into a room with Trump, it feels like it's so much easier to read and manipulate the British gentleman because Trump is like Trump-like characters.\nIt seems like Hitler is similar.\nChurchill is similar.\nIt's like this guy can do anything.\nThere's something terrifying about the unpredictability.\nYeah.\nYeah.\nIt feels like there's something very predictable about Chamberlain.\nYes, I think that's true.\nBut also, one has to take a step back and think about what Britain represents.\nSo therefore, what Chamberlain represents in 1938.\nBritain has the largest empire the world has ever known in 1938.\nYou know, third of the world is pink as the saying goes, you know, and that saying comes from the kind of atlas of the world where all British territories are kind of colored pink.\nYeah.\nAnd on top of that, it has lots of extra imperial territories as well.\nSo, you know, if you look at there's there's this incredible map of global shipping in 1937.\nAnd there's these little ant lines of of ships going out and and one of the strongest antlines is going down to Argentina and South America from Britain.\nSo, down past West Africa and down the southern Atlantic and there it is.\nAnd that's because Britain owns most of Argentina.\nIt owns huge great farming estates and ranches.\nIt owns the railway system.\nIt owns many of the port facilities.\nSo, you didn't even need an empire.\nYou just need the the, you know, you need the the facilities that overseas trade and possessions can give you.\nAnd Britain not only has the largest navy, it also has the largest merchant navy, has 33% of the world's merchant shipping and access to a further 50%, you know, Greek, Norwegian, Canadian shipping that it can can access.\nSo if you've got if you got access to 80 more than in in excess of 80% of the world shipping that puts you in an incredibly strong position and actually all sorts of other things have been going on.\nWhile they might not have been creating a huge army or producing enough Spitfires that they might want to up until this point what they have also been doing is stockpiling bulk site and copper and tungsten and huge reserves.\nAnd because Britain has this huge global reach, because it has its empire and its extra imperial assets, it can strike bargains that no one else can strike.\nSo it can go into various countries around the world and can go, \"Okay, I want you to guarantee me for the next 5 years every bit of your rubber supply.\nI will pay over the over the asking price to secure that.\"\nAnd it's doing that in the 1930s.\nSo when war comes, it's got everything it possibly needs.\nNow you always need more because it's suddenly turning into a kind of you know a proper global long drawn out war.\nBut but that is a huge advantage.\nSo it is with that mindset that Chamberlain is going into those talks and thinking okay well I'm not going to get a war over the Czechov and who cares about them but but I am going to show Hitler that I mean business.\nHitler's going who's this stuffy\n\n\nGuy with his white hair? I don't give a toss about him. You know, and it's he's coming at it from a completely different perspective. And I think one of the things that's so interesting from a dramatic point of view and from a historian's point of view or even a novelist point of view in the case of Robert Harris writing his book about these negotiations, which I don't know if you've read it, but it's really it's terrifically good, um, is the fact you've got two men, two alpha males who are going to those negotiations from totally different perspectives and vantage points. And I think it's very easy for people today to forget how elevated Britain was in the late late 1930s. You know, the gold standard was tied to the pound, not the dollar. Um, and so Britain was the number one nation in the world at that time, and and it just was. And it's so diminished by comparison today that it's hard to imagine it. And I think one of the interesting things about the historioggraphy about the narrative of how we tell World War II is that so much of it has been dictated by the shift in power that took place subsequent to 1945. And when people were starting to write these sort of major narratives in the 1970s and 80s and into the 1990s is through a prism of a very very different world. And so one of the reasons why you have this narrative that that you know Britain was a bit rubbish and hanging on the shirt tells of the Americans and you know all the blood was spelt in in Eastern front and you know Germany had the best army in the world and was only defeated because Hitler was mad and blah blah blah. You know that that kind of sort of traditional narrative. It's it's that narrative emerges through the prism of of what was going on in the 1970s and what was going on in the 1980s and the changing world rather than looking at it through the prism of the late 1930s or early 1940s. So there is this moment of decision. When do you think what lesson do you take from that? When is the right time for appeasement to negotiate for diplomacy and when is the right time for military strength offensive attacking uh for military conflict? Where's that where's that line? Where's that thing? Well, I kind of think it probably was when it was. I I mean Poland. Yeah. Honestly, I I'm not sure it would have been the right decision to go to war in 1948. I just I I think it would I I'm I can't predict because you can't second guess how things are going to play out because you just don't know. But but I I I'm not sure that Chamberlain made the wrong decision. I'm not saying he made the right decision. I'm just like I'm not I'm being a bit wishy-washy about this. You could have threatened it more. Imagine Churchill in those same meetings. Yeah, but but Churchill also appeases. I mean, he appeases Stalin all the time. I mean, you know, so the idea that Churchill's this big strong man and never appeases and, you know, he's gung over war. Churchill's out of the government at that time, he he he recognizes that you can't trust Hitler, he recognizes that Nazism is bad, but he because he's out of the government, he doesn't have a window on exactly where Britain is at that particular time in the way that Chamberlain does, you know. So, so I suppose what I'm saying is Chamberlain is better placed to make those decisions than than Churchill is. Which again doesn't mean that Church that Chamberlain is right and Churchill is wrong. It's just that's a massive pump to go to war in 1938 when you still don't have, you know, you've got a handful of Spitfires, you've got a handful of huracans, you haven't got enough, you know, your air defense system isn't properly properly sorted at this point. Um, your navy is strong. But you know what's that going to look like? I mean, if you do go to war, there's not going to be armies sweeping into Germany. It's just it's going to be accelerated industrialization for a year. So, no, you know, even if you go to war in 1938 over Czechoslovakia, Czechosaka will not be saved that, you know, France and Britain will not be going and invading Germany. That, you know, that is absolutely not going to happen. So, sort of what's the point? I mean, you know, if you're not going to do that, why didn't you accelerate your rearmament thereafter? Get your ducks in a row and then you can consider it. I mean, after all, you know, even in se September 1949, they don't really do anything. I mean, we talked about the kind of the SAR offensive, which isn't really an offensive at all. It's firing a one round of machine gun and scuttling back again. But, I mean, they don't even do that then, though. They're still buying time in 1949. And you know, Britain is only just about ready to take on the onslaught of the Luftwaffer in summer of 1940. Well, nobody's ready for war. No. And you always want more than you've got at any time, even when you're winning. But like really not ready. Even like like you mentioned with with Barbar Roa, Dasi Germany's really not ready. Not ready. Nobody's really except France. I swear. France. France have radios. Fine. But come on. Come on. When when uh when Nazi Germany invades Poland, I mean, yeah, it's terrible. It's terrible because I'm absolutely I I also do think that had France gone in in some force with some British troops as well, had they gone in, what would have happened is is that would have just that easily could have brought down Hitler because most of his commanders are his senior commanders are just thinking, \"What the hell is going on? This is a catastrophe.\" I mean to a man I mean even Guring is thinking this is a terrible idea they are absolutely not convinced and when Hitler does his big talk to his his um he asked all his senior commanders to come to the burgov to brief them about the invasion of Poland it's just after the ribbon trough molotov pact of the 22nd of\n\n\nAugust, go he.\nHe calls them all to Burgoff and says, \"Come in, you know, come in mufty, come in civilian suits.\"\nThey all turn up, and he gives them this kind of huge, great speech and says, \"This is the moment, this is this is the time, this is what we're going to do.\"\nAnd they're all going, \"What? You're kidding me. What? We're going to Poland in, you know, on the 26th of August. That's the plan.\"\nLike two days time, you know, where's the plan?\nWhere's the, you know, the whole point is that, you know, they're they're emerging and growing militarily, but they were supposed to have all these exercises where they, you know, coordinating ground forces, you know, the Panza spearhead with operations in the air with the Luftwaffer.\nNone of that happens.\nSo Poland becomes the proving ground.\nAnd actually they discover that there's lots of things that don't work and lots of things that are wrong.\nUm, but but but you know, it it's flying in the face of all convention, military convention, that that they, you know, he does this without any kind of warning, and even by the first of September, where there's been this kind of sort of 5-day delay, um, at the last minute negotiations.\nThe last minute negotiations are thrust upon Hitler by people like Guring and by Mussolini and and the Italians going, \"Oh my god, don't do this, don't do this, you know, there's got to be a solution.\"\nHe's absolutely chomping at the bit.\nWell, in that case, from a dark militaristic perspective, his bet paid off, well, except that it ended in ruins in May 1945 with total collapse of Germany.\nSo you could say the worst decision he ever made was going into Poland in September 1939.\nDepends where you look at it.\nBut I mean, yes, you know, it's successful in that, you know, Poland's overrun in 18 days.\nAnd there's there's so many counterfactuals here.\nBut I mean, if you would say to Hitler on the 30th of April, you know, is he's sort of taking out the pistol from his holster on his sofa in the in the fur bunk and going, you know, so Adolf, 1st of September 1949, still backing himself on that one?\nI mean, he might might have a different view.\nThe guy's insane and full of blunder.\nSo, he probably would have said, \"Yeah, do it all over again.\"\nYeah, I'm sure he would have done as well.\nConquest.\nPoland was not a mistake.\nSoviet Union was not a mistake.\nIt's just some of the other people I was let down by, by people not being strong enough.\nYeah.\nThe Prussian generals are all Yeah.\nYeah.\nOf course.\nThat's exactly what he'd say.\nWasn't my fault.\nHe might have uh quietly done some different decisions about Barbar Roa.\nMaybe the timing would be different.\nMaybe that all out central for us rather than kind of splitting into three.\nYeah.\nYeah.\nBut he was very sure, it seems like, maybe you can correct me, that Britain and France would still carry on with appeasement even after he invaded Poland.\nAbsolutely.\nHe he was completely convinced by it.\nThere was clearly a kind of sort of 10 to 15% level of doubt, but what the heck, I'm gonna do it anyway.\nHe was just he ratcheted himself up into such a lav of of kind of this is the moment.\nI have to do it now.\nThis is fate.\nI'm 50 and and you know I could be taken out by an assassin's bullet.\nI've got this important life's work that I've got to do.\nWe've got to get on with it now.\nThere could be no more delay.\nThis is my mission.\nYou know, this is our mission of the German people.\nAnd either the German people have got the will and the and the spirit to be able to pull it off or you know I was wrong and and therefore you know we don't deserve to be a thousand right, we don't deserve to be the master race, black or white, us or them, either or, it's same all the time.\nSo can you tell the story of the Molotov–Ribbentrop Pact, 1939?\nSo they make an agreement, Nazi Germany, the Soviet Union, and that leads us just like you mentioned in a matter of days.\nYeah.\nHow compact everything is.\nIt's just really, really fascinating.\nIt's a beautiful summer in Europe.\nSummer of 1949, you know, it's one of these glorious summers that sort of never rains.\nIt's just sunshine, sunny day after sunny day.\nIt's kind of, you know, it's like that sort of golden summer of 1914 as well, you know, where sky always seems to be blue, fluffy white clouds, everyone's sort of, you know, but this sort of the storm clouds of war, to use that cliche, are kind of brewing.\nThe Russians have have reached out to Britain and France and said, \"Come, come on over.\nLet's negotiate, you know, let's see what we can do.\"\nUm, and there is just no stomach for that at all.\nI I mean if ever there is a I think a mistake that's Britain and France should have been a bit more into real politics and than they were, that it's such an opportunity to to ensure that you to snooker the Third Reich and and they don't take it.\nUm because you know in many ways they see the westward spread of communism in exactly the same way that the Nazis see the threat of the westward spread of communism as something that's every bit as repellent as Nazism and and they don't want to be getting into bed with these guys.\nUm of course they kind of have to kind of change tack on that one in summer of 1941 in you know very quick order.\nUm and that's the whole point about Churchill appeasing Stalin.\nI mean, you know, it's all very well people saying, well, you know, Churchill wouldn't have appeased Hitler in the 1930s, but he does appease.\nHe appeases all the time.\nUm, and they miss that opportunity.\nAnd the and the the French and British delegation is third tier commanders, generals going over.\nIt's it's a you know, it's a shit show.\nI mean, it Yeah, excuse my French, but I mean, it's just it's it's a nonsense that they're not ready for.\n\n\nIt. They're not prepared. The British guy, um, Admiral Drax, doesn't have any authority. Um, the whole thing is a complete joke. It's it's never going to get anywhere. You tell the story of this quite beautifully, actually. Uh, again, it's such a human story. I mean, it seems like Stalin and the Soviets, they've already made up their mind. But I don't think they have. I think what they Wait, wait, wait. I mean, you described quite well that that they value in-person meeting. Yes. So, like Chamberlain should have just gone to Moscow. Yeah. Get on a plane. Like it I it's such a uh maybe it's a simplistic notion, but that could have changed the trajectory of human history right there. I really think it could have done. I think that was I think that's I think that's much more grievous mistake than than than Munich. Why are leaders so hesitant to meet? I I I'm told now by a bunch of diplomats that no no no no no there's a process you know first you have to have these diplomats meet and they have to draft a bunch of stuff and I sometimes have this simplistic notion like why not why not meet why not meet like I think there is a human element there um of course especially when there's this force that is Hitler. Well yes and because we humans we like to interact and and you like to see people in three dimensions and you know I'm sure it's why you always quite rightly insist on doing your podcast face to face cuz you want to get the cut of someone's chip and you want to be able to see them and and you want to see the intonation in their expression and the whites of their eyes and all that kind of stuff. And that that just does make a difference of course because you know we're fundamentally animals and we kind of we we want to be sizing people up and it's much easier to do that when you're a few feet away from each other than it is on a video screen or through the prism of someone else. Yeah. But there's also just you see the the humanity in in others. It's so much easier this you see this in social media. It's so much easier to talk shit about others when you're not with them. Yes. And and like military conflict is the extreme version of that. You can construct these narratives that they're not human, that they're evil, that they're you can construct a communist ideology, all these you can project onto them the worst possible uh version of a human. But when you meet them, you're like, \"Oh, they are just a person. They're just a person.\" Well, it's the world's great tragedy that that that it's only a few people that want to go to war and the vast majority want to live happily contented lives getting on with their neighbors. I mean, it has been ever thus. It's just it is those few that kind of ruin it for everybody else. But but but anyway, to go back to Leningrad um back in August 1939, they go halfcock. They're disrespectful to Soviet Union as a result of that. Um it gets nowhere. Had they been able to put on a really really firm offer there and then to the Soviet Union, Soviet Union would have would have probably come in. I mean, the big thing is is that the Soviet Union said, \"This is a big stumbling block.\" The Soviet Union said, \"Yeah, but we want to be able to march through Poland if we get threatened by Germany.\" Mhm. Both the British and the French just smell a massive rat there. They're basically saying, you know, if they agree to that, what they're what they fear is that Soviet Union will just march into Poland and go, \"Yeah, but you said we could and take it.\" Which they unquestionably would have done, but it would have stopped the World War probably. They're willing to appease Hitler. They're not willing to appease Stalin in that situation. Well, they're not willing to appease anybody by that stage. That's the point. Well, they appeased Hitler because they did for the year before, but there now there's a bottom line, you know, which is which is Poland, you know. So, it's changed. That's why right but anyway the bottom line is they don't you know there is a there is a a reluctance on the part of French and the British to negotiate with the Soviet Union because they're communists don't like them don't trust them worry about what they're going to do with Poland and they're going to be you know jumping out of the fire into the kind of water and it doesn't come off and as a consequence of that Soviet Union continue to pursue more hardly you know um more more viciferously the opportunities that the um that the Germans are offering which is this split of Poland cuz Soviet Union wants that part of Poland back in its own sphere of influence and it doesn't want to go to war just yet and the agreement that they won't attack each other essentially. Yeah. Do you think Stalin actually believed that? No, he believed it in the same way that Hitler believed it that it was a cynical kind of, you know, convenient bit of real politic for now. I mean, I I think Soviet Union was as determined to get rid of the Nazis as the Nazis were determined to get rid of the Soviet Union. I think whoever fired first was not not decided at that point. But I do think from the moment that Hiller takes power in 1943, a conflict between Soviet Union, Nazi Germany is inevitable. Yeah. So either direction you think it's inevitable. Yeah, I think I think there's Yeah, there's a huge amount of evidence for that. Stalin probably wanted it what, like in 42 43? Yeah, something like that. Yeah. And you know, they're doing exercises and stuff and building out. He's not ready yet because he knows he's done the purges and he's got to get his his army, you know, he's got to get his armed forces back into shape and all the rest of it, but you know, so they have this incredibly cynical agreement, but at that point, you know, Hitler's hands are untied. You know, he no longer has to worry about about the threat from the Soviet Union. um he\n\n\nHe's got car plans to go into Poland, and he doesn't believe that France and Britain are going to go to war over Poland.\nHe's wrong about that, obviously, but France and Britain, despite going to war with him, still do nothing.\nSo, you know, he's got away with it.\nWho was Churchill, and how did Churchill come to power at this moment?\nWell, Churchill is this absolutely towering figure in British politics.\nYou know, who's been, you know, first a minister in the kind of naughties of the 20th century and the first years of the 20th century.\nUm, first of the Liberals, then of the Conservatives.\nHe's a former chancellor, um, of the Jacka.\nUm, he's a towering figure, but he's been in the wilderness because he's out of favor with the Stanley Baldwin government.\nUm, he's out of favor with Chamberlain, but he is this towering figure, and he has been very outspoken as a backbencher, which basically means, you know, you're not a minister, you're not in the cabinet, you're just an ordinary member of parliament, but obviously you're an ordinary member of parliament, but you're also an ordinary member of parliament who has had ministries of state and who is this tyran figure.\nSo, he's listened to in a way that other backbenches aren't.\nUm, and he has been saying, you know, we need to stand up to the dictators.\nWe need to do this.\nUm, we need to rearm more more heavily, uh, and blah blah blah.\nSo when war is declared, he's brought back into the admiral, um, in charge of the navy, which is Britain's senior service, and um, suddenly he's there.\nAnd what happens is Britain doesn't really do anything.\nIt's very difficult working with France because France is so politically fractured that they can't make any decisions, and when you can't make any decisions, you're just impotent.\nUm, and so Churchill first mentions going into Norway mining the leads.\nSo, um, the idea is that you're making life very difficult for the Germans to get iron ore out of Sweden.\nTheir main source of iron ore is up in the northern part of Sweden in the Arctic Circle.\nIt then goes on a railway through northern tip of Norway and then gets shipped down the um west coast of Norway into Germany into the Baltic.\nSo, uh, Churchill suggests in September 1949, why don't we mine the leads, which are the leads are these passageways, um, out of the fjords and the in the north into the, uh, into the North Sea.\nWhy don't we mine those and stop the Germans from from from, um, taking this.\nEveryone goes, \"Well, yeah, that's quite a good idea, but they can't decide.\"\nAnd French are nervous that if they do that, the Germans retaliate and bomb France and all this kind of stuff.\nSo, no decision is made until kind of April 19, 1940.\nThey go up to start mining the leads on exactly the same day that the Germans invade Denmark and and Norway, and so they're they're caught off guards.\nAnd at that moment, really, it's seen as a failure of Chamberlain's government.\nAnd there is a kind of a mounting realization that no matter how good he was or competent he was as a peacetime prime minister, he's not a wartime prime minister.\nYou know, he's not served in the armed forces himself.\nHe doesn't really understand it.\nIt needs a different set of hands.\nAnd um, his government falls on the 9th of May.\nIt becomes inevitable that he's going to have to resign, and the obvious person to take his place is Lord Halifax, who is in the House of Lords, but you can still be a prime minister, and um, he is without question the most respected politician in the country.\nHe's um, a former viceroy of India.\nHe's seen as incredibly safe pair of hands, man of resolute sound judgment, etcetera, etcetera, um, but he doesn't want to take it.\nHe feels physically ill at the prospect, doesn't want this responsibility.\nHe's also not really a military man.\nHe's got a slightly sort of withered hand, which has prevented him from doing military service, and he just blanches at this moment.\nAnd that really leaves only one other figure that could possibly take on this position, and that's Churchill.\nSo when Chamberlain resigns on the 9th of May and Halifax says it's it's not for me, um, the only person who's going to slip into that position is Churchill, and he becomes prime minister, and he accepts it gladly.\nHe feels like it is his mission in life.\nThis is his moment cometh the outcome of the man.\nBut he comes with a huge amount of baggage.\nI mean, you know, he's known as a man who drinks too much, who's whose judgment hasn't always been great.\nYou know, he was chancellor during the time of the general strike 1926.\nYou know, he backed Edward VII over the uh monarchy crisis when the king wanted to marry Wallace Simpson, the divorcee, Catholic divorcee, etcetera, etcetera, so you know, his judgment has been brought into question.\nYou know, he is the man who was he who came up with the idea of the Gallipoli campaign, which was, you know, an ignominious failure, blah blah blah, so there are issues over him.\nYou know, he is seen as a hotthead and a man who doesn't have the kind of sound judgment of Halifax, so the jury is is very much out, and I think it's again, it's one of those things where you have to put yourself in, you have to look at this through the prism of what people were thinking in May 1940.\nYes, he he was considered a taran politician, but he is seen also as a loose cannon and by no means the right person in this hour of darkness.\nAnd it is coincidental that the 10th of May 1940, when he takes over as prime minister, becomes prime minister, not through an election, but by default of a new nationalist government.\nAnd so no longer a conservative comp government, but a nationalist cross party coalition government for the duration of the war.\nUm, which includes, you know, members of of the Liberal Party and also the Labor Party as well as Conservatives that it is by no means certain that that he's going to be able to deliver the goods.\nAnd it is also coincidentally the same day that the Germans launched case yellow, operation yellow, the invasion of the low countries in France.\nSo these are tumultuous events to put it mildly.\nAnd it is also the case that you know\n\n\nOnly a couple of weeks before, um, Paul Reo has taken over as prime minister of yet another coalition government in France from Dadier.\n\nSo, political turmoil is very much the watchword at this time for the, uh, for the Western democracies, just at the moment that the Germans are making their kind of, you know, their hammer strike into the west.\n\nThis might be a good moment to bring up this idea that has been circulating recently, brought up by Daryl Cooper, who hyperbolically stated that Churchill was the, quote, chief villain of, uh, the Second World War. To give a good faith interpretation of that, I believe he meant that Churchill forced Hitler to escalate the expansion of Nazi Germany beyond Poland into a global war. So, Churchill is the one that turned this narrow war, Czechoslovakia, Austria, Poland, into a global one.\n\nUm, is that accurate? No, I don't think it is. I mean, not least because the decisions over Poland were made by Chamberlain's government, not when Churchill was out of government. So, you know, Churchill wasn't even involved in that decision-making process at the time. No, I, I don't think so. I mean, again, I, I go back to kind of Britain's position in in the world in 1939. If you say we are going to defend the sovereignty of Poland, and then you don't, that is that looks really bad globally. You know, Britain's prestige would plummet, would lead to all sorts of problems. Um, you are saying that you're giving car blanche to dictators to just run a mock and take whatever territory they want. You are risking a future upheaval of the global order, um, away from democracies into the hands of dictators. You know, in the west, people believe in democracy and believe in advancement of, of, and freedoms of people. This is, you know, to, to echo the words of Roosevelt in August 1941. You know, that they're aspiring to a world, um, free of want and fear. Now, obviously, there's still some issues with the form that democracy takes in the 1930s. It's not democratic for everyone. You know, try saying that if you're in Nigeria or, uh, or, or India or whatever. Um, or if you're, you know, in the black southern states of the United States. But the aspirations are there. And I think that's, that's, that's an important distinction. And I think by saying that that Churchill is the chief warmonger of the Second World War, I think is, is ludicrous. You know, it's the same thing about about the bombing, you know, the, the, the detractors of strategic air campaign always go, \"Yeah, but you know, Germans had the Holocaust, but, but weren't the, weren't the allies just as bad killing all those civilians?\" It's like, \"No, because the moment Hitler stopped the war, the bombing would stop.\" You know, the moment the war stopped in Hitler's favor, the killing would continue and be accelerated. So, the, the thing you mentioned initially is the sort of the idealist perspective of, well, Britain can't allow sort of, uh, this warmonger to break all these pacts and be undemocratic, you know, um, murder a large number of people and do conquest of territory. Okay, that's idealistic, but if we look at a realist perspective, what decisions would minimize the amount of suffering on the continent in the next 50 years?\n\nSo, one of the arguments that he's making, I happen to disagree with it, to put it mildly, is that Churchill increased the amount of suffering. So, Churchill, Churchill's presence and decisions. So, we're not talking about idealistic perspective. We're talking about realist, like the, the reality of the war of Stalin, of, of Hitler, of Churchill, of, uh, of France and FDR. Did Churchill drag Hitler into a world war? Did he force Hitler to invade the Soviet Union? Did he force Hitler to then invade, uh, attack Britain? Well, no, because, because Hitler was always going to invade the Soviet Union if, unless, unless the Soviet Union invaded Germany first. So, that was always going to happen. Um, no one asked Hitler to invade the low countries and Norway and Denmark and attack Britain.\n\nUm, he does that, of course, because he's not given a free hand in Poland, but there's no question that Hitler would have also wanted to subdue France or certainly turn France from a democracy into a totalitarian state as well. I'm absolutely certain about that. So, I think there's pretty definitive evidence. I mean, it's obvious from everything he's said, from everything he's written, from everything everywhere that he was going to invade the Soviet Union, uh, no matter what. Yeah. And France, most likely. Yes. Also, he would have done a deal with Britain. Britain could have coexisted. So, actually, there is a, is there, there is a possible reality. I don't know, maybe you can correct me on this, where Hitler basically takes all of Europe except Britain. Yes. But then he would have got so strong that he would have then turned on Britain as well. You know, because he, he would, you know, the fear is that if you let him do this and then, then he, he gets greedy, he wants the next one, then he wants the next one, then he wants the next one, and, you know, then he wants to take over the whole world. And, you know, that is that is the fear of the British. That is the fear of the Americans. That's a fear of President Roosevelt, who's got a very, we haven't even touched on this yet, but he has a very difficult, uh, um, case on his hands because he's come into power also in January 1933, um, as president of the United States on an isolationist ticket with a retrenching, with a kind of sort of, you know, step away from the European old order. It's time for the Europeans on their own. Um, it all sounds very familiar right now. Um, and, and suddenly he's got to do this gargantuan political vault, um, and prepare the nation for war because he also fears, like Churchill fears, like most, like Chamberlain feared as well, um, that that Hitler's designs are not purely on Eastern Europe and the Lebanon's there, but would get ever bigger, and I don't, I don't doubt that they're right. I think if he'd prevailed in the Soviet Union, you know, he, he'd always wanted more, you know, because his whole concept is the\n\n\nMaster race, you know.\nYeah.\nI, I think, I think it should be said, if we, if we measure human suffering, if there was not Britain on the other side, if it was not a two-front war, that the chances of Hitler succeeding in the Soviet Union is much higher, or at least a more prolonged war, and there would be more dead, more enslaved, and more tortured, and all of this.\nYes, and, and ditto, if you, you know, if the, if the allies hadn't got involved against Imperial Japan, you know, it would have been, would have been catastrophic.\nI mean, 20 to 30 million Chinese dead anyway, you know, with American and British intervention, you know, was it going to be in China without that?\nI mean, and elsewhere, you know, because, because the reason why Japan invades French Indo-China, now Vietnam, um, and Hong Kong, and, um, and Malaya, and Singapore, and, and so on, and Burma, is because it's not winning in China, and it needs more resources because it's resource poor, and America has cut off the tap.\nSo is going into these countries to, to get what it needs, its rubber and oil and natural resources and ores, precious ores, and all the rest of it.\nAnd if it had been unchecked, it would have done so.\nAnd then it would have absolutely built up its strength and overrun the whole of China with even more deaths.\nSo, you know, I, I, I think there is, I think the one of the interesting things about the Second World War is, is lots of wars and why people get involved in them are extremely questionable.\nBut I think there is a moral crusade to the Allies and what they're doing that I think is entirely justified.\nWhat I think is interesting also is that as the war progresses, you know, if the allies are supposed to be on the force of the good, how come they're doing so much bad?\nAnd at what point is doing bad stopping you from doing good?\nAnd at what point are you doing good but also doing bad at the same time?\nSuch as destruction of cities, um, destruction of monasteries on outcrops in southern Italy, you know, destruction of killing of loss of civilians, etc., etc.\nYou know, that these are, these are difficult questions to answer.\nSometimes they're also incredibly interesting, and I think that moral component starts to blur a little bit by kind of middle of the war, by 1943, you know, it's, it's kind of easy to have a, a fairly, uh, cut and dry, um, war in North Africa, in the deserts of North Africa, where, you know, the only people getting in the way are a few sort of Bedouin tribesmen or something, but, but once you start getting into Europe or getting into the kind of the, the meat of highly populated countries in the Far East, um, for example, that's a different kind of fish because the scale of destruction is absolutely immense.\nBut it is also the job of political leaders, um, to look after and defend their own peoples first and foremost.\nAnd so what you're doing is you're trying to protect your own sovereignty, your own people before you're protecting other people.\nAnd so that's what leads to, you know, the whole way in which the allies are, the Western Allies are protracting war is to try and minimize the number of deaths of their own young men as much as they possibly can whilst at the same time winning the war.\nAnd that means bringing lots of destruction to your enemies, but also trying to minimize it.\nAnd the way you bring lots of destruction by to your enemies is by using immense firepower and this concept of steal not our flesh, which I mentioned earlier on, and technology, um, so that you don't have to bring to bear too many of your young men's eyes, and you don't have a repeat of the slaughter of the First World War.\nSo, you know, it is really interesting that, that in, in our mind's eye when we're thinking of, you know, the Western Allies in, in the Second World War, probably the first thing that comes into mind is Americans jumping out of landing craft on Omaha Beach on D-Day, for example.\nThose are infantrymen.\nThey're the front line.\nThey are the cold face of that.\nThey're the first people going into the, into the fire of the enemy.\nAnd we tend to think about guys in tanks, um, infantrymen with their Garand rifles or, you know, machine guns or whatever.\nThat's, that's what springs to mind.\nYet, actually, they're a comparatively small proportion of the army.\nSo, no more than 14 to 15% of any army, allied army, is infantry.\n45% are service corps, service troops driving trucks and cooks and bottle washers and people lugging great big boxes of stuff, you know, and that's because by that stage, you know, the allies have worked out the way of war, which is, is to, is to use, is what I call big war, this concept of a very long tail, logistics, the operational art, making sure that people have the absolute best you possibly can, great medical care, huge advances in, in, in first aid and, and medical care of troops, getting them back onto the battlefield, and for using firepower and technology and mechanization to do a lot of your hard yards.\nSo, you know, that's the principle behind strategic bombing.\nYou know, if you can, if you go over and bomb and you can destroy infrastructure and civilians and households, that makes it much harder for, for corrupt to make those Panther tanks and Tiger tanks or whatever it might be and guns.\nAnd, you know, you're disrupting the transportation system in Germany, you know, you're making life difficult for them to do what they need to do, then that means it's going to be easier for those 15, 14, 15% of infantrymen who've got to jump out of anticraft to do their job.\nAnd you're trying to keep that to a minimum.\nAnd you'd have to say, broadly speaking, that's a very sensible policy that makes an awful lot of sense.\nUm, consequence of that is a huge amount of destruction.\nAnd maybe that's what Daryl Cooper's driving at, but no one asked Hitler to invade Poland.\nI mean, you know, that is the bottom line.\nNo one asked Germany to go to war.\nNo one asked Hitler to come up with these ludicrous ideology.\nYeah.\nThere's complex ethical discussions here about, uh, uh, just like as you describe, which are fascinating, which are fascinating, and, uh, war is hell, and there's many ways in which it is hell.\nUh, just for a little bit, the steel man what, uh, Daryl is where he might be coming.\n\n\nFrom is since World War II.\nThe simplistic veneration of Churchill, sort of saying Churchill good, Hitler bad, has been used as a template to project under other conflicts, to justify military intervention. And so his general, his and other people like libertarians, for example, resistance to that overly simplistic veneration of somebody like Churchill has to do with the fact that that seems to be by neocons and war-mongers in the military-industrial complex in the United States and elsewhere, using Hitler way too much, using Churchill way too much to justify invading everywhere and anywhere.\nI, well, I, I do agree with that.\nI think oversimplification of anything is a mistake.\nYou know, life is nuanced.\nThe past is nuanced.\nIt's okay to be proud about certain things, and it's okay to be disgusted by other things.\nThat's absolutely fine.\nYou know, we have a complicated relationship with our past.\nIt doesn't need to be black and white.\nAnd, um, you know, life is not a straight line.\nAnd of course, as you know, the allies make plenty of mistakes in in in World War II.\nOverall, I think they made the right calls.\nAnd I think one of the things that's really interesting is I think that that the Allies for the most part use their resources much more judiciously and sensibly than the Axis powers do, and you know, good, um, because that means they prevail.\nI think, you know, there are so many lessons, um, from World War II that could have been brought into the last, the history of the last 30 years, which weren't, you know, such as, you know, if you have, if you, if you decapitate an incredibly strong leader, you get a power vacuum, and if you don't have a solution for that power vacuum, lots of bad elements are going to sweep into that in very quick order, which of course is exactly what happens in in in Iraq.\nSo, you know, Donald Ronson going, we don't do reconstruction well, you freaking well should do.\nYou know, this, this, if you're going to, if you're going to take on this, this particular challenge, you've got to see it through.\nYou know, that's, that's simply not good enough.\nYou know, it's not good enough to go into Afghanistan and go, \"Okay, we're going to change things around.\nIt's going to be great.\nYou know, all the women are going to have education.\nThey won't have to wear kind of, you know, uh, um, won't have to cover up their bodies anymore.\nUm, anything goes.\nWe love liberalism.\nIt's great.\nUm, let's make cobble into a thriving city once more,\" and then suddenly bug out, you know, because what, what, what's going to happen?\nYou're going to undo everything.\nAnd and I remember being in, you know, this is a bit of a segue, Lex, but I, I remember being in in Northern Helman province back in, you know, when was it, January 2008, and uh, British troops had just taken over an absolute dump of a town called, um, Musakala.\nAnd I remember talking to this Afghan guy.\nHe, he just had all his willow trees chopped down to make room for a helipad that the allies wanted, which they, you know, they put their kind of sur, you know, those cages with kind of rubble in the protective wall, is it called Hesco, I think it was called.\nAnyway, I said to him, what do, what do you think about about the British being there?\nAnd he just went, shrugged at me, lifted up his hands and said, \"Well, you know, if they stay, great, but they won't.\"\nAnd he said, said, \"You know, if they stay, then brilliant, but he said, I tell you what,\" he said, \"Taliban went great.\nThey weren't fantastic.\"\nHe said, \"But I could leave my personal wall and no one would touch it.\nI could leave it on a wall for a week.\nNo one would touch it.\"\nSaid, said, \"Will they bring that kind of order?\nYou know, will, will we have, will we have peace here?\nYou know, they've just chopped down my, my willow trees.\nYou know, thanks a lot.\"\nAnd you, you know, you, you're seeing a total lack of understanding of the culture, ethnic differences, you're trying to impose a kind of western-centric view onto something which is just some, you know, onto, onto a, onto a nation which isn't, isn't ready for that.\nNow there are ways in which, you know, it looked like Afghanistan was starting to kind of emerge, and there was a path, and then just at the critical moment, the west moves out with catastrophic consequences.\nWhat you have to say though is that in the west post 1945, the rehabilitation of Italy, of Japan, of western Germany was really good.\nYou know, the consequence of of all that destruction, all that turmoil was thriving, high-producing democracies which burst forth into the kind of second half of the 20, 20th century and into the 21st century in pretty good order.\nUm, so the lessons of the previous generation from the First World War had had been, had been learned, even though the scale of destruction, the displacement of people is unprecedented in 1945.\nIn 1939, what was the state of the militaries?\nWhat were the most powerful militaries on the world stage at that time?\nWell, um, in terms of naval power, Britain, as we've already discussed, and and and the United States.\nFrance has a pretty large navy.\nUh, Japan has a pretty large navy.\nItaly has a pretty large navy.\nBut Italy's navy is by far and away its most modern aspect of its three services, air, land, and sea.\nUm, but it doesn't have any aircraft carriers and doesn't have any radar.\nSo, you know, it's, it's, they've got modern battleships and battle cruisers, but without key modern bits of technology.\nSo, Italy is really not ready for war.\nOh, it's so not.\nIt's so not.\nIt's just again, both Hitler and Mussolini, they, they lack geopolitical understanding, you know, that's because they're so kind of focused on their narrow worldview, and they view everything through that prison, but they can't see that bigger picture.\nAnd we should say that Mussolini, maybe you can correct me, but I don't think at any point he wants a war.\nHe doesn't want a war.\nWhat he does want is he wants his own new kind of Roman Empire which extends over the\n\n\nThe Mediterranean, the kind of certainly the eastern part of the Med, half of the Mediterranean, North Africa all the way down to kind of East Africa, controlling the Sewish Canal.\nThat, that's what he wants.\nAnd I think he made clear that he was, I mean, there's always like this little brother jealous of Hitler kind of situation because he, he wanted absolute power the way Hitler did, but doesn't have it.\nDoesn't have it.\nAnd describe, yeah.\nThere's a monarchy often forgotten.\nIt's amazing.\nSo there's always this limit, and Hitler, quite brilliantly, once he gets some power, he takes it all, complete.\nHe completely emasculates Mussolini.\nAnd yeah, he likes him though.\nIt's really weird.\nEven when Mussolini is about to fall in July 1943, he has a meeting at Feltree, um, just literally a few days before Muslini tumbles, and he does that because he likes Mussolini.\nHe likes him as a man and thinks he's being his friend, and you know, he respects him to a certain extent, even though he's, he definitely views himself as top dog.\nHitler does that is.\nUm, so it's kind of curious because I don't think Hitler particularly likes anyone, really, but, but he does seem to like Mussolini.\nBut anyway, the problem with Mussolini is, Muslim, Muslim Italy is, is very impoverished from the First World War, you know, and that of course leads to the rise of fascism and the overthrow of parliamentary democracy and, and why Muslim takes place in the first place, you know, again, it's that kind of, there's been this terrible disruption, there's been financial crisis that leads to kind of people looking at an alternative.\nYou know, what's the alternative?\nWell, Mussolini is going, you know, we can be proud Italians again.\nLots of chest thumping, you know, wearing great uniforms, all the rest of it.\nPeople kind of think, well, you know, I have a piece of that, and it kind of works, and, you know, preferably the trains work on time under him and, and so on and so forth.\nBut he just gets ahead of himself, you know, and, and actually the writings on the war in 1945 when he goes into Abiscinia and, and you know, again, sort of what effectively are kind of, by first world European standards, privitive tribesmen in in in Abbiscinia.\nYou know, they, they have quite a tough fight there.\nYou know, they, they do prevail, but, but it's not a complete walkover, and they get a bit of a bloody nose at times, and they shouldn't have done, and they're just not ready.\nThey don't have the industry, you know, they're, they're tied up into the Mediterranean.\nThey don't have access to the world's oceans.\nThey do have some merchant shipping, but not a huge amount.\nUm, you know, they just don't have what is required.\nThey don't, they're dependent on Britain for coal.\nBritain is the leading coal exporter in the world in the 1930s.\nSo Britain's approach to fascist Spain and approach to fascist Italy has been very much sort of stick and carrot.\nIt's like, you know, we'll let you do what you do as long as you kind of stay in your box and, and you know, we'll continue to provide you with supplies and coal and whatever is you need as long as you don't kind of go too far.\nAnd so that's why Mussolini is very anxious in 1938 and again in 1939 to kind of be the power broker and kind of not let Germany go to war.\nBut Germany's just, you know, they, they signed the the Axis Pact of Steel in May 1939 where they become formal allies.\nThis is Hitler and um Mussolini, Italy and Germany.\nBut it's always a very, very unequal partnership right from the word go.\nOne of the reasons Mussolini signs it is because he fears that Germany has designs on Italy.\nYeah.\nIt's not because he thinks, \"Oh, these guys are great.\nYou know, they're our natural bedfellows.\"\nIt's so that he can, what, what it's a mutually convenient pact whereby Germany gets on with whatever it wants to do up in Northern Europe and Eastern Europe.\nItaly is given a free hand to do whatever it wants to do.\nThey'll just kind of watch each other's backs.\nThey have borders, you know, Austria and and Italy border one another.\nUm, and they'll just do their own thing and they'll kind of help each other out with supplies and stuff.\nUm, but, but basically they won't, they'll, they'll be their own, it's, it's a kind of marriage of convenience.\nYou know, they're never expecting to be fighting alongside each other on the battlefield.\nNot really.\nThere is a kind of obligation to do so, but, but it's, it's an obligation with no expectation of ever actually happening.\nAnd so from Muslimini's point of view, the pact still is, is kind of, you know, it's just sailing your flag to one particular mass and kind of trying to cover your, cover your back.\nAnd so long as he plays his cards right, you know, he can, he can still get his coal supplies from Britain.\nHe doesn't have to worry about that.\nYou know, the pctor still doesn't make any difference to that.\nThe, the problem for him is, is that in June 1940, he thinks that France is about to be defeated and that Britain will surely follow.\nAnd so he thinks, \"Ah, I've got some rich pickings.\nI can take Malta.\nI can take British possessions.\nI can overrun Egypt.\nAnd you know, now is my time.\nBut I, I also need to kind of join the fight before France is completely out of the fight.\nOtherwise, it looks like I'm a Johnny come lately and I won't, I won't get those spoils because the Germans will go, \"Yeah, you can't have all this stuff.\nYou've turned up too late.\nYou need to be in the fight.\"\nSo, he does it what he thinks is the perfect timing.\nAnd it turns out to be a catastrophic timing because, of course, Britain doesn't exit the fight.\nYou know, Britain is still there.\nAnd you know, by February 1941, a very, very tiny British army in Egypt has overrun, you know, two entire Italian armies and taken 133,000 prisoners in North Africa.\nSo you mentioned in the sea, uh, who were the dominant armies, who were, who was\n\n\nDominant in the air?\nWell, in the air it has to be the Luftwaffe, uh, and it is also the Imperial Japanese, both in the Imperial Japanese Navy and the Imperial Japanese Army.\nThey both have air forces, and one of the reasons that is because the quality of the pilots in Japan is extremely high because it's so difficult to get to get to the top position.\nYou know, you are going to your frontline squadrons with at least 500 hours in your log book.\nTo put that into some perspective, you know, a British RAF or Luftwaffe pilot would be joining their frontline squadrons with 150 to 170 hours in the log book.\nSo it is that these guys are disciplined to within an inch of their lives.\nUm, they are, you know, there are academic tests as well as physical endurance tests.\nYou know, they are the elite of the elite, and they are extremely good.\nThe problem they have is that there is a good number of them, but there's not that many.\nThe Luftwaffe is the largest air force in the world in 1939, but it is already at a parity when in in aircraft production with Britain.\nUm, and the French have a kind of similar size army, but they're very, very badly organized.\nSo, they're also they're organized into different regions, and they one region doesn't re is not really talking to another.\nAnd one of the problems that when Case Yellow, the invasion of German invasion of the west starts, France's army of the air is spread throughout France and has its own little area.\nYou have one bunch of, you know, fighters and bombers in that block in, you know, in the Marseilles area.\nYou have another block in kind of, you know, on the Britany coast, and you have another block in around Sudan, and you have another that.\nSo, so consequently, they're never be they're never able to kind of bring their full strength to bear.\nSo it's although although they've both got about three and a half thousand aircraft on paper and about two and a half thousand that are fit to fly on any one given day, the Luftwaffe, because they're the aggressor, can choose how they mass their aircraft and where they attack and and at when.\nSo in other words, you can send Luftwaffe can send overwhelming amounts of bombers and fighter planes and pulverize a French airfield and catch them napping.\nBecause the French don't have a defense system, they can't see whether they're coming.\nSo their only hope is to kind of take off and just hope they stoogge around the sky and hope they bump into some Luftwaffe.\nAnd of course that's inherently inefficient, and they get, you know, they get destroyed.\nThey get destroyed in in penny packets rather than on mass.\nThe difference with the RAF is is the RAF is not done on an air force basis where you have each air core or air fleet has a handful of bombers, a handful of um fighters, a handful of reconnaissance planes.\nThey have different commands.\nSo they have bomber command, fighter command, training command, cursal command, and they all have very specific roles.\nSo they're they're structured in a completely different way.\nAnd the other and that's because they're an island nation, um, and because they see their role militarily in a in a in a different way, and because the rearming that Britain has done in the 1930s is all about defense.\nIt is not about aggression at this point, not about taking it to the enemy.\nIt is it is showing you're tough, but also first and foremost getting your ducks in a row and making sure that you don't get defeated.\nSo this is the principle behind the the first the world's first fully coordinated air defense system, which is the radar chain, it is the observer core, it is control rooms, it is interesting technology such as identification friend or foe IFFF, which is where you have a little pulse which so you have these control rooms and you have a map table and you have a tote board in front of you where you can see what squadrons are airborne, what state of readiness they're at, you know, whether they're engaging the enemy, little lights come on and show you, you can see weather maps, you can see see the cloud ceiling.\nYou see all of that at a glance.\nThen you're on a dis and then down in front of you is a massive great map of southern England.\nYou've got crooious sort of moving plots.\nSo you can through a combination of radar which picks up a kind of a rough idea of what's coming towards you combined with the observer core, you have overlapping observer core stations all over Britain covering every single inch of airspace over Britain looking up into the air and seeing how many aircraft there are a and at what height they are, and you have little um thing called a panagramraph, which is a a piece of equipment which helps you judge um altitude.\nYou then ring through that that all comes into the control room along with the information from the radar stations which is going into a single filter room at at fighter command headquarters which is then being pushed straight back out to the sector stations.\nSo this information is being updated all the time.\nSo you have a plot and it looks like it might be, you know, enemy bombers 30 plus, for example, that's constantly being adapted.\nSo as more information comes in, you will change that, and then you can see that actually it's only 20 aircraft or 22 aircraft or whatever.\nSo you're updating that, and that little figure is put on the on your little plot and moved across, and so you can see and then because you can identify your own aircraft, you can then see where they are moving, and you're also on um the guys in the air are on the radio to ground controllers who are in these control rooms, and they're saying okay, well, if you proceed at, you know, angels 18, 18,000 ft, you know, on a vector of, you know, 150°, you should be seeing your enemy enemy bombing formation any moment now.\nAnd what that means is that you're not on the ground when the enemy are coming towards you with their bombers to hit your airfield, which means you're in the air.\nSo that all they're doing is hitting a grass airfield, which you've already got bulldozers and diggers and graders and lots of scalpings and earth ready to fill in the potholes, and it means you're good to go.\nAnd it means as a consequence of all that when the Germans do um launch their all-out assault on Adler Eagle Day on the 13th of August 1940, the British\n\n\nare ready.\nYou know, they can see them coming.\nThey know what to expect and they can anticipate.\nAnd it means that they're not being caught with their trousers down on the ground.\nAnd as a consequence of that, of the 138 airfields there are in RAF airfields there are in Britain, only one of them is knocked out for more than 48 hours in the entire summer of 1940.\nAnd that's Manston on the tip of the Kent coast, which is abandoned for the duration.\nSo these are the two biggest air forces.\nSo Lufafa, we should say German, I mean, they're like the legendary, the terrifying air force.\nThey are maybe, maybe they're slightly believing their own hype.\nThere's no question about it.\nWell, the rest of the world is also right.\nThey've just had it too easy.\nSo they don't have ground controllers.\nThey don't have an air defense system in Germany because why would you need an air defense system?\nWe're going to be the aggressor.\nYou know, there's no scenario where we'll have to defend the airspace of the Third Reich because we're on the offensive.\nSo they just haven't prepared it.\nSo there's that clash, the Battle of Britain, the clash of air forces.\nWhat explains the success of Britain in defending?\nWell, it's, I mean, you and everyone always says, you know, the the few were the last, you know, the last line of defense against the Nazi hordes and all this kind of stuff, and it's just it's all rubbish.\nThey're the first line of defense.\nSecond line of defense is the Royal Navy, which is the world's largest.\nAnd there is absolutely no chance on earth that a German invasion force made up of Ryan river barges, one out of every three is motorized and the other two aren't, is ever going to get successfully across the English Channel.\nAnd even if they did, they will be repulsed.\nI mean, they just it's just no chance.\nAnd it is often forgotten that while the Lufra is coming over and bombing Britain every single day, so is the RAF going over and bombing Germany.\nAnd one of the problems that the Germans have is is that these bombers need fighter protection.\nYou know, fighter planes are there to protect the bombers.\nAnd they don't have much fuel.\nAnd the Mesimmit 109E, the ME as a model is of of 1940 is the main stay of the German fighter force in the summer of 1940.\nAnd they don't have much fuel.\nSo they need to conserve their fuel, which means they need to be as close to Britain as they possibly can, which is why the majority of them are all in airfields which are hastily created in July 1940 following the fall of France in the Padacall, which is the closest point, you know, that's where the channel is its narrowest and all the rest of it and also in the northern Normandy and that's where they're flying from.\nBut what that means is that even if you're completely rubbish bombing, which the British are in 1940, they haven't developed those navigational aids that create untold accuracy by the end end of the war 1940, they don't, they don't have that luxury.\nIt's a target-rich environment.\nI mean, you know, you can barely miss if you go over to the aisle of, you know, the over to the paddala, I mean, it's literally, it's just like one huge great kind of hub of of fighter airfields and consequently that means that every single German squadron, which only is 12 airplanes strong on on establishment and very often even fewer than that, always has to leave two airplanes behind to defend their own airfield and it's really interesting when you look at kind of prison of war statements from from Lufka at Crown Crew that have been downed.\nThey're all bugged at a holding place called Trent Park.\nYou can see the transcripts of these conversations.\nThey're all going about how annoying it was that the RAF were over every night and they can't sleep and you know when they if only they just shut up and leave them alone and not bomb them.\nYou know, this is just part of the narrative of the battle of Britain that's completely left out.\nIt's always the stocky, you know, the plucky few against the kind of the, you know, the Nazi hordes and all the rest of it.\nAnd it's just, it's a complete misnomer.\nAnd by that time, aircraft production in Britain is massively outpacing the Germans.\nUm, and the best ratio that the Germans achieve in July 1940 is when the British produced 496 new Huracans and Spitfire single engine fighters and the Germans only produced 240 single engine fighters.\nThat's the best ratio.\nAnd of course, you know, that is the British outproducing the Germans 2 to 1.\nAnd what that means is by the end of October 1940 when the battle of Britain is sort of, you know, officially designated as being over, the single engine fighter force of Luwaffer is less than 200 from 750 or whatever it was in beginning of July.\nWhereas the British fighter force had been 650 or whatever at the beginning of July is now well over 750.\nAnd Britain is out producing.\nYeah.\nby to a massive degree and that that continues and you know that is a a ratio that just increases as the war progresses.\nI mean, Britain produces 132 and a half thousand aircraft in the Second World War.\nAmerica produces 315,000.\nSo why is there this legend of the Luftwafa?\nWell because it's the spearhead of the Blitz Creek.\nSo it has to do with the Blitz Creek.\nIt's to do with the Blitz Creek.\nThe the the Lufa becomes the kind of the bogeymen of the Third Reich.\nYou know, they're blamed for everything, but that's because they're completely abused.\nThey're the only part of of the Third Reich's armed services.\nThe only part of the Vermach, the Vermac being the Navy, the Army, and the Air Force, that is in constant use the whole time or constant abuse, I should say.\nIn Britain and America, they rotate their their pilots really really carefully.\nBy the time that but the that that you know you got the eighth fighter command, for example, part of the mighty eighth, the eighth air force operating in Britain.\nBy the by by the end of 1943, you would have in a squadron that would have 16.\nYou would never have more than 16 airborne from a squadron at any one time.\n\n\nYou would have 40 to 45 pilots for to service 16 in the air and a similar number of aircraft, which means you're not overusing these guys. And what would happen by that stage of the war, by 1943, you know, a young fighter pilot coming to a Thunderbolt squadron or a Mustang squadron, for example, um, at the end of 1943, beginning of 1944, he'd have 350 hours of consecutive flying because you can train in America, in Florida or California or Texas or wherever. However, you've got, you, you, you can process many, many more people because the training is much more intense because you've got clear skies. So, you're not, it's not a question of, of, oh, we'd like to take you out, out, Fritz this morning, but you know, it's a bit cloudy and, and, oh, the RAF are over, or you know, the Air Force are over, so we can't fly today. So, in Germany, pilot training is constant. Air crew train is constantly being interrupted by the war, by shortage of fuel, by inclement weather, etc., etc. In America, you have none of those problems. And Britain, because of its global reach, also has training bases in what was Rhodesia, now Zimbabwe, in South Africa, um, in Canada as well. And so, you're able to process these guys much better. You're able to give them more training. So, when they come, they're the absolute, the finished article as pilots. What they're not the finished article as is, say, a bomber pilot or as a fighter pilot. But that's okay because you join your squadron of 40 other guys for 16 airborne. And the old hands kind of take you up a few times. So you arrive at, I don't know, let's say some airfield in Suffolk, in East Anglia, in England, and you know, you'll have 10 days to two weeks acclimatizing, getting used to it. The, you know, the old hands will put you through your paces, give you some trip tips, you can pick their brains during kind of while you're having some cow and and listen in on some briefings. Then the first mission you do will be a milk run over to France where the danger is kind of pretty minimal, you know, and and you can build up your experience. So by the time you're actually sent over on a mission to Berlin or or Bremen or you know, the Ruhr or whatever, you're absolutely the business. So qualitatively and quantitatively, you are just vastly superior to anything the Luftwaffe has got. The Luftwaffe by that stage, in contrast, 1940, new pilots coming to frontline squadrons with, you know, 150, 170 hours on their in their log books, less than 100, 90, 92 hours, something like that. It's not enough, and and they're just being flung straight into battle, and they're getting absolutely slaughtered. And they're also, because their machines are quite complicated, there's no two-seaters really. So, no two-seater trainers. So, the first time you're flying in your FAWolf 190 or your Messerschmitt 109, it's this horrendous leap of faith, which you, as a young, bright Luftwaffe fighter pilot, know that you're not ready for this, and it can bite you. And something like a, um, a Messerschmitt 109 has a very high wing loading. So it's very maneuverable in the air, but it's got these tiny wings. It's got this incredible torque. This deep Ben's DB 605 engine with this huge amount of torque, and it just wants to flip you over. So if you're not used to it, and it's got a narrow undercarriage as well, if you're not used to it, you, you could just crash. So, in the first couple of months of 1944, they lose something like 2,400 aircraft in the air and and pilots, and about 3,400 are accidents. So, it has to do with training, really. Yeah. Not training enough. It's training and resources and supply. And the Second World War, more than any other conflict, is a war of numbers. There are differences that decisions that generals can make. There are um moments where particular brilliance and bravery can seize the day, take the bridge, you know, hold the enemy at bay or whatever. But ultimately, you know, you're talking about differences which might make a month's difference, 6 months difference, maybe even several years difference. But ultimately, there's a certain point in the Second World War where the outcome is absolutely inevitable because the guys that lose can't compete with the numbers that the guys are going to win at. So in that sense, you could think of World War II as uh as a battle of factories. Yes. What does it take to win in the battle of factories in out manufacturing military equipment against the Allies? It's it's efficiency really. So I always kind of, you know, I, I was think, let's take the example of the Sherman tank, for example, the mainstay of the Western Allied forces, and a fair number of them sent to the Soviet Union as well, for that matter. Uh, I think you've said it doesn't get the respect it deserves. Maybe doesn't get the respect it deserves. So, the Sherman tank, the 75 mm main battle gun, which a sort of medium velocity, fire a shell around kind of 2,000 ft per second, compared to the notorious, infamous German 88 mm, which can fire at kind of third fast again, like 3,000 ft per second. But on paper, a Tiger tank coming around the corner and a Sherman tank coming around the corner, it should be no match at all. Tiger tank is 58 tons. Looks scary. Is scary. It's got a massive gun. It's got really thick armor. Sherman tank doesn't have as thick armor. It doesn't have a gun that's as as big. It should, it should be an absolute walkover. And yet, at about 5:30 p.m. on Monday, the 26th of June 1944, a Sherman tank came around the corner of a road called a Rumu, a little village called Fontenay-le-Marmion in Normandy, came face to face of a Tiger tank and won. How does this happen? Well, I tell you how it happened. Because the commander of the Sherman tank was experienced, had one up the spout. So what I mean by that is he had an armor-piercing round already in the breach. Soon as he saw the the Tiger tank, he just said fire. That armor-piercing round did not penetrate the Tiger tank. It was never going to. But what it did do was it created a it\n\n\nHit the gun mantlet, which is a bit of reinforced steel that you have just as the barrel is entering the turret.\nAnd that caused spalling, which is a little shards of little bits of molten metal, which then hit the driver of the Tiger tank in the head.\nAnd he was screaming, you know, \"Gone himl,\" or whatever, and and, you know, was couldn't really see.\nThe moment they got hit, the commander of the Tiger tank retreated into the turret of the Tiger.\nThe moment you retreat into the tig into a turret, you can't see.\nYou can see because you've got periscopes, but your visibility is nothing like as good as it is when you've got your head above the turret.\nImmediately after that, the armor-piercing round from the Sherman tank was repeated by a number of high-explosive rounds, which are rounds which kind of, you know, detonate, have a little minor charge.\nThen there was a second charge which creates lots of smoke and and and in moments, in the first 30 seconds, 10 rounds from that Sherman tank had hit the Tiger tank before the Tiger tank had had unleashed a single round itself, and the crew then surrendered.\nSo, you didn't need to destroy the Tiger tank.\nYou just need to stop it operating.\nIf it hasn't got a crew, it's it's a it's a it's just a chunk of metal that's inoperable.\nSo, that's all you need to do.\nAnd what that tells you is that experience counts, training counts.\nUm, the agility of the Sherman tank also counts.\nIt's a smaller shelf, therefore it's easy to manhandle, which means you can put more in a breech quicker.\nUm, there's features on a Sherman tank, like it's the first tank to have a gun stabilizing gyro, which means it's more effective on the move.\nThere's also an override switch on the underside of the turret so that the commander, if he just sees something out of the corner of his eye, can immediately start moving the the turret before the gunner who is down in the belly of the turret can can react.\nThere's many different factors of it, but the main fact of all is there 1,347 Tigers built.\nThere were 49,000 Sherman.\nSo that means there's 36 Shermans to every single Tiger.\nSo you actually have an incredible uh uh video.\nYou talk about this a lot from different angles about the the top five tanks and and then the bottom five tanks of World War II.\nI think was it the Tiger that made both the top five and the bottom five?\nThe problem with a Tiger tank is it's really huge.\nWe should say that you keep saying the problem, but the one of the pros of the Tiger tank, it's very huge.\nIt it's I mean the psychological warfare aspect of it is terrifying.\nYes.\nSo I I don't know what the other pros, I mean I guess yeah, the the 88 mm high velocity and all the rest of it, you know, it's pretty fearsome, but but there are there are pragmatic problems.\nThe the big problems is the Germans are are incapable of mass production on a scale that Americans could do.\nFrankly, even the British can do.\nI mean, they're just they're just not in that league.\nThe reason they're not in that league is because they're in the middle of Europe.\nThey don't have access to the world's oceans.\nThey don't have a merchant fleet.\nThey can't get this stuff.\nIt hasn't gone terribly well in the Soviet Union.\nUm, you know, they can't process it and they're being bombed 24 hours a day, and so all their factories are, you know, having to split them all up, and that is inherently inefficient because you're then having to kind of move different parts around and you know, you're then having the whole process of having to travel from one place to another to get stuff, you haven't got much fuel.\nSo the consequence of that is that what you do is you think, \"Okay, we can't mass-produce, so let's make really brilliant tanks,\" but they've lost sight of what a really brilliant is.\nYou know, really brilliant to their eyes is big, scary, big gun, lots of armor, but actually what conflict in World War II shows you is is that that you need more than that.\nYou need ease of maintenance, you need reliability, and the problem with having the bigger the tank, the more complex like the maintenance equipment is, you know, you need a bigger hoist, which then means you need a bigger truck, which then uses more fuel.\nSo, for example, the Tiger tank is so big that it doesn't fit on the loading gauge of the European railway system.\nSo, they have to have different tracks to roll onto the wagons that will then transport them from A to B, you know, take them from West Germany to Normandy.\nThen they have to take them off, then they have to take off the tracks, put on combat tracks, then move them into into battle and hope that they don't break down.\nThe problem is when you have you start the war that's not very automotive and you've only got 47 people for every motorized vehicle in Germany compared to three in the United States or eight in France is that you've got lots of people who don't know how to drive.\nYou've also means you haven't got lots of garages and mechanics and gas stations and and and so on.\nAnd so you're then creating an incredibly complex beast, but you want that complex thing to be as simple as you possibly can be.\nAnd that's the beauty of the Sherman tank, you know, all those guys in America, they're used to driving stick cars, you know, one of there's three people for every automobile, you know, and that includes, you know, the old and children.\nSo almost, you know, every young man knows how to drive.\nAnd when you get into a Sherman tank, it's got a clutch, it's got a throttle, the brakes are the steering mechanism.\nUm, the clutch is where you would expect the clutch to be.\nIt's got a manual shift.\nYou put your foot on the clutch and you shove it into second gear and off you go, or reverse or whatever.\nAnd it literally couldn't be easier.\nAnyone who can drive a stick car could drive a Sherman tank.\nSeriously, not everyone can drive a Tiger tank.\nIt's incredibly complex.\nReally, really is.\nAnd that comes with a whole host of of problems.\nAnd of course, you don't have the numbers.\nYou don't have the numbers.\nYou know, you've got 1,347 of them.\n\n\nI've got 492 King Tigers, which are even bigger. And, you know, at a time where you are really short of fuel and you're really short of absolutely everything. And those shells are huge and they're harder to manhandle. And weird little things that the Germans do, you know, for all their design genius, the loader is always on the right-hand side. Now, in the 1920s and 1930s, children were taught to be right-handed. You weren't allowed to be left-handed. So, you were right-handed. So, you want to be on the right-hand side of the gun. So, you can take the shell from your right and swivel it into the breech with your right side. But the loader in a Tiger is always on the right-hand side of the bridge, which is ergonomically makes no sense whatsoever. Why do they do this? I've never found an answer to this, but you know, so there's all these little things and as a soldier coming up against, you know, you're an American GI and you're coming up against a Tiger tank, you don't care about the fact that it's difficult to maintain or the problems involved of trying to get it to the battlefield. All you care about is this monster coming in front of you. It's squeaking and clanking away and it's incredibly scary and it's about to blow you to bits. That's all you care about and quite understandably so. But those who are protracting the war at a higher level and historians that come subsequently and look at all this stuff, they do need to worry about all these things. I remember Georg Thomas, the architect of the hunger plan. I found these minutes of this meeting which I think was either on the 4th of December or the 5th of December 1941. So, it's just before the Red Army counterattacks outside Moscow in the winter of 1941. And it's a meeting about weaponry. And this is a verbatim quote. He says, \"We have to stop making such complete and aesthetic weapons.\" In other words, we've consciously been building overengineered and aesthetically pleasing weapons up until this point. And they sort of half manage it, but don't quite. We could probably talk for many hours about each of these topics. We could talk for 10 hours about tanks. I encourage people to listen to your podcast, World War II Pod, We Have Ways of Making You Talk. It's great. Oh, yeah. But we also do, we've got a new YouTube channel and website called World War II Headquarters. There are lots of walking the ground and videos of that and all sorts of stuff and little explainers of going around tanks and stuff and the weaponry and documents and photographic archives. So the idea is to sort of turn it into a kind of real hub of anyone who's interested in this subject. It's a place where they can go and find out just a whole load more. I love it. So, like I said, we could probably talk for many hours on each of these topics, but let's look at some of the battles and maybe you can tell me which jumps out at you. I want to talk to you about the Western Front and definitely talk about Normandy. But so, there was the Battle of Midway in 1942, which is a naval battle. There's Eastern Front Stalingrad, probably the deadliest battle in human history. Then there's the Battle of Kursk, which is a tank battle. The largest tank battle in history. Probably the largest battle period in history. 6,000 tanks, 2 million troops, 4,000 aircraft. And then that takes us also to the Battle of the Bulge in Normandy, the Italian campaign that you talk a lot about. So what do you think is interesting to try to extract some wisdom from before we get to Normandy? Is do you find as a historian the Battle of Kursk or Battle of Stalingrad more interesting? Stalingrad is often seen as the turning point. Well, I, yeah, I think so. I mean it's really interesting.\nSo they get through 1941. Operation Barbarossa doesn't happen as the Germans hope it will. You know, the whole point is to completely destroy the Red Army in 3 months and that just doesn't happen. And I think you can argue and argue convincingly that by, let's say, the beginning of December 1941, Germany is just not going to win. It just can't. And let me tell you what I mean by that. So if you take an arbitrary date, let's say the 15th of June 1941, Germany at that moment has one enemy, which is Great Britain, albeit Great Britain plus Dominion Empire. Fast forward 6 months to, let's say, the 16th of December. It's got three enemies. It's got Great Britain Dominion Empire, USSR and the USA. It is just not going to win. You know, for all the talks of wonder weapons and all the rest of it's just not going to, you know, it has lost that battle. Having said that, Soviet Union is still in a really, really bad situation. It is being helped out a huge amount by supplies from the United States and from Britain. You know, just unprecedented amounts of material being sent through the Arctic or across Alaska into the Soviet Union at that time. It is absolutely staggering how much is committed by Roosevelt and Churchill to try and stem the flow in the Soviet Union because for all the announcements and pride that the Soviet Union has about moving factories to the other side of the Urals and stuff which they do in 1941, huge amounts are overrun intact by the Germans in the opening stages of Operation Barbarossa. I mean really, you know, colossal losses, huge amounts. So you know the grain has gone, coal has gone, entire factories have gone, steel production goes down by kind of, you know, 80% in the Soviet Union in 1941 and into 1942. So in 1942 despite the vast amount of numbers of men that they have at their hands. I mean they create 80 new divisions in the second half of 1941, for example. I mean Britain never has 80\n\n\nDivisions in the entire Second World War. Division being about rule of thumb 15,000 men. So, you know, despite that, and that is because Stalin's meddling, the awful state of the Red Army in 1941, etc., etc., which we've already sort of touched upon. So, 1942, it's is still in a really bad way, but Germany's in a really bad way, too. It's the attrition it's it suffered in 1941, it's winning itself to death in 1941. So it's having these huge great encirclements like the encirclement of KEF in September 1941 you know capturing a further kind of best part of 700,000 Red Army troops etc etc but in the process of doing that it is constantly being attitted you know both both in battle casualties but in also mechanical casualties too just can't cope it's too the scale is just too big and what happens is with every moment that the German forces that ultimate victory slips away. So Hitler's personal handling of the battle increases. And you know, you can say what you like about him, but he just hasn't had the military training to do that. He might have amazing attention to detail. He might be able to understand, you know, have an enormous capacity to remember units and where they are on a map. But he was only a half corporal in the First World War. He's never been to staff college. You know, he might have read lots about Frederick the Great. I mean, I've read lots of history, but that doesn't mean to say I'd be a competent field marshal. Um, so he is not the right person for the job at all. And he micromanages and and he looks at and and figures and doesn't understand what it's like at the actual front, the coldface. So he's he's stifling the very thing that made the German army effective, which is the ability to give commanders at the front the freedom on their leash to be able to make decisions and battle command decisions. And he's taken that away from them. So he's basically making them go into battle with decreasing amounts of supplies and and firepower and with one hand behind their back in terms of decision-m process and that is not a good combination. The other problem is that he decides rather than going for Moscow in 1942 because basically there's a kind of cooling off period in the in the winter because of the conditions. But everyone know the Soviet Union know the Red Army knows that the moment spring's come there's going to be another offensive be another major offensive in the summer. That is absolutely as certain as you know day following night etc. The problem that the Germans have is they just don't have enough. They have less than they had when they launched Operation Barbarossa the previous year. The Soviet Union has more. It is better prepared. It knows what's coming now. It's kind of learning some of the lessons, starting to absorb the lessons. Stalin, coincidentally, is pulling back from his very tight leash. And the way that Hitler is doing the opposite and increasing his micromanagement and control freaky. And what Hitler decides is rather than going for Moscow, he's going to go for the oil fields. And this is absolutely insane because what's going to happen when they get to the oil fields? I mean, does he think really that the Soviet Union are going to let those oil fields come into German hands intact? Even if he does let them get in intact, what are they going to do with that oil? I mean, oil needs to be refined. Where are you going to refine it? You know, they don't have any or they don't have many oil refineries. How are you going to ship that oil to where you need it to be in the factories in the Third Reich and into your, you know, process into into gasoline and then get it and diesel and get it to your Yubos, get it to your tanks, get it to your armored units. How are you going to do that? How do you transport it from from the uh from the Caucuses, which is a long long way away from from Berlin? How you going to do that? There's no pipelines. There's only some pipelines. They've been built by American money and American engineering and they're going backwards towards the urals, not forwards. They have no more rail capacity whatsoever. They just don't have the oil tankers. So, it's just it's it is absolute la la land. It is incredible that when you look at the detailed literature that the Germans have. No one is asking this question in the in the spring and summer early summer of 1942. the logistics question in part. No one is saying, \"Okay, it's great that we're going to go to the caucuses and get all this oil, but then what?\" No one is asking that question, nor how do you provide resources and feed and the soldiers and all that kind of stuff. I mean, it's so so the case prove first of all, they get distracted by going into the Crimea and they go, \"Well, we got to do that first.\" So, they have to get Sevastapole and the Crimea, which they do. And then they have to push on and and and at this point suddenly looming in front of them is Stalingrad on the banks of the Vular. This this city this industrial city which has Stalin's name and Hitler goes okay what I'm going to do now is I'm going to split my forces so half of you can go south towards the Caucuses and the rest of you can confront Stalenrad. And on Boach just who's the commander just goes that's nuts. That makes no sense whatsoever. you know, you're you're you're splitting the mission. So, he fires him. So, suddenly they get get into this assault for Stalingrad and it becomes this sort of street fight. Street fighting is the worst kind of fighting. I mean, the reason why the Israelis have just blown everything up in in Gaza is because otherwise you can't see. You know, you need a field of fire. This is fighting up in a fighting in a buildup area is is horrendous. Yeah. To clarify, we're talking about urban warfare, doortodoor, building to building. It's incredibly difficult and home advantage is colossal in this this instance and of course it's piping hot when they\n\n\nAttack in kind of August into early September, and then it suddenly gets very, very cold. At the same time, American mechanization, and slightly British mechanization, but primarily American trucks, are enabling Zhukov to plan this great pincer movement. So it is, you know, and Russians will hate me for saying this. Um, and I probably will get a whole load of bots on the back of it, but the truth is, it is not the street fighting that destroys the German army. It is the encirclement, the subsequent encirclement. So the Germans have been sucked into this street battle in Stalingrad. Cannot give up. We cannot back down. We cannot pull out. We've got to destroy this city. Meanwhile, while their backs are turned, and while most of their forces are going off to the Caucasus on a wild goose chase for absolutely zero oil, incidentally, um, and they never get remotely close to Baku, this huge great pincer movement is being planned, and it is only possible through mechanization from the United States. And that is the big turning point, because from that moment onwards, the Germans are on the back foot. They're basically going backwards. There are little small character attacks. There is obviously the cursed salient, for example. Um, but it's game over. You know, the catastrophe of the surrender of the final. I mean, the writing's on the wall at the end of 1942, by November 1942, when the two Soviet fronts meet up, then, you know, there is no possible chance of escape for the German army. They are consigned. They are toast. And their final strand obviously happens at the very beginning of February 1943. But that's all over. Then, at the same time that that is happening, disaster is unfolding in North Africa, because Hitler has insisted on massively resupplying the Mediterranean theater. And the problem there is the amount of equipment that is lost in North Africa is greater than it is at Stalingrad. I don't think you could argue that psychologically Tunis is a greater loss than Stalingrad. It absolutely isn't. But you have to see them in tandem, as this is two fronts. This is eastern front, southern western front, and this is the first time that the Americans have been on the ground against Axis forces, and they lose big time. The Allies become masters of the North African shores on the 13th of May 1943, and it is a catastrophe. And in that time, 2,700 aircraft have been, Luftwaffe aircraft have been destroyed over North Africa between November 1942 and May 1943, and overall the subsequent that summer as well. Um, it's really interesting, the Luftwaffe loses between June and October 1943. So this is including the Kursk battle, which that takes place in July 1943. In that period, the Luftwaffe loses 702 aircraft over the Eastern Front, but 3,704 aircraft over the Mediterranean. So I think one has to also, one of the lessons about studying the Second World War is one has to be careful not to assign strategic importance to boots on the ground. It can be of great strategic importance, but not necessarily. You know, no one would argue, for example, that the Guadalcanal is not an absolutely game-changing battle in the Pacific War, and yet the number of troops compared to, you know, what's going on in the Eastern Front, or even, you know, the Western Front, is tiny in comparison. So, it is absolutely true that the most German blood is lost on the Eastern Front, but that doesn't mean to say that it's more strategically important than the Western Front. It's a, it's, and it's not saying that the western front is more strategic either. It's just you have to kind of be balanced about this. The psychological blow of Stalingrad is immense, and you cannot belittle that. I mean, there's the, we went over it really fast, but there is a human drama element. Yes. But yes, when we're talking about the operational side, the material loss of a battle is also extremely important to the big picture of the war. And we often don't talk about that, because of course, with war, the thing to focus on is the human drama of it. Yes. Because we're humans. And I also think that what's interesting is that is the Nazi high command's response to Stalingrad, which is not to go, \"We're screwed.\" It's to double down. It's, you know, then, so, Goebbels, for example, gives his infamous speech in the sports palace in the third week of February 1943, where he goes, \"Are you ready for this? You know, this is now total war. The war is coming. This is a fight for survival. We're all in it together. You are in this as well. You know, every single one, every single German is now this is a fight for survival, and we are now in total war.\" And everyone is just so depressed by this. I mean, yeah, they realize that there is that they have, they will are going to reap what they have sown, you know, because everyone knows what's been going on in the Eastern Front, because first part of the war, Germans have loads and loads of cameras. They're really into photographing everything, taking cine footage of everything. It's all part of recording the greatness of the Reich and the triumphs of the Reich. They want it recorded. So, all this stuff is bit like the radios is made very, very cheap. So, lots of havoc, and people are sending it all back, and you know, the people that are developing the stuff are all seeing it, and people are talking about it, and then it's being sent to families, and they're all seeing it, and they're seeing pictures of Jews being rounded up and beaten, and they're seeing Ukrainian partisans being executed, and they're seeing villages being torched, and everyone knows. They all know. Yeah. This whole idea is, you know, did they really know what was going on? Yeah, they do. They do know what's going on, you know, to lesser or greater detail. Of course, you know, there's some people who don't. And, you know, a bit like people know about the news today. Some people do, some people don't. I never read a newspaper. I never listen to the news, you know. So you have that, of course, but it is widely understood and widely known that really brutal things have been going on in\n\n\nThe east and troops are coming back utterly traumatized by what they have taken part in, what they have witnessed, the kind of unspeakable brutality.\nThis is war on a completely different level to anything that's been kind of seen in recent years.\nYeah.\nWe should mention that, you know, the Western Front and the Eastern Front are very different in this regard.\nYes.\nSo a lot of the Holocaust by bullets, the Holocaust with the concentration camps and the extermination camps is not in Germany, is not in the Western Front, is in Poland, is it's in the Soviet Union.\nYeah.\nBut don't forget that even Achvitz, for example, is part of the new Reich.\nIt is part of, you know, it is part of an area which has been absorbed into Germany.\nSo as far as they're concerned, this has now got, you know, it's now no longer got the Polish name.\nIt's now called Ashvitz, which is a German name.\nIt is part of Germany and there are German people moving there into this, you know, aircom model town, and they all know exactly what's going on.\nYeah.\nYou, by the way, have a nice podcast series of four episodes on Ashwitz.\nUm, the evolution of the dream world town that becomes a camp, a work camp, then becomes an extermination camp and a big boona factory for IG Farbin, which never produces a single bit of rubber.\nSo this for sure is something I would have to dive deep in.\nThere's a book you've recommended, KL.\nYes, it's just called KL.\nIt's about the the whole concentration camp system.\nUm, cuz K is concentration, um, in German.\nLaga is a is a camp.\nUm, it's a it's an exhaustive book and I'm I'm full of admiration for him for for writing it just because cheap as it must have been.\nSo I mean, I I was very depressed doing that work on Ashvitz, that deep dive.\nI just found the whole thing utterly dispiriting.\nUm, and I've been there a few times and it's ghastly.\nUm, so how he wrote a whole book on it, I don't know.\nI think in the details there's a there's two ways I think to look at the holocaust.\nOne is uh man's search for meaning about Victor Franco, sort of this philosophical thing about how a human being can confront that and find meaning and what it mean what what does the human condition look like in the context of such uh evil.\nAnd then there is the more sort of detailed, okay, well, how how do you actually implement something like the final solution?\nSo you have this ideology of evil implemented.\nYes.\nAnd at the fine detail of what what are the different technologies used?\nWhat are the different humans in the hierarchy of humans in a camp?\nHow do they what's the actual experience of the individual person who shows up at a camp?\nJust get in the details and in those details I think there's some deep profound human truth that can emerge that the the the mundane, um, one step at a time is how you can achieve evil.\nYeah.\nSo you can get lost in the mundane.\nIt's Yes.\nThe benality of evil.\nIt's um, it's incredible.\nI I I think I think what what is so so completely horrific is is that you know, you know, half the six million were killed by kind of bullets at the back of the head.\nAnd the reason they stopped doing that and they wanted to stop doing that was because the guys said, the perpetrators were finding it so traumatic.\nYou know, him goes and visits um an execution in Ukraine and or maybe he's in the Baltic States.\nI can't remember where he goes, but he but he witnessed some in, you know, in the summer of 1941.\nHe thinks, &quot;Oh, that's horrible.&quot;\nYou know, they don't have to do that.\nI don't want my men having to do that.\nGot to find a more humane way of doing it.\nWhen you talk about more humane way of doing it, humane for the for the executors, executioners, not not for the victims because trust me, cyclone B is not a nice way to go.\nYou know, it basic basically it's bursting all the capillaries in your lungs.\nIt's extremely painful and and you you can no longer breathe and it can take up to 20, 25 minutes.\nYou know, some people it can take a couple of minutes.\nBut all of those who are standing naked in that gas chamber, first of all, extremely humiliated by this process in the first place, then there's a sudden realization of that that they're not having a shower.\nThey're actually being gassed and they're all going to die.\nImagine what you're thinking as that process is you because you might be the first, but you're still going to even the first person is going to know that I can't breathe and I'm I'm dying.\nEveryone else is going to see the first few dying and then going to realize that is what's going to happen to them.\nAnd you've got those minutes, sometimes many minutes where you've got to contemplate that that and and that's that's in extreme pain and panic.\nAnd just think about how cruel that is while being humiliated all the way through.\nWhile being humiliated all the way through.\nAnd so the inverted commas humanity of of of the gas chambers is anything but.\nIt's disgusting.\nA and the fact that people could do this is just beyond terrific.\nAnd then the fact that you are taking your Jewish prisoners and getting them to cut off all the hair, pull out the teeth of the dead before you put them on a lift and incinerate them.\nIf you go to Avitz now and you go to the collapse, the blown up gas chambers which the Germans destroyed before the Russians overran them in January 45, you can still see some of the ash ponds.\nAnd there are bits of bone there but still there from the ash.\nIt's just it is utterly repulsive.\nAnd imagine arriving from that train on that incredibly long journey where you've had no comforts whatsoever.\nYou've had again you've had humiliations and privation, you know, the privations you've had to suffer as a result of that, you know, of having to kind of defecate in a bucket in the corner in front of other people.\nIt's just horrendous.\nAnd then you get there bewildered and immediately your kids are taken away from you or your you know husband and wife who've been married 20 years.\nThey're\n\n\nSeparated just like that, sent off into different groups, straight to the gas chambers.\nI mean, you know, it is the scale of cruelty is so immense.\nIt's hard to fathom.\nAnd the thing that I find really difficult to reconcile, and this is where I think the, you know, the warning from history is important, is that Germany is such an amazing nation.\nYou know, it's the country of Beethoven and Strauss and of Goethe and incredible art and culture and some of the greatest engineers and scientists have ever lived.\nAnd look how quickly it flipped into the descent of unspeakable inhumanity, which manifested itself in the Holocaust and the gas chambers, and the executions into pits and tiny places and creeks in Lithuania or Ukraine or whatever.\nI mean, it's just horrendous.\nAnd you know, this is from a nation which a decade earlier had been a democracy.\nIt seems like as a human civilization, we walk that soldier in line between good and evil.\nIt's a thin line, and we have to walk it carefully.\nYes.\nSo, one of the great battles in World War II on the Western Front is Normandy.\nI have to talk to you about Normandy.\nD-Day, the Normandy landings, the famous on June 6th, 1944.\nThis was an Allied invasion of Nazi-occupied Western Europe.\nWhat was the planning?\nAnd it was lengthy planning.\nWhat was the planning?\nWhat was the execution of the Normandy landings?\nWell, the decision to finally go into, when the Americans joined the war in December 1941, there's the Arcadia conference a few days later, a week later between the British chiefs of staff and political leader Churchill and Roosevelt and his own chiefs of staff about what the policy should be.\nAnd the policy is to get American troops over to Europe as quickly as possible, get them over to Britain, get them training, and get them across the channel ASAP and start the liberation of Europe.\nBut the reality is that in 1942, the Americans just aren't ready.\nYou know, they've gone from this incredibly tiny army.\nThey're still growing.\nThey've got no battlefield experience.\nThe British are still recovering.\nYou know, they're good on the naval power.\nThey're kind of increasingly good on air power.\nBut land power, they've had to kind of make up from the loss of their ally France and expand as well.\nSo kind of ground zero for both America and Britain has been kind of June 1940, when France is out, and suddenly that's the strategic earthquake, and that's the issue that needs settling, and they need to just completely realign everything that they'd fought in 1949.\nThey've got to start again, but it's also becomes clear that they're not really ready in 1943 either.\nAnd one of the problems is that Molotov, who is the Soviet foreign minister, has come over to Britain in May 1942 and said, you know, we need you to kind of do your bit and get on the campaign trail against the Germans and fight on the ground.\nAnd the British sort of going, well, yeah, but you know, cross-channel invasion is not really going to happen.\nWe know we're doing that in North Africa at the moment.\nThen he goes over to Washington and the Americans go, you know, we are definitely going to go and take on the attack to the Germans in 1942.\nThey've made this promise.\nSo in the summer of 1942, it becomes clear that they can't keep that.\nSo Churchill says, \"Well, look, I've got here's an idea.\nYou know, we're in, we've got already got an army in Egypt.\nWhy don't we land another one in Northwest Europe?\nWe can Northwest Africa.\nWe can, that's run by Vichy France, which is pro-French colonies.\nWhy don't we take that?\nWe can do that, and then we can meet in the middle.\nWe can pinch around.\nWe can conquer the whole of North Africa.\nYou can kill two birds with one stone because you can get some experience fighting against Axis troops.\nYou know, test some of your equipment and commanders, you know, what's not to like, and then we can sort of see how it goes.\"\nSo, this is a kind of opportunistic strategy, whereas the Americans are very much sort of, you know, we want to draw a straight line to Berlin, and that's the quickest way, and let's do it that way.\nSo, it's a kind of a different viewpoint, and but Roosevelt kind of gets that and agrees to that.\nSo that's where the whole North Africa Mediterranean campaign comes from.\nAnd as a consequence of the huge commitment to Tunisia, you know, three and a half thousand aircraft, huge navies, you know, two army allied armies in North Africa by the time Tunisia is won in mid-May 1943, they think, well, we got all this here.\nWe might as well kind of really try and get put the nail into the coffin of Italy's war, get them out of the battle.\nYou know, Sicily is an obvious one.\nLet's go in there, and then we can take a view.\nBut between Sicily happening and the fall of North Africa is the Trident Conference in Washington.\nAnd that is where the decisions made.\nThe Americans go, \"Okay, enough of this opportunistic stuff.\nLet's just, okay, we get it.\nWe buy it.\nBut no more faffing around.\nYou know, May 1944, one year hence, we are going to cross the Atlantic.\"\nAnd the British go, \"Okay, fair cop.\nWe'll do that.\"\nSo that is where Operation Overlord, as it becomes, gets given its code name, its operational name.\nThat's when the planning starts.\nSerious planning starts at the beginning of 1944.\nAnd one of the lessons from Sicily to Normandy is that you can't have commanders fighting one battle whilst preparing for the next one.\nSo you have to have a separate command structure.\nAnd that's okay because by this time you got enough people that have got experience with battlefield command that you can actually split it.\nThere are very good reasons for going into Italy, not least getting the fodder airfields so that you can further tighten the noose around\n\n\nAround Nazi Germany.\nAnd one of the great prerequisites for the Normandy invasion is total control of air of the air of the airspace, not just over Normandy, but over a large swathe of northwest Europe.\nWhy is that?\nBecause the moment you land in Normandy, the cat is out of the bag.\nAnd it's then a race between which side can build up meta material quickest.\nIs it going to be the Allies who've got to come from southern England, which is a distance of a slow journey across seas and a distance between kind of 80 and 130 mi away, or is it going to be the Germans that are already on the continent?\nWell, clearly on paper it's the Germans.\nSo, you have to slow up the Germans.\nWell, how do you do that?\nYou do that by destroying their means of getting there.\nSo, bridges, destroy all the bridges over the sane, destroy all the bridges over the RVI, hit the marshalling yards.\nThe German the glue that keeps the German war machine together is the Reichkes barn the German railway network.\nSo destroy the railway as much as you possibly can and make it difficult for the Germans to reinforce the the the Normandy British head as and when it comes.\nBut the way you do that in turn is by very low-level precision bombing and that has to be done by by twin engine faster smaller bombers going in low.\nBut the problem is is you can't go low and and and destroy those bridges if you've got fucker wolves and measure smmiths hovering above you.\nSo you've got to destroy those, which is why you need to have air superiority over this large wave of Northwest Europe to do that.\nThe problem is that while the industrial heartland of Nazi Germany is in the west is in the rural era, which is very convenient for bombers coming out of Lincolnshire or East Anglia on the east flat east side of of Great Britain.\nThe aircraft industry is much deeper into the Reich and it is beyond the the range of fighter escorts for the bombers and the American daylight bombers who are going over are discovering that despite being called flying fortresses they're not fortresses they're actually getting decimated and whenever their bombers go in strength over to try and hit the aircraft industry in Germany beyond fighter range they get decimated first infamously on the Schwin Reagers raid on the 17th of August 1943 coincidentally the same day that Sicily falls to the allies.\nUm, and also coincidentally the same day that face-to-face negotiations begin with the Italians for an armistice in Lisbon.\nBut on that day of the 324 heavy bombers that the Americans send over to hit Schweinford and Regensburg where there are mesh plant and and also a ball bearing plant which is essential for aircraft manufacturing.\nUm, they lose 60 shot down and a further 130 odd really badly damaged.\nAnd even for the vast numbers of manpower and and bombers that are coming out of America, this is too much.\nSo they can't sustain it.\nSo they've got to find a fighter escort that's going to be able to escort them all the way into the into the Reich.\nAnd the race is on because basically if they haven't got one airspace by April 1944, it's game over.\nYou can't do a cross channel invasion.\nYou have to have that control of the airspace beforehand.\nSo the race is on.\nUnfortunately, they come with a solution, which is the P-51 Mustang, which has originally been commissioned in May 1940 by the British, developed from sketches to reality in 117 days.\nIt's a work of absolute genius.\nBut Stal is harnessed with a really bad engine.\nThe Allison engine is just not not right for that aircraft.\nAnd it's not until a Rolls-Royce Merlin, which is the same one that powers the Lancaster, the Mosquito, and Spitfire and Huracan is put into the P-51 Mustang that suddenly you've got your solution because that means it can now fly with extra drop tanks and fuel tanks, it can um it's it's so aerodynamic and it's so good.\nThe higher it goes with this engine, the more fuel efficient it becomes, it can actually fly, you know, over 400 miles, which gets you not just to Berlin and back, but to Warsaw and back.\nSo, suddenly you've got that solution.\nUh and actually by April 1944 they have cleared airspace and by the end of May 1944 just on the eve of the invasion uh operation overlord the closest German aircraft that is seen fighting um allied aircraft is 500 miles from the beach head.\nSo it is absolutely job done.\nMeanwhile, new fighter, comparatively new um ground attack fighter planes like Typhoons and Tempests and adapted um uh um P-47 Thunderbolts are attacking the German radar stations all along the the coastline.\nThey now do have an air defense system.\nUm they're destroying kind of uh um 90% of their effectiveness.\nAnd in the intelligence game, they're winning that one as well.\nThey're just much better because in Germany, intelligence is power.\nSo people tend to you know and Hitler always has this kind of divide and rule thing going on.\nSo you have parallel command structures which is not conducive to bringing together of intelligence and while much play has been made about the successes of Bletchley and code breaking and all the rest of it.\nActually what you have to do is you have to see the kind of the decrypts that the Bletchley cryp analysts do as just a cog and that those various cogs together from listening services to photo reconnaissance to agents on the ground to say the cogs collectively add up to more than some of their individual parts.\nSo the intelligence picture is a broad picture rather than a than just codereing.\nBut anyway they they win that particular battle as well.\nAnd what you see really with D-Day is, I think, is the zenith of coal coalition warfare.\nWhat you've got is you've got multiple nations who have different uh overall aims, different cultures, um different attitudes, different start points, but they have all coalesced into one common goal.\nAnd for until they've achieved that common goal, they're kind of put differences to one side.\nYou know, much play has been made about kind of anglophobia amongst American um commanders and and America phobia amongst ally, you know, British commanders, but actually it's nothing.\nIt's a marriage made in heaven compared to the way Germany teach looks after its own allies, for example.\n\n\nAnd what is remarkable about the allies is they're not actually allies.\nThey're coalition partners.\nSo there's no formal alliance at all.\nAnd uh and there is a subtle difference there, but what you see them is you see them really really pulling together.\nAnd you see that manifest itself on D-Day, I think, where you've got, you know, 6,939 vessels of which there are 1,213 warships, 4,127 assaultcraft, 12,000 aircraft, you know, 155,000 men landed and dropped from the air in 24-hour period.\nIt is phenomenal.\nIt is absolutely phenomenal.\nAnd while it is still seen as a predominantly American show, all three service commanders are British.\nUm it is um most of the aircraft are two-thirds of the aircraft are British.\nUh two-thirds of the men landed are British in Dominion.\nYou never forget the Canadians who consistently punch massively above their weight in the Second World War.\nUm in all aspects, it has to be said, air, land, and sea.\nUm they're key in the Battle of the Atlantic.\nThey're key um in air power.\nTheir key D-Day and indeed in the battle for Italy as well.\nSo the Canadians should never be forgotten.\nUm but but one of the reasons it is that the the that it is the British Navy that dominates in in D-Day is because of course the the incredibly enormous strength of the Royal Navy in the first place.\nBut partly because most of the US Navy is by this stage in the Pacific fighting its own own fight.\nSo it's not slacking by any stretch of the imagination.\nIt is it is because it's elsewhere doing its bit for the kind of overall Allied cause.\nBut D-Day is just extraordinary, you know, and despite the terrible weather, uh, which is a such a debilitating factor in the whole thing.\nI mean, it puts people off course, means many more people get killed on Omaha Beach than they might have done and on other beaches besides incidentally.\nAnd actually, in terms of lives lost proportionally, it is the Canadians that suffer the worst, more so than the Americans.\nIt's just as fewer of them um, overall.\nUm D-Day has to be seen as an unqualified success.\nI mean it is absolutely extraordinary what they achieve and while they don't 100% achieve their overall D-Day objectives you know the objectives are always going to be the outer reach of what is is can be can be achieved and you'd need absolutely perfect conditions for that to happen and they don't get perfect conditions but they're so balanced they're so thought of absolutely everything and and their logistic supply and and I mean even things like the mind sweeping operation it's the biggest single mind sweeping operation of the entire war because there's huge minefields off the Normandy coast and ahead of the invasion force, the mind sweepers, which amount to I think something like 242 different mine sweepers in in five different operations AC opposite every single beach, creating lanes through these minefields through which the invasion force can go.\nNot a single ship is lost to a mine in the actual invasion.\nThat is phenomenal and and and can only be done with the greatest of skill and planning and all in a period where you know there are no computers, there's no GPS, there's nothing.\nI mean it is it is absolutely astonishing and the scale of it is just frankly mind-boggling.\nYeah.\nAnd that was really the the nail in the coffin the beginning of the end.\nYeah.\nFor for Hitler for the European theater.\nYeah.\nOnce you get the the only cause for doubt is will they be able to secure that bridge head.\nThe moment they get that bridge head it is game over.\nThere's only, you know, there is there is no other way it's going to be because of the overwhelming amount of men and material that the allies have compared to the Germans at this stage of the war.\nAnd of course, you know, you're being attacked on three fronts because there's the Italian front to the south and of course in a very major way, you've also got the Eastern front and operation which is launched that that summer as well is enormous.\nSo, let's go to the very end.\nUh the battle of Berlin.\nYeah.\nUh Hitler sitting in his bunker, his suicide, Germany's surrender.\nYou actually said that Downfall, the movie was a very accurate representation.\nI think it is really except that Joseph Goebbels took Sonide and shoot himself.\nDetails, but I think it's probably it might be my favorite uh World War II movie, which is strange to say because it's not really about World War II.\nIt's about Hitler in a bunker.\nBut I think uh was it Bruno Gance, wasn't there?\nI think I think he he nailed him.\nYeah, that's there's so many accounts of that.\nThere's so much written about Hitler.\nThere's so many of there's millions and millions of Hitler's words that you can read.\nYou know, there are translations of many of his conferences.\nYou can see what he's saying.\nHe can get inside his head in a very clear way and much more clearly than you can Stalin or just about any other leader really.\nAnd so what has a very very strong impression of what Hitler was like in the bunker in those last last days that just there's so many accounts of it and it just feels like they nailed it.\nIt just feels like they've got it spot on to me.\nI mean it's a fascinating story of a evil maniac and then and this this certainty you know crumbling right like realizing that this vision of the thousand-year Reich is uh and Hitler says says you know my reputation won't be good to start off with but I hope in a few years time that people start to realize that kind of all the good I was trying to bring.\nYeah that sort of they're all the same aren't they?\nYou always believe you're doing good.\nYeah.\nAnd there's so many deep lessons there.\nSo now you have written so much, you have said so much, you have studied this so much.\nWhat to you looking at World War II is uh the lessons we should take away.\nWell, I suppose it's it's it's what happens when you allow these individuals to take hold of great power and great authority and make these terrible decisions.\nIf you allow that to happen, you know, there are consequences and you have to be you have to recognize the\n\n\nMoments of trouble when they arise.\nSo when there are financial crisis, you know that political unrest is going to come and you need to be prepared for that.\nYou know, you need to be able to see the writing on the wall.\nYou can't be complacent.\nComplacency is such a dirty word, isn't it?\nYou've got to keep your wits and you can't take things for granted.\nYou've got to recognize, I think, um, that the freedoms we enjoy in the West are, you know, they're not necessarily permanent and you need to make the most of them while you've got them and cherish them and consider what happens if the milk turns sour and what the consequences of that are.\nI mean, actually overriding because although I don't think it'll ever be a war on the scale of the Second World War, you've only got to look at pictures of those opening days of the war in Ukraine and see sort of knocked out Russian tanks and dead bodies, bloated bodies all over the place, put that into black and white and, you know, it could be the road out of Fal in 1944.\nIt could be, you know, any number of German battlefields in World War II and the similarities and the trenches and the kind of people hiding in foxholes and, you know, that's horribly reminiscent as are the huge casualties that they're suffering on both sides, whether they be Russian or Ukrainian.\nAnd, you know, it's a shock.\nIt's a shock to see that.\nUm, and it reminds you of just how quickly I think things can descend.\nSo that's that's uh that's the other thing you know that point I was making about how quickly Germany descended from this amazing nation of arts and culture and science and development and engineering into one of the Holocaust.\nI mean life is fragile and peace is fragile and you know it's you take it for granted at your peril and you take for granted at our peril that nobody will use nuclear weapons ever again and that's not a thing we should take for granted.\nNo sir.\nWhat gives you hope about the future of human civilization?\nWe've been talking about all this darkness in the 20th century.\nWhat's the source of light?\nThe source of light is that I think the vast majority of people are good people who want to live peacefully and want to live happily and are not filled with hate.\nAnd there are some brilliant minds out there.\nAnd I think the capacity for the human brain to come up with new developments and new answers to problems and challenges is infinite.\nAnd I think that's what gives me hope.\nJames, this is uh I'm a big fan.\nThis was an honor to talk to you and please keep putting incredible history out there.\nUm I can't wait to see what you do next.\nThank you so much for talking today.\nWell, thank you, Lex.\nIt's been a It's a privilege to talk to you.\nThanks for listening to this conversation with James Holland.\nTo support this podcast, please check out our sponsors in the description or at lexfreeman.com/sponsors.\nAnd now, let me leave you with some words from Winston Churchill.\nIf you're going through hell, keep going.\nThank you for listening and hope to see you next time.\n"
}