{
  "episode": {
    "id": "gtmJi8LbAts",
    "title": "Iran War Debate: Nuclear Weapons, Trump, Peace, Power & the Middle East | Lex Fridman Podcast #473",
    "publishedAt": "2025-06-26T17:28:29.000Z",
    "description": "Debate on Iran war between Scott Horton and Mark Dubowitz. Scott Horton is the author and director of the Libertarian Institute, editorial director of Antiwar.com, host of The Scott Horton Show, and for the past three decades, a staunch critic of U.S. foreign policy and military interventionism. Mark Dubowitz is the chief executive of the Foundation for Defense of Democracies, host of the Iran Breakdown podcast, and a leading expert on Iran and its nuclear program for over 20 years. This debate was recorded on Tuesday, June 24, after the Iran-Israel ceasefire was declared.\nThank you for listening ❤ Check out our sponsors: https://lexfridman.com/sponsors/ep473-sb\nSee below for timestamps, transcript, and to give feedback, submit questions, contact Lex, etc.\n\n*Transcript:*\nhttps://lexfridman.com/iran-israel-debate-transcript\n\n*CONTACT LEX:*\n*Feedback* - give feedback to Lex: https://lexfridman.com/survey\n*AMA* - submit questions, videos or call-in: https://lexfridman.com/ama\n*Hiring* - join our team: https://lexfridman.com/hiring\n*Other* - other ways to get in touch: https://lexfridman.com/contact\n\n*EPISODE LINKS:*\nMark's X: https://x.com/mdubowitz\nMark's Podcast: https://youtube.com/playlist?list=PLmEsAFBNkqsMQnt5pypwEX0ul0NyIjd3E\nThe Foundation for Defense of Democracies (FDD): https://www.fdd.org/\n\nScott's X: https://x.com/scotthortonshow\nScott's YouTube: https://youtube.com/@scotthortonshow\nScott's Podcast: https://www.scotthortonshow.com/\nScott's Website: https://scotthorton.org/\nScott's Books: https://amzn.to/3T9Qg7y\nThe Libertarian Institute: https://libertarianinstitute.org/\nAntiwar.com: https://antiwar.com/\n\n*SPONSORS:*\nTo support this podcast, check out our sponsors & get discounts:\n*Hampton:* Community for high-growth founders and CEOs.\nGo to https://lexfridman.com/s/hampton-ep473-sb\n*Notion:* Note-taking and team collaboration.\nGo to https://lexfridman.com/s/notion-ep473-sb\n*Shopify:* Sell stuff online.\nGo to https://lexfridman.com/s/shopify-ep473-sb\n*Oracle:* Cloud infrastructure.\nGo to https://lexfridman.com/s/oracle-ep473-sb\n*LMNT:* Zero-sugar electrolyte drink mix.\nGo to https://lexfridman.com/s/lmnt-ep473-sb\n\n*OUTLINE:*\n0:00 - Episode highlight\n1:15 - Introduction\n2:18 - Iran-Israel War\n11:00 - Iran's Nuclear Program\n42:52 - Nuclear weapons and uranium\n54:55 - Nuclear deal\n1:20:29 - Iran Nuclear Archive\n1:43:06 - Best case and worst case near-term future\n2:18:30 - US attack on Iran - Operation Midnight Hammer\n2:42:04 - Nuclear proliferation in the future\n3:03:02 - Libertarianism\n3:15:51 - Foundation for Defense of Democracies (FDD)\n3:31:26 - Trump and Peacemaking process\n3:36:23 - WW2\n3:49:23 - WW3\n\n*PODCAST LINKS:*\n- Podcast Website: https://lexfridman.com/podcast\n- Apple Podcasts: https://apple.co/2lwqZIr\n- Spotify: https://spoti.fi/2nEwCF8\n- RSS: https://lexfridman.com/feed/podcast/\n- Podcast Playlist: https://www.youtube.com/playlist?list=PLrAXtmErZgOdP_8GztsuKi9nrraNbKKp4\n- Clips Channel: https://www.youtube.com/lexclips\n\n*SOCIAL LINKS:*\n- X: https://x.com/lexfridman\n- Instagram: https://instagram.com/lexfridman\n- TikTok: https://tiktok.com/@lexfridman\n- LinkedIn: https://linkedin.com/in/lexfridman\n- Facebook: https://facebook.com/lexfridman\n- Patreon: https://patreon.com/lexfridman\n- Telegram: https://t.me/lexfridman\n- Reddit: https://reddit.com/r/lexfridman"
  },
  "channel": {
    "id": "UCSHZKyawb77ixDdsGog4iWA",
    "name": "Lex Fridman",
    "slug": "@lexfridman",
    "url": "https://www.youtube.com/@lexfridman"
  },
  "transcript": "If we want to avoid wars, we have to have serious deterrence because our enemies need to understand we will use selective, focused, overwhelming military power when we are facing threats like an Iranian nuclear weapon. I'm not seeing the peace through strength. I'm saying permanent militarism and permanent war through strength. Do you ever hold our adversaries responsible or do you just don't think we have any adversaries? The easiest kind of nuke to make out of uranium is a simple gun type nuke. Are you saying that Mossad fabricated it? That's what you're claiming. Here's the offer. Take it or leave it. Zero enrichment. Full dismantlement. The Iranians told the IAEA, \"You can inspect any five out of 10 facilities here. Cart Blanch, go ahead.\" And they did and found nothing. Experts in Iran's nuclear program, including David Albbright, who actually saw the archive, went in there, wrote a whole book on it, and there's a lot of detail about how Iran had an active nuclear weapons program called the Mad to build five nuclear weapons. I have to refute virtually everything he just said, which is completely false. I mean, really everything. There was not one thing I said that was true. Just one thing. I mean, Iran is a nation over there somewhere. You got that part right. 22 years of working on Iran, and I got that right. But do you know the population of 92 million? Okay, give me a pound, dude. There we go. Agreement.\n\nThe following is a debate between Scott Horton and Mark Dubowitz on the topic of Iran and Israel. Scott Horton is author and editorial director of anti-war.com, host of the Scott Horton Show, and for the past three decades, a staunch critic of U.S. foreign policy and military interventionism. Mark Dubowitz is a chief executive of the Foundation for Defense of Democracies, host of the Iran Breakdown podcast, and he has been a leading expert on Iran and its nuclear program for over 20 years. This is the Lex Fridman Podcast. To support it, please check out our sponsors in the description and consider subscribing to this channel. If you do, I promise to work extremely hard to always bring you nuanced, long- form conversations with a very wide range of interesting people from all walks of life. And now, dear friends, here's Scott Horton and Mark Dubowitz.\n\nGentlemen. All right. It's great to have you here. Uh let's try to have a nuanced discussion slash debate and uh maybe even steel man opposing perspectives as much as possible. All right. As it stands now, there's a barely stable ceasefire between Iran and Israel. Let's uh maybe rewind a little bit. Uh can we first lay out the context for this Iran-Israel War and try to describe the key events that happened over the past two weeks? Maybe even the uh a bit of the deep roots of the conflict.\n\nSure. Like first of all, thanks so much for having me on. Great to be on with Scott. I know he and I don't agree on a lot, but I certainly admire the passion and and the dedication to stopping wars. So that's something we want to talk about. So let's talk about how we got to this war. So, President Trump comes into office and immediately lays out that his Iran strategy is maximum pressure on the regime and he will not allow Iran have a nuclear weapon and he and he makes that clear consistently. I think made it very clear during his first term made a clear throughout his career and thus beguns this process with the Iranians which has kind of multiple tracks but the one that Trump sees most interested in at the time is the diplomatic track and he makes it very clear from the beginning in a sort of Oval Office remark. He says the Iranians can either blow up their nuclear program under U.S. supervision or someone's going to blow it up for them. And even though, you know, at the time we think Netanyahu is really trying to push the president into a military campaign, well, I'm sure we'll talk about that throughout the podcast, the president authorizes his lead negotiator and close friend Steve Witkoff to begin outreach to the Iranians and and thus begun the Oman round. And it's Oman round because it's taking place in Oman with mediation efforts by the Omanis. There are five rounds of negotiations with the Iranians. And through the course of those negotiations, the U.S. finally puts on the table an offer for Iran. We'll talk about the details of that. The Iranians reject that offer and we're now into the sixth round which is supposed to take place on a Sunday. Uh on the Thursday before the Sunday, the Israelis strike and they go after in a rather devastating campaign over a matter of now 12 days. They go over and go after Iran's nuclear program, the key nuclear sites. Um, going after weapon scientists who are responsible for building Iran's nuclear weapons program, and also go after top IRGC, Islamic Revolutionary Guard commanders as well as top military commanders. And yet, there's still this one site that is the most fortified site. It's called Fordo. It's an enrichment facility. It's buried under a mountain, goes about 80 m deep. It's encased in concrete. It has advanced centrifuges and highly enriched uranium. The Israelis can do damage to it, but it's clear it's going to take the United States and our military power in order to severely degrade this facility. And Trump orders the United States Air Force to fly B2 bombers and drop 12 massive Ordinance penetrators, which are these 30,000 pound bombs on Fordo in order to, as he said, obliterate it more realistically, to severely degrade it. So that happens. Um, and then he offers the Iranians, as he's been offering all the way through, you have an option. You can go back to Oman. I told you Oman and you decided to force me to go to Fordo but now we can go back for negotiations and he forces a ceasefire on the Iranians gets the Israelis to agree and that's where we are today like we're at a as you say a tentative ceasefire that just came into effect and we'll see now if the Iranians decide to take President Trump on his repeated offers join him in Aman for another round of negotiations.\n\nScott, is there some stuff you want to add to that?\n\nSure. Well, he started with uh January, right? Trump's second term here and the maximum pressure campaign. Essentially, as should be clear to everyone now, all these negotiations were just a pretext for war. Trump and his entire cabinet must have known that the Ayatollah is not going to give up all enrichment. That is their latent nuclear deterrent. Their posture has been heavily implied. Don't attack us and we won't make a nuke. While America's position was if you make a nuke, if you start to, we'll attack you. So, it was the perfect standoff. But what happened was, and you might remember a few weeks ago, there was some talk about, well, maybe we could find a way to compromise on some enrichment. Maybe they could do a consortium with the Saudis. Maybe there's some way that we And then, nope, the pressure came down. No enrichment. Zero enrichment. But that's a red line. Everyone knows that there's and even now uh it's probably less likely than ever that they're going to give up enrichment. Sure, they bombed Fordo, but they didn't destroy every last centrifuge in that place. And the Iranians are already announcing that they're already begun construction on another facility under a taller mountain buried even deeper. And you know, they figured out how to enrich uranium hexaflloride gas, you know, what 20 years ago now. And uh they will always be able to. And this is the slippery slope that we're on with these wars is in fact um I saw our friend here on TV the other day as he almost pretty much just implied there saying well now Trump has to go in. You know we were told it's just Israel doing it. Don't worry. But then no Trump has to hit Fordo or else now they'll break out toward a nuclear weapon. So, in for a penny, in for a pound, in for a ton, and now once we bomb Fordo again and Natans again and the new facility again, then it'll be decided that no, as Benjamin Netanyahu said the other day, you know what would really solve this problem? If we just kill the Ayatollah, then everything will be fine. Then we'll have a regime change. And then what? Then we'll have a civil war with bin Laden again in the catbird seat just like George Bush put them in Iraq and Barack Obama put them in Libya and in Syria and we'll have Azeris and Belooki suicide bombers and Shiite uh you know revolutionaries and whoever all vying for power in the new absolute chaos stand. If you listen to the administration and Mr. to do was they're essentially just implying that like, oh yeah, mission accomplished. We did it. Their nuclear program is destroyed. Now we don't have to worry about that anymore. But that's not true. Now it there's every reason to believe and we don't know for sure. There's every reason to believe that at least is much more likely now that the Ayatollah will change his mind about God changing his mind and we'll say that actually maybe we do need a nuclear deterrent. That's really what it's been for this whole time is a bluff. We have bullets in one pocket, revolver in another. Let's not you and me fight and escalate this thing. It's the same position, by the way, as Japan and Germany and Brazil. Two of the three of those are under America's nuclear umbrella, I admit. But still, where they've proven they've mastered the fuel cycle and they can make nuclear weapons. But hey, since nobody's directly threatening them now, why escalate things and go ahead and make atom bombs? That has been their position the whole time because after all, they could not break out and make a nuke without everyone in the world knowing about it. And that's why, Lex, and I'm sure you can vouch for me on this, if you've been watching TV over the past few weeks, you'll hear Marco Rubio and all the government officials and all the Warhawks say, \"Oh yeah, 60%, 60%. What do you think they need with that 60%.\" Implying that, oh yeah, see, they're racing toward a bomb. But you see how they always just imply that. They won't come right out and say that cuz it's a ridiculous lie. They've been they could have enriched up to 90 plus% uranium 235 this whole time. The reason they were enriching up to 60% was in reaction to Israeli sabotage. First of all, assassinating their nuclear scientists and then their sabotage at Natans. They started enriching up to 60% just like they did in the Obama years to have a bargaining chip to negotiate away. Under the JCPOA, they shipped out every bit of their enriched uranium to France to be turned into fuel rods and then shipped back into the country to be used in their reactors. And so, they're just trying to get us back in that deal. It is an illusion. It is. And I don't know exactly what's in this man's mind, but it's just not true that they're making nuclear weapons. And it has been a lie of Benjamin Netanyahu and his lood party regime and for that matter the Kadima regime of Ahudmer before him that this is a threat that has to be preempted when in fact it never was anything more than a latent nuclear deterrent.\n\nMaybe a good question to ask here is what is the goal for the United States in Iran in relation to the nuclear uh Iran's nuclear program? What is the red line here? Does Iran have this uh need for a latent nuclear deterrent and what what is the thing that's acceptable to the United States and to the rest of the world? What should be acceptable?\n\nYeah, L. So, there was a lot to unpack there. So let's sort of just back up a little bit. Let's talk about first of all the regime itself. Islamic Republic of Iran came into power in 1979. Um it has been declared a leading state sponsor of terrorism by multiple administrations dating back to the Clinton administration um by Obama, by Biden, by Trump and it is a regime that has killed and maimed thousands of Americans, not not to mention obviously uh hundreds of thousands of Middle Easterners. Um it is a regime that has lied about its nuclear program. It never actually disclosed its nuclear sites. All these sites were discovered by um Iranian opposition groups, by western intelligence agencies. And the International Atomic Energy Agency, which is the UN agency responsible for preventing proliferation, has come out again and again over many, many years in reports, very detailed reports describing Iran's nuclear weapons program. Um, there have been multiple attempts at diplomacy with with Iran. I'm sure we're going to talk about it. Scott mentioned the JCPOA, so we should certainly talk about the JCPOA, which was the 2015 deal that Barack Obama reached with Iran. Um, but multiple attempts to to actually get the Iranians to negotiate away their nuclear weapons program. I mean, it's worth mentioning that if Iran wanted to have civilian nuclear energy, there are 23 countries in the world that have it, but they don't have enrichment and they don't have reprocessing. uh we we sign these deals called the gold standard with the South Koreans, with the Amiradis, with others and we say if you want civilian energy, you can have power plants, you can buy your fuel rods from abroad, but there's no reason to have enrichment or plutonium reprocessing because those are the key capabilities you need to develop nuclear weapons. Now the five countries that have those capabilities and don't have nuclear weapons are Argentina, Brazil, Holland, Germany, and Japan. And I think it's the view of many administrations over many years, including many European leaders, that that the Islamic Republic of Iran is very different from those aforementioned countries, because that it is been dedicated to terrorism. It's been killing Americans and other Westerners and other Middle Easterners, and it is a dangerous regime. You don't want to have that dangerous regime retaining the key capabilities and needs to develop nuclear weapons. But I but I want to kind of get back more to the present mentioned this was around negotiations out of Oman. Scott saying that President Trump had said here's the offer. Take her to leave it. Zero enrichment full dismantlement. Well, in fact, that wasn't the offer that was presented to the Iranians at Oman. The offer was a one-page offer and it said you can temporarily enrich above ground. You've got to render your below ground facilities quote nonoperational and then at some time in the future three four years as Scott said there'll be a consortium that'll be built not on Iranian territory. It'll be a partnership with the Saudis and the Amiradis. It'll be under IAEA supervision and that enrichment facility will create fuel rods for your nuclear reactors. So that was the offer presented to Iran and that offer would\n\n\ncome with significant sanctions relief.\nBillions of dollars that would go to the regime.\nObviously, the economy there has been suffering.\nThe regime has not had the resources that it's had in the past to fund its, what I call, its axis of misery, its proxy terror armies around the world.\nAnd it was a good offer.\nAnd I was shocked that Kame rejected it.\nUm, he did reject it.\nAnd I think he rejected it because I think he believed that he could continue to do to President Trump what he had done to President Obama, which is just continue to squeeze and squeeze and squeeze the Americans at the table in order to ensure that he could keep all these nuclear facilities, all these nuclear capabilities so that at a time of his choosing, when President Trump is gone, he can develop nuclear weapons.\nNow, it is a bit interesting to say that Iran has no intention to develop nuclear weapons.\nAnd let's examine the nuclear program and ask, does this sound like a regime that's not interested in building nuclear weapons?\nSo, they built deeply buried underground enrichment facilities that they hid from the international community and they didn't disclose.\nThey had an active nuclear warhead program called Ahmad, which ended in 2003 formally when the U.S. invaded Iraq.\nAnd we know that because not only has that been detailed by the IAEA, but actually Mossad in a daring operation in Thran took out a nuclear archive and brought it back to the West.\nAnd then the IAEA, the U.S., and the intelligence communities went after this detailed archive, went into it, and discovered that this supreme leader Ayatollah had an active program to build five atomic warheads and was a very detailed program with blueprints and designs, all of which was designed under Ahmad to build a nuclear weapons program.\nSo again, it's interesting to say that he doesn't have the intention to build nuclear weapons when he actually had an active nuclear weapons program.\nU and we can talk about what happened to that program after 2003, and there's a lot of interesting details.\nSo when you combine the fact that he has an active nuclear weapons program, he has sites that are buried deep underground, he has weapon scientists who come out of the Ahmad program and continued to work on the initial metallurgy work and computer modeling designed to actually begin that process of building a warhead.\nAnd all of this has been hidden from the international community.\nHe has spent estimates of a half a trillion dollars on his nuclear program in direct costs and in sanctions costs.\nAnd one has to ask, and I think it's an interesting question to compare the UAE and Iran, right?\nThe UAE signed the gold standard.\nThey said we'll have no enrichment capability or reprocessing.\nThey spent about $20 billion on that, and it supplies 25% of their electrical generation.\nKame spent a half a trillion, and that program supplies maybe 3% of their electrical needs.\nIn fact, they have a reactor that they bought from the Russians called Bucher.\nAnd there that reactor, it's exactly what you'd want in a proliferation-proof reactor.\nThey buy fuel rods from the Russians.\nThey use it, and they send the spent fuel back to Russia so it cannot be reprocessed into plutonium.\nSo, I just think it's important for your listeners to understand just some of the technical nuclear history here in order to unpack this question of did Kam want nuclear weapons?\nWhat was his goal here?\nAnd then we can talk about was this the right operation in order to for the U.S. to order the B2 bombers to strike these facilities in what again was a limited operation as President Trump has said and in order to drive the Iranians back to the negotiating table and finally do the deal that President Trump has asked them to do since he came into office in January.\nYeah, that is one of the fascinating questions whether this operation midnight hammer increased or decreased the chance that the Iran will develop a nuclear weapon.\nBefore you ask any more questions, I have to refute virtually everything he just said, which is completely false.\nI mean, really everything.\nThere was not one thing I said that was true.\nJust one thing.\nI mean, Iran is a nation over there somewhere.\nYou got that part right.\nAll right.\n22 years of working on Iran and I got that right.\nBut do you know the population of Iran?\n92 million.\nOkay.\nSo, first of all, they were trying to buy a lightwater reactor from the Europeans or the Chinese in the 1990s, and Bill Clinton wouldn't let them.\nAnd put tremendous pressure on China to prevent them from selling them a lightwater reactor, a turnkey reactor that produces waste that's so polluted with impurities that you can't make nuclear weapons fuel out of it.\nBy the way, they never have to this day had a reprocessing facility for reprocessing plutonium, even their current plutonium waste for their he from their heavy water reactor at Bucher to make weapons fuel out of that.\nThey have no plutonium route to the bomb under the JCPOA.\nIraq, not Bucher.\nThere's a difference between Iraq.\nIraq is a, Iraq is where they pour concrete into the reactor and shut it down.\nAnd the reason they poured concrete under the JCPOA, not they, but the Obama administration, he's right, under the JCPOA poured concrete into Kindria in order to prevent them from using that reactor to reprocess plutonium.\nSo there's a distinction between Iraq and Bucher.\nScott's exactly right.\nBusher is a reactor, a heavy water reactor provided by the Russians, as I described, for the generation of electricity.\nIt's proliferation proof.\nIraq has is the opposite.\nIt's a heavy water reactor that was built for a plutonium pathway to nuclear weapons, which is exactly why under the JCPOA, they literally had to pour concrete into the into the middle of it to prevent it from reprocessing plutonia.\nI think we're going to need a scientist to come in here and split the difference.\nOr maybe we need to go and look up some IAEA documents cuz I don't believe that Iraq ever had a reprocessing facility for their plutonium waste.\nAnd the deal under the JCPOA, the Russians would come and get all their plutonium waste, which the waste comes out all polluted and not useful.\nYou need the reprocessing facility to get all of the impurities to clarify.\nIt could be that I'm wrong about that, but I don't believe that they ever had a reprocessing facility at Iraq that they could use to remove all those impurities and then have weapons plutonium fuel as the North Koreans do.\nSo the Obama administration was very clear under the JCPOA, we are going to pour concrete into the into the Iraq facility as as Scott acknowledged because we are concerned that Iraq can be used for reprocessing plutonium for plutonium pathway to a nuclear weapon.\ncan be used, but we don't know if it was used.\nOh, we know it never was.\nThere never was any reprocessing of weapons fuel there.\nBut there was concrete.\nI'm I'm happy to there's no indication.\nFor your viewers who are interested and not to plug my own podcast, so I apologize, but it is a very good podcast.\nI just recently had David Albbright on my podcast, who is actually a physicist and a weapons inspector and goes into a lot of detail about the Iranian nuclear program.\nPlease listen to the podcast.\nIran Breakdown, by the way, is the name of the podcast.\nYeah.\nAnd David's the president of the Institute for Science and International Security, by the way, spent decades on this.\nAnd to his credit, he was one of the deep skeptics of the Bush administration's rush to war with Iraq.\nAnd that's not true.\nHe vouched for claims that there were chemical weapons in Iraq and later said he was sorry for it.\nAgain, I mentioned the Bush administration's rush to war based on their claims that Saddam was building nuclear weapons.\nHe did debunk the aluminum tubes, though.\nHe debunked it, and he was a deep skeptic again of the of the Russia War in Iraq.\nYou know the argument today, Lex, which I think is the more interesting argument because there are very few people left today who don't believe that the Iranians were building the nuclear weapons capability that gave them the option to build nuclear weapons.\nI already said that.\nWe can debate, we can debate whether they had decided to, and and we I'm interested to hear Scott's opinion on this, but the recent intelligence that has come out that the Iranian nuclear weapons scientists have begun preliminary work on building a warhead came out from where this intelligence that came out, who put that in?\nIsraeli claims not verified by the U.S. and the Wall Street Journal anywhere, right?\nLet's talk about, let's talk about all of my list of reputations of all your false claims.\nCan the Wall Street Journal did verify this?\nLawrence Norman to refute one time.\nLawrence Norman actually wrote a piece.\nThis was during the Biden administration.\nUm, because the Biden DNI had actually come out and for the first time in their annual threat assessment had removed a line that said Iran is not working currently working on developing any capabilities that would put it in a position to to actually deliver a nuclear warhead.\nAnd what be what became the Lawrence Norman piece in the Wall Street Journal was that there actually was initial work done on metallurgy and on computer modeling.\nAnd so those actually were defined terms in section T of the 2015 JCPOA, which defined weaponization in that section.\nAnd metallergy and computer modeling were some of the initial steps.\nSo that the DNI was very concerned under Biden that these initial steps meant that either Kame had given the green lights or nuclear weapons scientists in order to get ahead of the boss so they could be in a position if he decided to move forward on this were in a position and their timelines were therefore expedited.\nSo it's interesting.\nI mean, again, you've got the DNI under Biden, you've got the CIA director, John Ratcliffe, you've got Israeli intelligence, you've got the Wall Street Journal, and you've got the IAEA asking questions of Iran on its past weaponization activities.\nWhy are you denying us?\nWho's the dog that didn't bark there?\nThe current director of national intelligence who issued her threat assessment, Trump's director of national intelligence, Tulsi Gabbard, who issued her threat assessment in February, that repeated the exact same language that from the national intelligence estimate of 2007 and that the CIA and the NIE, the National Intelligence Council have reaffirmed repeatedly ever since then, which is that Supreme Leader has not decided to pursue nuclear weapons.\nHe has not made the political decision to pursue nuclear weapons.\nShe testified in fact in under oath in front of the Senate in March.\nAnd then according to CNN and the New York Times, there was a brand new that assessment that was put together the week before the attack was launched reaffirming the same thing.\nAnd at least in history, if you read it in Harets, MSAD agreed with the CIA.\nI'd like to just sort of quote CIA director John Radcliffe because Scott brought brought up the CIA and the intelligence community.\nI think Radcliffe had a good way of looking at this is and that he said is, you know, when you're in the 99 yard line as a football team, you have the intention to score a goal, quote unquote.\nAnd what what he was what he was actually pointing to is let's not talk about this debate about whether Kame had given the order or not given the order because Kame knows that if he gives an order, the U.S. and Israeli intelligence community will pick up on that order and that will be the trigger for strikes.\nWhat Rackcliffe is saying is that Kame had built the nuclear weapons capability, he's at the 99 yard line and both the CIA and European leaders, European intelligence community has said for years that if Iran has that capability and they're on the 99 yard line, at that point it's going to be too late to stop them once that decision is made to to assemble the final warhead, which by the way is the final piece of what you need for a deliverable nuclear weapon.\nThat's not true at all.\nRight.\nThey have to resort to a crude analogy about football yard lines because they can't say the truth, which is that they had zero weapons grade uranium.\nThey were not producing it.\nThey were trying to get the United States back in the deal that they are still officially within the JCPOA with the rest of the UN Security Council wherein they shipped all of their enriched uranium stockpile out of the country to France to be transferred to fuel rods.\nTheir insistence was on their continued ability to enrich uranium.\nAnd so this goes to one of the things that he at least sort of brought up that deserves addressing.\nWhen Trump came into power in 2017, he decided on this Israeli influence maximum pressure campaign and he said the JCPOA was the worst deal in the history of any time any two men ever shook hands and all these kinds of things in his hyperbolic way, which of course made it very difficult for him to figure out a way to stay in the thing or to to compromise along its lines.\nUh, but the fact of the matter is if he had just played it straight and said, &quot;Listen, Ayatollah, we don't have to be friends, but we do have a deal here, which my predecessor struck with you, but I don't like these sunset provisions, and I want to send my guys over there and see if we can figure out a way to convince you that we really wish you'd shut down commto together or this or that or the other thing.&quot;\nAnd tried to approach them in good faith.\nWe talk about yard lines and things.\nWe had a JCPOA.\nOkay.\nSo toward peace, we were past the 50-yard line.\nDonald Trump could have gone to Tyrron and shook hands with the Ayatollah.\nAs Dick Cheney complained that we had cold relations with Iran back in 1998 when he was the head of Allebertton and said, &quot;We can do business with these guys.&quot;\nUm, Donald Trump could have gone right over there and done business, and instead he gave into Netanyahu's lies in this ridiculous hoax that they had uncovered all these Iranian nuclear documents, which he pretends is legit, where all they did was recycle the fake Israeli forged smoking laptop of 2005, which they lied and pretended was the laptop of an Iranian scientist that was smuggled out of Iran by his wife and had all this proof of a secret Iranian nuclear weapons program on it.\nBut every bit of that was refuted, including the thing about the warhead, he said, was refuted by David Albbright and his friend David Sanger in the New York Times that all those sketches of the warhead for the missile were wrong because when MSAD forged the documents, they were making a good educated guess, but they didn't know that Iran had completely redesigned the nose cone of their mid-range missiles and had an entirely different nose cone that would require an entirely different warhead than that described in the documents.\nAnd why would they have been designing a warhead to fit in a nose cone that they were abandoning?\nAnd so that was refuted.\nDavid Albbright completely discredited your claims there, pal.\nAnd then they later admitted that it was a CIA laptop.\nThere was no laptop.\nAnd they later admitted Ali Hin\n\n\nOnin admitted, uh, who was a very hawkish, uh, uh, one of the, not director, but a high-level executive at the International Atomic Energy Agency, admitted that that intelligence was brought into the stream by the Mujahedeen-e-Khalq, a communist terrorist cult that used to work for the Ayatollah during the revolution, then turned on him and he turned on them and kicked them out.\nThen they went to work for Saddam Hussein, where they helped crush the Shiite and Kurdish insurrection of 1991, and then they became America, Donald Rumsfeld's and Ariel Sharon's sock puppets, and later Ahoud Almer's sock puppets when the U.S. uh, invaded Iraq and took possession of them.\nThey're now under American protection in Albania.\nAnd these are the same cooks who, just a few weeks ago, you might remember, said, \"Look, new satellite pictures of a whole new uh, nuclear facility in Iran.\"\nIsn't it funny how no one ever brought that up again?\nDidn't bomb it.\nIt was nothing.\nIt was fake.\nJust like before when they said, \"Hey, look, here's a picture of a vault door.\"\nAnd behind that is where the secret nuclear weapons program is.\nExcept, turned out that vault door was a stock photo from a vault company.\nIt meant nothing.\nAnd they had repeatedly, uh, you know, made claims that were totally refuted.\nJust like I'm about to refute his claim that they ever were the ones who revealed, for example, Natanz.\nHe was implying that Natanz and Qom were both buried and hidden until revealed, I think you said, by dissident groups.\nThat is the MEK sock puppets of the Israelis.\nBut it was your friend David Albright, not the Israeli Mossad through the MEK, who revealed Natanz's facility.\nAsk him, he'll fist fight you over it.\nHe claims credit.\nHe was first and said, \"This is a facility.\"\nHowever, they were not in violation of their safeguards agreement with the IAEA.\nThey were still six months away from introducing any nuclear material to that facility.\nAnd so when it was revealed, they weren't in violation of anything.\nAnd, uh, and then on, we had a huge fight about this at the time.\nThe party line came down in from all the government officials and the media that they had just exposed the facility there.\nQom is the same thing.\nUh, when in fact that wasn't true.\nThe IA, the, the Iranians had announced to the IAEA that we have built a new facility here and we are going to introduce nuclear material into it within six months.\nSo here's your official notification.\nAnd then a few days later, they just pretended to expose it when it was the Iranians themselves who had admitted to it in, in, uh, going along with their, uh, uh, obligations under their safeguards agreement.\nSo it's just completely wrong.\nWhy do they bury him?\nThey buried them for protection because clearly the Israelis have indicated since the 1990s that they consider any nuclear program in Iran to be the same thing as an advanced nuclear weapons program.\nYou're hearing that today.\nFor them to have a nuclear facility at all is is equivalent to them going ahead and breaking out and making a nuclear weapon.\nAnd so, of course, they know that they have to have it buried to protect it from Israel.\nThat doesn't mean that they are trying to get nukes.\nIt does mean, as I already said, that they wanted to prove to the world that they know how to enrich uranium and that they have facilities buried deeply enough where if we attack them, that would incentivize them to making nukes, and then we would might be unable to stop them without going all the way toward a regime change, which they're bluffing, basically betting that we won't go that far, considering how gigantic their country is and how mountainous and populous it is compared to Iraq next door.\nNow, here's some more things that he said that weren't true.\nSo, he said, \"Iran has been killing Americans all this time.\"\nWell, that's almost always a reference to Beirut 1983, which you can read in the book by Way of Deception by Victor Ostrovsky, the former Mossad officer, that the Israelis knew that they were building that truck bomb to bomb the Marines with and withheld that information from the United States and said that's what they get for sticking their big noses in.\nAnd, uh, that is in the book by Way of Deception by Victor Ostrovsky.\nAnd by the way, the Israelis were friends with them at with Iran at the time in, uh, all through the 1980s.\nAnd it was just a couple of years later when Ronald Reagan sold Iran missiles and using the Israelis as cutouts to do so when he switched sides temporarily in the Iran-Iraq War.\nAnd so that's just, and that was in 1983.\nIf Ronald, if Ronald Reagan can sell missiles a year or two years after that, three years after that, then surely the United States and the Ayatollah can bury the hatchet from that.\nAnd no one's ever even, I don't believe, ever really proven that Tyrron ordered that.\nIt was a Shiite militia backed by Iran that sort of proto-Hezbollah that did that attack that killed those Marines.\nUm, and if there's some responsibility for then damn them, like if there's direct responsibility for that, not just their support for the group, then damn them for that.\nBut that's still no reason in the world to say that we can't get along with them now when that was in the same year Return of the Jedi came out.\nOkay.\nAnd then, uh, the other one, and this is always referred to, you'll see this on TV news today.\nAnyone watching this, turn on TV news and you'll hear them say Iran killed 600 Americans in Iraq War II.\nBut that's a lie.\nThere was a gigantic propaganda campaign by Dick Cheney and his co-conspirators David Petraeus and Michael Gordon of the New York Times, now at the Wall Street Journal, where they lied and lied like the devil for about five, six months in early 2007, that every time a Shiite set off a roadside bomb, these new improved copper cord enhanced, uh, uh, they're called EFPs, explosively formed penetrators.\nNow, anytime that happened, Iran did it, which is what George Bush called shorthanding it.\nYeah.\nIn other words, just implying the lie.\nWhat they're saying is Iran backed Muqtada al-Sadr, also, also, who actually they were fighting the whole war for him.\nHe remains a powerful kingmaker in that country this day.\nHe was part of the United Iraqi Alliance.\nAnd in fact, as long as we're taking a long form here, he was the least Iran-tied of the three major factions in the United Iraqi Alliance in Iraq War II.\nThe other two major factions were Dawa and the Supreme Islamic Council, and they had been living in Iran for the last 20 years.\nThey're the ones who came and took over Baghdad.\nMuqtada al-Sadr is Shiite and close to Iran, but he's also an Iraqi nationalist, and at times he allied with the Sunnis and tried to, in, tried to limit American and Iranian influence in the country, was more of an Arab and an Iraqi nationalist.\nAnd the Americans decided they hated him the most, not because he was the most Iran-tied, but because he was willing to tell us and them to get the hell out.\nAnd America was betting that if we backed the same parties that Iran backed in Iraq War, that they would eventually end up needing our money and guns more than they would need their Iranian friends and co-religionists and sponsors next door, which of course did not work out.\nAnd America's had minimal influence in supermajority Shiite Iraq ever since the end of Iraq War II.\nAnd we can get back later in the show to how Israel helped lie us into that horrific war as well.\nBut the fact of the matter is it was not Iranians setting off those bombs.\nAnd it was not even Iranians making those bombs.\nAnd I show in my book enough already.\nI have a solid dozen sources.\nEnough already.\nThank you.\nI have a solid dozen sources, including, uh, Michael Gordon's own colleague, Alyssa Rubin, at the New York Times and many others, where they found these bomb factories in Shiite Iraq.\nThey were being made by Shiite Arab Iraqis.\nAnd when they, David Petraeus was going to have a big press conference and they laid out all the components, all the reporters gathered around and they started noticing that the components said made in UAE, made in Haditha, that is Iraq.\nIn other words, there was no evidence whatsoever that these came from Iran.\nAnd then they called off the press conference and Steven Hadley, George Bush's second secret, uh, national security adviser, admitted that, yeah, we didn't have the evidence that we needed to, uh, present that.\nAnd I also quote two, one Marine and one high-level army intelligence officer in there, uh, who were deeply involved in Iraq War, uh, reconfirming that that there was never any evidence that these bombs were coming across, uh, from Iran or especially that then even if they were, that that was at the direction of the Quds Force or the Ayatollah.\nThis was all just a propaganda campaign because Dick Cheney and David Petraeus were trying to give George Bush a reason to hit IRGC bases and start the war in 2007.\nAnd this sounds crazy, but there's like four major confirming sources for it.\nDick Cheney's national security advisor, David Wormser, who was the author of the clean break strategy, which we're going to talk about today.\nDavid Wormser in 2007 was saying, \"We want to work with the Israelis to start the war with Iran to force George Bush to do an end run around George Bush and force him into the war.\"\nAnd that was reported originally by Steven Clemens in the Washington Note, but it was later confirmed in the New York Times and by the Washington Post reporter Barton Gellman in his book Angler on Dick Cheney that there was this huge, this was the end that they were going for was they were trying so hard to force a war in 2007.\nAnd it was the commander of Centcom, Admiral Fallon, who said, \"Over my dead body, we are not doing this.\"\nAnd then a few months later, the National Intelligence Council put out their NIE saying that there is no nuclear weapons program at all.\nAnd W. Bush complained in his memoir, lect that in, in his story, it's the Saudi king, his royal highness Abdullah, rather than, um, Ahoud Dolmer, but he's saying, \"I'm sorry, your highness, majesty.\nI can't attack Iran's nuclear program cuz my own intelligence agency says they don't have a military program.\nSo, how am I supposed to start a war with him when my own intelligence agencies say that?\"\nThis is what Donald Trump just did.\nStart it anyway.\nHad his man Rubio say, \"Well, screw the intelligence.\nI don't care what it says.\nWe can just do this if we want to.\"\nSo, first, let me say on the cover of Enough Already, devastating.\nDaniel Ellsberg, outstanding.\nDaniel L. Davis, essential.\nRon Paul, you are respected by a very large number of people.\nYou have decades of experience in this.\nSame thing with Mark, extremely respected by a very large number of people, experts.\nThere's a lot of disagreements here, and we're going to, unfortunately, leave a lot of the disagreements on the table for the, uh, aforementioned nuclear scientists to, to deconstruct later.\nSo let's not like try to, every single claim does not have to be perfectly refuted.\nLet's just leave it on the table, the statements as they stand, and let's try to also find things we kind of agree on and try, I know this might be difficult, but to steel man the other side, that's the thing I would love to ask you, uh, maybe give Mark a chance to speak a little bit, but to, to try to, for both of you, to try to steel man the other side so people who are concerned about, uh, Iran developing a nuclear program can you steel man that case and the same, the people...\nI did in my opening statement, quite frankly, I, I'm, I don't carry any brief for the Ayatollah.\nI'm a Texan.\nI don't give a damn about what some Shiite theocrat says about nothing, right?\nMy interest is the people of this country and its future and what's true.\nAnd so I don't mind telling you, even though the Iranians never said, \"We're building a latent nuclear weapons capability.\"\nThat's clearly what they're doing is showing that they can make a nuke, so don't make me make a nuke.\nThat has been their position.\nTheir position has not been, \"I'm making a nuke so I can wipe Israel off the map.\"\nTheir position has been, \"Look, if you guys don't attack us, we could just keep this civilian program the way it is.\"\nAnd again, there's always the implication that they're just building up this uranium stockpile, but no, they're not.\nThat was in reaction to one, Donald Trump leaving the deal in 2018.\nTwo, the assassination in December of 2020 of the Iranian, uh, nuclear scientist, Far Cazada, or however you say that, and then in April of '21, the sabotage at Natanz.\nAnd there's a Reuters story that says right after they sabotaged Natanz, that's when the Ayatollah decided, let's enrich up to 60%.\nWhich, why stop 30% short of 90% 235?\nIt's because they're not even making a threat.\nThey're built, they're making like the most latent up threat, a bargaining chip to negotiate away.\nThey're trying to put pressure on the United States to come back to the table.\nThat's not the same as racing to the bomb.\nThat's why Marco Rubio says, \"Never mind the intelligence,\" cuz the intelligence says what I just said.\nYeah.\nPoint made.\nLet's try, let's try if possible to keep it to like a minute and two of back and forth, except, you know, the problem is we're talking about nuclear stuff, which is all very complicated and most people don't know much about it, which is what the war party is relying on, that people just hear nuclear, afraid, and mushroom cloud and and give the benefit of the doubt to the hawks, and so we got to get into the details of this stuff.\nDetails, 100%, but I like the tension between two people with different perspectives exploring those details, and the more we can go back and forth, the better, and there's a lot of disagreement on the table.\nI personally enjoy learning from the disagreement.\nI think that was a very long list of claims that he made though, where I felt like I had to go down the list as much as I could cuz there was a lot.\nI think you addressed like maybe one or two claims and it took 15 minutes.\nSo that's what I'm just commenting on.\nLet's do one at a time.\nI like the tension of the debate of back and forth.\nThat's that's all.\nMark, do you want to do you want to comment on stuff a little bit here?\nWhich, pick, pick whichever topic you want to go with here.\nYeah, there's a lot there.\nSo, um, just a couple things I think that are worth your viewers knowing because Scott's right.\nI mean, the nuclear physics is complicated and it's also important.\nUm, so the Iranians have assembled about, they say about 15 to 17 bombs worth of 60%\n\n\nEnriched uranium. And I think it's always important for your listeners to understand what does this all mean? Enriched to 3.67% to 20% to 60% and then to 90% weapons grade uranium, like what, what does this actual process mean? Um, first of all, obviously, enriched uranium is a key capability to develop a nuclear weapon. It can also be used for other purposes, civilian purposes and research purposes. You can use it to power a nuclear submarine. So, let's just, if you don't mind, if I could just break it down.\n\nThat's fascinating.\n\nYes.\n\nYeah.\n\nJust, just, I think it's again important just to understand the, the sort of basics before we jump into the allegations and claims and counter claims. So, if you're going to enrich to 3.67%, enrich uranium, um, that's for civilian nuclear power, right? But when you do that, you've basically 70% of what you need to get to weapons grade. Right? So, you, you've done all the steps, 70% of the steps in order to get to weapons grade uranium. If you enrich to 20%, you are now at 90% of what you need to get to weapons grade uranium. Now, why would you need 20%? You may need it for something like a research reactor, right? And so, medical isotopes. Iran has, correct. Iran has a tan research reactor for medical isotopes. Now, you can, by the way, you can buy those isotopes from abroad, or you can, or you can produce them at home. If you're going to enrich to 60%, right, then you've done 99% of what you need to get to weapons grade uranium, and then n% is quote weapons grade uranium. By the way, you can use 60% to actually deliver a crude nuclear device. Um, that, that has been done in the past, but you want to get to quote 90%, that's, that's weapons grade uranium, as Scott's defining it. But just again, clarify the, these huge stockpiles of 60% that Iran has accumulated, right? This 16, 17 bombs worth of 60% is 99% of what they need for weapons grade. So, I, I just wanted to explain that.\n\nYeah. But when you say, you're saying if you include the mining, the refining of the ore into yellow cake, the transformation of that into uranium hexafluoride gas, the driving of it in a truck over to the centrifuge and then spinning it. This is where we get this 90% number from, right? In, in place of 90% enriched uranium or, or 80% enriched uranium, it's 90% of the way on some chart that includes picking up a shovel and beginning to mine, right? Like, so again, just to clarify, I, I just think it's important to understand the definition of terms, um, to get what, once you have 60% enriched uranium, you've done 99% of all the steps, including some of the steps that Scott's talking about. You've done 99% of what you need to have weapons grade uranium.\n\nThat's just meaningless.\n\nWhy is that meaningless?\n\nWell, as I've already established numerous times here, under the JCPOA, they shipped out every bit of their enriched uranium stockpile. The French turned it into fuel rods and then shipped it back. That's the deal they're trying to get the U.S. back into and were obviously clearly willing to do. And again, the only reason they were enriching up to 60% was to put the pressure on the Americans to go ahead and get back into the deal. And bad bet. It gave him an excuse to bomb based on the idea that people are going to listen to him. Pretend that somehow that's 99% of the way to the bomb when you're including, yeah, driving to the mine and mining it and converting it to yellow cake and all these other things. I, you have a deliverable nuclear weapon. So, you need the weapons grade uranium. And just to repeat, they have multiple bombs worth of the 60% enriched uranium, which again is 99% of the steps you need to take for weapons grade. So, they're, they're very close to, to weapons grade. It's that's 1% more that they need to do to enrich to weapons grade. The second aspect of a deliverable nuclear weapon is obviously the delivery vehicle, and those are the missiles. And according to the DNI and and other credible sources, Iran has got the largest missile infantry in the Middle East. Um, 3,000 missiles before the War began and, uh, at least the ballistic missiles, 2,000 capable of reaching Israel. So, there's no doubt that Iran has the ability once they have the weapons grade uranium and the warhead to fix that to a missile and deliver that, uh, certainly to hit Israel, hit our Gulf neighbors, hit southern Europe. They also have a active intercontinental ballistic missile program, an ICBM program, which ultimately is designed not to hit the Israelis or the Gulfies, but to hit deeper into Europe and ultimately to target the United States. So, so let's just understand the missile program. I think it's an important part of it. The third leg of the stool, and and Scott has already alluded to this, and we've had some debate on this, and I think we should talk about it, what it really means in detail, is you've got to develop a warhead, right, or a crude nuclear device. And according to estimates from both U.S. government sources and, uh, nuclear experts, it would take about four to six months for Iran to develop a crude nuclear device, right? This is something that you wouldn't use a missile to deliver, but you would use a plane or a ship. Uh, and it would take somewhere in the neighborhood of about a year and a half to deliver or to develop a warhead. And that's to affix to the missile. So, sort of the three legs of the nuclear stool, right? The weapons grade uranium, the missiles to deliver it, and the, uh, and the warhead. So, I just want to sort of define terms so that when we're having this big Debate, your listeners kind of understand what we're talking about. If I can jump in here on this point too, and I'll turn it back over to you, but I actually have a bit of a correction to make for anyone who's seen me on Pierce Morgan or Sager and Crystal. I actually oversimplified and made a mistake. I've been off of the Iran nuclear beat for a little while doing other things, and, um, and so I'd like to take this opportunity to clarify, and I'm going to try to clarify with them on their shows too, was, um, I have an old friend of mine used to make nuclear bombs, Gordon Prather, and I only just found out that he died two years ago. Uh, unfortunately, he used to write for us at Antiwar.com and a brilliant, uh, nuclear physicist and hbomb developer, uh, and he had really taught me all about this stuff, and, um, so I'm not correcting anything you said, what, what he said essentially is right. I maybe add a little more detail. The easiest kind of nuke to make out of uranium is a simple gun type nuke, like they dropped on Hiroshima, was a little boy. It's essentially a shotgun firing a uranium slug into a uranium target, and that's enough. They didn't even test it. They knew it would work. Uh, it was so easy to do, to do the Hiroshima bomb. The Nagasaki bomb was a plutonium implosion bomb. It's virtually always plutonium that's used in implosion bombs. Um, and, and in miniaturized nuclear warheads that can be married to missiles, right? As opposed to a bomb you can drop out of the belly of a plane. That's what he was saying, right? So, gun type nuke, you can't put that on a missile. That is by far the easiest kind of nuclear weapon for Iran to make if they broke out and made one, right? But it'd essentially be useless to them, right? What are they gonna do? Drive it to Israel in a flatbed truck, right? They, they got no way to, to deliver that. They could drop it as a\n\nYeah, they could test it in the desert and beat their chest, but essentially that's all they could do.\n\nOr you could drop it from a plane like we did as, as Scott said in with Hiroshima Nagasaki.\n\nYeah. Well, very slim chance of Iranian heavy bombers getting through Israeli airspace. But anyway, um, but to make an implosion bomb, they would have to do years worth of experiments unless the Chinese or the Russians just gave them the software or gave them the finished blueprints or something, which there's no indication of that whatsoever. The only people who gave them blueprints for a nuclear bomb was the CIA. Remember Operation Merlin, where they just changed one little thing and gave them nuclear bomb blueprints, but the Iranians didn't take the bait.\n\nThe blueprints were given, just, just to clarify, it's just interesting just in the terms of the history of proliferation. Um, so Iran's initial nuclear program, right, which is built on centrifuges, as Scott and I have been talking about, um, that was actually given to the designs of that were given to them by AQ Khan, who was really the father of the Pakistani nuclear program. Um, and he actually stole those designs from the Dutch and handed it to the Iranians. He also handed it to the North Koreans and the Libyans and others. So, they were able to illicitly acquire this technology, or at least the blueprints for this technology from the father of the Pakistani bomb. So, I think that's an interesting point. But if you, but it was, as I said earlier, because Bill Clinton clamped down on the Chinese and wouldn't let them sell, or anyone else wouldn't let them sell them lightwater reactors. So, then they went to AQ Khan and bought the stuff on the black market.\n\nYeah. And, and they obviously bought heavy water reactors from the Russians, which they've been using for electricity. Um, I want to just get to the, the second thing. I think it's just important for listeners to know, and then I want to get to JCPOA. I was in the middle of saying though, when you're trying to make a uranium implosion bomb or a plutonium implosion bomb, it's a much more difficult task than putting together a gun type nuke, takes an extraordinary amount of testing. And that's why he repeated, probably unknowingly, some false propaganda about Iran having this advanced testing facility. I think he was implying, correct me if I'm wrong, he was, I'm pretty sure you're implying at Parchin that they were testing these implosion systems, but that's completely debunked. It's completely false. What they were testing, what they were doing at Partin with that implosion chamber, uh, um, was making nano diamonds, and the scientist in charge of it was a Ukrainian who had studied in the Soviet Union at this, uh, military university where they said, \"Oh, see, they study nuclear stuff there.\" But that wasn't his specialty. His name was Dan Leno, and he was a specialist in making nano diamonds. And that facility was vouched by Robert Kelly in the Christian Science Monitor, told, um, Scott Peterson of the Christian Science Monitor that that stuff was nonsense, that that, that facility, that implosion chamber could not be used for in testing, uh, for testing an implosion system for nuclear weapons. And I know from Dr. Pray, they're telling me that when the Americans were doing this and the Russians too, that they test all their implosion systems outside, and you have to do it over and over and over again with lead instead of uranium in the core, and then you take all this high-speed X-ray film of the thing, and it's this huge and drawn out and incredibly complicated engineering process. And this is probably why the week before the War, the CIA said, \"Not only do we think that they're a year away from having enough nuclear material to make one bomb, we think they're three years away from having a finished warhead.\" That must have been assuming that they would try to make an implosion system that you could put on, uh, in other words, miniaturize and put on a missile, as opposed in, in other words, skipping a gun type nuke that would be useless to them. So, it's very important to understand then that if, if they have a uranium route to the bomb, if they withdraw from the treaty and kick out the IAEA inspectors and, and announce that now we're making nuclear bombs, they can either one, race to a gun type nuke that's essentially useless to them, or they can take their ponderous as time trying to figure out how to make an implosion system work. First of all, I'm glad Scott knows about what's going on at Partridge because the IAEA doesn't, and they've been asking the Iranians.\n\nThat's not true. The Iranians told the IAEA, \"You can inspect any five out of 10 facilities here, cart blanch, go ahead.\" And they did and found nothing. Then they made up the lies about the implosion chamber later. And the IAEA, again, Robert Kelly is the American IAEA guy, debunked that in the Christian Science Monitor. All right. So, uh, I, I want to just again, just put it out there for your listeners. They, they should just Google Ahmad program, and they should learn about the Ahmad program because it's, it's detailed in U.S. government documents, experts in Iran's nuclear program, including David Albbright, who actually saw the archive, went in there, wrote a whole book on it, and there's a lot of detail about how Iran had an active nuclear weapons program called the MOD to build five nuclear weapons. But I want to get to the JCPOA because I actually think that's an interesting discussion for Scott and I to have, um, because I think there are things that we agree on there and things that we disagree on. Right. So, this is the 2015 nuclear deal that Obama reaches. Um, it's negotiated painstakingly over two years between 2013 and 2015. And it follows the interimm agreement that United States negotiated with Iran. And it's, it's, it's in that interimm agreement in 2013 where the United States for the first time actually gives Iran the, the right to enrich uranium. There were five UN Security Council resolutions passed with the support of Russia and China that said Iran should have no enrichment capability and no plutonium reprocessing capability because of the fears that Iran would turn that into a nuclear weapons program. But in 2013, they give up, they give that up. 2015, we reached the JCPOA, and under the JCPOA, Iran is allowed to retain enrichment capability and reprocessing capability, but over time, so Scott mentioned these sunsets, and just want your listeners to understand what these sunsets are, essentially the restrictions that are placed on Iran's nuclear program, right? And there's some really serious restrictions placed on it, especially in the short term, and Scott's right, the enriched material has to be shipped out, not to the French, but to the Russians, um, and there's restrictions on Iran's ability to operate these facilities at ATANS and Foraux. They're not closed. They're still remain open, but there's restrictions on what they can do with it. There's also restrictions on Iran's ability to test and install advanced centrifuges. Now, the reason you'd want an advanced centrifuge rather than the first generation centrifuge that AQ Khan, the father of Pakistan's nuclear bomb, gave to the Iranians is you need a smaller number of these centrifuges to produ\n\n\nCE weapons grade uranium.\nIf it's smaller, less, it's easier to hide, right?\nYou can put it in clandestine facilities without this large enrichment centrifuge footprint.\nSo there's restrictions on these advanced centrifuge R&D.\nAnd Iran gets significant sanctions relief as part of this.\nBut the whole assumption here from both an Iranian and American perspective is these restrictions are going to sunset.\nThey're going to disappear over time.\nIn fact, 2025 is the year where some of the significant restrictions on Iran's capabilities begin to sunset, and all of them are effectively gone by 2031.\nOkay?\nSo, in 2031, Iran can emerge with an industrial size enrichment capability.\nThey can emerge with advanced centrifuges that they can install in as many enrichment facilities as they want to build.\nAnd Iran can enrich to higher and higher levels.\nSo, they can go from 3.67 to 20%, they can go to 60%.\nUm, there's nothing in the JCPOA that actually prohibits them from going to 90% in Richmondia.\nAnd I think at the time, the Obama administration's theory of the case was, yeah, sure, in 15 years time, but in 15 years time, we'll be gone.\nHopefully, there'll be a different government in Iran, and maybe we can renegotiate a different agreement with that government that will extend the sunsets.\nSo, that that's the JCPOA.\nThe reason that critics of the JCPOA, and I was one of them, we objected to the deal, is not because it didn't have some short-term temporary restrictions that were useful, but that if you got it wrong and there was the same regime in power in 15 years, that regime could emerge with this huge nuclear program with the capabilities to develop nuclear weapons in these multiple hardened sites.\nIran, we estimated, would have a trillion dollars in sanctions relief over that 15-year period.\nAnd if you got it wrong, that it was the same regime in power as it been in power in 2015, then you had some difficulties.\nOkay?\nI just wanted to lay out the case against the JCPOA.\nNow, to steal man uh Scott's argument, right, I think there's a legitimate argument because I actually didn't support the withdrawal from the agreement.\nUh President Trump withdrew in 2018.\nI did a similar version of what Scott was suggesting was I thought that the U.S. should negotiate with the Europeans, the French, the Germans, and the UK who were part of the original deal, extend the sunsets as an agreement between the U.S. and Europe, and then collectively go to the Iranians and say, \"Let's renegotiate this agreement to extend the sunsets.\"\nIf you if you don't want a nuclear weapons program, then you should agree that you would you don't need these capabilities and let's extend the sunsets for another 15, 20, 30 years.\nPresident, somebody give me a screenshot of this.\nGive me a pound, dude.\nThere we go.\nAgreement.\nThere we go.\nThat makes my heart feel so.\nAnd I think the hole would have gone for it too.\nWell, so I'm not sure if he would have, but but let's just a little bit of history.\nI think it's just useful for the viewers to know again the context, especially when Scott and I agree.\nYeah.\nUm, so a process was begun by the Trump administration.\nThey, uh, Trump appointed, uh, Brian Hook, or Secretary Pompeo actually appointed Brian Hook, who's the lead Iran envoy, and he began a process of talking to the Europeans.\nNow, the Europeans actually rejected this idea.\nUm, and so at some point, Trump said, \"Look, if the Europeans aren't prepared to get on side, then I'm out of the deal.\nI'm out of the deal.\"\nAnd if you're interested, I can talk about why I thought we should have stayed in the deal because I thought you gave us some important restrictions in the short term, certain leverage.\nBut Trump decides to withdraw from that agreement because he recognizes that the fatal flaw of the agreement, the fatal flaws of the agreement are one, giving them any enrichment capability, especially at an industrial size within 15 years, right?\nAnd two are these sunsets as Scott said which under which these restrictions are going to go away and Iran's going to end up with a massive nuclear program.\nSo I think that's just important.\nWe can talk about the JCPOA, the process, and everything else if you're interested.\nI'd like to go ahead and quickly accuse the FBI and the CIA of framing Trump for treason with Russia and pushing the Russia gate hoax.\nI'm trying to agree with my friend here because what it is is that that completely ruined Donald Trump's ability to engage in real diplomacy with Russia for his entire first term.\nCertainly for the first three years of it, he was completely handcuffed.\nIt was it was it was terrible as I'm sure you're well aware for the future now our past and current history of Ukraine as well as for this deal too.\nWhy couldn't Trump pick up the phone?\nI don't know the details here, but I'll take his word for it.\nThat the British and the French and the Germans weren't being nice to Trump.\nThey didn't like him.\nThey didn't want to do it.\nWhy couldn't he pick up pick up the phone and say, \"Hey, Putin, I need you to call the Ayatollah for me and tell him, 'Hey, you'd like to see him lift these sunsets, too, and this and that.'\"\nWhy?\nBecause they framed him for treason.\nSo, he was completely unable to engage in real diplomacy with Russia.\nAnd I bet that he'd agree with me on that one, too.\nSo, next, actually, could I just say one thing interesting?\nAnd again, I think it's going to be a later topic and so it it's going to be a provocative statement, but I think let's put it on the table.\nI absolutely agree with Scott.\nI mean, I think it was a travesty that the of the accusations against Donald Trump as a Russian agent.\nI mean, completely debunked, but it it did it I think it paralyzed his presidency for two, two and a half years.\nI I agree with Scott.\nThe idea that you would accuse the president of the U.S. of being a foreign agent for Vladimir Putin, I think is unfounded and I I I thought at the time disgraceful and I thought it was really important.\nI think Scott did really good work in in debunking that.\nI would say that just a couple days ago I was watching a podcast Scott was on and he accused uh Trump of being an agent for Netanyahu and the Israeli government.\nSo I think again the accusations that the president of the U.S. is a foreign agent for some foreign government.\nI think we should just put all of that aside in any discussion and just say President Trump makes his own decisions whether we agree with him or agree with him.\nBut he's not working for the FSB and he's not working for Mossad.\nPresident Trump makes his own decisions based on American national security.\nNow I was making a point.\nThat's hyperbole making a point.\nBut he did.\nIn fact, could you Google this for me because I always forget exactly how many hundreds of millions of dollars that he took from Sheldon add who are Americans, by the way, who are Americans who Sheldon Allison said his only regret in life is that he served in the American army instead of the IDF and said America should nuke Iran in order to get them to give up their nuclear weapons.\nHe said, \"I have one issue, one Israel.\"\nAnd they gave Trump hundreds of millions of dollars over three campaigns.\nThat's not just a gez.\nI really hope you'll think of me in the future.\nScott, first of all, a couple things.\nSo, one, there's a lot of people that are friends with Trump and try to gain influence.\nI believe that Trump as an American is making his own decisions.\nLet's for the purpose of this conversation just focus on that and see what are the right decisions and what are the wrong decisions.\nAnd uh maybe I wonder what decisions I could get you to make if I gave you hundreds of millions of dollars.\nWell, me personally, you couldn't give me It doesn't matter.\nI couldn't even get you I couldn't get you to drop in on a vert ramp or nothing for 100 million bucks.\nNothing.\nYou cannot control my decisions with money.\nIt's the American system, Lex.\nThat's how it works.\nIt's money.\nThey appreciate.\nYeah, we can we can go down that.\nIt's the same if we were talking about Archer Daniels Midland Company throwing hundreds of millions of dollars around.\nThey get policies based on their hundreds of millions of dollars.\nThe squeaky wheel gets the grease, right?\nAll that.\nSo Lex, I think you're right.\nI mean, I think Elon Mus spent what, $400 million helping Trump get elected.\nUm, and obviously there a number of philanthropists.\nI think clearly his son Don Junior has had a lot of influence in who gets selected in these positions in the Pentagon, the NC.\nI think Tucker Coulson has had a lot of influence.\nSo I think as you say, he surrounds himself with people who have certain ideas, ideologies, policies.\nThe president makes his own decision.\nI just want to touch on just one thing because I I I don't want to leave this alone.\nUm just out of respect for for the victims of Iran-backed terrorism and hostage taking and assassinations since 1979.\nUm, you know, this is the regime that took our took hostages in 79, took our diplomats hostage.\nUm, Scott says, you know, 83 was really the only thing that happened and and throws out a lot of information.\nCertainly some some pretty breathtaking accusations that somehow the Israelis knew about this and didn't tell the Americans and and it's an Assad officer's accusation.\nYeah, Victor Ostroski is his name.\nYeah, I know exactly who he is and and he has been widely discredited um and having an axe to grind with with Mossad.\nBut anyway, um not only 83 but all through the 90s, the 2000s, 2010s, 20120s, um there have been hundreds of attacks, of um assassinations, of hostage taking.\nUm there are thousands of Americans who have been killed and maimed by the regime.\nCan you be specific what you're talking Yeah, I mean I I can give you a whole list and Sure.\nliterally I'm happy to pull it up.\nLex, I shared it with you.\nIt's a long list of attacks all through the 80s and 90s.\nUm I mean everything from the you know Kobar Towers Kobar towers was al Qaeda.\nThat was Osama bin Laden and Khali Shake Muhammad.\nLet him lay it out.\nAll right, let's hear him.\nOh, I got my pen in my hand.\nGo ahead.\nYeah.\nAnd again, according again, according to U.S. intelligence findings, it was actually Hzbala that worked with al-Qaeda, trained al-Qaeda in that attack in the Cobra Towers.\nUm they were they were kidnapping our diplomats in Beirut.\nUm they were they launched attacks against our um our soldiers while in Iraq.\nThe notion that somehow you debunked that.\nNo, I don't I don't think Well, you you say you debunked it.\nYou just made your claim.\nUm but those were Iran-backed militias.\nUm backed by the by Kasum Solommani who Scott referred to who was the commander of the RGC goods force who supplied them with those IEDs or those EFPs actually those explosive well again this has been all confirmed by why don't you search Alyssa Rubin New York Times EFP factory or you can look in the Christian Science Monitor for Operation Eagleclaw where they found these things you can it's it's easy to find in my book you can flip right to soda straws and EFPs.\nAnd you see where I I have all my citations for the solid dozen American newspaper reporters who were embedded with American soldiers who found these factories in Iraqi Shiastan, okay?\nWith Iraqi Arabs working the machines, not Iran.\nSo I' I'd like your viewers to to Google not just a couple of sources, but actually Google the U.S. government reports.\nThey did a whole afteraction report on the Iraq War.\nAll the mistakes were made in the Iraq War and there and there were legion of mistakes made.\nUm but it was very clear that Iran had actually provided the technology, the training, the funding for these Iran-backed militias to kill Americans.\nI mean I I could see Scott method from Lebanese Hezbala that got it from the IRA.\nThey didn't even get the technique from the Iranians at all.\nYeah.\nSo Lebanese asbal as I'm sure all your listeners know has been trained financed true but they got supported by Iran for the copper core for many years and that design did not come from Persia.\nYeah.\nSo again I think we all admit Scott admits as well that Hisbala was trained financed and uh supported by Iran.\nHisbala has been responsible for many of these terrorists.\nWhere does Hisbala come from?\nIt's a reaction to the Israeli invasion of Lebanon where they went after the PLO and horribly mistreated the poor local Iraqi Shiites until they rose up and created these militias to fight in self-defense.\nThat's where Hezbollah comes from.\nHisbala was actually created by the RGC before the Israeli invasion.\nThis was the CIA's Bin Laden unit.\nMichael Shyer says it was Osama bin Laden and colleague Shake Muhammad that did the Cobar Towers attack.\nAnd who did they kill?\nThey killed 19 American airmen who were stationed there to bomb Iraq from bases of Saudi Arabia under the Israeli insisted upon dual containment policy.\nBill Clinton came from Yeetsak Shamir who had who had uh sent his man Martin Indic to work for Bill Clinton and push the dual containment policy is where that comes from in the first place.\nThe main reason al Qaeda turned against the U.S. and the Kobar Towers attack was bin Laden and he bragged about it himself to um Abdel Bari Atwan the uh reporter from Alud's Alarabi in London and spent days with him and bragged all about it and blessed the martyrs and the rest of that and uh is widely uh discredited the claim that it was Iranian-backed Shiite Hezbala that did the Kobar towers attack.\nThat was what the Saudi government told the U.S.\nIn fact, there's a great documentary about John O'Neal, who was the head of FBI counterterrorism, who told Louisie Free, \"Boss, the Saudis are blowing smoke up your ass about this Hezbala thing.\nIt was Al Qaeda that did it.\"\nAnd then Louis Free got all upset cuz he used the a word.\nUm he was a very conservative Catholic guy, Louis Free, and then uh refused to listen to another word from John O'Neal about it.\nSo, what we know now from Scott, because he's he's given certainly a lot of context to how he actually sees things, is um here's who lies to you and here's who doesn't.\nUm,\n\n\nU.S. government lies to you. Israeli government lies to you. Uh, the Israelis clearly lie to you. Menacious bunch. Saudis lie to you. Um, you know, but you know who doesn't lie to you? Actually, doesn't lie to you. Al-Qaeda doesn't lie to you.\nI didn't cite al-Qaeda or I himself and the Iran. I cited Michael Shawyer, the chief of the CIA's Bin Laden unit, didn't make it clear here.\nThe Iranian trusting Hezbollah, Scott, straight up, I hear you, but you're interrupting. And like, please just honestly, it's not about the content, but like honestly, how come you're not saying him? Isn't that weird that you just said he trusts Hezbollah even though he didn't say anything about trusting Hezbollah?\nI'm not calling out the content. I'm calling out the interruptions. He hasn't interrupted you. It's great. I'm loving the back and forth. It's great, but just a little less talking over each other, that's all.\nYeah. So I mean again the the sort of view of the regime in Iran and and I think Scott wisely said at the beginning of this discussion like what did you say? I I don't have any love for the Ayatollah. I'm a Texan. I don't have any love for the Ayatollah in Iran. And yet despite the fact Scott doesn't have love for the Ayatollah and I I agree with him and I think he's being sincere in every discussion that we've had on every topic. It's always about everyone's lying except the Ayatollah in Iran. He's not lying about having a nuclear weapons program.\nHe he didn't actually support all of these terrorist organizations that he founded, financed, and supported to kill Americans. It wasn't the Ayatollah and Iran. He's he's not lying about his um his deception campaign against the United States. He's not lying about negotiations with the Americans. It's Americans fault all the time. So he he's presented all the time in Scott's conception here as a sincere actor who doesn't want to develop nuclear weapons, who doesn't actually want to kill Americans. He is just always a victim of American and Israeli aggression. I I think it's an interesting conception. I think let's talk about it. And I I mean I'm I'm fascinated by the conception because it it's very contrary to mine. Obviously, it's very contrary to, I think, decades of overwhelming evidence that the Islamic Republic has been war with the United States since 1979. And, you know, I I don't take too much stock in what people say. I take stock in what they do. So, you know, death to America, death to Israel could just be a slogan. It could be just propaganda. But when it's actually operationalized, then you start to ask, well, maybe it's not just propaganda. Maybe it's intention operation operationalized into capabilities. You know, we what we're forgetting here and again it's it's this causal relationship. It's we aggress against Iran and the Israelis aggress against Iran and Iran is always reacting. I mean, let's give the Iranians their due because Comedy made it very clear when he established the Islamic Republic that there will be a revolutionary and expansionist regime and they will expand their power through the Middle East. And so he built and to his credit was very successful until October 7th. This axis of resistance as he calls it which are these terror proxy armies, Hamas, Palestinian Islamic Jihad, the Iraqi Shiite militias, the Houthis in Yemen that and certainly supporting the Assad regime in Syria. He built a very very impressive and deadly axis that he turned against the United States and against Israel which saw its culmination on October 7th. I think after October 7th that was a huge miscalculation for Kame and we've seen the results of what's happened to his axis of resistance through quite devastating Israeli military capabilities over the past number of months but he has an ideology and I think where I agree with Scott is I'm not sure if Kame would actually use a nuclear weapon against Israel the United States because I don't think Kame is suicidal but I think what Kame wants is he wants a nuclear weapon as a backs stop for his conventional power. Right? He's it's very the it's very much the Kim Jong-un model of North Korea, right? I'm going to have nuclear weapons with ICBMs to threaten America, but what I'm actually going to do is threaten South Korea with having massive conventional capabilities on the DMZ that I could take South Korea in a week. I could destroy in a week. So, you the United States and South Korea have no military option. That's Kame's view. he can actually building up this massive ballistic missile arsenal that he's unleashed in the past 12 days that according to again the US and Israel was going to go from 2,000 to 6,000 to 20,000 that from Kame's perspective he didn't need to drop a nuclear bomb on Tel Aviv. What he needed to do was use the threat of nuclear escalation in order to use his conventional capabilities his missiles to destroy Tel Aviv. And you've already seen the damage from just uh a few dozen ballistic missiles getting through the kind of damage that he's wrought on Tel Aviv already. That is the conception that Kame has. It's a revolutionary regime. It aggresses and I I do think it's interesting and I think we should talk about it.\nActually, that's a good cue. Take a bath.\nLet's take a bath.\nOkay, we took a quick break and now uh Scott.\nYeah. Okay. So, a few things there. First of all, uh on Ahmad, the pre-2003 nuclear weapons research, um the CIA estimate in 2007 concluded that all research had stopped in 2003 and Seymour Hirs reported that the reasoning behind that was uh mainly that America had gotten rid of Saddam Hussein for them. Now, in Gareth Porter's book, Manufactured Crisis, he shows that the major conclusion that the uh DIA had made, that the Iranians were researching nuclear weapons was based on some invoices that they had intercepted for some dual use materials, some specialty magnets and things that they thought, boy, this looks like this could be part of a weaponization program, a secret program here. And you know, Gareth Porter, who's a really great critic of all of these policies and claims, says, \"Hey, this was a good faith misunderstanding by DIA. They were doing their job.\" But it turned out the IAEA later when America gave them that information, the IAEA went and verified, oh, there's the magnet and there's this and there's that and all those dual use items actually were being used for civilian purposes. And so then um as Gareth writes in his book, the only real reason um that the NIE said that they even had a program before 2003 was essentially because they didn't want to dispute their last mistaken conclusion. So they said, \"Okay, well that was right up until then.\" But that was when that changed. And then the other half of their reason for accepting that there ever was a nuclear weapons research program uh in the country before 2003 was the smoking laptop. And I'm sorry, I think I misspoke earlier when I said that the laptop was in 2005. That was just the Washington Post story that had a bunch of stuff about it. That was in 2003 as well or 2004 possibly. So this was why the um but it was still all again forged by the Israelis and funneled through the MEK cult um but was obsolete essentially and had nothing in it. At least the accusations and it weren't past 03. And so there's really no reason to believe that there was actually a nuclear weapons research program even before 03 which then again the National Intelligence Council says ended in 2003 and hasn't been restored.\nA question just not a comment by me but a question just your perspective. So just so I understand this. the the the nuclear archive, this this massive archive that the Israelis were able to take out of Tyrron, bring to the United States, bring to the IAEA, which is very detailed blueprints.\nIt's just the alleged studies documents again. It's the same stuff from the smoking laptop.\nYeah. So, let me just ask you because it's it's it's huge and it's very detailed and it shows clearly that the Iran had an active nuclear weapons program certainly until 2003 and then we can have a discussion about what happened after that. Are are you suggesting that that's all been forged by by Israel?\nYes. Nothing in this smoking lot held up.\nNot not the laptop, but this entire archive that they pulled out with this\nyou're you're thinking of like the big photo op with all the do all the full documents behind\nI've seen it. I've seen many many of the documents. There's thousands of pages.\nI'm asking this is not what I'm claiming. Is that all forged by Israel?\nIs that not all about the uranium tetraflloride and the warhead that David Albbright debunked and all the same claims that were in the smoking laptop from the Bush years? David David Albbright actually wrote an entire book. It's a very detailed book. Your listeners should Google it's it's David Albbright and the archive where he goes in he went in in detail and he confirms the information in that archive that Iran had an active program under something called Ahmad to develop five atomic weapons. So again, you and I can debate this all day, but\nnow this would have been before Natans was even dug and before a single centrifuge, right? Got all that.\nI'm just making sure everybody understands assuming that was true. We were talking about a piece of paper.\nBut you you it's not a piece of paper. It's a massive archive. I'm just asking the question. You you believe Mossad fabricated all of this as a lie to deceive the United States, the IAEA, and the international community? That's just my question. My understanding is that there is nothing significant in the 2018 archive that was not already in the debunked claims from the laptop. But my question is is not that it's debunked because we can argue about whether it was debunked or not, but are you saying that Mossad fabricated it?\nThat's what you're claiming.\nYeah, because the CIA admitted that there was no laptop and Olli Heinan admitted that he got it from the laptop.\nHe got it from the MEK and where did the MEK get it? The MEK got it from the Israelis.\nScott, I'm not asking about the laptop. I'm asking about this huge archive that was sitting in a warehouse in Tyrron. Full\nI don't know the truth behind those documents. I don't believe Israeli claims of what they were and where they came from without, for example, reading Albright's book and seeing what he has to say about all of that. I don't take Netanyahu's uh claims and and Okay. So, what's so significant in there? You say that there's a document that has a plan to to make five bombs, but isn't the rest of the proof the same green salt experiments and the warhead for the missile that David Albbright showed was obviously fake because the warhead was purportedly being designed for a missile that was now going to have an entirely different nose cone on it.\nNo. So David Albbright again, you know, we should bring David Albbright here.\nDavid Albbright is a prominent physicist, nuclear proliferation expert known for his detailed research and publications on nuclear weapons. Yeah,\nhe has a bunch of books. Peddling Peril, Iran's Perilous Pursuit of Nuclear Weapons, Plutonium, and Highly Enriched Uranium, 1996, and so on.\nYeah. So, so folks should should read the book on the on the archive because David had um full access to the archive, all the all the detailed documents and blueprints, and he writes a book that again, the conclusion of which is Iran had an active nuclear weapons program.\nNo, no, no. The conclusion of which was they were researching it right before 2003. They had no nuclear material to introduce into a single machine. Right.\nWell, they they active program meaning they had a piece.\nThey had already built a covert enrichment facility which was only\nNo, they hadn't. It was closed. Natans was empty by till the end of 2006, right? They didn't even start spinning centrifuges in gotten centrifuge for AQ. They'd built a deeply buried underground facility at Natans. They were putting in place the component parts for a nuclear weapons capability and Ahmad showed conclusively unless you believe Mossad fabricated it all that they actually had the plan to build nuclear warheads.\nAgain, Seymour Hirs says that it was when\nSeymour Hirs is not a nuclear weapons expert. David Albbright has you saw the archive Hersh's sources said America invaded Iraq and overthrew Saddam Hussein for them. That was when they gave up even considering the need for it. Remember, the Iranians held a million man vigil for the Americans on September 11th. The Iranians hated the Taliban. In fact, the Americans thought Iran might invade Afghanistan earlier in 2001. And they hated Saddam Hussein. So, they had every reason in the world to want to work with the United States September 11.\nIt's a distraction. My question is, let's not go to al-Qaeda, the Taliban, and 9/11, and the Iranians and a million people. Let's just stay on the topic.\nasking me what I already answered.\nYou believe Mossad fabricated that entire\nI already told you I don't take their word for anything and I' have as far as I understand the accusations in there are the same ones from the laptop that are already discredited and I haven't read David Albbright's book. You're distracting from me refuting this giant list of false claims that you made previously that let's all agree you're going to read the book. Maybe Lex, you're going to read the book. Viewers, you should read the book. I think David Albbright has done a meticulous job.\nIt's a by the way just just warning it's a big book. very detailed, hundreds of pages, and he goes through it in meticulous detail in analyzing this archive and showed again that Iran had an active nuclear weapons program designed to build five atomic warheads.\nNow, we can talk about what happened after 2003 and did they make the decision to totally stop it?\nYeah, God changed his mind after the neoconservatives lied America into war with Iraq for Ariel Chiron. So just to clarify, you Mark and David Albbright uh believe that Iran was developing a nuclear weapon and you Scott are saying they were not before 2003.\nThat's just just to summarize what we were just talking about.\nWell, I I can tell you that. So Gareth's book came out in 2014, which is before this archive was supposedly revealed in Tyrron. But in in Garris book, he shows that the CIA and national intelligence estimate of 2007 that said that there was a program before 2003 and was halted after America invaded Iraq was based on one the the DIA's mistaken\n\n\nBut sincere interpretation of these invoices for these dual-use technologies and then the smoking laptop, which was completely fake and funneled into the stream by the Mujahideen cult, a communist terrorist cult. The same people who come up with, you know, 10 major hoaxes. The NCRI, they just put out the NCR, the National Council for Resistance in Iran. That's the MEK. They just put out a fake story, what, three, four weeks ago about a big secret nuclear weapons site in Iran. Don't you remember? And then nothing happened with that, because it was another lie by the MEK. It happens all the time.\n\nSo, Lex, maybe we should talk about what happened after 2003. What about this 2007 NIE? What does it mean? Did it mean Iran had now abandoned its nuclear weapons program or does something else? They never had a nuclear weapons program. But let's talk about that.\n\nInteresting. Interesting. According to the NIE, they had a nuclear weapons research program that never made anything at all. So, you can try to conflate that if you want, but I think everybody can see that's not what the 2007 NIE says. What the 2007 NIE says is that, and you are correct, according to the 2007 NIE, Iran made the decision after the invasion of Iraq not to pursue an active nuclear weapons program anymore because we were putting their best friends in power in Baghdad for them. Well, because the U.S. had gone in, worry no more, and in a matter of 100 days had taken down the Iraqi army and put in Abdul Aziz al-Hakim's faction, the Supreme Council for Islamic Revolution in Iraq, who'd been living in Iran for 20 years. That's why you and I did not publicly support the Iraq War. Did we? I publicly opposed it as far as I possibly should have publicly opposed it rather than just working on Iran in 2003. But you're right. It redounded to the benefit of Iran that invasion. But that's not actually what I'm talking about. What I'm talking about is 100 days, the Iranian sea, that the U.S. military has taken down the Iraqi army that they had fought an 8-year War with, where almost a million people, Scott, as you know, had been killed. So, they were afraid that the United States was going to march from Baghdad to Tehran. So, they make a decision to end their active Ahmad program.\n\nThey make a decision to build up the key capabilities they need to retain an Iranian nuclear weapons option, specifically the enrichment capabilities at Natanz and then Fordow and at Iraq, giving them the plutonium route. Um, and then what they do is they take the members of the Ahmad program, the nuclear weapons scientists that have worked on this, and they disperse them. So, they're now no longer in a formal weapons program. They're put in a number of different research centers and universities and Mohsen Fakhrizadeh, who you mentioned earlier, who's in some respects, I wouldn't call him the Oppenheimer of the Iranian nuclear weapons program, he's more like, is it, was it, um, who was in the Oppenheimer movie, Leslie Groves, um, the guy who was actually responsible for the organization and the training and the recruitment and the guy that actually ran the program as opposed to Oppenheimer, the sort of brilliant nuclear physicist.\n\nUm, this is Fakhrizadeh. So, Fakhrizadeh takes control of this program and now it is dispersed and it is unstructured in that sense because they recognize that if they continue with this, the United States may march to Tehran. And so the NIE says Iran is retaining the key capabilities, the enrichment capabilities to give them an option for a nuclear weapon. But we, the NIE, decided or we have concluded that they no longer have an active structured nuclear weapons program. However, since then, what have we seen? We've seen them actually do what many suspected they would do, which is build all the key capabilities that they need so that at a time of their choosing, they can decide to develop a nuclear bomb, whether it's a crude nuclear device, as you described, whether it's a nuclear warhead. We've had that discussion so far, but just, sorry, just to finish. So just understand the brilliance of Iranian nuclear deception, right? I just, I think it's really interesting to get in the minds of the Ayatollah and understand this because he doesn't want to provoke the United States. He doesn't want to see another Iraq-style invasion this time of his country. He's building this capability on the enrichment side and on the reprocessing side. He is framing this as, \"I'm only building a civilian nuclear program.\" He's taken the weapon scientists who were building an active nuclear weapons program and he's dispersing them, putting them under the guidance and direction of Fakhrizadeh and starting to build out these capabilities. I mean, he, I, I admire, I have to say, I really admire the way he's played this three-dimensional nuclear chess game. It's very, very interesting, and I think he made a tragic mistake about six weeks ago when he rejected the offer from Trump at Oman and then provoked both an Israeli and then an American strike. But he was playing this game almost perfectly before then in building out these capabilities. And I think what he should have done, if I were him, I would have waited out Trump. I would have waited three and a half years. I would have taken the offer in Oman, which gave him enrichment capability above ground. This consortium that was going to be built in three and a half years would never be built, and even if it was built, he could just say, \"I'm not interested anymore,\" and challenge the next president, whoever that is, Republican or Democrat, to do anything about it. And I think the political calculation should have been the next president's not going to do anything about this. I'll be able to then be able to complete my nuclear weapons program. But he challenged Trump. He thought Trump was a paper tiger. He rejected that offer at Oman, and we've seen what's happened over the past couple weeks.\n\nTwo things. One, can you go and respond to certain things that you heard? And two, can we generally move in the direction of the modern day and trying to see what is the right thing now, our analysis of the situation now? We've been kind of staying in this in the context of history, which is really important, but sort of moving forward. But yeah, go ahead, please.\n\nI'm not sure how much time we have. I had kind of hoped, and let me talk about Israel's role in Iraq War II and for that matter in Barack Obama's dirty war in Syria that led to the rise of the bin Laden there. It's all part of America's Israel policy. So I don't want to, I'd rather go back before we go forward. But I also do, I need to go back over so many claims that he's made here that I'd like.\n\nSo I strongly prefer we go because there's so much history. We're going to lose ourselves, and there's not enough hours. We should take certain moments in history that instruct the modern day, but let's not get lost there if it's okay. I sure this is such a fascinating conversation about, you know, the JCPOA and the time between then and now, like quite a bit already, too. So we'll be going back over some of that. Oh no, I mean modern day, I don't mean JC. I mean, like this week, there a lot of stuff happened this week, and a lot of stuff will happen tomorrow and the next week, and we everyone is wants to know like what is going to happen? What is the worst case? What is the best case? Should we be freaking out? What do we need to understand about today? That's all.\n\nAll right. So there's a lot of things to address here. So first of all, something that me and Mr. Dubowitz agree about, Mark. Mark, something that Mark and I agree about is that there actually is not a threat of an aggressive first strike by Iran. I'm a little surprised to hear him say that, but I'm grateful to hear him say it is honest. I would, you know, advise you for, you may be unfamiliar with this, but I can tell you anyone in America who drives for a living and listens to AM radio have heard claims that Iran was making nuclear weapons probably 50,000 times in the last 25 years.\n\nOver and over and over again, we hear this propaganda. They still don't have a single atom bomb. The reason why they haven't been able to commold together an atom bomb in this 1940s technology is because they have not tried to, okay? So people can, you know, just essentially fog this dead horse, pretend there's this threat. Oh, he's going to break out any day now. But here's the thing about that. As the Ayatollah well knows, George W. Bush, Barack Obama, Donald Trump, Joe Biden, and now Trump again have all vowed with all sincerity that they would bomb Iran off the face of the earth if they attempted to break out and make a nuclear weapon. Hillary Clinton, when she ran, said they'd be obliterated from the face of the earth. Barack Obama did an interview with Jeffrey Goldberg in the Atlantic in 2012 called \"As President, I don't bluff.\" And essentially the interview is him begging Jeffrey Goldberg to explain to the Israelis that he really, really, really, really means it, that he's trying to negotiate, but if the Ayatollah breaks out for a nuke, I'll nuke them if I have to.\n\nNo, they never said that.\n\nHe didn't say that. But the implication was, by the way, no, no U.S. president ever said they're going to obliterate Iran. U.S. president said, Hillary Clinton did.\n\nAll options are on the table.\n\nAnyone can Google her word.\n\nShe was never our president.\n\nNo, I said she was running for president.\n\nYeah, but she was never our president, but no U.S. president ever said they'd obliterate Iran. Nobody ever said the implication. The implication was clear under W. Bush, Barack Obama, Trump, Biden, and Trump again that they would strike Iran's nuclear facility. If they broke out toward a nuclear weapon, America would do whatever it took to prevent that from happening. So, strike their nuclear facilities. That was always the case there. Please clarify, just to be accurate. And I'm almost talking about nuking Iran. No one's talking about bombing Iran to smithereens or obliterating or any of that.\n\nI mean, that's really not true. True. I mean, Barack Obama changed America's nuclear posture to say, because it used to say, \"We reserve the right to use a nuclear first strike against any country.\" And he changed that to say, \"No, we, we promise not to use a nuclear first strike against any non-nuclear weapon state except maybe Iran.\" Okay.\n\nOkay. That's true. All right. And so, um, in fact, that was the threat. And, and I got more here. Okay. Uh, Netanyahu also did an interview with Jeffrey Goldberg back when Ehud Barak was his defense minister, uh, in, I think this is also 2012, it might have been 2014, where the two of them explained that they agreed with what he said, too, that there the threat is not of a nuclear first strike, unlike every AM radio audience has been led to believe that the Ayatollah, as soon as he gets an atom bomb, he will nuke Tel Aviv, and he doesn't care if all of Persia is nuked by Israel's 200 nukes in response. He's trying to cause the end of the world by causing a nuclear war and all these things. Well, Netanyahu himself admitted that that's not true.\n\nYeah, I think it's really important. I agree with, I'm just agreeing with you, so you don't have to stop me. But I'm agreeing with you.\n\nI know, but I'm agreeing with you, so it's all right. So Netanyahu told Jeffrey Goldberg that he was not concerned about a first strike, that his only concern was that talented young Israelis would move to Miami, that there would be a brain drain. That was his words, a brain drain from Israel. And that also then Hezbollah, as this is what he put it, and I agree with this, that conventional forces would have a bit more freedom of action in the region if Iran was sitting on an A-bomb. Neither of them said that there was a threat of an offensive first strike against Israel. And I would point out, and I'm skipping ahead to Trump, but I'm skipping back here again in a second because I got more things to refute. But Trump just said the other day when he announced American air strikes there that this has neutralized a threat to Israel. He did not even pretend that it was a threat to the United States that he had ended in doing so.\n\nActually, he said exactly that.\n\nWell, actually, you can Google the statement.\n\nHe said President Trump has said that an Iranian nuclear weapon is a threat to the United States. He said that over announced his great victory in bombing, which is what I just said, right? President Trump sends out 20 truth posts a day. So let's look at the many, many, this whole thing about how I always believe Hezbollah and I always believe the Ayatollah, when in fact I did not quote the Ayatollah and I did not quote Hezbollah on anything. I did quote Osama bin Laden taking responsibility for the Gopar Towers attack, which he shared that with Abdelari Awan, anyone can read it, and he agrees with Michael Scheuer, the former chief of the CIA's bin Laden unit, who also said that it was a hoax, that it was Iranian-backed Saudi Hezbollah that did that attack, and again, who did they attack? They killed 19 American airmen, which was the number one complaint of al-Qaeda against the United States, that we had air forces and army stationed in Saudi Arabia in order to bomb and blockade Iraq, which again, this was the thing that you had asked about before, was part of the dual containment policy in the 1990s.\n\nSo, Scott, you're saying, no, wait a second. The fact is you're sitting here saying that, \"Oh, I, I trust them all so much.\" Well, what do you think, Lex? What do you think Ronald Reagan meant by \"trust but verify?\" He meant don't trust, but be polite, right? That's what he meant. Verify means we, we know with sensors and cameras and inspections what's going on. No one can find a quote that I said here about how we can trust the Ayatollah because he promised this or that or the other thing. I didn't say that, right? What I'm talking about is the process. They sign agreements, and then we have inspectors to verify their claims. And as anyone can search at IAEA.org, they have continued to verify the non-diversion of nuclear material in Iran to any military or other special purpose. IAEA has now said that they actually can no longer do this before because America withdrew from, before this war started. So I mean at\n\n\nAt the end of the day, let's just be factually accurate, and the fact of the matter is, anybody who knows anything about a nuclear weapons program knows that we do not have 100% certainty on anything.\n\nI mean, Scott is making claims here that the Mossad is fabricating, the CIA is fabricating, everybody's fabricating, but he's also assuming that we have 100% certainty about what we're doing inside a country more than two and a half times the size of Texas.\n\nAs Scott rightly said, mountainous, incredibly difficult to monitor, incredibly difficult to surveil.\nThey built underground facilities at Natanz and Fordo without our knowledge.\nThey didn't disclose it.\nWe finally found out about.\n\nRefuted that an hour ago.\nAnyone, but the fact of the matter is, they did it.\nIt's there.\nBoth the facilities are there.\n\nAnd by the way, you keep saying that I just say lies, lies, lies.\nBut I have explained exactly what I meant.\nI've cited my sources, and I haven't just sat here and said, \"Uh-uh, that's a lie,\" cuz I don't like it.\nI sat here and explained to you exactly how I know who was building those EFP bombs in Iraq, exactly how I know what the IAEA said about the state of inspections here, or what Robert Kelly told the Christian Science Monitor about Parchin and the rest, and on and on and on.\nYou sit here like I'm just saying, \"Well, that's not true cuz I don't like it,\" when in fact, I'm explaining exactly why your claims are not true, which they're not.\nUh, just like saying that I said I trust Hezbollah, when anyone can rewind that and break their finger trying to find the part where I said that, cuz I never did.\n\nUm, and now, uh, you brought up the DPRK.\nWell, in 2002, when George W. Bush said that they were part of the Axis of Evil, they were part of the NPT, and they had a safeguards agreement with the IAEA.\nAnd yes, they had bought centrifuge equipment from AQN, but they had not used it.\nIt was John Bolton's lie that they were enriching uranium to weapons grade and violating the agreed framework.\nJohn Bolton and George W. Bush in the fall of '02 then canceled the agreed framework deal that Bill Clinton had struck based on this misinformation.\nThey added new sanctions, and they launched what was called the proliferation security initiative, which was an illegal and unilateral uh claim of the authority to seize any North Korean ship on the high seas if they suspected it of proliferation.\nAnd then they added them to the nuclear posture review, putting them on the short list for a potential first strike.\nAnd it was only then, in the end of 2002, after these, what, four or five major things that the Bush government did to antagonize them, that North Korea then announced that they were going to withdraw from the treaty and begin making nuclear weapons, which is what they did.\nAnd then, as we know from all the scientists say, every time that they've tested a nuclear bomb, it's been a plutonium bomb.\nThey never tested, not never once used a uranium bomb.\nThere's no evidence that John Bolton's claims there that they were enriching uranium were ever true.\nAnd they had, you know, Sig Hecker, who's this important American nuclear expert, went and toured their facilities and all of these things.\nAnd so we know uh quite a bit about what they have.\nAnd it was simply Bush pushed North Korea to nukes, as Gordon Prather wrote in his last great article for us at Antiwar.com.\nAnd it was through this exact kind of belligerence when we already had a deal that we could have.\n\nTheme in your analysis.\nAnd again, I just want to, I want to look at it, maybe steel man it, maybe challenge it.\nBut the constant theme is the United States and Israel and the West.\nWe constantly aggress against North Korea, against Iran, against Russia, against these countries, and they respond to us.\nAnd they respond to us in ways that they build nuclear weapons programs that they're that are peaceful, but we force them to develop nuclear weapons.\nThey don't actually mean to kill us.\n\nLook, it's not right that I'm saying everything anyone does.\nYou're saying that everything I say is that everyone anyone else does is a reaction.\nBut that's not true.\nThe subject here is what has America done to make things worse rather than better.\nI'm citing I'm citing provocations.\nThat doesn't mean I'm saying that everything that happens in the world is only an equal and opposite reaction to an American provocation.\nAnd you can't find me saying that.\nYou can only somehow try to paraphrase me claiming that somehow or something like that.\nBut that's what's issue, right?\nIs as I said, for example, there's the Reuters story that says that after Israel did the sabotage, which they bragged about at Natanz in April of '21, that was when they started enriching up to 60%.\nOkay.\nSo now I'm saying that and I'm just denying the agency of the Iranians or anything.\nI said that no, I'm not.\nI'm just citing the Reuters news agency saying that this proactive action by Israel caused a negative reaction by your own lights.\nA very negative reaction in their beginning to again enrich up to 60% uranium.\nSo that means, oh, I'm just spinning for the Ayatollah or I believe that no one ever does anything except in reaction to Israel and America, except that I'm just citing specific examples of where that's exactly the case.\nDonald Trump withdrew from the deal.\nHe could have stayed in the deal and tried hard to make it better.\nHe didn't.\nAmerica has done America.\nThe US government has made numerous mistakes.\nIf this podcast is all about the American government and the mistakes it's made, it's a huge spend hours on it.\nCan we please get to today?\n\nUh, talk about use everything we just talked about and talk about today.\nWhat is maybe Mark, can you lay out what is the best case and the worst case, and Scott then lay out the best case and the worst case that can happen now.\nSo, Lex, I think the best case and something I've advocated for, I've been working on this for 22 years, is that the Iranians return to negotiations at Oman, uh, sit down with the United States and conclude an agreement that peacefully and permanently and fully dismantles their nuclear program.\nThey agree to that, which means they shut down any remaining facilities.\nThey give up all the remaining centrifuges and enriched material that they could use to develop nuclear weapons.\nThey let the IAEA in in order to supervise this.\nThey actually commit to not rebuilding this nuclear program.\nAnd we commit as we've done with 23 other countries to helping them provide civilian nuclear energy because it seems to me a little fanciful that the Kam would build a civilian nuclear program under 80 m of concrete surrounded by rock uh and take all the risks he's taken.\nAnd by the way, he faces a risk to his regime.\nSpent a half a trillion dollars to do this when it it makes no commercial sense.\nBut let's take him at his word that he wants civilian nuclear energy.\nLet's build it for him as long as there's no enrichment or reprocessing that gives him the key capabilities that he could if he decides to build nuclear weapons.\nThat seems to me a thoughtful approach.\nI think Scott would probably agree with it.\nProliferation proof, he can't build nuclear weapons, and we can do this all peacefully.\nThat's my preference.\nWhat can Trump do to help make that happen?\n\nI think what he can do is he can say to the Iranians, look, I made you that offer last time.\nYou rejected it.\nNow that offer is no longer on the table because that offer gave you enrichment now temporarily, but I now see the game that you would have played when I left office to turn that enrichedment and enrichment capability into nuclear weapons.\nSo that deal's off the table.\nBut here's the deal that's on the table.\nIt's a one-page deal.\nYou give up your nuclear capabilities, we help you build civilian nuclear energy.\nI think that's best case.\nAll right.\nI think worst case is that the Iranians do what they've unfortunately been doing over and over again and rejecting these deals and holding firm that they want to retain this enrichment capability.\nAnd the only reason they want to retain enrichment capability is the option to develop nuclear weapons.\nOtherwise, they can have civilian energy.\nTomorrow makes much more commercial sense to do that, and the entire international community would help them and pay for that.\nI I worry that they're going to just remain intransigent at the negotiating table.\nAnd I think if they do that, then what I worry that they're going to do is whatever remaining capabilities they have left, they'll b their time.\nThey'll wait for the opportunity.\nMaybe it's not now, maybe it's when Trump's gone, and they will rebuild this nuclear weapons program, and they'll be then inviting further strikes, further war, and further suffering.\nAnd I worry that that is the worst case.\nAnd by the way, as part of that worst case in retaining the capabilities, the extra worst case is they take those capabilities and they go for a nuclear bomb.\nNow, if Scott's right and the regime has never had any desire for a nuclear bomb, we don't have to worry about that because according to Scott, all of this has been fabricated.\nAll of this has been result of US and Israeli uh intelligence macity, and we don't have to worry about a nuclear weapon.\nI personally worry about it knowing this regime, looking at two and a half decades of of nuclear deception.\nI worry that they want to retain those capabilities and a time of their choosing develop a nuclear bomb.\nSo I think if you're responsible and you're trying to think through the various scenarios, you've got to consider an Iranian nuclear weapons breakout as a possibility, and you've got to try to mitigate that.\nYou can either mitigate that at the negotiating table through a full dismantlement deal or and that's not it's the least, well, it's it's the least good option for sure is you're going to have to go back in there either the Israelis andor the United States and you're going to have to continue to use both covert action and air power to destroy those capabilities.\n\nCan I just even uh dig in further on the worst case?\nDo you think it's possible to have where US gets pulled into a feet on the ground full-on war with Iran?\nI think one must never dismiss possibilities because as I said, you you've got to plan against worst case options.\nAnd I think that's what the Israel lobby has in store for you guys.\nAmerican lives mean nothing to the Israel firsters.\nThey don't care that Israel motivated September 11th and killed 3,000 of our guys.\nYou know, I was at the airport yesterday.\nThey had a big American flag with all the red and white stripes made out of the names of the dead as September 11th who are killed by people motivated by Israel's crimes in Palestine and in Lebanon and enforcing Bill Clinton's dual containment policy from Saudi Arabia.\nThey don't care about that.\nThey don't care about the 4,500 Americans who died in Iraq War II or the million something people who died in Iraq war, the half a million in Syria as long as the Shiite crescent somehow is limited.\nThey'll even celebrate openly, I don't know about him, but I know Ben Shapiro and many other leaders of the Israel lobby in America celebrated the overthrow of Bashar al-Assad in Syria by Abu Muhammad al-Galani, the leader of al Qaeda in Iraq in Syria.\nWhy?\nBecause he's not a Shiite.\nHe's not an Alawite.\nFriends with the Shiites and friends with Iran and friends with Hezbollah.\nAnd so that's good for Israel even though it's the worst thing that you could possibly imagine for the people of the United States of America.\nThose sworn loyal to Osama bin Laden and I alsawahhiri ruling Damascus now uh their own ISIS caliphate in our era.\nAnd this is why they always pretend they go, \"Oh, you know, over there the Muslims, the terrorists, greatest state sponsors of terrorism.\"\nIt's al Qaeda that threatens the United States of America.\nIt wasn't Hezbollah that knocked those towers down.\nAnd they have us siding with our enemies against their enemies.\nAnd as you just said, well, I guess time will tell, Lex, whether we're going to have to drop the 82nd Airborne in there, whether Americans are going to have to do a regime.\n\nI didn't actually change in.\nI wish you'd listened and and not put words in my mouth.\nI heard what he said.\nI forced him kind of to say what the worst case possibility of a full-on invasion as a thought experiment.\nAnd you can let him finish that as opposed to making the accusations.\nLet's just minimize both ways accusations, please.\nLet's just talk about the ideas.\nLet's the most charitable interpretation of his ideas.\nUh, well, I'm from the United States of America, unlike him, and I care about the future of this country, unlike him, who's here to serve a foreign power and make their case at our expense.\nScott, and next you're going to say that I'm an American.\nCuz you're an immigrant, too.\nWell, you're just hosting the show.\nI don't know.\nSeems like you're trying to be fair.\nNo, it's not.\nNo, it's not about fair.\nHe has an agenda.\nHe's from the FDD.\nStop.\nIt's not about being fair.\nThe implication here is somebody's unamerican because where they're from.\nI didn't say anyone who's not from here.\nI'm talking about him.\nOkay.\nI think that's a really deeply disrespectful accusation.\nCan I ask you, does it bother you that when Naftali Bennett bombed a UN shelter full of 106 women and children in Kana, Lebanon in 1996, that that's what motivated Muhammad Atani to join Ala and attack our country 22 years ago?\nI became a proud US citizen 10 years ago.\nI'm proud to be an American, and accusing me or Lex or any immigrants to this country of not being unamerican is deeply offensive.\nSo let me answer Lex's question.\nLex, let's get back to your question because I think it's an important question, right?\nWhat are the chain of events that could lead 500,000 mechanized US troops to have to invade Iran, which would be a disaster, and that's something we never want to see again?\nThat's one of the lessons of Iraq.\nI think Scott has done a good job over the years in demonstrating that we don't want to do that again.\nSo, is there is there such a scenario?\nI think one must never rule it out because there is a scenario, for example, where the regime collapses, okay, and the regime collapses and there's chaos inside Iran.\nNot suggesting that'll happen.\nThere are a whole bunch of scenarios maybe we should talk about with respect to um the the collapse of the regime.\nBut you could see a scenario where the United States would have to go in there in.\n\n\nIn order to try to secure military and nuclear and missile assets so that it doesn't end at the hands of warring, uh, factional and ethnic groups that Scott referred to, because again, as he's rightly pointed out, Iran is not Persia. Can't the IDF handle it? So, can I, can I just finish? Just who can handle it, who cannot handle it? Um, I think that it's a potential scenario, which is why I don't think anybody should be advocating for a U.S. decapitation of the regime in Iran. I have long been on record of supporting the Iranian people, right? Providing support to the Iranian people to, at one point, take back their country and take back their flag. It's very much sort of Reagan strategy that Reagan ran in the Cold War of maximum pressure on the regime, maximum support for anti-Soviet dissident. While, by the way, he was negotiating arms control agreements with the Soviet Union in order to try reduce the number of nuclear-tipped ICBMs that both countries had pointed at each other. So I think the Reagan strategy of providing support to the people is a far better strategy for trying to get transition, leadership transition, government transition inside Iran. But I think the scenario of decapitation strikes, killing, taking out the entire government could potentially lead to that scenario, and I think we have to be conscious of that. We have to guard against that. So I think that's important. I think Scott's right. I mean, if the scenario happened like that, yeah. I mean, I think the Israelis have demonstrated extraordinary capabilities, and they could go in there, and they could secure loose nuclear materials that you would be worried could be fashioned for nuclear weapons. I mean, Scott doesn't seem to worry about these materials. I worry about these materials and capabilities in the hands of anybody because they're all capabilities that, just the physics of it, you can produce nuclear weapons. So, so best-case scenario, negotiation, we fully dismantle their program in Oman. Worst-case scenario, right, is having to return for continued military strikes that continue to escalate the situation. Worst, worst situation is some kind of decapitation strike that collapses the regime and causes chaos. There are a whole bunch of other scenarios we can talk about that are embedded in that, but I think if you're a responsible person and a responsible analyst, and certainly if you're a responsible policymaker, you got to be planning for all of these scenarios and more.\n Scott, what do you think is the best case and the worst case here? Uh, well, the best-case scenario is that we quit right now and that we, Trump figures out a way to reorder some paragraphs and get back in something like the JCPOA, which was also signed with the rest of the UN Security Council power.\n Can I ask you, like, is JCPOA a pretty good approximation of what would be a good deal?\n Pretty good.\nIt could have been better. As I said at the beginning, Trump could have gone in there and tried to negotiate a better result with the sunset provisions on some of those things. But, um, the concept that America is just going to insist on zero enrichment, zero nuclear program whatsoever when they have the unalienable right, quote unquote, in the nonproliferation treaty to civilian, uh, nuclear material and a civilian program, uh, it's a poison pill. It's meant to fail, just like it was a poison pill meant to destroy the talks here.\nGood enough to start a war. Again, as I quoted from earlier, uh, he said on TV last week, \"Well, America has to take out Fordo now because now they're more likely to break out towards a nuke.\" I think that's exactly right. So, there still is, or there's, there's strong reason to be skeptical, including Israeli and American officials told the New York Times that they thought that the damage was quite incomplete.\n Yeah, the IAEA just came out recently, just point of fact, sort of interesting. We'll see on the battle damage assessment, but they actually think the facility was destroyed and that the centrifuges, the sensitive centrifuges, were destroyed. So, just interesting for the viewers.\nAll the uranium, sell all the uranium mines, all the aluminum smelters so that they can't make any more centrifuges.\n Uh, they've already, they know how to make centrifuges. So, at this point, and you know, in for, uh, it's, this is why government doesn't work. They make matters worse and create more work for themselves and make things worse and worse and worse. We can make the same criticism about Russia's invasion of Ukraine, making matters worse for themselves and causing them to have to escalate even further. Now America's in the situation where the danger that Iran will now break out to a nuke is so heightened that now we're talking about, well, maybe we'll have to do a full regime change. And I appreciate you, Mark, saying that we should not kill the Ayatollah, but Benjamin Netanyahu says we should. He said just the other day that if we get rid of the Ayatollah, that will solve all the problems, which is just crazy to think that they have. Israeli officials have been tweeting out pictures of them ping around with the son of the Shah, talking about reinstalling his royal majesty's monarchy.\nSock puppet dictatorship that's taking back Iran for the people of Iran, giving them over to a bunch of foreign-backed exiles.\nWas that what Trump meant when he gave that speech in Qatar, saying we don't believe in neocon servatism and spreading democracy anymore? He's just setting up because we're going to try to reinstall a monarch.\n Can you go into the analysis of best case and worst case? You laid out the best case. What? So, worst case would be worst case. Did I hear what was the best case? I, I missed the...\n Best case is a deal.\n Yeah.\nThat, that we quit deal, basically. You guys agree on the best case.\nRespect their right to a civilian nuclear program and try to negotiate, as I said, back into something like the JCPOA, which again had them exporting their entire stock of uranium out of the country. He wants no nuclear program whatsoever.\n No, no, that's not what I said. That's not what I said. Be careful what I said.\n Well, no enrichment capabilities, entire dependence on other countries to supply their fuel needs.\nCan you teach me the difference when we...\n Yeah. So, so let me just step back from this, cuz we agree on some, and we disagree on a major issue, and then we both agree Iran deserves a civilian nuclear program.\n See, Ayatollah is never going to give in on enrichment. We know that it's a premise for our whole discussion here. Therefore, what he's saying is we're going to have to keep escalating the war until the mission is accomplished.\n Not sure I said that, Scott. I think it's again important, the distinction here, right? We both agree that Iran deserves a civilian nuclear program. Twenty-three countries have civilian nuclear programs, and they don't have enrichment, and they don't have reprocessing. Where we differ is I don't think Iran should have the Iran standard. I think that should Iran should agree to the gold standard that 23 U.S. allies have agreed to. So have civilian nuclear program, but you don't get to keep the key enrichment and reprocessing capabilities that you need to develop nuclear weapons. Do you think that Bill Clinton should have just let the Chinese sell them the lightwater reactor that they wanted to back in the '90s?\n Yeah. And America, of course, allowed Russia to sell them a heavy water reactor for the same purpose. But I agree with Scott that I think one of the ways out of this is, yes, whether it's the Chinese or, preferably, as an American, I'd prefer the Americans actually sell, uh, reactors to the Iranians. A great, you know, nuclear industry in this country. Let's do that. But if they can't, the South Koreans can. The Russians can, the Chinese can. I wouldn't want to have significant Russian and Chinese influence in Iran. So, better that it be a Western country that does it. Nevertheless, provide those reactors. They're proliferation-proof. There's no enrichment and no reprocessing. You buy your fuel rods from abroad. You put them in the reactors. You power the Iranian electrical grid, which is in terrible shape because the Ayatollah has spent a half a trillion dollars trying to build nuclear weapons and not trying to provide electricity for his people. Let's help him. Let's help his people get electricity. But the key difference in our argument, and it's a fundamental difference. God's right. Like the key difference is I do not want to give this regime enrichment or reprocessing, cuz they have shown over time, for whatever reason, whether you believe it's they intended to, or we were lying about it, or we broke them, it doesn't matter. What they have shown over the past number of years is they have gone up from 3.67% enrichment uranium for civilian purpose all the way up to 60%, which is 99% of what you need for weapons grade. Since we've seen them do it before, we don't want to see them do it again. So, no enrichment, full dismantlement, full deal, and then there's a peaceful resolution to what I, what I worry about is positions that are taken that undermine President Trump's negotiating leverage in Oman because...\n Can I ask you, you were saying you supported the JC, you were...\n Yeah, we're, that's, you opposed to withdrawing from it. Don't you think that Trump could have gone over there and negotiated to make it better? And would you agree that it was a huge mistake to withdraw that because they were, as we agreed, shipping out all of their enriched uranium to only be brought back in a form that they could not use to make nukes? The scientists had decided that if they kicked all the inspectors out and beat their chest and started making a nuke, it would take them a full year to have enough weapons-grade uranium for a single gun-type nuke under the JCPOA. Right. So, so can I, let me ask you a question because you're right. I mean, I'm glad you've pointed out because I, I try to take a nuanced position in during the JCPOA debate, and I got hammered by the left, and I got hammered by the right. Okay. The, the, the left hammered me because I criticized the JCPOA because its fundamental flaw was twofold. One, it gave Iran enrichment capability that would expand over time as the restrictions sunsetted, right? And number two, the restrict, the sunsets were going to kick in, and Iran would emerge with his industrialized program, which we would not be able to stop. Now, the nuance position, which I got hammered on by the right, was I said, go negotiate with the Europeans, agree on a common transatlantic position to approach the Iranians and say, \"Look, that deal that we did back in 2015, we think it's flawed. We want to extend that deal. We want to get rid of the sunsets, and we are going to negotiate a deal.\" Now, does that mean we have to give you more sanctions relief? Yeah, probably. The Iranians are not going to just agree without sanctions relief. What happened is the Trump administration tried to negotiate with the Europeans. The Europeans were opposed because they didn't want to revisit the agreement. We knew from, we knew the Iranians were completely opposed, and there was no way they were going to do this if the United States and Europe were divided. And so, at that, just, just a little bit of history, I just think it's interesting history. It was at that point that President Trump decided to withdraw from the agreement. But what I'm asking you is, if, say, you were the national security advisor under the JCPOA, where they are still shipping all their enriched uranium out of the country and all that, which you're, you would be advising him to not leave in the negotiations to improve the deal. Would you have been willing to accept some level of enrichment then, as long as we're still, we have the restriction part where they're shipping it all out of the country, or to you, enrichment at all is always a red line, essentially equivalent to them being 99% of the way to a nuclear weapon?\n Look, enrichment capability is a red line. It has to be a red line. And, and, even though you know it's protected by the NPT, the right to peaceful nuclear technology. Call it a loophole, but they have the right to enrich uranium in...\n As there's different interpretations of everything, including agreements. Um, there is a raging debate about whether the NPT actually gives you a right to enrich. In fact, the Obama administration, even with the JCPOA, was not willing to recognize Iran's right to enrich, but they were willing to recognize its de facto reality that they were enriching.\n Can you explain NPT?\n It's the non-proliferation treaty. Iran is a member of it, and it is supposed to promote civilian, peaceful civilian nuclear energy, right? And it's supposed to prevent countries from developing nuclear weapons. I think that's a basic summary of it, and it mandates that non-nuclear weapons states have a safeguards agreement with the IAEA, um, and full of additional protocols and whatever they have the right sign. Well, no, they had an additional protocol that they were abiding, not even enriching at all while they were negotiating with the E3. And then what the JCPOA really did was add a bunch of additional protocols and subsidiary arrangements and agreements.\n Refused to ratify the additional protocol. I just want to just be clear on the facts. I mean, it's really important.\n At which point in time did they refuse to ratify? Because they did ratify the JCPOA, which was full of additional protocols and and subsidiary arrangements and agreements. They're called...\n There's, there's an important additional protocol that Iran refused.\nWhich one was that? One where they promised not to enrich at all, which they actually did abide by while they were negotiating with the E3 in the W. Bush years before they even started spinning.\n The important point you ask me, you, you asked me what I would advise the national security advisor of the United States, or if I was the national security advisor of the United States, which I, I guess I can't be because I'm a foreigner, but the fact of the matter is, is...\n I think you could still be national security advisor. Zbigniew Brzezinski sure was.\nI think he was taking a shot back at the fact that you took a shot.\n You know what, Lex? I think that you probably would recognize that there are many people who lobby for Israel's interests in the United States who clearly don't care that much about what happens to the United States of America in as a consequence because they care about Israel, which is a different country than America, right? It's not part of...\n I think an American, an American citizen cares primarily about America. That is a fundamental belief for me to make an accusation that they don't requires a very large amount of proof for each individual. I don't care.\n To pretend that American and Israel's interests are the same requires a tremendous amount of cognitive dissonance by those who support Israel's...\n Sponsor of terror as though Iran has anything to do...\n\n\nwith anti-American terrorists.\nI don't know who is the they that we're talking about, but I believe American citizens care about America first.\nThey may discuss other nations and the interests in the Middle East or in Europe and those interests might align with their own worldview, whatever.\nBut when it comes at the end of the day, if everybody starts a war with everybody else, they're America first.\nLike I I'm America first.\nIf there's a war that breaks out and we have to pick up guns, I'm fighting for America.\nI'll take them on a case by case basis.\nI know immigrants who are absolutely super patriots who know American history and love and care about America more than their nextoor neighbors who are from here.\nBut that ain't universal.\nOkay.\nAnd let's talk about case by case then.\nThat's fine.\nWell, I think I think I think he's clearly accusing me.\nA worse war with Iran.\nHe was entertained the possibility of putting ground troops in there.\nDon't take personal catastrophe of you.\nYou've taken personal shots.\nLet's not do it.\nYou guys are just having fun and I'm having fun.\nJust on the idea, he said that there's there's a threat to missiles.\nThere's a threat from Iranian missiles to America's bases in the Middle East.\nYeah.\nBecause of Israel and because of this war.\nThe first time Iran ever fired missiles at an American base over there was in response to Trump bombing them.\nIt's never fault.\nIs that what everybody thinks?\nIt was Iran who started this.\nLet's bring it back.\nWhat a joke.\nScott, it's a remarkable management.\nI want to reiterate this.\nAnd then Iran shot missiles at Qatar and Iraq.\nScott, you're a patriotic American.\nGod bless you.\nGod bless the United States.\nThank you for allowing me to come to this country and become an American.\nIt's a great country.\nUm and as a patriotic American, I assume that the the United States government and the United States intelligence community and the United States military, okay, has America's best interest at heart.\nHowever, we have learned from the history and Scott's done a very good job of detailing this during the Iraq War that the United States gets it wrong.\nOkay, I don't think the United States lied us into war, but the United States got it wrong.\nSo, I think Scott's right.\nWe must make sure that we learn the lessons of Iraq, but not overarn the lessons of Iraq.\nI would also say this, there are many lobby organizations in the United States.\nThere's the China lobby, there's the oil lobby, there's the the pharmaceutical lobby, there's the Qatar lobby.\nI live in Washington.\nI see all these lobby organizations.\nOkay.\nFact of the matter is the pro-Israel lobby which actually lobbies in support of the US-Israel relationship is comprised of tens of millions of Christians and Jews and Hindus and yes yes Muslims who believe strongly in a strong US-Israel relationship.\nThe reason that relationship has been so strong over so many years and that this quote lobby has been so successful is they're pushing through an open door with policy makers, not because some nefarious money influence, but because at the end of the day, the interests align.\nWe we we counter terrorism together, we counter nuclear proliferation together, and we believe that the US-Israel relationship is a strong relationship.\nAnd and these accusations of dual loyalty and these accusations of Israel firsters that Scott's thrown around I think distract us from the conversation which I think we should return to right let's talk about today we we've talked about best case scenarios we talked about worst case scenarios and we talked about really worst case scenarios so I think let's let's talk about the way forward and I I'd be interested in hearing from Scott where he thinks we're going and I'm certainly I I don't crystal ball these things it's always difficult to predict but I I I think President Trump has done a really good job.\nHe has led this, right?\nHe has not been, you know, the uh at the beck and call of BB Netanyahu or Muhammad bin Salman of Saudi Arabia or anyone else.\nHe has led this effort.\nHe has made these decisions.\nThis is a man who throughout his entire career and not just his political career, but many many years before that believed that an Iranian nuclear weapon was a threat to the United States of America.\nNot just to our allies but to the United States of America.\nAnd he's been very clear on record.\nHe led this campaign since he started in January.\nHe offered negotiations.\nHe got rebuffed by the Iranians in Oman.\nHe put pressure on the regime economically.\nHe continued to offer negotiations.\nHe offered a very good something that I thought was flawed.\nI mean, Lex, I got to tell you, the the offer in Oman that he gave to the Iranians, I thought it was flawed because I think it allowed Iran to retain this key enrichment capability.\nThe Iranians turned it down.\nAnd I think Kame to his everlasting regret is going to wonder why did I turn that down?\nI could have got the enrichment capability that Scott thinks they deserve.\nAnd yet I rejected it.\nWhy?\nWhy did I reject it?\nCuz now look what's happened in the past 12 days.\nYou know, I've lost mostly.\nWe'll see what happens on the BDA, the battle damage assessment.\nI've certainly lost Natans.\nI've uh lost my conversion facility at Isfahan which converts uranium hexafflloride into uh into well converts yellow cake into uranium hexafflloride to pump into centrifuges and the most important thing I lost at isvahan there's a conversion facility that takes 90% enriched uranium and turns it into uranium metal without uranium metal they don't have any 90% enriched uranium he just means hypothetically if they did have some be you know the 60% that's 99% of the to 90% enriched uranium.\nBy the way, you can make a a crude nuclear device with 60% enriched uranium.\nI just want to put that on the record.\nBut he lost that key conversion facility that turns 90% enriched uranium or even 60% enriched uranium into uranium metal.\nYou need uranium metal to fashion a crude nuclear device or a warhead that's been destroyed.\nAnd I just when I was coming in this morning, I just checked.\nI thought it was interesting.\nBeen a whole lot of discussion about the fact that about 12 or 16 trucks showed up at Foraux in the days before the the US strikes and moved something out of Foraux.\nWell, according to reports just this morning, we'll we'll see if they're verified.\nI I don't trust single sourcing.\nI don't trust what some reporter just says in their stories because reporters got it wrong over and over again, especially all the ones who accuse President Trump of being a Russian agent.\nBut we'll see what happens.\nWe'll see if it's verified.\nBut according to the reports um most of the material remained at Fordo because the Iranians were calculating this was the most heavily fortified facility.\nThey were also calculating that President Trump was not going to strike it because what they had been doing was listening to lots of voices and we can name the voices or we can just talk talk to them about a collective who were who they thought were telling Trump don't do it and we're telling Trump don't do it and Trump decided on his own to do it.\nSo, they kept the enriched material at Foraux.\nAnd if that's the case, it may be that much of it was destroyed.\nAgain, caveat, it's just one or two stories right now, uh, one in NBC News, and let's see what happens over the coming days, but if that's the case, that material may have been destroyed.\nOne other element that we haven't even talked about at all today, which I think your listeners should be aware of, we talked a lot about nuclear weapons development, warhead development.\nWhat the Israelis did was they took out the top 15 nuclear weapons scientists who have been part of, you remember I talked about that original Ahmad program and the development of those five atomic weapons.\nWell, some of them who are old enough come from the Ahmad program which was the early 2000s.\nSome of them are new, but they've been or not new but younger and they've been trained by the veterans.\nThe 15 top guys taken out.\nThat is akin to it's January or February 45 and the entire central team of Oppenheimer gets eliminated three to four months between the Trinity test before the Trinity test where we explode our first nuclear weapon.\nSo I would say significant damage to Iran's nuclear weapons program suggests that we potentially have rolled them back for years.\nI don't know how many years and all those technical assessments are still to come but significant damage.\nSo the question, as I said, is have they retained enough capabilities that they've squirreled away, stored in covert sites, put under deeply buried tunnels to break out to nuclear weapons?\nThat's Scott's concern.\nIt's my concern.\nLike I'm sure it's your concern that they could do that.\nOr have have they set back the program so significantly that Kame then has to decide will I be inviting another Israeli and or US attack if I try to break out?\nAnd if I do, do I risk my regime?\nwho thinks that if they break out and try to start making nukes now that any hawk supporting this war will take responsibility for driving them to it.\nSo the the suggestion you're making is we're actually driving of course as opposed to doing the opposite.\nWe're actually driving them to develop nuclear weapons.\nThat's right.\nCan you make the case that?\nYeah.\nPreviously he said let's take the Ayatollah at his word that he only wants a civilian electricity program.\nWell, let's not take him at his word.\nAgain, I never said in this conversation, trust the Ayatollah.\nHe did.\nNow he's kind of But you said that the Ayatollah doesn't want nuclear weapons programs.\nScott, you were very clear about that.\nWhat I said about nuclear weapons program, are you going back on that now?\nJesus Christ.\nWhat I was very clear about from my very first statement when we sat down was that the Ayatollah was building himself a latent nuclear deterrent putting Iran as what they call a threshold nuclear weapon state just like Brazil and Germany and Japan so everyone knows they have mastered the fuel cycle they could enrich uranium up to 90% don't make me do it that was his position weapons program did you ever hear me say anything about believing the Ayatollah saying he only wanted an electricity program.\nThis is why enrichment is a red line.\nIt's because if all the enrichment is done overseas somewhere, then it's not a latent nuclear deterrent at all.\nSo, it's a red line for you as well as for me.\nWe agree, Scott.\nI'm saying it's a red line for the Ayatollah that he's clearly not going to give in on and it's a poison pill by the Israelis in the West.\nThey know he's never going to give up enrichment 100%.\nUm because that's the whole point of it.\nSo it's just disingenuous to say, &quot;Oh, let's believe him that he wants an an electricity program.&quot;\nHe's not saying that.\nI don't even think that's his official position.\nOr if it is, it's with a strong implication as everyone understands that it's a latent nuclear weapons capability and a potential actual nuclear weapons capability.\nDo you a deal will have to include enrichment?\nYes, that is a red line.\nHe won't move off.\nYes.\nAnd then the thing is too, just like I was saying before, if Trump had come in in 2017 and said, &quot;Screw this.\nI hate this deal.&quot;\nAnd then got on a plane and flown straight to Tyrron and said, or you know, sent his guys and said, &quot;Now listen here, Ayatollah, I want to fix this deal up better.&quot;\nI think that he really could have.\nAnd I don't I already said I don't know the details, but I believe Mark when he says that the Europeans were being intrigent on that.\nAnd again, I criticize the CIA and FBI for framing Trump for treason, for preventing him from being able to work with the Russians to see if maybe they could put pressure on the Ayatollah to deal with him.\nBut I think that it's clear when the Ayatollah was willing in the JCPOA to well, first of all, to sign the additional protocol back in the W.\nBush years for year for three years, he didn't enrich anything under that deal as long as he was negotiating with the E3.\nAnd then under the JCPOA where he's shipping out every bit of his declared nuclear material, he's clearly keeping the ability to enrich uh if necessary to uh weapons grade if if a crisis breaks out.\nAnd he feels like he has to make nukes, but he has he had no stockpile to enlist this whole thing about 99% of the way there.\nHe had no stockpile.\nSo even if you uh you know count drive gassing up your truck on the way to the mine as part of this long time scale of percentages here they were much further from a nuke under the deal which he agrees we shouldn't have even gotten out of.\nCan I just say technically just I think again important for your listeners to understand under the JCPOA um Iran is allowed to keep a stockpile of maximum of 300 kg as I remember of 3.67% enriched material.\nThey're allowed to continue to enrich as long as if they go over the 300 kilogram, they have to continue to send that out to Russian um to to Russia to blend down.\nAnd so they kept the enrichment capability, the ability to enrich.\nThey did keep a stockpile.\nScott's right.\nThey weren't able to they're not allowed in those early years to go under 3.67%.\nThey would be allowed to go to 20% and 60% and 90% as the restrictions sunseted, but they were able to keep all of those keep capabilities.\nSo, I just want to clarify just technically what the JCPOA actually said and what it didn't say.\nYeah.\nCan you comment on the so-called operation midnight hammer now that we can look back at it?\nWhat parts were successful or what parts were a mistake?\nWas the whole operation a mistake that accelerates the Iran nuclear program, the incentives for it, or is there some components that actually is a disincentive, disincentive for Iran to develop the program?\nAnd then maybe you can comment on the same.\nIt'd be nice to get comment.\nI think we really don't know, right?\nThere's some initial battle assessments and arguments and all that about just how much was destroyed and what and we don't know exactly what their reaction is going to be.\nUm the you know there were reports of them saying hey we're already starting up a new facility somewhere else.\nUh there were reports where they said hey a lot of our centrifuges survived and we're going to start spinning them up right now and this kind of thing.\nUm the potential is there.\nI don't know what the ITL is going to do.\nAnd I think this goes to the larger argument about the apocalyptic threat of the ayah which\n\n\nMark has not made, but which Israel hawks often do, that these guys just can't wait to get into a war and all this. In fact, if you look at a war. But the argument I make is we're not going to use a nuclear weapon. You interrupt me every time. I try to, Scott. I just, you're mischaracterizing what I'm saying. I need to clarify when you misar. He's not interrupting you every time, but sometimes interrupting. Yes. Uh, so try not to interrupt as much. Uh, go ahead, Scott. Don't take it personally. Come on. Let's go.\n\nIt seems like a deliberate attempt to obfuscate and and prevent me from just being able to complete a point. You know, he does it virtually every time.\n\nNo, it's not.\n\nAs a listener, I'm enjoying this. Uh, well, look on the face of it, they blew up a lot of stuff, and they made them very angry. So are they going to now give in, or they're now going to double down, or they're now going to hold still? We don't really know. As I was trying to explain from the Ayatollah's position that he's in. What are you going to do with a problem like the United States of America? Right? They can chant \"Great Satan\" this and that all they want. They have no ability to really threaten this country in any way. And they, and they know that America absolutely does have the ability to, in fact, even without nuclear weapons, essentially wipe their civilization off the face of the earth just with B-52s if we wanted to carpet bomb their major cities. And they, so they know that the Ayatollah knows he's in a very difficult position. And look at what he did when they assassinated Soleimani. He sent essentially a symbolic strike at an empty corner of an American base in Iraq. It did cause some concussions and head trauma, but it was, he deliberately did that to not cause casualties. And then Trump let him have the last word. And then also when they shot down the drone, which I think Trump was suspicious that the Pentagon had flown that into Iranian airspace, and they demanded strikes, and Trump said, \"No, it's just a drone. How many Iranians will die at the base you want me to hit? No, I don't want to kill them. I don't want to do it.\" And again, he let the Ayatollah get the last word. Same thing happened again with yesterday's strikes. Iran hit America's, our central command headquarters, the Aludid air base in Qatar, and also an American uh base, I think in Baghdad, and I'm not sure about in Iraqi Kurdistan.\n\nZero casualties so far.\n\nZero casualties so far. So what is going on there essentially is he's got to do something, and he's doing like these symbolic strikes essentially to say like, \"Hey, you can't do that to me,\" but then he's also telegraphing that, \"Hey, like, I can't do anything about you, and I don't really want to fight.\" And so in a way, he's like kind of backing down. He's doing, and then what did Donald Trump say? Donald Trump again let him have the last word and in fact, like, bragged and mocked and said, \"Hey, thanks, Ayatollah, for giving us a warning that you were about to shoot missiles at our base so we could be ready to shoot them all down,\" and this kind of thing. And he said, \"Now is the time for peace.\" In other words, Trump again letting the Ayatollah get the last word. Why? Because the Ayatollah, he might be a horrible leader if you live in Iran, but he is not perfectly, but essentially cautious in foreign policy because what's he going to do? He's going to decimate our naval base at Bahrain. He's going to slaughter all our troops in Kuwait. And then what's Trump going to do? And so the Ayatollah knows. So, it's the same people who, who, and I don't include him in this, but you hear a lot of the hawkish talk about just how easy this has been. These same people talking about what an absolutely irrational uh, religiously uh, motivatedly and motivated and therefore, you know, crazy and irrational uh, group of people, the mullazar, and why they can only be dealt with with force, when in fact what they're showing is essential conservatism, trying to hold on to what they got, making a latent deterrent because they know if they break out toward a bomb, that'll get them boned. So they were hoping having the latent deterrent would be enough to just keep them at the status quo. That's why it's so disingenuous, just again with um, uh, Marco Rubio, the Secretary of State, saying, \"Forget the intelligence because 60% hey, it's 99% of the way there, close enough for us.\" So it doesn't matter if the Ayatollah has decided to make a nuke or not. They're just too close to one as it is. Which is really silly because they're not much closer than they've been for 20 years since the W. Bush administration, they proved they've mastered the fuel cycle. That is one of the fundamental disagreements in the room that you're saying they don't have, they really don't have interest to develop a nuclear uh, weapon, and they're not quite.\n\nWell, not exactly. I mean, I more towards that direction than Mark is saying.\n\nMore toward, but they're saying, \"Look at us, we're a threshold state. Don't push your luck and and force us to make the bad decision.\" They have now, that's an implication. They have not said that outright, but clearly the implication is that if we force them, then they will go ahead and make a nuclear weapon.\n\nWhat I mean is, if left on their own devices, they would not develop. That's the case you're making.\n\nNot just on their own devices, but if we were to try to negotiate with them in good faith and try to have normal relations with them, that would disincentivize a nuclear weapon even further.\n\nOkay. Can you comment on the mission operation and general?\n\nSure. A couple things I think were interesting what Scott said, and I agree with, with certainly with some of it. Um, I mean, the first thing is, I, I do believe President Trump has negotiated in good faith. I mean, he sent Steve Wickoff, he's chief negotiator for five rounds of negotiations since he came in office. Um, the second is, I mean, we can keep going around in circles, but the, the fact of the matter is, I do believe that Iran and Iran-backed terrorist organizations have, for since 1979, uh, killed and tried to kill and maim Americans and taken them hostage. I think it's important for me again to put that on the record. But where I agree with, with Scott is, I, and it's interesting, and I don't know if Kame has changed in his, you know, he's 86 years old, he's been in power since 1989, and there's a little bit of history that I think is really interesting, Lex. It was the, it was 1988, and uh, Iran and Iraq had fought this brutal 8-year War, million people dead, and um, the United States accidentally shot down a Iranian passenger airline. The United States offered to pay compensation and apologized. The Iranians didn't believe it. They didn't believe we could accidentally do that. They thought we were going to be intervening militarily on behalf of Saddam. So, Kame, who's not the supreme leader at the time, he was the Iranian president. He and Raf Sanjani, they go to Kmeni and they say, \"Mr. Ayatollah, we got to sue for peace with the Iraqis because the Americans are intervening, and and we cannot fight the Americans. We fought this brutal war. We'll continue with Saddam. We cannot fight the United States of America.\" I think Scott's right, like that perception that there's no way they can fight the United States of America because that's regime-ending potentially, even if we don't intend to, that could actually happen. And there's a famous line where Kmeni says, \"All right, I agree. I will drink the poison chalice. I'll drink the poison chalice, and I will agree to a ceasefire on pretty tough terms for Iran.\" It's interesting now, 36 years later, or 37 years later, Kame is now going to decide to drink the poison chalice. Does he agree to a negotiated deal with the United States? Does he agree to a deal that President Trump, and I mean, Scott criticizes me for it, but that's President Trump's position is no enrichment, full dismantlement. By the way, that's backed up by 52 of 53 Republican senators and 177 House GOP members and backed by everybody in his administration, including JD Vance, who's been emphatic about that. Does he agree to that deal, or does he decide, \"I'm not going to join the poison chalice, and I am going to, I'm going to take other options?\" Now, I agree with Scott, like going after U.S. military bases, except in a symbolic way, suicidal. Closing the Straits of Hormuz. 40% of Chinese oil goes through there. The Chinese have been saying to the Iranians, \"Don't you dare.\" By the way, 100% of Iranian oil goes from Iran in Carg Island through the Straits of Hormuz. So economically suicidal for the Iranians to do that. Um, terror attacks, absolutely. I mean, that has been their modus operand for years. So, I would be concerned about uh, terrorist attacks against U.S. targets, against civilians, um, potentially sleeper cells in the United States. So, he's used terasels around the world. He's engaged in a decades-long assassination campaign, including on American soil, by the way, sometimes successfully, sometimes not, including most recently where he went after an Iranian-American three times to try to assassinate her in New York, a woman named Masielad. And so he's got to be calculating, like, what is my play? So if I don't do a deal, how can I actually squeeze the Americans? And Scott's right, like he must be thinking to himself, \"You know what? I was literally on the 99-yard line with an entire nuclear weapons capability. I should have crossed the goal line. If I had had a warhead, a nuclear warhead or multiple nuclear warheads, as they had been trying to build since the Ahmad plan in early 2000s, there's no way Israel and the United States would have hit me militarily if I had nuclear weapons. Then I would have had the ultimate deterrence to prevent that. And then I would be like Kim Jong-un with nuclear weapons. I would then build ICBMs, and then I'd have the ultimate deterrent to stop that.\" So he's got to be thinking maybe now, and I, I can guarantee you the revolutionary guards.\n\nDo you think that that might have anything to do with the fact that America attacked Iraq and Libya when they did not have weapons of mass destruction programs?\n\nCan I tell you the Libya example? I think Scott is the most interesting one for me. Right. Because the Libya example, it was a big mistake. By the way, Ukraine is another good example of this. We went to the Libyans and we said, \"You must fully dismantle your program.\" And Gaddafi said, reluctantly, under huge American pressure, \"Okay, I'll do it.\" And the Brits and the and the Americans went in there and literally hauled out his entire nuclear.\n\nIt wasn't really a program. It was just a bunch of AQN's junk sitting in crates in a warehouse. They did not have the capability to make a nuclear program at all in Libya. They didn't have the the engineers, the scientists, or anyone. So Gaddafi had bought that junk just to trade it away.\n\nJust to be clear, there never was a nuclear weapons program or a nuclear program of any kind in Libya, unlike what you just heard.\n\nThat wasn't my point. Okay. My point is, is he had a nuclear program. We can debate about, again, how we debating about whether, again, it's always Gaddafi and Kame and all these people. They don't really want nuclear weapons. We just misunderstand them. But, but that's not the point. The point is, we did a deal with Gaddafi. We pulled out his nuclear program, and then, I don't know how many years later, but it wasn't too many years later. Seven years later, thank you, Scott. We actually took, took Gaddafi out, and he didn't have a nuclear program. So, we took him out in in the Libya operation. Now, Ukraine is another great example. The Ukrainians after the fall of Soviet Union, you know this, they had the Soviet nuclear arsenal or or good parts of it on their soil. So, we went to them and we said, \"All right, well, here's a deal for you. Give up the nuclear arsenal right off your territory, and we, we, and the Russians and the French guarantee your territorial integrity and your sovereignty as a country.\" So the Ukrainians said, \"Fair deal to me,\" gave up all the nuclear weapons, and then Putin has now invaded Ukraine.\n\nThat's not what Bucharest declaration says that we promised their security. We promised to respect it, and the Russians promised to, and both sides broke that promise. But there is nothing like a guarantee that America would protect Ukraine's sovereignty. They gave up those nukes, and they had no ability to use those nukes anyway because they were Soviet nukes with Soviet codes. They belong to the Soviet military, and the Ukrainians would had no ability to use them or deliver them. They were married to missiles that were made to fly around the world, not to Russia next door.\n\nScott, my point is, and I think this, you'll agree with this. My point is, if you're Kame, and you've seen those two examples of Libya, you gave up your nuclear program, Gaddafi gets taken down.\n\nYou're Ukraine, you gave up your nuclear weapons, and the Russians invaded twice. If you're Kame thinking to yourself, the only thing that matters more to me than my nuclear weapons program is my regime survival. And in 12 days of war, the Israelis specifically, because we hit Foraux and Isvahan and Hans, we, the United States hit those sites. We, the United States hit those sites. The gleeful nature, Scott, like, stop. Take that out. There's no place here in this room with me. The un-American bullshit. Don't do that. The implication here, man, is that I me un-American. And I've been attacked just like the Russian hoax for being a Putin shill. I'm an American.\n\nWell, when you talk about Ukraine's war with Russia, do you say we or do you say they?\n\nI said we, the United States. We, we actually.\n\nWell, you added the United States, but you were just described Israel strikes. Israel didn't strike for Scott. You talked about the US attack on you. You're you're speaking to this other people that you've heard that somehow they do say we, and they talk about, I would say ridiculously, as if uh, I've even heard some people basically put Israel above us, and they're American citizens. Yeah, that's fucking ridiculous. But none of those people are in this room. The, the, the there are demons under the bed. I'm sure those people exist. There's ridiculous people on the internet. There's ridiculous people in Congress who can criticize them, make fun of them, say they\n\n\n're fucking.\n\nThe Foundation for Defense of Democracies has been the vanguard of the war party in this country for 25 years.\nWell, that's a different criticism, but I was, I was... It's an important one. Yeah. Yeah. But no, you just switched. You just switched. No, no, no, no, no, no, no, no. There's no... You just switched from the unamerican discussion to criticizing policies that that particular institute. Fine, and criticize the policies. Do that unamerican bullshit.\n\nLex, the neoconservative movement is the vanguard of the Israel lobby. That's who they are. That's what neoconservatism is about. I'm not a... who the neoconservative, so I don't know who he's talking about, but I'm not. Let's not mix stuff up. There, there, there is a massive Israel lobby in America in Washington that is inseparable from the American war party. Yeah. Yeah. I've talked to John Mir. I respect him deeply. He is one of the most brilliant uh people speaking on that topic. Great. Great. Let's just talk about today and the nuclear proliferation. You guys have been brilliant on this. I'm learning a lot. Let's continue. Yeah. So, let's let's go back to where where Kame may be. I mean, in a bunker, 86 years old, thinking he's going to drink the poison chalice and agree to a deal with Donald Trump and Oman, or is he going to do all of the things that Scott and I are concerned about? And one of those, and Scott has pointed this out rightly so, is he may decide now to to break out for the nuke or creep out for the nuke. He may decide not to do it now. He may decide to do it in three and a half years when President Trump is gone. Right? And I think that the the the important thing is he's seen we, the United States, we took out Fordo and Natans and Isvahan in one operation with B2 bombers and and 12 30,000 lb massive orange penetrators and Tomahawk missiles. So if he doesn't think, if he didn't think that the United States had serious military power before, he now knows we do. So to you, that operation was geopolitically a success. It sends a message of strength that if you try to build, you're going to be punished for it.\n\nSo I've said online in the past 12 days and even before that, curb your enthusiasm. Curb your enthusiasm to all the people...\n\nRelated to which topic? Yeah. Just just this sort of idea that this has been like this unbelievable success and everything's great and everything's going to be amazing and we've stopped the Nuclear Weapons program and this has been a resounding success. I've just said kind of curb your enthusiasm. Kame remains very dangerous. The regime remains very dangerous. A wounded animal is the most dangerous animal in the animal kingdom. He retains key capabilities to build weapons.\n\nYou demanded unconditional surrender on Twitter again last night. Right after Trump said there's a ceasefire. What does unconditional surrender mean? No enrichment, full dismantlement. Yes. Exactly right. It's exactly what President Trump... Well, I... not regime change. Unconditional surrender in World War II meant the end of the Nazi regime and the imperialist Japanese regime entirely. Right. But President Trump made it very clear. President Trump made it very clear. He, he made it clear, I don't support regime change. Well, except for that one... a few hours earlier, right? I, I'll actually, I'll explain that one, cuz I thought it was analyze it like a Shakespeare. What is that? Yeah. Yeah. And what, what, what did he also mean? We have two countries that have been fighting so long and so hard that they don't know what the fuck they're doing. What's that about? He was angry that Israel was still attacking after he promised they weren't. He demanded they turn their planes around. He felt that they were doing it in defiance of their agreement. But he didn't say Israel. He says the both countries... different quote, different quote. He did say, I demand, I believe it was a tweet from True Social. I demand that Israel turn those planes around right now was how upset he was about.\n\nI guess Donald Trump doesn't listen to BB all the time, does he? Yeah. I guess he's finding out they respect him about as much as they respect a Palestinian. Well, that's called world leaders. Help. World leaders are interested in their own nation. That's right. They fuck you over. Good important lesson there, everyone. What does Israel care about? Israel. Every country, every country then defends its national interest. I mean, that's not unusual for Israel or any other country. But I think to understand... we're supposed to pretend that, hey, whatever Israel needs, we're here to serve their interest. If those people exist, they're unamerican. If people put Israel's interest, we fight terrorism together. Well, we do. Well, we, we generate terrorism together. What are you talking about? But that doesn't mean you put Israel's interest above America's. If you do, you're unamerican. You know how many American lives these Israeli intelligence community has saved? Um, and ask, ask people in the FBI and CIA who were counterterrorism, how many American lives the Israelis have saved because of their intelligence capabilities. How about when enough Bennett... well, again, bomb that shelter full of women and children and caused the September 11th attack. That's what happened. In fact, I don't know if you know the story, but you could Google this. You like googling things. It's on Google books. You can read Perfect Soldiers by Terry McDermott, or you could read The Looming Tower by Lawrence Wright, where both of them explained how when Shimon Perez launched Operation Grapes of Wrath, that Ramsay bin Ali and Muhammad Ata filled out their last will and testament, which was like symbolically joining the army to fight against the infidels, etc., etc. And when Bin Laden put out his first declaration of war a couple of months later, it began with a whole rant about the 106 women and children that Naftali Bennett had killed with an artillery strike in a UN shelter in, in, um, in Kana in 1996. And, and he said, \"We'll never forget the severed arms and heads and legs of the little babies, etc.\" And it was then that Muhammad Ata and Ramsay bin Alshe decided that they would join al-Qaeda and that they, these Egyptian engineering students studying in Hamburg, Germany, would volunteer for this Saudi chic to kill 3,000 Americans to get revenge for what Israel was doing to helpless women and children in Lebanon. As well as, of course... of course ignores the history of al-Qaeda, which for years before that was the United States operations against the United States, but executing them. You guys love pulling each other into history. They went, they went out with al-Qaeda. Just one second. America's problems with al-Qaeda is Israel. America and Israel are terrorist, terrorist states. They were America's mercenaries that we used in Afghanistan, in Bosnia, and Chechnya. When they turned against, I mean, America, they turned against us. Anyone could read Michael's book, the former chief of the CIA, Bin Laden, Imperial Hubris, and it's about how the number one reason they attacked us was American bases on Saudi soil to bomb Iraq as part of Israel's dual containment policy. And the second reason was American support for Israel in their merciless persecution of the Palestinians and the Lebanese. That's the most articulate justification I've ever heard for al-Qaeda in my life. But let's... it's not a justification. I'm not saying that makes what they did right. I'm saying that was how Bin Laden recruited his foot soldiers to attack this country was by citing American foreign policies that were directly to the detriment of the people of the Middle East and specifically our support for Israel. And I've never heard a pro, in fact, I take that back. There's one guy, a liberal from The Nation magazine named Eric Alterman is the only pro-Israel guy I've ever heard say, \"Well, that may be true, but I still say we got to support Israel anyway.\" The others, they'll just pretend that Terry McDermott never wrote that book, that Lawrence Wright never wrote that book, that Muhammad Ata had no motive to turn on the United States except for Muhammad made him do it. When in fact what it was is it was the ultraviolence of Shimon Perez and artillery officer Naftali Bennett slaughtering women and children that turned America's mercenaries... America backed the Arab Afghan army in Afghanistan, in Bosnia, in Kosovo, and in Cheschna, as I demonstrate in my book, and yet, as he correctly says, they turned on us all through the 1990s. Bill Clinton was still backing them anyway after they were attacking us and including at Cobar Towers, and they were doing that is this was a bin Laden plot, not Hezbollah, not the Shiites. This was the Bin Laden getting revenge against us for support for Israel and being too close to their local dictators that they wanted to overthrow, namely the king of Saudi and the El Presidente of Egypt. That is the cause of the September 11th attack against the United States. Not the Taliban hate freedom, but the bin Laden hate American support for Israel and America adopting policies, Israeli-centric policies like Martin Indict's uh dual containment policy in 193.\n\nI think al-Qaeda hates America, Scott, I think. Why? You know what? I'll tell you what, Ali Sufan, you know, Ali Sufan, the former FBI agent, counterterrorism agent, he wrote in his book, The Black Banners, that the Bin Laden said to Bin Laden, \"We don't understand why you're so angry at America. They've been so good to us in Afghanistan, in Bosnia, in Kosovo, and now here in Chechnya. Why do you want to attack them?\" Said, \"I have a larger agenda that you don't understand.\"\n\nThe disagreement between you is clear. I've talked to Nam Chsky twice. Scott, you focus on the criticism. Interview Michael Shyer. Well, although he's gone pretty crazy lately. I don't know, maybe not. Anyway, we're going into history. We're learning a lot. The perspectives differ strongly. Uh, can we look into the, maybe a ridiculous question, but a nuclear proliferation? You already started to speak to both of you. Uh, if you look like 10, 20 years out now, does, does the U.S. attacking Iran, does that send a message... even to NBS, to other Middle Eastern nations that they need to start thinking about a nuclear weapon program, specifically, like, do you think just in a numbers way, does the number of nukes in the world go up in 10, 20, 30 years?\n\nSo, look, I, I think, uh, it's a great question. Will there be more nuclear weapons powers in the future or less as a result of this decision by President Trump? So, I actually think there'll be less, um, and I'll tell you, uh, it's succinently as I can, and that is that it's been very clear from the Saudis, from the Turks, um, certainly from the, um, even the Algerians and others that if Iran gets a nuclear weapon, they too want a nuclear weapon. In fact, the Saudis have gone even further and said if, if Iran is allowed to retain the key enrichment capability that they have under JCPOA, that we want that too. If there's an Iran standard, we want the Iran standard. We don't want the gold standard. In fact, that's been the subject of intensive negotiations between the United States and Saudi Arabia for the past couple years, both under Biden and Trump as part of the U.S.-Saudi uh agreement, defense agreement and economic agreement that that has been underway. It is, it's very clear that there's going to be a proliferation cascade in the Middle East if the Iranians get a nuclear weapon and certainly if they're allowed to retain this enrichment capability. I also worry about, we haven't even talked about at all this conversation. I mean, the most important area in the world, the United States is not the Middle East, it's China and the Indopacific. And I worry that the South Koreans, the Taiwanese, and the Japanese will say, \"You know what? We don't trust any U.S. commitments to stop nuclear weapons. You failed on Iran. We don't trust you. We don't trust your nuclear umbrella. We too want nuclear weapons in order to guard our security against China.\" And so what you would see, I, I hope it doesn't happen, but I worry about is this kind of proliferation cascade in the Middle East and in the Indo Pacific, two of the most important areas for American national security, which is why I think it's very important that that be that Iran's be stopped. Now whether this attack is succeeds in stopping Iran's nuclear weapon or accelerates it, we, we disagree, but I think neither of us know yet. Hard to predict. But what I think is absolutely certain is that if Iran develops that nuclear weapon and is allowed to retain the key capabilities to do so, you're going to see five, six countries in the Middle East, at least three, four countries in the Indo Pacific asking for the same capability. And then you're going to have a club of nuclear weapons powers uh that will have an additional five, six, seven over the next 10 to 20 years.\n\nWhat if they don't? What if they're prevented? Doesn't that still send the same message to everybody that they should build? Oh, I think it sends the opposite message, Lex. I think if they see what has happened and that it's and that it's successful and it stopped Iran from developing nuclear weapons and in addition, Trump was able to negotiate an agreement for zero enrichment and full dismantlement. And the message to all these other countries is number one, you don't need it. And number two, if you try to get it, then the United States is going to use American power. Now, I'm not suggesting the United States is going to start bombing the Saudis or the Turks or the Amiradis. Clearly, not the Japanese. I mean, these are many of them are allies. But I think the United States retains many tools, counterpril tools to prevent these countries from developing nuclear weapons, including, you know, sanctions and export controls and many of the things. And plus, I think those countries, you know, understand that in the Middle East, despite Scott's focus on Israel, you know, when you talk to Arab leaders, their biggest concern is the threat from Iran. It's not the threat from Israel. They're not concerned with the threat from Israel. That's why you had the Abraham Accords. It, you know, this is why the UAE and Bahrain and Morocco entered into this peace agreement with Israel. The Saudis will one day, and they'll bring many other Arab and Muslim countries in it. They don't say Israel is a threat. They see Iran as a threat. And so if you counter that threat, you eliminate Iran's nuclear weapons proliferation and expansion. Those countries now...\n\n\nLonger.\nHave to build nuclear weapons capabilities to counter the Iranians.\nNow, we've also restored our credibility.\nWe don't bluff.\nWe said Iran doesn't develop nuclear weapons.\nThey won't.\nAnd now it's the Japanese who have, as Scott rightly pointed out, they do have reprocessing and plutonium capabilities.\nUm, the Taiwanese who used to have a military nuclear weapons program and gave it up.\nAnd the South Koreans who agreed to our gold standard of zero enrichment, zero reprocessing, those three countries can now say, \"Okay, we rely on the United States on your word, on your power, and on your ability to actually turn words into action.\nWe don't need nuclear weapons.\nSo I say if successful, big if, big if, if successful, then it's going to be a significant um guard against the potential of greater nuclear proliferation and we will have less nuclear powers, nuclear weapons powers than uh than we otherwise would have.\nMy favorite thing is when you guys point out when you agree with the other person.\nAnyway, uh Scott, what do you think?\nWhat what do you think everything that's just happened over the past two weeks does to nuclear proliferation over the next 5, 10, 20 years?\nWell, I mean, I really don't know for sure, but I would think that um the uh there's a very great danger that it's going to reinforce the lessons of North Korea, Iraq, and Libya, which is you better get a nuke to keep America out and you better hurry before it's too late.\nNow, for the Saudis, they're not going to do that cuz they're obviously a very close American client state.\nSo, it's a different dynamic there.\nBut, you know, for any country that has trouble with the U.S. or is worried about the future of their ability to maintain their national sovereignty, obviously getting their hands on an A-bomb as quickly as possible is uh has been, you know, reincentivized to a great degree.\nAlso, I'm really worried about the future of the non-proliferation treaty with the nuclear weapons states promise to respect the right of non-nuclear weapons states to civilian nuclear energy and where here you have a non-PT signatory nuclear weapons state Israel launch an aggressive war against an NPT signatory that is was not attacking them and was not making nuclear weapons and with the assistance of the world empire the United States.\nAnother nuclear weapons state signatory to the NPT.\nAnd I don't really take this that seriously, but it's worth at least listening to is uh Madv, the uh once and probably future president of Russia.\nHe said, \"Oh yeah, well maybe we'll just give him a nuke or kind of implied maybe get Pakistan too.\"\nNow, for people familiar with like Key and Peele, Madv is sort of angry Obama, right, for Putin.\nYou know that skit where it's like Obama talks all calm and translator.\nPeele goes off like an angry black guy kind of character, right?\nHe's been going nuts on X.\nYeah.\nVev, he he goes way out, you know, above and beyond.\nBut I think he's probably acting on instructions to talk that way.\nAnd it is a real risk that the MPT could just fall apart when it becomes when it's treated uh so callously by the United States who invented it and insisted that the rest of the world adopt the thing to such a great degree.\nTrump did say don't use the nword.\nHe he talked down to midv around the end the nuclear word.\nYeah.\nWell and and I appreciate that.\nGood.\nHe's right.\nHe's right in that not Pakistanis could give a nuke to Iran who are their friends.\nI think not the tightest of allies.\nI'm not saying I predict that, but there's a danger of that.\nUm, now when it comes to, you know, Eastern Asia, obviously there's a concern about a Chinese threat to Taiwan, but nobody thinks China's coming for South Korea or Japan.\nThe the question of Taiwan is one that's very different because, as the American president agreed with Ma Tong 50 years ago, Taiwan is part of China and eventually will be reunited, although we hope that's not by force.\nSince then, they have essentially abandoned Marxism, although it's still a one-party authoritarian state, but they've essentially abandoned Marxism, adopted markets, at least to the degree that they've been able to afford to now build up a a giant naval force that is capable of retaking Taiwan.\nAnd so I think the way to prevent that is not from making a bunch of threats and setting examples in other places about how tough we are, but to negotiate with the Chinese and the Taiwanese and figure out a way to reunite the two in a peaceful way in order to prevent that war from breaking out.\nBecause in fact, we don't really have the naval and air capability to defend Taiwan.\nWe could lose a lot of guys trying and probably kill a lot of Chinese trying, but in the end, they'd probably take Taiwan anyway, and we'd have lost a bunch of ships and and planes for nothing.\nSo, we can negotiate an end to that.\nAnd then even if America just withdrew from the region, we could still negotiate long-term agreements between China, Japan, South Korea, and whoever, there's no reason to think that everyone would make a mad scramble to a bomb to protect them uh if the moment they are out from under America's nuclear umbrella and so forth.\nAnd the fact of the matter is that um you know the greatest threat to the status quo as far as the nuclear powers go probably is what just happened.\nAmerica and Israel launching this war against the non-nuclear weapons state as a member in good standing of this treaty throws the the whole as they call it the liberal rules-based world order into question.\nI mean, if these rules repeatedly always apply to everyone else, but very often not to us, then are they really the law or this is just the will of men in Washington DC?\nAnd how long do we expect the rest of the world to go ahead and abide by that?\nIf you know, a deal is a deal until we decide, as Bill Clinton said, to wake up one morning and decide that we don't like it anymore and and change it.\nThat was a phrase from the founding act of '97.\nHuh?\nMaybe we'll wake up one morning and decide that we want to do something else entirely.\nIs that your Bill Clinton impression?\nNo, I'll spare you.\nOkay, that was pretty good.\nAfter the show when we're not recording, I'll show.\nCan I respond to a couple things here just really quickly?\nI'll try to do it quickly.\nUm, first of all, you know, the notion that Iran is in full compliance with the NPT um is is just not the case.\nThe International Atomic Energy Agency has made it clear in report after report after report that Iran is in violation of its obligations under the um protocols of the IAEA under the request that the IAEA have made and under the NPT.\nSo they are a serial violator of the NPT unlike all these other countries we've been talking about that are our allies.\nSecond is this this quote um Iran is not attacking Israel.\nThat's quite an amazing quote um which kind of ignores I think uh 50, 60 years of Iranian attacks against Israel including um suicide bombings and missiles and drones and October 7th and it it's indisputable that Iran has been attacking Israel and they've been they've been doing it for many years through their terror proxies that they fund and finance and and weaponize and since uh October 7th, they directly struck Israel with hundreds of ballistic missiles in April and October of last year.\nSo this notion that before 12 days ago, Iranians were just playing nice with the Israelis and the Israelis just came out out of the blue.\nWell, you said quote unquote Iran is not is not attacking Israel.\nSo I mean it's just not true.\nYeah.\nThey were not in a state of war until Israel launched a state of war.\nThat's the fact that you go oh well they backed a group that did a thing.\nYeah.\nOkay.\nThat kill thousands and of Israelis, ma thousands of Israelis, but that was not ordered in Tehran.\nThe Wall Street Journal says that U.S. intelligence does not believe that Tehran ordered that attack.\nThey found out about Journal says and what the U.S. intelligence says, and we can dispute whether they directed it on October 7th.\nEverybody knows indisputably that Iran financed Hamas, provided Hamas weapons.\nJust well, just a second.\nProvided Hamas with weapons that the IRGC and the Quds Force were training Hamas.\nHisbala backed by Iran was training Hamas.\nThere were three meetings before October 7th, one in Beirut, one in Damascus, and one in Tehran where the IRGC, Hezbollah, Hamas, and Palestinian Islamic Jihad were together.\nThere was a meeting in Tehran that was attended by Khamenei, the Supreme Leader.\nNow, at those three meetings right before October 7th, you know, maybe they're discussing the weather, maybe they were discussing Persian poetry, I don't know, but it is hard to believe they weren't discussing something.\nAnd the fact that they had armed Hamas, financed Hamas, and weaponized Hamas suggests to me that there is pretty overwhelming evidence that Iran has been at war with Israel for decades.\nCritics of Israel will say that Benjamin Netanyahu has also been indirectly financing Hamas by allowing the fund the funds going America backs Israel, so anything Israel does is America's responsibility, too, under that same logic.\nRight.\nI think you started to make a a point disagreeing with Scott about that.\nThey're not a good member of the NPT.\nThat's all tiny technical violations.\nNone of that has anything to do with weaponization.\nIt's always, oh yeah, how do you explain this isotope?\nAnd they go, well, it must have came with the Pakistani junk that we bought from A.Q. Khan.\nAnd then later that's verified.\nAnd they go, yeah, well, we want to inspect this.\nLet us.\nAnd they go, no.\nOh, and then they do a year later and then they find nothing there.\nYeah, that's just not the case.\nEntire history of Iran of the IAEA's objections to Iran.\nSo your listeners, I know they're not going to do it because it's a lot of technical, but just go out, go out and read IAEA reports dating back at least 20 years and you'll see the IAEA meticulously, methodically, dispassionately outlining all of the violations that Iran has embarked on of the NPT.\nVirtually all those are resolved later.\nThey won't answer this and then later they do.\nThey won't answer that and then later they do.\nAnd many open files are still there.\nI mean, just again like I just I just want your viewers to walk away from this conversation thing, okay, that's interesting.\nI I I didn't know that.\nAnd that I'm gonna go fact check Mark and fact check Scott and just kind of see what this is all about, right?\nBecause otherwise it's just he says, she says, or he says, he says.\nUm the fact of the matter is is that Iran has been in violations of its obligations under the NPT under the additional protocol.\nIt never it never uh it never ratified under its safeguards obligations under the NPT.\nIt suggests a pattern of nuclear macity.\nThey abided by the additional protocol without having ratified it.\nThey abided about it for three years and did not proceed with any enrichment at all as long as they were dealing in good faith with the EU until W. Bush ruined those negotiations and closed them down.\nOnly then did they began to install the centrifuges at Natanz.\nIt's always the American screw things up.\nComplain they didn't ratify the thing but they abided by it for years.\nSo that's an interesting they were in violation of it.\nBut I I think a more pragmatic and important disagreement that we already spoke to is how do we decrease the incentive for Iran to build nuclear programs not just in the next couple years but in the next 10, 20 years.\nWhat that's you're mocking that there's a lot of people that will there's neocons that say basically invade everything let's make money off of war but there's people that will say that you know operation midnight hammer is actually a focused hard demonstration of strength a piece of strength that is an effective way to do geopolitics I mean there's cases to be made for all of it if we're really lucky.\nYeah so it's a big risk is your case.\nSo here's some practical recommendations that I think the United States should follow.\nI think the first is, you know, get the Iranians back to Oman, negotiate with them, and do a deal.\nAgain, the deal has to be no enrichment, full dismantlement.\nI I I think for the reasons we talked about today, Scott and I passionately disagree, but that's fine.\nWe This is This is a reasonable debate.\nNeither of us is crazy.\nNeither of us is rational.\nIt is what would it take to get a deal with Iran?\nI say I say this is the deal.\nThis has to be our red line.\nScott disagrees.\nThat's fine.\nBut we got to get a deal.\nIn that deal, we got to provide them financial incentives, right?\nWe're going to have to lift a certain number of sanctions because they're going to have to get something in return.\nOkay, we can argue about exactly how much, but I think our opening negotiating position is no sanctions relief and then we'll get negotiated down from that.\nRight?\nI mean, like I think a lot of this is about how do you position yourself for a negotiation?\nHow do you how do you come in with leverage and then how do you find areas of compromise where you you satisfy your objectives?\nOne is Oman.\nTwo is the credible threat of military force needs to remain right needs to understand that the United States of America and Israel will use military force to stop him from developing nuclear weapons.\nIf he didn't believe that before 12 days ago, he now believes that and I think that's the credibility of that military force has to be maintained in order to ensure that he does not break out or sneak out to a nuclear weapon.\nI I think that's absolutely critical.\nThird is I think we have to reach agreements with all the other countries in the Middle East to say, \"Hey, listen.\nWe're demanding zero enrichment and full dismantlement from the Iranians.\nYou don't get enrichment and you don't get a nuclear program that is capable of developing nuclear weapons.\nOur gold standard is the American standard.\nCivilian nuclear energy like 23 countries, no enrichment and reprocess.\nWe should be consistent.\nWe should be consistent not just with American allies but also very clear with American enemies.\nI think that's the third important thing we do.\nFourth is I think it's really important that we find some kind of accommodation between the Israelis and the Palestinians.\nWe can go down many rabbit holes on that, but I think that lays the predicate for a Saudi-Israeli normalization deal that then brings in multiple Arab countries and Muslim countries.\nAnd finally is we talked about the Abraham Accords.\nI I think we need to start thinking\n\n\nAbout.\nWhat did the Cyrus Accords look like, right?\nCyrus was the great Persian king, right?\nWho, by the way, brought the, you know, the Jews back from, um, from, uh, the diaspora to Jerusalem, and Cyrus Accords would be, let's find an agreement between the United States and Israel and Iran.\nThat would be a remarkable transformation in the region if we could actually do that.\nSo imagine a Middle East, and again, I know this sounds fanciful, but I think this is what Trump has in mind when he starts to talk about the things you're seeing in these truth posts, is actually a Middle East that can be fundamentally transformed where we actually do bring peace between Israel, Iran, Saudi Arabia, and the rest of these countries.\nI, by the way, completely agree with you on Syria.\nThe idea that we are trusting a former al-Qaeda ISIS jihadist, uh, to rule Syria, I think is a big bet President Trump has made.\nHe's made it on the advice of NBS.\nWe'll see how that transforms, uh, or transpires and see if Syria is transformed.\nBut the notion that somehow we should just be rolling the dice, lifting all the sanctions, and taking this former al-Qaeda jihadist at his word is, uh, a big bet.\nIf we got the bet right, that is actually a remarkable occurrence because now all of a sudden Syria and Lebanon are brought into this Abraham Accord, Cyrus Accords structure, and then we actually have what I think all three of us want is peace in the Middle East, stability in the Middle East.\nI don't think we need democracy in the Middle East.\nI think if the Middle East looked like the UAE, that'd be a pretty good Middle East.\nI think we'd all be pretty comfortable with that if that kind of stability and prosperity.\nAnd ultimately, you could put these countries on a pathway to greater democracy the way that we did during the Cold War where countries like Taiwan and South Korea that were military dictatorships ended up becoming pro-western democracy.\nSo, that's kind of stepping back maybe a little bit polyianish.\nUm, but I think we should also always keep in mind what a potential vision for peace could look like.\n\nSo, Scott, as many people know here in Austin, Texas, you're the director of the Libertarian Institute.\nUm, let's zoom out a bit.\nWhat are the key pillars of libertarianism and how that informs how you see the world?\nWell, the very basis of libertarianism is the non-aggression principle, but, uh, which essentially is the same thing as our social rules for dealing with each other in private life.\nNo force, no theft, no fraud, and keep your hands to yourself.\nAnd we apply that same moral law to government.\nAnd so, you know, some libertarians are anarcho-capitalists, some are, uh, so-called minarchists, meaning we want the absolute minimum amount of government, a night watchman type state.\nUh, in other words, just enough to enforce contracts and protect property rights and allow freedom in a free market to work.\nThere's also, of course, natural rights theory, Austrian school economics, and a lot of revisionist history.\nUm, and, uh, and it something very, uh, key to, uh, libertarian theory was is expressed by Muran Rothbart was that war is the key to the whole libertarian business because especially in the United States of America as long as we maintain a world empire makes it impossible for us to have a limited and decentralized government here at home as our constitution describes.\nAnd so I was going to crack a joke, but neither of you have called me an isolationist yet, but I was going to joke.\nYes.\nAs, as Thomas Jefferson wrote in the Declaration of Isolation, um, that the same guy, the principal author of the Declaration of isolation, he said in his first inaugural address, &quot;We seek peace, commerce, and honest friendship with all nations and entangling alliances with none.&quot;\nThat's the true libertarian philosophy.\nThink Dr. Ron Paul, the great congressman, uh, for many years up there.\nHe was opposed to all sanctions, all economic war on the rest of the world and the entire state of the United States as world empire.\nAnd what's strange now is that anyone who wants just peace as the standard is considered an isolationist.\nAnd people who are for world empire and a permanent state of conflict with the rest of the world, economic war, coups and regime changes and even invasions, those are considered normal people.\nIt's almost like people who want peace should be called cis foreign policy because now we gota, we have to come up with a funny word to describe a normal state of being when no one calls Mexico an isolationist state.\nIt's cuz they mind their own business.\nAnd is there any faction anywhere in America that calls themselves isolationist?\nEven the paleoconservatives who favor much more like trade protectionism and that kind of thing than libertarians, they don't call themselves isolationists.\nThey still want to have an open relationship with the world to some degree when isolation means like the hermit kingdom of North Korea or some crazy thing like that.\nNo one wants that for the United States of America.\nWhat we want is independence, non-interventionism and peace.\n\nSo to you isolationism is a kind of dirty word term invented by interventionists and internationalists to attack anyone who didn't want to go along with their agenda.\nThe term itself is used essentially as a smear against anyone who doesn't want to go to war.\n\nSo can you actually just deeper describe what non-interventionism means?\nSo how much sort of display of military strength should be there do you think?\nDr. Paul said we could defend this country with a couple of good submarines, which by the way, for people who don't know, one American Trident sub could essentially kill every city and military base in Russia.\nJust one.\nSo he's absolutely right about that.\nCouple of good submarines are enough to defend our coast and deter anyone from messing with the United States of America.\nAnd then I admit I'm a little bit idealistic about this that I think of that old William Jennings Brian speech, behold a republic where unlike the empires of Europe burdened under the weight of militarism, here we have a free country and where you know what we could do?\nWe could be the host of peace conferences everywhere.\nThere are frozen conflicts in the conflicts in the Donbass, in Kinenrad, in Transnistria, in Taiwan, in Korea.\nUm, virtually all the borders of Africa and Eurasia were drawn by European powers to either divide and conquer their enemies or artificially group their enemies together in order to keep them internally divided and conquered in those ways.\nThere are great many borders in the world that are in contention and that people might even want to fight about.\nAnd I think that America could play a wonderful role in helping to negotiate and resolve those types of conflicts without resorting to force or or even making any promises on the part of the US government like we'll pay Egypt to pretend to be nice to Israel or anything like that.\nBut just find ways to host conferences and and find resolutions to these problems.\nAnd I think quite sincerely that Donald Trump right now could get on a plane to Tyrron.\nHe could then go to Moscow to Beijing and Pyongyang and he could come home and be Trump the Great.\nWe in fact don't have to have the especially the American hyper power as the French called it the world empire.\nWe have everything to give and nothing to lose to go ahead.\nAnd Donald Trump even talked like this.\nYou might remember when he first was sworn in this time.\nHe said, &quot;You know what?\nInstead of pivoting from terrorism to great power competition with Russia and China.\nI don't want to do that.\nI just want to get along with both of them.\nLet's just move on and have the rest of the century be peace and prosperity and not fighting at all.\nWhy should we have to pivot to China?\nLet's just pivot to capitalism and trade and freedom and peace.\nThat's America first.\nYeah, I've, uh, I've criticized Trump a lot, but I think maybe he's just rhetoric, but I think he talks about peace a lot.\nEven just recently the, the number of times the word peace is mentioned and with seriousness, not, you get like a genuine desire for peace from him and that's just beautiful to see for the leader of of this country.\n\nAnd look, man, there used to be a time when a third of the planet was dominated by the communists, right?\nSo like, I'm not going to sit here and argue the first cold war with you, my book's about the second one and I'm not as good on the first, but since the end of the first cold war, we have let the neoconservative policy of the defense planning guidance of 92 and rebuilding America's defenses and the rest of this American, uh, dominance centered policy, uh, control our entire direction in the world.\nIt's led to the War on Terror in the Middle East.\nSeven countries we've attacked.\nIt's led to the disaster in Eastern Europe and it's leading toward disaster in Eastern Asia when there's just no reason in the world that it has to be this way with the commies dead and gone.\nAnd again, I to stipulate here, the Chinese flag is still red.\nIt's still a one-party dictatorship, but they have abandoned Marxism.\nI mean, people were starving to death by the tens of millions there.\nIt's a huge, it's a probably the greatest improvement in the condition of mankind anywhere ever in the shortest amount of time when Deng Xiaoping and the right-wing of the Communist Party took over in that country.\n\nJust one more thing.\nYou mentioned the two submarines.\nWhat's the role of nuclear weapons?\nWell, I would like for America to have an extremely minimal nuclear deterrent and work toward a world free of nuclear weapons.\nAnd I know that that sounds utopian.\nHowever, I would remind your audience that Ronald Reagan and Mikall Gorbachev came within a hair of achieving a deal just like that at Reichovic, Iceland in 1986.\nAnd they were both of them dead serious about it, complete and total nuclear disarmament.\nAnd then Reagan was essentially bullied by Richard Pearl and others on his staff saying, &quot;You promised the American people that you would build them a defensive anti-missile system, the Star Wars system,&quot; which was total pie in the sky technological fantasy of the 1980s.\nAnd if you're getting rid of all the ICBMs, then why the hell do you need a missile shield anyway?\nIt is the world's probably greatest tragedy that ever took place that Ronald Reagan walked away from those negotiations.\nThey literally were within a hair.\nAnd it wasn't magic and there was no trust in evil bad guys.\nThis is by the way two years before the wall came down.\nThis is when everybody still thought the USSR was going to last.\nAnd Reagan had the plan was that America and the Soviet Union would dismantle our nuclear weapons until we were right around with parody with the other nuclear weapon states who all have right around two or 300 nukes.\nFrance, Britain at that time, Israel and China.\nIndia and Pakistan came later.\nSouth Africa only had a few then that but gave up whatever they had.\nAnd the idea was we would get down to two or 300 and then America and the Soviet Union both together would lean hard on Britain, France, and China.\nLet's all get down to 100.\nLet's all see if we can get down to 50, etc.\nLike that in stages.\nAgain, Ronald Reagan we're talking about here.\nTrust but verify means do not trust at all.\nIt means be polite while you verify.\nAnd in fact, America did help dismantle upwards of 60s something thousand Soviet nuclear missiles in the after the end of the cold war.\nAnd so it is possible to live in a world where at the very least we have a situation where the major powers have a few nukes and potentially can even come to an arrangement to get rid of the rest.\nWe should also just say one more thing, not to be agist, but most of the major leaders with nukes and those with power in the world are in their 70s and 80s.\nI don't know if that contributes to it, but they kind of are grounded at a different time that maybe I have a hope for the fresher, younger leaders to have a more optimistic view towards peace and to be able to reach towards peace.\nAnd underlying so much of what we're talking about here is all this enmity, right?\nBut if America could just work, remember when China cut that pseudo sort of peace deal between Saudi and Iran a couple years ago or last year was it?\nWell, we could try to double up on that.\nWe should, we could try to come up with ways for Saudi and Iran to exchange as much as possible.\nYou know, um, I know you don't like all the going back too far in history, but it's important.\nIt's in my book that in 1993 Zabign Brazinski, who the revolution had happened on his watch.\nOperation Eagleclaw, the disaster of the rescue mission in 79 after the hostage crisis and everything.\nAll that egg was on ZB space.\nBut in 93 he said we should normalize relations.\nWe should build an oil pipeline across Iran so they can make money.\nWe can make money and we can start to normalize.\nAnd Ronald Reagan's Secretary of State, Alexander Heg, who had been Kissinger's right-hand man, agreed.\nThey both were trying to push that.\nBut the Clinton administration went ahead with Martin Indic, who had been Yeetsak Shamir's man, and inaugurated the dual containment policy instead because the Israelis were concerned that America had just beaten up on Iraq so bad in Iraq War I now wasn't powerful enough to balance against Iran.\nSo, America had to stay in Saudi to balance against them both.\nAnd that was the origin of the dual containment policy.\nIt was Martin Indic, who had been Yets Shamir's man who pushed it on Clinton.\nAnd this was not the Israelis.\nIt was the Kuwaitis who lied that there was a truck bomb attempt assassination against HW Bush, which was a total hoax.\nIt was debunked by Seymour Hirs by the end of the year.\nIt was just a whiskey smuggling ring.\nAnd it was the same guy whose daughter had claimed to have seen the Iraqi soldiers throw the babies out of the incubators.\nHe was the guy who two years later, uh, made up this hoax about Saddam Hussein trying to murder Bush Senior.\nBut when he did, that was when Bill Clinton finally gave in and adopted the dual containment policy because he had been interested in potentially reaching out to Saddam and the Ayatollah both at that time.\nBut instead of having normalization with both, we had to have permanent cold war through the end of the century with both.\nAnd my argument is simply it just didn't have to be that way.\nIs the same thing with Russia.\nLook at, you know, how determined the Democrats especially are to have this conflict with Russia where to Donald Trump, nah, not at all.\nWe could get along with them.\nAnd so it's perfectly within reason.\nIf Zabnzinski says we can talk with Iran and get along with Iran and Donald Trump says we can get along with Russia, then the same thing for North Korea.\nThe same thing for China.\nAnd then and then who do we have left to fight?\nHzbala is nothing without Iran.\n\n\nWe'll just have Scott and I fighting.\nThat'll be the last remaining fight.\nThat's the fun kind of fight.\nThat'll be fun.\nFight peaceful.\nYou're the CEO of FDD, the Foundation for Defense of Democracies.\nIt's a DC-based organization that focuses on national security and foreign policy.\nWhat has been your approach to solving some of these problems of the world?\nSo, look, I I love the vision that Scott painted.\nUm, and I I agree with some of the libertarian instincts that he has, but my view is that America is the indispensable power.\nUm, Scott mentioned earlier in the conversation about the rules-based order that is so important and the NPT and all these rules-based agreements that are important to maintain.\nWell, the rules-based order has been maintained by the United States since World War II, right?\nThere is no American prosperity to the degree that we have.\nThere's no recovery of Europe.\nThere's no recovery of Asia after the devastation of World War II without American power and the rules-based order that America has led and backstopped.\nAnd I think America first is about American power and deterrence.\nI think if you want to avoid war, I think you cannot just believe in some fantasy where all the world's leaders are going to get together in some place and are just going to agree to disarm all their nuclear weapons and we'll disarm our entire military and we'll have one submarine off our coast and some all of that is going to lead to peace.\nI mean, I think what has led to peace in the past has been the American forward deterrence of our military and a belief that our enemies think we will credibly use it.\nI think if they believe we'll credibly use it, then it's less likely they will challenge us.\nAnd if they less likely to challenge us and challenge our allies, there's less likely to be war.\nSo for me, deterrence leads to peace and any kind of unilateral disarmament, any kind of I think sort of fanciful notion that somehow they're our enemies are going to respect the non-aggression principle that is the core fundamental underpinnings of libertarianism, which I think in in in a personal relationship, I think is very important.\nBut remember, these are aggressors.\nThey don't respect the non-aggression principle.\nI think we can spend a lot of time, we did over how many hours now has it been talking about the fact that in Scott's view of the world, it's America that provokes.\nIt's America that provokes.\nAnd then it's not America provoking, it's Israel provoking.\nAnd oh, by the way, America provokes because we're being seduced or paid or browbeaten by those those Israelis and you know, those Jews in America.\nI mean I think that whole notion that somehow we are we are the provocative force in global politics I think is is wrong.\nI think the fact of the matter is we make mistakes.\nWe are an imperfect nation.\nWe have made some serious sometimes catastrophic mistakes but the there is a bad world out there.\nThere are evil men who want to do us harm and we have to prevent away prevent them from doing us harm.\nTo do that, we need an American military that is serious and well supported.\nWe don't need a military-industrial complex that ultimately is going to pull us into wars.\nWe need thoughtful leaders like President Trump who will resist that and will say at the end of the day, I will use force when it is selective, narrow, overwhelming, and deadly.\nAnd that was Trump's operation just a few days ago.\nHe he went after three key facilities that were being used to develop the capability for nuclear weapons.\nNuclear weapons are the greatest danger to humanity.\nI totally agree with Scott.\nLike I think a world without nuclear weapons, the kind of world that that Reagan envisioned and others have envisioned since is really the only way we can eliminate the most devastating weapons that could end humankind.\nBut we have to make sure that those weapons don't end up in the hands of regimes that seek to do us harm and that have have done us harm over over many many decades.\nSo yeah, I mean deterrence, peace through strength, rules-based order, the Foundation for Defense of Democracies is not the foundation for promotion of democracy.\nWe don't believe in this important concept that we have to promote democracy around the world.\nI'll speak for myself because we have many people in my think tank.\nWe're 105 people.\nWe have different views.\nI don't personally believe that it is the role of the United States to bring democracy to the Middle East or democracy around the world.\nI think to the extent we've tried, we failed.\nI'm not sure the Middle East is ready for democracy.\nNow, Iran is interesting because it's not an Arab country, right?\nIt is a it is a different country altogether.\nCulturally, it's a very sophisticated country.\nIt has a long history.\nIt actually has a history where it has had democracy in the past.\nIt is a country that I think could have incredible potential under the right leadership and under the right circumstances.\nI don't know if the right circumstances are a constitutional monarchy with Reza Palavi as the as the as the crown prince or the sha.\nI don't know whether it's a secular democracy or not.\nLet let let Iranians make that decision.\nHave I been pronouncing it wrong this whole time?\nResp.\nYou know the guy?\nI met him.\nYeah.\nYeah.\nPalavi.\nPali.\nWhat were you saying?\nI thought it was Palavi.\nOh wow.\nNo, it's okay.\nOkay.\nIt's okay.\nThe only thing you've ever gotten wrong is you're pronouncing a problem.\nThat's not bad.\nI've been pronouncing so many things correctly.\nI think people will give you a pass.\nCan I ask you though?\nLike I I mean all this militarization has led to a state of permanent war.\nWe've been bombing Iraq for 34 years.\nWe uh launched we put uh a war against the Taliban who didn't attack us instead of al-Qaeda who did.\nfought for 20 years and the Taliban won anyway.\nWe overthrew a launch an aggressive war against Saddam Hussein, put the Ayatollah's best friends in power.\nWe launched an aggressive war against Libya and this ridiculous hoax that Gaddafi was about to murder every last man, woman, and child in Benghazi.\nImagine Charlotte, North Carolina being wiped off the map.\nBarack Obama lied in order to start that war and completely destroyed Libya.\nIt's now three pieces in a state of semi-permanent civil war, including, and this wasn't just back then.\nThis is to this day the relegalization and reinstitutionalization of chatt slavery of subsaharan black Africans in Libya to this day as a result the our intervention this was not a direct overt war but America Israel Saudiq and Turkey all back the bin Laden in Syria completely destroyed Syria to the point where the caliphate grew up and then we had to launch Iraq war II to destroy the caliphate again and so I'm I'm not seeing the peace through strength I'm seeing permanent militarism and perman permanent war through strength.\nPoint well made.\nHe's speaking to the the double-edged sword of a strong military.\nThat what you mentioned that Trump did seems like a very difficult thing to do, which is keep it hit hard and keep it short.\nWe don't know how this ended yet, but even the beginning part is not trivial to do like just hitting one mission and vocalizing except for one post.\nuh no regime change, like really pushing peace, make a deal, ceasefire, like that's that's an uncommon way to operate.\nSo, I guess you said that we should resist the military-industrial complex.\nThat's not easy to do.\nThat that that's the double-edged sword of a strong military.\nYemen, let me say real quick, and I promise I'll say one thing and then I'll stop.\nYou made a good point.\nLet me I just I just want to add this is a really important point, okay?\nIs grassroots effort.\nThere is no Houthi lobby in America, okay?\nIt was grassroots efforts by libertarians, Quakers, and leftists to get war powers resolutions introduced in Trump's first term to stop the war in Yemen, which was launched not for Israel, for Saudi Arabia and UAE by Barack Obama in 2015.\nThat's not a first.\nThe Afghan war wasn't about Israel either.\nOkay.\nBut this Yemen war was\nI thought 911 was about Israel.\nWell, it was in great part, but the af the decision to sack Kbble and do a regime change and all that had nothing to do with the loot whatsoever other than well, we got to keep the war going long enough to go to Baghdad.\nOh, okay.\nSo, it was Israel's fault.\nI was in the middle of saying about the war in Yemen that we got the war powers resolution through twice and Trump vetoed it twice and his man Pete Navaro explained to the New York Times that this was just welfare for American industry.\nA lot of industrialists were angry about the tariffs disrupting trade with China and somehow they substituted Rathon for all American industry somehow and said industry will be happy if we funnel a lot of money to Rathon.\nThat's Pete Navaro talking to the New York Times about why they continued the war in Yemen throughout Trump's entire first term.\nHe had no interest in it at all.\nThe whole thing was it was Obama's fault.\nThe whole thing was essentially on autopilot.\nAnd what was he doing?\nflying as al-Qaeda's air force against the Houthis who originally, if you go back to January of 2015, America was passing intelligence to the Houthis to use to kill al Qaeda.\nYou know, AQAP, the guys that tried to blow up the plane over Detroit with the underpants bomb on Christmas Day 2009 that did all those horrific massacres in Europe, real ass bin Laden terrorists.\nThe Houthis were our allies against them before Barack Obama stabbed them in the back.\nAnd why did Trump keep that going when he inherited that horrific war from Barack Obama?\nWhy'd he do it?\naccording to his trade guy, so that they could keep funneling American taxed and inflated dollars into the pocketbooks of stockholders of Rathon Incorporated, right?\nMilitary industrial complex.\nThe point was made.\nYeah, maybe I could respond to that because I mean again, it's always America's fault.\nAccording to Scott,\nhe's taking jab at.\nNo, no, but Saudi and UAE asked Barack Obama for permission to start that war and for American help in prosecuting it and he said yes and then helped.\nI'm going to segue into an answer cuz I I think it deserves an answer.\nmilitary-industrial complex is a serious concern.\nUm because I think you're right, it there, you know, the bigger it gets um and the more weapons you have, you think the more the greater the temptation to use it, right?\nI think that's sort of the the argument.\nAnd then there's also self-enrichment and how much money can be made and and all of that I think is of serious concern to people.\nLook, I think Trump is somebody who it's hard pressed to say that Donald Trump um is a great advocate of the military-industrial complex or that he is he is in their pocket the same way that he's in the pocket of the Israelis and in the pocket of the Saudis and in the pocket of everybody.\nI mean, I think the one thing with Trump is that Trump has he has learned the lessons of American engagement over the past few decades.\nAnd I think Scott's done a good job of kind of laying out the mistakes that have been made even though, you know, we can discuss about causal connections and who's responsible.\nAnd, you know, I I lean on\nCan we I want to\nWell, Scott, can I finish because you know, your your causal connection is always it's America aggressing, Israel aggressing, and all these poor people responding to us.\nUm, but nonetheless, I think Trump has he's learned the lessons, but he hasn't overlearned the lessons.\nHe he's not paralyzed by Iraq or Afghanistan or the mistakes made by his predecessors.\nHe understands that at the end of the day, we need serious American power.\nWe need lethal power.\nWe need foreign deterrence.\nAnd he's been very careful and very selective about how he uses American power.\nI mean, we've talked about it throughout this whole conversation.\nTrump used American power to kill Kasumsmani, one of the world's most dangerous terrorists.\nHe killed Baghdadi, the head of ISIS, one of the world's most dangerous terrorists.\nHe he refrained from going after the Iranian takedown of our drone.\nHe refrained from when the Iranians fired on Saudi Aramco and took off 20% of our oil.\nRight.\nHe's been very very selective about the use of American power.\nHe did go after the Houthies who are Iranbacked and were using Iranian missiles to go after our ships.\nThat's not true.\nThose are North Korean missiles.\nCompletely debunked by Jane's Defense Weekly.\nNice try.\nYeah, nice try.\nUm anyway, everybody knows that the Iranians have been financing the Houthis.\nHisbal has been training the Houthis.\nAnd Iran has given capabilities to the Houthis to develop their own indigenous missile capability.\nThe fact of the matter is he he did in a way go after the Houthis much more intensively than Biden did in order to prevent them from continuing to shut down Red Sea shipping on which both America and our allies depend as a trade route.\nHe actually did it quite successfully because after a few days of pretty intensive bombing, the Houthis got the message and they cut a deal with Donald Trump.\nThey're not going to interfere with our ships anymore.\nHe cut a deal with them.\nThey kept bombing Israel, which is what got him involved in the first place, he completely backed out.\nSounds to me like they won and he backed down.\nWell, it sounds it sounds like he in terms of promoting American national security interests.\nSounds like he did he did a pretty good job of sending a message to the Houthies and the Iranians.\nDon't we mess with the United States?\nAnd that gets us to the contemporary reality.\nHe took a decision one day on one day to send our B2s and our subs in order to do severe damage to three nuclear facilities.\nIt was a one-day campaign.\nIt was selective.\nIt was narrow.\nIt was overwhelming.\nAnd I think it sends a message to Kam.\nI think it sends a message to regimes around the world, anti-American regimes around the world, that Donald Trump has not overlearned the lessons of the past 20 years, right?\nbut that in fact he is not going to dismantle the US military and dismantle our nuclear program and fly around to all these cities and call peace conferences and hope that these dictators will just sit down with America and say you know what all is forgiven the United States of America it's all your fault you did this all we we admit our responsibility and then we have we have peace and paradise on earth I think Trump is much more um pragmatic and in some respects cynical when he looks at the world and he realizes the world is a dangerous place.\nI have to be very careful about how I use American military forces.\nI am not going to send hundreds of thousands of\n\n\nPeople around the world.\nBy the way, I mean you all talk about Israel.\nI mean the Israelis are one of the best allies we could possibly have.\nThey fight and they die in their own defense.\nThey fought multiple wars against American enemies.\nThey haven't asked for American troops on the ground.\nThere no boots on the ground in Israel defending Israel.\nThe best we've given them is we've given them a THAAD system to help them shoot down ballistic missiles that have aimed at them.\nAnd our American pilots have been in the air recently with our Israeli friends shooting down ballistic missiles.\nBut the Israelis have had a warrior ethos.\nWe will fight and we will die in our own defense.\nI would just say if you're going to actually build out a model where you're going to minimize the risk to American troops, let's find more allies like that.\nRight?\nI worry about, I'm like Scott.\nI really worry about China, Taiwan.\nI really really worry about that because the Taiwanese are not capable of defending themselves without U.S. assistance and we may have to send American men and women to go defend Taiwan and we can have a whole debate about the wisdom of that.\nBut again, it would be very very helpful to have more Israels in the world, more countries that are capable of fighting against common enemies and against common threats without having to always put American boots on the ground in order to do that.\n\nSo you made a case for it's okay if you made a case for strength here.\nJust practically speaking, why do you think Trump has talked about peace a lot?\nWhy do you think he hasn't been able to uh get to a ceasefire with Ukraine and Russia, for example, if he just move away from Iran without getting into the history of the whole thing?\nLike why?\nHe's been talking peace, peace, peace, peace, peace.\nHe's been pushing it and pushing it.\nWhat can we learn about that so far?\nFailure that's also instructive for Iran.\n\nLook, I'm not a Russia expert.\nI'm not a Ukraine expert.\nI'm sitting in front of two people who know a lot more about that conflict than I do.\nI, I...\nYou are, we should say, banned by Putin.\nI am, I have been sanctioned by Russia and by Iran.\nUm, sanctioned.\nYes.\nYes.\nBanned.\nSanctioned, uh, threat.\nCongratulations.\nThank you.\nThank you.\nWell, it's it causes some difficulties.\nBut anyway, um, I think the answer to that is that for Putin, he needs to understand that like Kame, he has two options here, right?\nOption one, which President Trump has signaled over and over and over again, is come sit down and negotiate a ceasefire with the Ukrainians.\nI don't want to get into the details and the back and forth about who's responsible for the fact there's no ceasefire, Putin or Zelensky.\nI mean, that's a whole other debate, and I'm sure you guys have a lot of opinions on that.\nUm, but path one is sit down and let's negotiate a ceasefire.\nPath two is the United States will use American power in order to build our leverage so that Vladimir Putin understands that he has to do a ceasefire.\nNow, I'm not suggesting U.S. troops.\nAbsolutely not.\nRight.\nWhat I am suggesting is there's a package right now of sanctions that have 88 co-sponsors in the Senate across party lines.\nAnd I think Trump is using that and will use that as a sort of sword of Damocles hanging over Putin and the Russian economy to say, \"Look, if Vladimir, we either do a ceasefire or I'm going to have no choice but to have to start imposing much more punishing sanctions on you and on the Russian economy.\"\nSo, I think there's an economic option.\nI think there's a military option.\nI think the biggest mistake Biden made in this whole war and there's many mistakes uh in terms of signaling not having U.S. credibility, you know, Afghan debacle which signal to Putin that he could invade without any kind of American response is he kind of went in and he tied Ukraine's uh hands behind their back.\nI mean, he actually tied one hand behind their back while they were fighting with the other hand.\nAnd he refused to give him the kinds of systems that early on in the war would have allowed the Ukrainian military to be able to hit Russian forces that were mobilizing on the Russian Ukrainian border.\nAnd I think if he had done that, I think this war would have ended sooner.\nThere'd be far less casualties.\nAnd I think Putin would then understand maybe I need to strike a deal.\nI'm not a Russia expert or a Ukraine expert.\nI don't know what the deal looks like.\nYou keep the Donbass, you keep Crimea, you keep, you know, larger chunks of eastern Ukraine.\nThat's for smarter people than me on this issue to decide what the deal looks like.\nBut there's no doubt today Putin thinks that he can just keep fighting, keep killing Ukrainians, keep driving forward.\nEventually, he's going to wear down the Ukrainians through a sheer war of attrition.\nHe'll throw hundreds of thousands of Russians at this.\nHe doesn't care how many Russians are going to die.\nThat's the way the Russians and the Soviets have fought wars for many, many years.\nJust endless number of Russian bodies being thrown into the meat rider and he thinks he can continue without any consequences.\nAnd I worry that as a result of the fact that we are not showing Putin that we've got leverage, it's made war more likely.\nIt's made a war more brutal and it's going to make a war more protracted.\nBut increasing military aid to Ukraine in the case that you've described also has to be coupled with extreme pressure to make peace.\nCorrect.\nExtreme pressure to make peace, which Trump hopefully is appears to be doing now in Iran.\nI think Trump is early.\nI mean, it's interesting you said that because he's early indicators again.\nWho knows where the ceasefire goes, but I think it was important.\nIt was he he slapped Kame, but he also said to BB, \"Enough, enough.\"\nAnd it's like, \"Okay, now we're going back to Oman.\nThere's going to be a temporary ceasefire.\nNow, let's negotiate.\"\nAnd I think that's important.\nAnd I think it shows that Donald Trump is leading, not following.\nIt shows that Donald Trump is his own man, not on the payroll of the Russians or the Iranians or the Israelis or all these other crazy accusations that have been made about this guy for many, many years.\nUm, and he's going to give, you know, as they say, peace a chance.\nAnd he's going to give give a ceasefire a chance and he's going to give negotiations a chance.\nBut I'll think he's sending the message to the Iranians and he needs to send it to Putin is if you don't take me up on my offer, right?\nI've already demonstrated that I am serious and I will use American power carefully and selectively in the way that I've done in the past.\nAt the risk of doing the thing I shouldn't do.\nUh but just to test the ideas of libertarianism and uh the things we've been talking about, can we for a brief time unrelated to everything we've been talking about talk about World War II?\nWhat was the right thing to do in 1938, 1939?\nLike what would you do?\nOkay, to be clear, World War II has nothing to do with the current events.\nIn fact, many of the horrible policies of the United States, in my opinion, have to have to do with projecting World War II onto every single conflict in the world.\nOkay, agree.\nBut overarning, overarning, overarning.\nBut it is an interesting extreme case.\nJust to clarify, I'm just like philosophically talking about.\nYeah.\nAt which point do you hit do you do military intervention?\nAnd that's a nice case.\nMaybe you have a better case study, but that's such an extreme one.\nYeah.\nThat it's interesting.\nWe're talking about Germany or Japan.\nGermany said.\nYeah.\nSo, Japan attacked us and Germany declared war on us.\nTough for them.\nAnd that's what happens when you declare war on the United States, you get hit.\nBut that was idiotic on the part of Hitler to declare war on the United States.\nYou know, I never understood why he ever did that.\nThey always said it was just cuz he was crazy.\nBut what it was is he was trying to get the Japanese to invade the Soviet Union from the east and in order to divide Stalin's forces, which failed and it didn't work and it was a huge blunder from his point of view.\nI guess philosophically from an interventionalism perspective, you're saying United States should have stayed out from that war as long as possible until they're attacked.\nYes.\nI mean, and look at how powerful they ended up being and the amount of damage that they were able to inflict on the Soviets.\nBetter them than us.\nWhat do you think?\nSo, look, I...\nIs this a useful discussion?\nIt's interesting.\nI mean I think it's interesting of you know libertarianism um or or isolationism in practice.\nI mean I think the 30s are more interesting to me than what happened between 39 and 45.\nI think the debate in America was very interesting in the 30s um where there was really a strong uh isolationist movement um you know with Charles Lindberg and and Henry Ford and Father Coughlin and many Joe Kennedy.\nYeah.\nJoe Kennedy.\nI mean, they defined themselves as sort of America firsters.\nUm, but it was very much an isolationist strain.\nAnd I think, you know, we can talk about that history.\nAnd Coughlin was a New Dealer, not a right-winger.\nAnyway, um, very much an isolationist talking about America having to stay out these entangling alliances.\nThis is not our war.\nEmotionally understandable, right?\nBecause you can you can also overlearn the lessons of World War I, right?\nAnd I think they overlearned the lessons of World War I.\nI mean, which was a brutal war and a devastating war mostly for Europe, but obviously for the United States.\nWe we lost thousands of American men and women.\nSo the 30s was this big debate between the um those who saw the gathering storm of what was happening uh with Nazi Germany and those who wanted to keep America out.\nAnd I think in some respects it's like today with the contemporary reality with Kame is that because these isolationist voices were so prominent and so vocal um and in some cases quite persuasive to American leaders, Hitler calculated that the United States would not enter the war.\nAnd so he could do what Scott says.\nHe could focus on the Eastern Front.\nUm he could gather his forces and then he could do a kill shot on the Western democracies in Western Europe and the United States would not intervene.\nI mean, you're right, the the big mistake he makes is declaring war in the United States after Pearl Harbor.\nBut he believes all through the 30s and before Pearl Harbor that the isolationist voices are keeping FDR from entering the war.\nEven while Churchill and the Brits and the French and others are imploring the Americans uh not only to just just to provide provide them with material support with weapons so that they could hold hold on to the island and and defend themselves and I think Hitler miscalculates in the same way I think Kame miscalculates.\nKame heard the debate over the past number of years.\nHe believed that this sort of isolationist wing of the Republican party right represented I think in you know by Tucker Carlson and others who have been very anti-intervention with respect to Iran.\nI think he believed that that was the dominant voice within Trump's MAGA coalition and that as a result the United States would not use military force.\nSo in the same way that Hitler miscalculated the influence of the isolationists on FDR, Kame misjudged the influence of the isolationists on Trump and both ended up miscalculating to uh to their great regret.\nSo to me that's the sort of parallel between kind of World War II in the 30s and the prelude to World War II and what we're seeing in the in the current reality over the past few weeks.\nTo make clear, you mentioned there's a parallel, but mostly there's no parallel.\nIt's a fundamentally different.\nAbsolutely.\nThere will never be a war like that.\nAnd I have...\nIt's a real problem, too, because they always say everybody's Hitler.\nAll enemies are Hitler.\nAnd to compromise with them at all is to appease Hitler.\nAnd you can never do that.\nAgreed.\nAnd they do that to Manuel Noriega, to David Caresh, to Saddam Hussein, to whoever they feel like demonizing and saying, too crazy to negotiate with when, let's get real, and I think we're agreed about this probably that right in 2002, W. Bush could have just sent Colin Powell, the four-star general, former chairman of the Joint Chiefs of Staff, Secretary of State, to read the riot act to Saddam Hussein, and tell him, \"Look, man, you help keep al Qaeda down, and we'll let you live.\"\nAnd everything would have been fine.\nAnd and in fact, just like Saddam Hussein, and there's a great article by James Risen.\nDon't agree.\nHang on, hang on.\nNow, there's there's an article by Surprisingly, there's an article by James Risen in the New York Times, and there's another one by Seymour Hersh as well about how Saddam Hussein offered to give in on everything.\nHe said, \"You want us to search for weapons of mass destruction, you can send your army and FBI everywhere you want.\nYou want us to switch sides in the Iran-Israel conflict, we'll stop backing Hamas.\nYou want us to hold elections, we'll hold us, we'll hold elections.\nJust give us a couple years.\nIf this is about the oil, we'll sign over mineral rights.\"\nThis is James Risen, New York Times.\nThey sent an emissary to meet with Richard Pearl in London.\nThat was who was the chair of the Defense Policy Board and was a major ring leader of getting us into Iraq War II.\nAnd then they I don't know why this is a real mistake.\nYou want to talk about mistakes?\nWhy does he always send his guys to meet with Richard Burl?\nBecause the there was a Saudi businessman, pardon me, a Lebanese businessman I think that they tried to get to intervene as well who again offered virtually total capitulation and Pearl told him, \"Tell Saddam, we'll see you in Baghdad after he was attempting to essentially unconditionally surrender.\"\nThe same thing happened with Iran in 2003.\nRight after America invaded, they issued what was called the golden offer, which the Bush administration buried, and they castigated the Swiss ambassador who had delivered it.\nBut in the golden offer, and you can find the PDF file of it online, they talk about we're happy to negotiate with you our entire nuclear program, which didn't even really exist yet, but nuclearization\n\n\nWe're willing to negotiate with you about Afghanistan and Iraq because again, they hated Saddam Hussein and wanted rid of him, too.\nSo they're perfectly happy to work with us on Afghanistan and Iraq.\nAnd they had captured a bunch of Bin Laden and they were willing to trade them for the MEK.\nAnd that included one of Bin Laden's sons and another guy named Aff.\nIranians held under house arrest for years.\nAnd it was only in the, I think, late...\nand they're giving refuge to al-Qaeda.\nAnd the CIA said this is a key facilitation pipeline between Iran and al-Qaeda.\nWilling to negotiate between these dangerous Bin Laden and the MEK, and America refused to negotiate that, and it was years later when the Bin Laden abducted some Iranian diplomats in Pakistan that they then traded them away to get their diplomats back.\nAnd, I think, Bin Laden's son ended up being killed not long after that, Hamza, but and and too, but both of those dangerous terrorists were released and were involved in terrorism between then them then then and the time that they were later killed, I think, within a couple of years of that.\nSo the hawks always like to say, \"Oh yeah, Iran gives such aid and comfort to al-Qaeda and all that.\"\nThere's a great document at the counterterrorism center at West Point where they debunk all of that.\nYeah.\nThere's a 9/11 report by the 911 commission.\nThere's a 911 commission report, people can Google it, which talks about the cooperation between Iran and al-Qaeda only in Bosnia when they were doing a favor for Bill Clinton.\nBeyond that, and the CIA released um thousands of pages of classified material that they declassified showing the relationship between Iran and al-Qaeda.\nThe US Treasury Department under Obama and under Trump actually designated a number of Iranian uh individuals for facilitating al-Qaeda.\nSo anyway, I mean, these are important facts, but I, I actually...\nYou mentioned Baghdaddy and Solommani in the same breath a minute ago when they're deadly enemies, and it was Solommani's Shiite forces in Iraq War II that helped destroy the enemy of my enemy is my friend with America flying air power for them.\nThe greatest era that we've made in the Middle East is this notion, not the greatest, but one of the greatest is this sort of conceptual era that somehow Sunnis and Shi don't work together and Iran doesn't work with al-Qaeda.\nI'm not saying you say that, but but many people think that, and of course they do work.\nThey hate each other, but of course they work together because they hate us more.\nBut can I just say something, Lex?\nBecause I actually think just stepping back from like all of this detail...\nThe more we start to zoom out now, the better.\nYeah, I'd like to zoom out a little bit.\nI look, I think the lessons for me um over 22 years on working on these issues is one must learn about the mistakes that we've made in Iraq and in Afghanistan and Libya.\nOkay.\nOne must learn about the mistakes that we made in Vietnam, mistakes that we made in World War II, so we can make them all over again in Iran this time.\nCan I finish or go ahead?\nAre you good?\nYeah, I'm I'm ready.\nAll right.\nSo, um, I think that what what President Trump is trying to do is learn but not overlearn, right?\nI think he understands the mistakes that have been made.\nI think he's trying to rectify those mistakes, and he also understands that American power is important.\nIt is been a, it is a force for good in the world.\nEven though we have made major mistakes, I think there's a great danger amongst certain people to believe that no power should ever be exercised, that all American power is a bad thing and a destructive thing.\nAnd sometimes to confuse major tactical decisions, right, that have been made, whether it's been made by the Brits in World War II or the Americans or us or whoever it is in whatever war with the fact that there is a strategic reality that we always have to be conscious of and that we have enemies, right?\nThis is not the Garden of Eden yet.\nI hope the libertarians create one.\nI want to go live there when they do, and Scott and I will be neighbors, believe it or not, living living in that uh garden of Eden together.\nBut there are major threats in this world.\nAnd we need to find the right balance between the overuse of military power and the underuse of military power.\nIf we want to avoid wars, we have to have serious deterrence because our enemies need to understand we will use selective and narrowly focused overwhelming military power.\nWhen we are facing threats like an Iranian nuclear weapon, that is a serious threat.\nIt's a serious threat to us.\nIt's a serious threat to to to the region.\nIt's a serious threat with respect to proliferation around the world.\nAnd I think with that respect, I think President Trump's decision to drop bombs on three key nuclear facilities was a selective targeted military action that I hope will drive the Iranians back to the negotiating table where they can negotiate finally the dismantlement of their nuclear weapons program.\nRight.\nI think there's a nuclear weapons program.\nAgain, we've had a 4-hour debate on this, so I'm sure if you want to rewind, you can listen to all our arguments once again.\nUm, but the fact of the matter is is that the our unwillingness to use power, if we're never going to use power, all that's going to do is send a signal to our enemies that they can do whatever they want.\nThey can violate whatever agreements they want.\nThey can they can use aggression against anyone they want.\nAnd I think that makes that puts American lives in danger.\nAnd we've seen the results of that where we we delayed and delayed and delayed and we didn't move and we didn't move too early and we didn't preempt and the and the threat grew and we ignored the gathering storm.\nAnd so I think the lessons of you know hundred years of American military involvement is if you have an opportunity early on as the storm is gathering to use all instruments of American power with the military one being the last one you use, then deter when you can and strike when you must in order to prevent the kinds of escalation and wars that everybody at this table and I'm sure everybody listening in your audience is is seeking to avoid.\nOn that topic.\nQuestion for both of you, Scott.\nIf human civilization destroys itself in the next 75 years, it probably most likely will be a World War II type of scenario, maybe a nuclear war.\nHow do we avoid that?\nWe've been talking about Iran, but there will be new conflicts.\nThere's Ukraine, China, Kashmir.\nKashmir.\nUm, North Korea.\nNo.\nYeah.\nDon't forget North Korea.\nYeah.\nI mean, there was a time when North Korea was the biggest threat to human civilization.\nAccording to...\nWe could have had a deal except John Bolton ruined it.\nSo, that's the bigger question.\nNot so much in the specifics.\nOh, I mean the second time he ruined the Clinton deal of '94.\nThen he ruined the Trump deal of 2018.\nMay maybe the Korean dictator, North Korean dictator ruined it.\nBut again, one doesn't want to blame our enemies for their mistakes.\nWell, you know that at the second meeting, Trump sent John Bolton to outer Mongolia so that he couldn't sit at the table and ruin the deal.\nBut but what happened then?\nThe Democrats had his lawyer testify against him while he was at the meeting.\nAnd they had this huge propaganda campaign that Kim Jong-un is going to walk all over Trump and take such advantage of him.\nAnd they made it virtually impossible for him to walk away claiming a victory.\nDo you ever blame the enemy ever?\nDo you ever blame the enemy?\nNorth Korea is not my enemy.\nNorth Korea is not your enemy.\nNo.\nReally?\nThey they they build nuclear weapons, ICBMs that target America.\nIt's George Bush and John Bolton's fault.\nI already said that.\nWhatever fault it is, the fact of the matter is, do you ever ever blame an American adversary?\nOr is it always our fault?\nIn fact, what happened was always our fault.\nSee, all you can do is characterize, but you don't want to talk about the details.\nThe details are that Steven Began who worked for for Donald Trump gave a speech and said, \"You know what?\nWe can put normalization first and denuclearization later.\nI know him very well.\"\nAnd then they brought Donald Trump brought John Bolton to the meeting.\nAnd he prevented that from being the uh from being the uh the message of the meeting.\nRuined the deal.\nJohn Bolton's fault.\nAlways John Bolton's fault because how reasonable does it sound to you, Lex?\nGive up all your nuclear weapons first, then we'll talk about every other issue.\nDoes that sound like a poison pill or that sounds like a reasonable negotiation?\nGive me a break.\nSounds like a beginning of a negotiation.\nYeah.\nWell, they got nowhere because Trump brought John Bolton with him and helped to ruin it.\nAnd maybe they went nowhere because the North Korean dictator at the end of the day is a dictator who wants to threaten the United States with ICBMs and nuclear.\nListen, you're you're criticizing the the sequential decisions made in negotiation.\nI'm asking you a serious question after hours of talking, which I must say I've really enjoyed.\nI've learned a lot.\nI enjoyed it.\nI think there's been areas of agreement, obviously, real disagreement, but here's the question to you.\nLike really, I mean, do you ever ever hold our adversaries responsible or do you just don't think we have any adversaries?\nThis is ridiculous.\nThe topic has been from from your point of view, it's all the adversaries and all America and Israel trying to do is survive and fix the situation the best they can.\nI'm refuting that by bringing up all the things that America and Israel have done to make matters worse.\nI didn't ever say that the Ayatollah is some great guy or that Kim Jong-un is some hero or like any kind of spin for their side.\nAre they a threat to America?\nNo, of course not.\nAs a big Brazinski said in 1993, we could have perfectly normalized relations then.\nYou talk about Iranian support for al-Qaeda.\nIran supported al-Qaeda in Bosnia in 1995 as a favor to Bill Clinton because they were trying to suck up to the United States is why they supported Ala.\nYour position.\nYour position.\nMy position is whatever you say it is, not what I say it.\nNo, no.\nI'm just I'm trying to summarize.\nYou know who's the last person who told me I need to beware about overarning the lessons of Iraq?\nIt was Charlie Savage from the New York Times when on the subject was his absolute ridiculous hoax that Russia was paying the Taliban to murder American soldiers in Afghanistan in 2020 which ruined Trump's potential which he was floating balloons about withdrawing in the summer of 2020 which would have absolutely prevented the Joe Biden era attack and Charlie Savage who published these ridiculous lies that were later refuted by the general in charge of the Afghan war the head Sentcom the chairman of the joint chiefs of staff and the director as much detail as possible.\nHe told me, \"You know what your problem is, Horton, is you have overlearned the lessons of Iraq War II.\"\nBut it turned out those lessons were perfectly apt for Charlie Savage's hoax.\nIt wasn't true what Charlie Savage said.\nYou know what he resorted to?\nHe said, \"Well, it's true that there was a rumor I was reporting on.\"\nScott, you made it very clear America has no adversaries.\nThat's called learning the lessons of Iraq, not overarning them.\nAll right.\nSo, I guess the the answer to the question I asked about avoiding World War three is the two of you becoming friends.\nThat's my my goal.\nIf you can try to find the light at the end of the tunnel, one one last question.\nWhat gives you hope to the degree of hope about the future?\nWhat gives you hope about this great country of ours and humanity too?\nYeah.\nI mean, look, there are a million wonderful things about this country, the land, the people, our culture, and our resources and everything.\nAnd the kind of society that we could build in a not with a controlled system, but with just a pure free market, capitalist system in this country where people are allowed to own their property, improve its value, and exchange it on the market and build this country up.\nWe would be living in comparatively a paradise compared to what we have now.\nAnd if you look at the opportunity costs just since the end of the cold war on on all that has been wasted on militarism in the Middle East especially, but also in Eastern Europe and in East Asia, all of that wealth put here could have gone much more to something like perfecting our society.\nIt's always an unfinished project.\nSo that then we really have something to point to the rest of the world and say this is how you're supposed to do it.\nNot like that.\nI think it's crucial that for all of the problems that Somalia, Syria, Libya, Iraq, Afghanistan have, the worst thing about those countries is America's wars there.\nIt's what we have done to them as the worst thing about those places.\nSo, we're not in much of a position to criticize, you know, whatever horrible and political uh practices uh you know, cultural and and things about their societies that we would like to criticize when the worst chaos that's happened to them has been inflicted by our country against them virtually all in in wars of choice that were unnecessary from the get-go.\nWhat gives you hope?\nWhat gives me hope?\nI think first of all, um I have a lot of um hope and confidence in the wisdom of the American people.\nUm, I think Americans understand the end of the day that they need leaders who are about making America great again.\nI think they elected Donald Trump who is flawed in many many ways, but I think Trump is wrestling with some of the questions that we have been wrestling with for the past 5 hours.\nUm, I think that um we I think most Americans know that we have adversaries.\nUh, and you know, it's just overwhelming numbers of Americans understand that.\nThey may disagree on exactly who is an adversary and how you rank them, but they know we have adversaries.\nI think the third thing is Americans greatly admire the men and women in uniform.\nI mean, I think the institution with the greatest popularity in America still remains the US military while many of other institutions are are failing the American people and are reflected in the in the polling.\nI think we got to be very judicious about how we use this incredibly powerful military.\nUm and because most importantly it comes down to it's not about weapons and technology.\nIt's about the people.\nIt's about the men and women who have sacrificed their lives um to serve our country.\nAt the end of the day, if we understand we have adversaries, we're care\n\n\nFul about how we use our military, we understand the importance of foreign deterrence in order to actually confront threats before they become so severe that we ended up plunging ourselves in a war.\nI agree totally with Scott in terms of how we use our money and how judiciously we must we have to guard it.\nI agree with how we've we've run out these massive debts and we have to be actually if we're serious and conservatives are really serious, they need to stop, they need to tackle these massive budget deficits.\nUm, and you know, it would be really easy if it was just all about the military and we could just kind of get rid of the Pentagon and all of a sudden we'd be running balanced budgets.\nIt's not the case.\nWe have much deeper structural economics economic problems in this country, and everybody knows that.\nAnd so we got huge challenges as a country.\nUm, but I really believe, uh, as I believe since I was a little kid that America is the greatest force for good in the world and that we do, we make mistakes, sometimes tragic mistakes.\nWe make huge miscalculations, and I think we will be much more clear in how to rectify those mistakes if we stop obsessing with these boogeymen that are out there, the Israelis, the Jews, theians.\nWell, and we start focusing on our adversaries, which are not the Iranians, because the 80% of Iranians despise this regime.\nAnd you know, Lex, I feel really bad that we in 5 hours we actually haven't even talked about that in any detail.\nMany of my friends are Iranian, and they're beautiful people and and as one of the great cultures on earth.\nYeah.\nAnd you know, the only place they don't succeed in the world is inside the Islamic Republic.\nWhen they come to America and Canada and Europe, they're incredibly successful people.\nAnd 80% of Iranians despise this regime and they long for a free and prosperous Iran.\nAnd so it's a big question that they're ever going to get there.\nAnd who knows the right way to get them there.\nBut at the end of the day, I am convinced that the vast majority of Iranians are our friends.\nBut there is a regime that has been trying to build nuclear weapons, has been engaged in terrorism for decades, has killed and maimed thousands of Americans and our allies.\nAnd it's a regime that has to be stopped.\nAnd I think Donald Trump in the past couple of weeks, I would argue in the past number of months, has tried to try to play a strategy, try to figure out a way to offer the Iranians negotiations and a peaceful solution to this, but use overwhelming military power recently against Iran's nuclear sites in a very targeted way in order to send a message to the Islamic Republic of Iran that they cannot continue to build nuclear weapons and threaten America.\nAnd so I hope that things will work out well on this.\nI I've always said curb your enthusiasm because we have still a lot of of pieces that still need to fall into place.\nAnd this is going to be a windy road as we try to figure this out.\nI'm hoping for the best, preparing for the worst, and want to thank you very much for having me on the show.\nScott, it was a real pleasure to meet you.\nI enjoyed the debate.\nVery lively.\nI admire your dedication to the issue and your and your attention to detail, and I think all of that speaks well of of you and your commitment and and your passion for this.\nSo I am thank you deeply grateful that you guys will come here.\nUh, this was really mind-blowing.\nUh, also that you have it's silly maybe to say, but the courage to sit down and talk through this through the tension.\nI've learned a lot.\nI think a lot of people are going to learn a lot.\nI'm a fan of both of your work.\nAnd um, it means a lot that you come here today and talk to a silly kid like me.\nSo Scott, thank you so much brother.\nThank you.\nThank you Mark.\nThanks Lux.\nAppreciate it.\nBam.\nThanks Scott.\nThanks for listening to this debate between Scott Horton and Mark Dubowitz.\nTo support this podcast, please check out our sponsors in the description and consider subscribing to this channel.\nAnd now let me leave you with some sobering words on the cost of war from Dwight D. Eisenhower.\nFor some context, Eisenhower was the 34th president of the U.S..\nBut before that, during World War II, he was the supreme commander of the Allied Expeditionary Force, orchestrating some of the most significant military operations of the war with leadership marked by strategic and tactical brilliance.\nIt is in this context that the following words carry even more power and wisdom spoken in 1953.\nEvery gun that is made, every warship launched, every rocket fired signifies in the final sense a theft from those who hunger and are not fed, those who are cold and are not clothed.\nThis world in arms is not spending money alone.\nIt is spending the sweat of its laborers, the genius of a scientist, the hopes of its children.\nThe cost of one modern heavy bomber is this, a modern brick school in more than 30 cities.\nIt is two electric power plants, each serving a town of 60,000 population.\nIt is two fully equipped hospitals.\nIt is on 50 mi of concrete highway.\nWe pay for a single fighter plane with a half million bushels of wheat.\nWe pay for a single destroyer with new homes that could have housed more than 8,000 people.\nThis is not a way of life at all in any true sense under the cloud of threatening war that is humanity hanging from a cross of iron.\nAnd now allow me to add some additional brief excerpts.\nIn 1946, Eisenhower said, \"I hate war as only a soldier who has lived it can.\nOnly as one who has seen its brutality, its futility, its stupidity.\"\nIn 1950, Eisenhower said, \"Possibly my hatred of war blinds me so that I cannot comprehend the arguments they aduce.\nBut in my opinion, there's no such thing as a preventative war.\nAlthough the suggestions repeatedly made, none has yet explained how war prevents war.\nWorse than this, no one has been able to explain away the fact that war creates the conditions that beget war.\nAnd finally, an excerpt from Eisenhower's farewell address in 1961 on the military-industrial complex.\nA vital element in keeping the peace is our military establishment.\nOur arms must be mighty, ready for instant action so that no potential aggressor may be tempted to risk his own destruction.\nAmerican makers of plowshares could with time and as required make swords as well.\nBut now we can no longer risk emergency improvisation of national defense.\nWe have been compelled to create a permanent armament industry of vast proportions.\nThis conjunction of an immense military establishment and a large arms industry is new in the American experience.\nYet we must not fail to comprehend its grave implications.\nIn the councils of government, we must guard against an acquisition of unwarranted influence, whether sought or unsought, by the militaryindustrial complex.\nThe potential for the disastrous rise of misplaced power exists and will persist.\nThank you for listening and hope to see you next time.\n"
}