{
  "episode": {
    "id": "CZw9BnPBwWo",
    "title": "Joe Rogan Experience #2351 - James McCann",
    "publishedAt": "2025-07-17T17:00:14.000Z",
    "description": "James Donald Forbes McCann is a stand-up comic, author, and host of “The James Donald Forbes McCann Catamaran Plan” podcast.\nhttps://www.jdfmccann.com\n\nGet a free welcome kit with your first subscription of AG1 at https://drinkag1.com/joerogan\n\nDon’t miss out on all the action - Download the DraftKings app today! Sign-up at \nhttps://dkng.co/rogan or with my promo code ROGAN.\n\nGAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit https://gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit https://ccpg.org (CT), or visit https://www.mdgamblinghelp.org (MD). 21+ and present in most states. (18+ DC/KY/NH/WY). Void in ONT/OR/NH. Eligibility restrictions apply. On behalf of Boot Hill Casino & Resort (KS). 1 per new customer. $5+ first-time bet req. Max. $150 issued as non-withdrawable Bonus Bets that expire in 7 days (168 hours). Stake removed from payout. Terms: https://dkng.co/dk-offer-terms. Ends 7/20/25 at 11:59 PM ET. Sponsored by DK"
  },
  "channel": {
    "id": "UCzQUP1qoWDoEbmsQxvdjxgQ",
    "name": "Joe Rogan",
    "slug": "@joerogan",
    "url": "https://www.youtube.com/@joerogan"
  },
  "transcript": "Joe Rogan podcast. Check it out.\nThe Joe Rogan Experience.\nTrain by day. Joe Rogan podcast by night. All day.\nThank you for having me here.\nMy pleasure.\nIt's a joy.\nIt's a joy to have you, sir. I've been having a good time hanging out with you at the club. So, it's been great.\nFeel like we got to do this.\nThis is very Man, I'm trying not to spin out. This is I have watched this on a phone before. This is great.\nWell, it's weird for me that it's weird for people because to me it's still the same thing. It's just sitting down and talking to people. I've gotten so used to it. Even when it's like Trump or Elon or some [ __ ] huge cultural figure, it's still\nYou must have spun out at least one time.\nI spun out a bunch of times in the early days. I still spin out every now and then like uh you know like you like Mel Gibson's on the podcast like oh that's really Mel Gibson. Mike Tyson that's another one. Um, yeah.\nYeah, he was, was this where he said he became erect when he wanted to beat people up?\nThat was in uh California.\nOkay.\nYeah, that was\nIt's a classic It's a classic all-time great moment.\nHe was He was scaring the [ __ ] out of me, man. I spin out when I first got to the club, I was going it was every week I would uh\nIt's weird, right? When I first met James McCann,\nI've seen you you deny the Holocaust. I love you.\nNot really. We should be real clear.\nNo, he was a Nor McDonald under a bridge.\nIt was a Nor McDonald bit.\nHe features in that book a lot.\nWell, Adam's an amazing guy. Yeah.\nHe's the reason he's one of the reasons why I went back to the store.\nWhen I was banned from the store for seven years, Adam came to\nSeven years.\nYeah. Well, I banned myself for seven years. They banned me. They were going to ban me for like a few weeks. I'm like, [ __ ] you. Like, nay.\nWhat did you do?\nThis is the whole Carlos Mia thing.\nThey ban you for that?\nYes.\nYou won the court of public opinion on that.\nWell, not only did I not really get banned, the guy who banned me was eventually fired. He was the manager there. But Mity gave me a spot that night. It's like before they called me to tell me I was banned. Mity was going through a lot of health problems, right? And you know, Mity was I was very close with her. So I called her when the whole Mensia thing happened and I said, \"Listen, this is this guy's been a problem. It's a it's a real issue. People are worried about do doing materially in front of them. It's like this is a giant problem.\"\nAnd you know, I told her the whole thing with the video and she's like, \"All right, well, just keep away from them. What time do you want to go up tonight?\" And I said, \"When do you want me to go up?\" And she said, \"How about 10:30 or whatever it was?\" And I said, \"Thank you.\" Okay. I love you. Bye. We said bye. And then uh like [ __ ] an hour, two hours later, I get a call from this manager telling me that I'm uh banned from the store for two weeks.\nAnd I was like, \"What?\"\nI go, \"For two weeks?\" For for I go, \"Listen to me right now. I'm not coming back.\" I go, \"I'm not coming back. And you're making a decision that's going to [ __ ] this club up because you're choosing to take the side of plagiarism.\"\nYes. over someone who's exposing it.\nLike the the agents won't expose it. They're making a [ __ ] ton of money. And if the comedy store is not going to side with the artists, I'm like, listen, this is the same conversation I had with my agent. I lost my agent too for that.\nI feel like that those are both important moments in a\nlike a everybody seems to have a problem with their agent violent, but also the number of people who've been banned from comedy clubs. I was Brian Simpson has told me about how he got banned for ages when he was homeless. Uh who there was like people were all doing banned from comedy club but he was uh he he had some sort of an issue with someone there and this was like when Brian wasn't Brian Simpson from Netflix, you know, it's like Brian Simpson upand cominging door guy that people go, \"Oh, that guy's funny.\" But like if you get a run a foul with certain things,\nthis is what I'm trying to avoid. I did this in Australia a lot.\nYou ran a foul.\nI was a problem and uh I couldn't work in certain cities for some time just cuz I was I think unpleasant.\nWhat were you doing wrong?\nI you know I started comedy. I would go around telling people that they sucked and they should quit. And I went to like the head of the Melbourne Comedy Festival. I was in I was in the comedy competition. It was like my fourth gig and I was like you're picking all the wrong people to win these. This guy's the better.\nAnd it just Anyway, I'm we grow older. I was also 18 and I was\nYeah.\nUm\nOh, I get it.\nVery No, it's\nYeah. A lot of feuds, a lot of telling people that they sucked.\nWell, when you enter into comedy, you know, a lot of times people treat it weirdly like sports, you know, like they talk [ __ ] playing basketball, so they try to talk [ __ ] doing comedy. It's like it's weird.\nI'm I've gotten better at it. I think I've purged it for but sometimes\nWell, it depends on the environment you're in. If you're envi in an environment where a lot of people are doing that, it's not fun. But this is I find it easy here because people are I don't want to I don't want to say that everyone in Australia is bad at comedy. There are many great comics. But I could not for the life of me like there there were times where it's like oh this could be helpful for your career to get in with someone and have them guide you. And it's like I just hated everybody's comedy that I met and hung out with and people who were great would often leave or not be around.\nAustralia's kind of a different\nWe've got great people out there but low listen you got Jim Jeff. I think you're the funniest guy that's ever come out of Australia. You believe that?\nNo. We have Barry Humphre. I'll never be better.\nOkay.\nYou know Barry Humphre?\nNo.\nThe first\nI think we watched a clip once in the green room. But you know the problem is the green room is so loud and\nYeah. I'll watch the man. He would dress up like a DNA. This is in the 70s. He's conservative man. Dress up like a housewife. Like a very dowy drag act and uh was like super funny. Really broke through in the UK. And then the festival turned their back on him. He started the Melbourne Comedy Festival and then he made some like trans remark and Hannah Gadsby I think was like I'm not taking this award in his name and then the funniest Australian.\nI lose out to Hannah as well. You forget about Hannah. Hannah was a great club act. I tell this to people all the time.\nNo one in No one wants to believe it.\nWell, listen man. It's just she did a different thing. A lot of people got mad at that. But I don't get mad at things that are not for me. It's not it's pointless.\nIt I think it was like a revolutionary act for Americans because you don't have comedy festivals in the same way here. But like\neveryone in Australia was doing the I got raped show or the I wanted to commit suicide show. Really?\nYeah. You show, you know, everyone does an hour. That's the only way you can. There's only five cities. So the comedy festivals are the only way you can really break through and make money. There's five clubs and once you've done two of them, you got nothing.\nSo every you have to have a new hour every year. There was the Oh man, there have been some great I Was Molested shows. Shout out Corey White for one of the greatest I was molested shows ever. Uh who? Dave Quirk had the I had an Affair show. That was great. Uh Dad's Got Cancer. Big show.\nOh no.\nBig show. Mom died when I was young.\nSort of like more like um spoken word thing than you would say standup comedy. You just No one's even People do all the jokes they wrote that year, which gets you to like 35 minutes. Mh.\nThen you tell a 10-minute very sad story about\nAnd then and then I I finished my chicken curry and I thought I'm ready to die.\nAnd then then you bring it back with a gag at the end and\nYeah. I\nAnd that was like standard.\nYeah. It's still going on to this day.\nThere's a lot of that and I could never do it.\nYeah. You're I don't I couldn't imagine you doing that. You're so like funny heavy.\nLike your your comedy is very funny heavy, you know? It feels important for comedy.\nIt's the [ __ ] most important thing.\nIt's fun to get interesting ideas out there. It really is. It's fun to talk about interesting subjects, but it's got to be funny.\nI mean, I when people have a theme, I Colin Quinn does this all the time and it's great. He goes like that.\nOh, yeah.\nGoing to therapy show, Red State, Blue State, History of America in New York is great.\nHe's a genius at it. He's probably the best at it about like telling interesting subject matter, using interesting subject matter, telling you things you didn't know with comedy. He Yeah.\nAnd highlighting the ridiculousness of it all.\nHe was at the club and that was that was crazy.\nHe's great. He's such a\ntime usually like you time is dragging on when people are on stage and you check how long it's gone. Even if it's great and you go,\nI thought we were at the 20-minute mark, it's been six minutes or something. Time just disappears for him.\nReally blew me away is Jimmy Carr.\nYeah. Oh my god, he was so on when he was here. He was doing new stuff.\nI saw him running the new with the pages.\nYeah, with the pages. But the polish, like while he was doing the new stuff, he's so good off the cuff that even if the new stuff was going sideways, he figured out a way to turn it around and would address it and like, oh, he was so good.\nHe just sits and writes apparently.\nHe's an animal. He teaches it, too. He teaches it. He has a program that they actually ran at the mothership for up and cominging comics.\nCan you teach it?\nI'm always wary of that.\nWell, I don't think you could teach comedy necessarily, but I think you could teach you could learn how he does it and you can learn how certain people do it. And I think some of that you can apply.\nUm, and school of comedy, you've got to take a lot of heroin and put your hair right over your face.\nI think you can What you can do though is teach work ethic.\nYeah.\nAnd I think that's half the battle. Half the battle is just sitting down and and actually writing. And know everyone comes up with an excuse. It's like a cold plunge. Everybody comes up with an excuse why they don't want a cold plunge.\nAnd everybody comes up with an excuse why they don't write in front of a computer or on a piece of paper. They always write only on stage.\nWell, I mean doing the same thing over and over again was I for I don't know seven, eight years at the start, I struggled to do it. I had no I had like five bad hours of comedy and it wasn't until I probably impregnated my wife. It was like I should I should make sure there's a good five I should really boil this down to a good five minutes or I'm in real trouble.\nWell, sometimes it's something like that has to happen in your life where you really take it seriously cuz we all know comics that like we started with we're like, \"Oh my god, this guy's going to be huge.\" Yeah. And for whatever reason, they didn't put in the work. They [ __ ] off. They self-sabotaged.\nEvery town you go to, there's the guy who was going to be big.\nI think if we can encourage more people, we can make less of that. And I think we can give more people a chance cuz I I think we all could have been that person who quit.\nYeah.\nAnd I know in the beginning I thought about quit a bunch of times. One of the things that helped me not quit is I tore my ACL.\nOkay. So, uh, I couldn't train or compete anymore. Yeah. Because I was still like kind of on the fence of whether I'd go back to fighting or because I was terrible at comedy. I was I was like good every now and again.\nACL took that away from you. You got one option now.\nI was like, \"Okay, I can't fight anymore. I need to get surgery. Um, I got to take this seriously and I got to really pick one thing.\" And I completely stopped competing. So, that was like a year into comedy. So that was an important thing like it needed a thing where it was like okay I've got no options now like I can't just enter into a kickboxing tournament and say [ __ ] comedy this is too hard.\nYeah.\nAnd it's just there was it was a weird thing. It was like I had to make a complete mind shift from someone who didn't care at all about other people's opinions. Someone who was like I will show you. I will show you. Like I don't give a [ __ ] what you think. I will show you.\nYeah.\nTo I have to get you to like me.\nYeah. I have to be f not just funny with my friends, but I have to figure out how to make these people my friends where I was always very standoffish with new people. It was a weird thing to try to adjust to comedy.\nWell, also if you can't make it work, you have to stop at some point.\nOh, you have to.\nIf you can't make it work, you But I did make it work sometimes. I just had to figure out what what was consistent when I was making it work.\nThat's a real\nYeah.\nI\n\n\nI don't know how I mean so few people get passed at a club.\nI know.\nIt's hard.\nUh, cuz you you have to come back and do it a couple times and see.\nBut I see people have a great, like a one-off great one, and then you go, \"Where did that go?\"\nOh dude, there's a girl that I saw once in 1990.\nNo, 1995 or six.\nThat's what it was.\n1995 or six.\nShe did a set in the belly room, and it was one of the funniest sets I've ever seen in my life.\nIt was like I was watching a female Sam Kenisonson.\nI was like, \"This girl is on fire. Like, this is insane.\"\nAnd then never happened.\nI don't know what happened, you know?\nI don't know.\nPeople just never really get it together.\nThey, they, whatever the [ __ ] they pulled off that time, they can't do again.\nLightning in a bottle.\nOh, but it was in there.\nLike, it's in there.\nThat comedy was in there.\nI was like, if this person with the right encouragement could have been [ __ ] huge, man.\nYeah.\nI remember I saw my friend Amos on that day.\nHis girlfriend broke up with him, and he went and did, he was meant, he was booked for 10.\nHe did like 25.\nUh, he was just heartbroken.\nHe was just complaining about being devastated.\nAnd it was all the things that were wrong with his comedy beforehand were like gone.\nHe was used to be like unpleasant in people's face, and then he was like free and likable and good.\nIt's like, oh, you can't engineer to be broken up with every show.\nYou can't, you can't engineer that, right?\nYou shouldn't.\nWell, that was Kenisonson in the early days, right?\nCurly.\nKenisonson in the early days was all about like how you know, like meeting the devil, and the devil's like, \"Oh, you've been married?\"\nYeah.\nThis is all [ __ ] nudy.\nYou know, this is all old hat to you.\nOh, this is where we torture the souls.\nLike, I never had it.\nOh, you were married twice.\nLike, remember that bit?\nI, I never, the first time I realized that he was a big thing was when that poster went up backstage at the mothership.\nOh, really?\nYeah.\nWe didn't, we didn't get him.\nWow.\nWe didn't get him.\nWe didn't get, uh, I mean, maybe some people got them.\nWe got Ron White cuz he was on Comedy Central.\nSo, I had seen his special like a bunch of times.\nThat's crazy.\nBut in terms of American comics, I didn't get Kenisonson.\nI didn't get, uh, who we got?\nChappelle cuz we got Chappelle shot.\nYou must have got Hicks.\nPeople around me had Hicks, but the, I was late to Hicks because the men who loved Hicks were uh, nuts, right?\nYou know what I mean?\nLike, you go, there's something good here, but it's going to, I'm going to have to come back to it where they...\nWell, he was so good and so unique in the kind of comedy that he did and so smart that it made a bunch of guys try to be like him.\nYes.\nYeah.\nThere's many such cases.\nGuys who are great, but they destroy, dude, there's a lot of little Casey Rockets running around who think they don't have to write anything and...\nOne of the all-time great, I mean, if you, one of the all-time greats is Richard Jenny.\nI mean, he's an all-time great.\nAnd um, when I saw him in like the 1980s, he did a club, I guess I was probably 90, 91 maybe, East Side Comedy Club.\nHe did four different hours.\nAnd the MC wanted to quit comedy after he MCed for him the weekend.\nHe said he did four different hours.\nA different hour on uh, Friday night, first show, different hour, second show, different hour, first show, Saturday night, different, and all of them murdered.\nAnd he said it was insane.\nAnd he goes, \"I wanted to quit comedy.\"\nHe saw Hicks, and he said to me, like we were hanging out together, he was like, \"God, I got, I wish I...\"\nMakes me want to do more of that.\nYou know, I feel like sometimes I'm not doing enough of that.\nLike, wow, that's crazy.\nDo you know Ken Dodd?\nDo you know that?\nHe was a Liverpian comedian, I think, but he would come out and he would do his new hour, and people would like clap and say thank you.\nAnd then he would, he would say, \"Right, I'm going to do the hour I did last time I was in town.\nYou can leave if you want, but I'll do.\"\nAnd the second hour is the hour he did the year before.\nAnd then he'd do the hour that he did the year before that.\nAnd he'd just do hour after hour until the whole, until like if people had enough, they could get up and walk away.\nWow.\nBut he'd be there for like seven hours.\nJesus Christ.\nYou know, he used to staff hated it.\nChappelle used to do that.\nHe used to pull up to the Laugh Factory and do like a 9-hour set.\nYeah.\nHe's still doing it.\nI think, I think him and Dane Cook had like a battle to see like who, who could do the longest set.\nI mean, I saw, I got to go to...\nI don't think Dave was like trying to battle, but I think Dade like took the title.\nShane took me to his, the, the YS Firehouse, the club that Dave has set up in uh, Yell Springs.\nYeah, it was on his birthday.\nAnd he did three hours, and he bombed at his own birthday.\nAnd he kept saying, \"I can't believe I'm bombing at my own club on my birthday.\"\nBut then in the middle, there was a guy with a coat, and he just did maybe 45 minutes about this guy's coat of crowd work on his, just a, it was magical.\nThe whole thing flew.\nHe could release an hour on this guy's coat.\nI think he's recording everything though.\nHe's building a vault.\nI think, I think he's got a Prince vault.\nA Prince vault?\nYeah.\nLike how Prince, I think every second album Prince would just put it away.\nAnd I think he's got, he must have hours in the vault.\nYeah.\nHe's got a whole system for how he creates comedy.\nIt's very unique.\nHe goes on stage, and he has some subjects, and he just [ __ ] around, and he gets a little drunk.\nYeah.\nGets a little high, and he's so funny that some of those things will wind up being bits.\nYes.\nAnd then he takes those bits, and then he, like, he has all of them recorded.\nSo he's just constantly stock, and he goes on stage like almost every night.\nI, there's nothing in my vault.\nEverything I've, I've gotten, I've got like...\nEvery time I go out there, I go, I've got nothing.\nIsn't that a great example?\nLike, not everybody has the option to just go on stage and rant for 3 hours.\nBut isn't it educational to any young comics?\nIt says, \"Okay, who do people consider to be the greatest, greatest comic alive?\"\nMost people would say Dave Chappelle.\nAnd Dave Chappelle is working harder than anybody.\nYes.\nIt's not a coincidence.\nLike he's effortlessly funny.\nYes, for sure.\nBrilliant.\nYes, for sure.\nBut also works every night.\nLike there's something to that, and works every night and does long sets.\nYeah.\nLike every night, like he's always, he's always there.\nHe's always getting better.\nHe's always covering to do it.\nBefore I came to America, I would do like, I would do an hour a month and be very happy with that.\nAnd I thought this was enough to get me where I needed to go.\nAnd uh, no, going every night is, it's also hard to go every night.\nLike you don't, you have a good time once you're out, but then you...\nComedy.\nYou got to avoid that feeling, right?\nSo it's a, it's a mental collapse.\nIt's, you know, familiarity breeds contempt.\nIt's not just in relationships.\nIt's in anything you do.\nYeah.\nAnd that's where you have to reset your mind.\nRight.\nSo like when you start to feel that coming on, like I can't believe I have to do another set.\n[ __ ] I don't want to do a second show.\nYou have to remember what it was like when you had nothing.\nAnd you have to remember what it was like when you would go to open mic night and just you wouldn't on the, weren't on the list.\nYou didn't make the list, but you just wanted to go on stage so bad.\nYou wanted to go on stage so bad, and you wanted to, you're like, I got to figure this thing out.\nYou got to have your Johnny Cash moment sitting backstage at the Falsome Prison looking at the water thinking about your brother.\nYou are about to go do a second soldout show.\nNo, it's silly.\nYou should be so pumped.\nIt's just a familiarity thing.\nIt's just a mind [ __ ].\nBut you can get over mind [ __ ], man.\nYou can get over them if you understand what they are and just recalibrate the way you engage with it.\nFiguring out a way to recalibrate that doesn't kill you in the long run is a good, like I know some...\nWell, you mean cocaine?\nI cocaine.\nPeople get like [ __ ] up or just play a video game all, all week, and then they can get back and do it.\nYou don't have to though.\nYou don't have to do those things.\nI think you got to do something.\nYou got to go for a nice walk.\nI started swimming.\nWe all need to take our health seriously.\nAnd let's face it, while the average modern diet might include some fruits and veggies, it also comes with its fair share of fries and barbecue, that mix probably isn't giving your body everything it needs.\nThis new generation of AG1 can help fill the nutrient gaps your diet might miss.\nI think it's a simple way to support your overall health.\nIt's an easy morning routine that sets you up to feel ready, energized, and equipped to take on the day.\nYou still need to eat right.\nYou still need to exercise.\nIt's not a miracle, but it's a foundational habit that's quick and easy to maintain.\nMix it in some cold water and off you go.\nI partner with AG1 for so long because they're committed to constantly improving.\nTheir NextGen formula is backed by solid research, rigorous testing, and four gold standard clinical trials.\nSubscribe today to their newest clinically backed formula, AG1 NextGen.\nYou'll also get a bunch of other free stuff like a bottle of D3 K2 and five of the upgraded travel packs with your first subscription.\nJust go to drinkag1.com/joen or head to the link in the description to get started.\nThat's drinkagg.com/joengan.\nThat's...\nI love to swim.\nOh, you were telling me that.\nYeah, I'm all about, I've got nothing.\nAnd I go on stage, and I try and talk about how much I love the pool.\nI got nothing.\nYou might, like three sets where I stand there and go, \"Isn't swimming beautiful?\"\nThen I say nothing, and I wait for something to happen after that, and I go and talk about the next thing.\nWell, it's, you know, one of those exercises that because you're moving against the resistance of the water, it doesn't damage your joints.\nYeah.\nAnd it's like it feels like therapeutic even though it feels like exercise.\nYou can get yourself tired if you want.\nYou can slow it down.\nOh, yeah.\nYou can.\nYeah.\nAnd it's fun.\nI swim with my dog in a lake.\nIn a pool?\nNo, in a pool.\nMe and the dog swim in the pool.\nHe's the, he's the funniest.\nHe's such a great dog.\nI did find your dog Instagram account.\nAre you running the dog Instagram account?\nMy wife runs.\nOkay.\nBut he's um, he's so great that like he won't swim unless you're swimming.\nLike he knows he's not supposed to just randomly jump in the pool cuz then he comes in the house, [ __ ] everything up.\nSo he only allowed to swim when we tell him to swim.\nAnd so he sits there like, \"Are we [ __ ] swimming today?\"\nYeah.\nAnd then he finds out we're swimming.\nLike, \"Oh [ __ ] we're swimming.\"\nAnd he just jumps off the [ __ ] side of the pool.\nCoronated pool.\nSalt pool.\nSalt pool.\nI think it's salt pool.\nIf it's not supposed to be, it's not.\nI can float in that.\nI cannot float in the chlorine pool.\nAnd that brings me great.\nWhy not?\nI, my legs sink down.\nOh,\nI have no bum.\nHave you ever done a float tank?\nNever.\nOh my god.\nWe have...\nI'm afraid of what would be in my brain.\nYou need to find out.\nNo.\nThere.\nDig around that clothes forever.\nRepression is so beautiful.\nJust dig around, dog.\nI've been there for 5 minutes.\nI'll be back.\nJust push it down and get back to work at the factory.\nIt really, I'm a big believer in push it down and keep moving.\nHey, there's something to be said.\nI mean, you explode at some point.\nWell, the opposite is not good, right?\nIf you're constantly dwelling on your problems all the time, that's, that's worse.\nI was someone was...\nI got, I got circumcised at like 32 cuz I had...\nJesus Christ.\nLord's name.\nBut it was a beautiful experience.\nI enjoyed it.\nI had a nice time.\nDid you get a rabbi to suck your dick?\nI thought about it.\nI thought I could leave that in as an option.\nBut also it's fine.\nBy the way, for people, I'm not making a joke.\nThey do suck the, sometimes they have a tube.\nSometimes they have a special tube.\nYeah.\nAnd sometimes they don't.\nNo.\nSometimes they just get the whole, given kids herpes and babies do die from it.\nYeah.\nYeah.\nIt's grim.\nBut circumcision in general, I'm in favor.\nWhy?\nCuz I, I know what it was like before.\nI know what it was like after.\nIt's not a big deal.\nBut there are people, what I'm saying, people make it their whole life.\nOne of one.\nYeah.\nI've experienced both as an adult.\nPeople go, I think most people would not want their dick to be cut for no real reason other than aesthetics.\nAnd people are like, \"Oh, it prevents AIDS.\"\nLike, shut the [ __ ] up.\nI got to go to the AIDS memorial garden in San Francisco.\nYeah.\nDid you show them your new dick?\nUh, well, people definitely would.\nIt's a lot of nooks and cr...\n\n\nAnnes in the AIDS memorial. Like they built the perfect place to have sex with a man in the AIDS.\nSomeone's definitely gotten AIDS at the AIDS memorial garden.\nYou think so?\nAnd they're [ __ ] away and they're going, \"Ah, I knew there was something I was supposed to remember. [ __ ] Now I have AIDS. It was very good. It was a beautiful park. San Francisco was lovely.\"\nHave you ever uh listened to people like um what is that guy's name? The guy that we had on the podcast a long time ago, Peter Dooberg.\nNo.\nIf you want to go down the ultimate rabbit hole,\nwhat was he doing?\nWas he in a park?\nNo. Peter Dooberg doesn't believe that HIV co causes AIDS.\nI've heard about this. It's the treatment.\nPeter Dooberg is uh he's a professional of professor of biology, University of California, Berkeley. Uh tenured and he's done like groundbreaking work on cancer. It's like considered to be a brilliant guy.\nSo in the 80s when all this was going on with AIDS, his assertion was that there was a thing that people were not factoring in is that almost all of the people who developed AIDS Yeah. were hardcore parters, hardcore drug users in the gay community. And no one wanted to address that. And he was saying, \"No, this is destroying their immune system.\" And then HIV shows up. He goes, \"HIV is a weak virus.\" He goes in most people and in what I had read what he said and I don't know if this is true maybe we could find out that babies if they're born they test positive for HIV without any treatment at all are HIV negative within a certain amount of time\nokay\nand so it all sounds nuts right because you go there's no way evidence for that because like African countries you would go healthcare would be bad malnutrition would be\nwell this is the thing are they really testing for HIV when they say these people have AIDS and is there other poss possible factors that could cause this immune thing. And if you're dealing with like it's all coming out of this gay community where there are a lot of partying, there's a lot of drug use, a lot of wild [ __ ] and these guys are burning it at both ends. And when you do that, sometimes you [ __ ] die.\nSometimes your immune system gets crashed.\nNow, clearly I'm not [ __ ] smart enough to know if he's right or if everyone else in the world is right because it's literally that, right? It's like him.\nI want that guy to be right, though.\nWell, there's a bunch of people that agree with him and silently agree with him. There's a bunch of people. It's actually covered in RFK Jr.'s book on Fouchy because it has to do with Fouchy.\nFouchi was in charge then, right? Like he was\nYes. He was the one that was giving people act, right? So ACT was a cancer medication that was killing people quicker than cancer was. It was a chemotherapy. And it not only is it a chemotherapy, this is the only time during the AIDS crisis where a chemotherapy was prescribed permanently because chemotherapy the the the agreement is like I'm going to take this poison that's going to destroy my body but it's going to kill the cancer and then when the cancer is dead I'm going to get healthy again, right?\nYeah.\nNo one gets hooked on chemotherapy.\nYou don't stay on.\nNo one's getting an extra. a super strong one. And you know, there was a lot of people that took ACT when they were asymptomatic. Like they didn't even have any of the symptoms. They just tested positive for HIV.\nAnd this is back when Carrie Mullis, the guy who invented the PCR test, he he's like famously on record saying like this is no way to test for diseases and Fouchy doesn't know what the [ __ ] he's doing.\nAnd it's the same guy that was in charge during the whole CO thing. And you're like that is the craziest conspiracy that HIV doesn't cause AIDS. But what he's saying is HIV is present is is present in people with already compromised immune systems and that this unique factor that they're all hardcore drug users was never taken into consideration.\nWell, they I mean certainly with co they didn't take it into account that fed people and weak people.\nThe thing is you got to look at it from a profitability standpoint. And I know this is super cynical and sounds disgusting,\nbut if you have a actual disease that you can prescribe medication for, that's valuable.\nYes.\nIf you have a bunch of people that are doing something that's super healthy that's killing them and you don't have a solution, that's not valuable.\nWell, they figured it out with fat people. They got the Ompic. I mean, people are just on the Ompic forever, bro. Do you know Ozmpic is like the number one most profitable medication in the country?\nI I believe it. But\nwhat is that true? Did I make that up? I think that's true. They're all doing it.\nSometimes I see things on TikTok and I'm like, is this China?\nAlso, some of them look great.\nOh, yeah.\nI mean, I know people on Empic who are they're spritly. They're bouncing around doing it.\nNo.\nThinking about it?\nNever.\nNo.\nNo.\nNo way.\nI'm a comfortable level of fat.\nIn America, no one has ever called me fat.\nNo.\nIn Australia at this body, all the time.\nReally?\nYeah.\nThey're all [ __ ] healthy over there.\nYou guys got to hike everywhere.\nI think the food is better for sure. I think the food I think I've\nfor sure\nI became lactose intolerant when I came to America. Uh cuz I had raw milk and then I vomited green bile for a couple of days.\nYou ate raw milk here?\nI had like a gallon of raw milk in a day.\nSo raw milk, not um pasteurized, not\nI got it from the farmers market. The guy looked really strong and healthy. I was like, I want that cool rightwing milk.\nGave you lactose intolerance.\nI don't know. I like the milk so much I like to believe it wasn't that. But it was the next day too much of it. I think I got some sort of weird bacteria, but I was Yeah. Oh, green bile. Both ends.\nReally?\nYes.\nLost.\nRight now, you're destroying the raw milk industry single-handed.\nI would like it. Also, it was the most beautiful milk I've ever had.\nYeah.\nI don't want to be negative about raw milk. If you're going to have it and it doesn't do that to you,\nI think you had the raw milk.\nI have.\nIt's like drinking a secret.\nI think raw milk should be like raw meat. Leave me alone. Leave me alone. I know how to cook a steak. Right. You don't You don't tell me how to cook a steak. Let me buy raw milk. Let me buy it.\nYeah.\nIf you let me buy raw meat, let me buy raw milk. Shut the [ __ ] up. Now, are you saying that it's killing people? Okay. Where's your evidence? And is pasteurization and homogenization, which does make it more shelf stable and make it so that you could, you know, you can keep it in the refrigerator for a long time and it's still fine. You know, it has a expired by date.\nYes,\nraw milk goes bad quick. So, should you drink the bad raw milk? No, definitely not. But is there anything limit on how much you should have\nsuper beneficial about drinking the raw milk? Well, there seems to be a lot of evidence as long as it doesn't have bacteria in it. Okay. Well, how do you prevent that? Well, I feel like we can do that. See, this I don't think the solution\ndoesn't feel especially well regulated at the moment. I bought it from a guy's muddy van.\nOh, yeah.\nAnd then as I was vomiting and [ __ ] I was like, this doesn't feel natural.\nYou got to get it from a reputable farmer. But if you get it from a reputable farm, they exist. There's like a whole list where you can find raw milk cuz people are raw milk nuts which is also what turns me off to raw milk. The raw milk I with for about 6 hours I thought I had the greatest insight anybody had ever had. This is the special milk we should all be having it until it started blowing out your body.\nMaybe you just drank too much.\nI did. Everyone else in the family was fine. My wife, my kids, they little bit. They had a little bit. Yeah, you probably drank too much. I mean, if you drank too much of anything, you'll get diarrhea. And think about like how much you're you're dealing with. How much like milk fat and how much liquid you can get diarrhea just from that.\nOverdosed on the milk.\nYeah, that's I wouldn't blame.\nI've never had a milk problem before then on the pasteurized milk.\nSo now you have a milk problem. How so?\nI [ __ ] uh Oh, a big heavy weird.\nSo it gave you lactose intolerance.\nIt hap I liked the milk so much I don't want to blame the milk but I will say it happened at the same time.\nOkay. So is\nBut from then on, are you getting lactose intolerant every time you drink raw milk or regular milk?\nRegular milk. Maybe maybe my body got used to the beautiful raw milk and it would only happen.\nHave a hard time selling that to the wife. We're getting the raw milk back in the house.\nYeah, that might be it, dude. I know that sounds crazy, but that might be it. Like your body might prefer real milk, and now that it knows what real milk Yeah. It's like [ __ ] you with this boiled\nwith the bread. But I think this happened. I mean, something something's happening with the bread in America.\nThat's like my hands feel swollen.\nI don't personally have any problem with homogenized and pasteurized milk. Like when I drink it, it doesn't make me feel bad. I don't feel great, but I I'll will do it if I have like cookies and milk.\nBut\nOh, cookies and milk.\nYeah. But I don't think that you should be able to tell people that they can't sell raw milk. I think you should tell people if you're going to sell raw milk, it has to meet some certain standards. You have to have certain standards of how you cool it, what you're doing, making sure everything's clean, everything has to be inspected. But they do that with other stuff. That's what's USDA standards are definitely put together by big business to crush small people.\nBut they do it that way anyway with meat. This is my point. There's USDA inspections. They have to make sure that the processing place is clean.\nEverything's supposed to be under and then even then they still do the like you know for a like a burger used to be one cow and they'd grind that bit up and now it's like a thousand cows coming together\nright I don't think there's laws against that right I think I don't I think that if you the the cow thing is a weird thing like when and you're getting burgers that have like a thousand cows DNA in it is a weird thing\nbut I mean it is just me right it's\nI think those standards are put there by the big corporate like I I was thinking about uh like housing zones and districting like in Australia the median house price is a million dollars. It's you just you can't buy no one in my generation is buying a home. It's a we there's so much land. There's a lot of stuff. You should just be able to like whip up a slum with the with your bros. You go to a valley where no one is. You all live in a that would be better to some extent rather than like renting in a horrible thing forever. You go used to be able to just like build a horrible thing. You know, there was no building regulations. Sometimes the ceiling would collapse and people would die. But\nso you think that's better to have no regulations?\nI Yeah.\nReally?\nYes.\nBut that's how like stadiums collapse on people in third world countries.\nNo doubt bad things will also happen.\nNo, that's a dumb idea.\nI I'm not saying no regulation. All right. I'm going to walk back. No regulation. But it would be nice if the regulation was somehow written just with the safety in mind and not so that I mean there are insane like there are buildings up now that are perfectly safe that wouldn't pass code if they were built today. You couldn't build them again. Now,\nwhy wouldn't they pass code?\nCuz they do things like, you know, the door has to be this far away from the stairs, the ceiling has to be this height, that it needs eight fire beeping detectors.\nYeah.\nIn the same way that, you know, like you can't cut hair without getting a degree. You need like a certificate to be a hairdresser. And they go, \"This is to make hair cutting safer.\" But like people were cutting hair without\nAll right, folks. Something special is about to happen in the Big Easy. UFC 318 is coming to New Orleans and it's absolutely stacked. DraftKings Sportsbook, the official sports betting partner of the UFC, has all the action you need. We're talking Holloway versus Porier. The trilogy, the BMF titles on the line. But more than that, this is Dustin Porier's last fight. That's it. The final walk. One of the all-time greats. You taking Holloway's volume or Porier's power? If you've never bet with UFC with DraftKings, don't worry. Just pick something simple like a fighter to win and make your pick. That's it. Straightforward and easy. And check this out. New customers who bet just five bucks. Get 150 bucks in bonus bets instantly. That's a huge boost to get started. Don't miss Porier's final fight. Download the DraftKings Sportsbook app right now and use the code ROGAN. That's code ROGAN for new customers to get $150 in bonus bets instantly when you bet just five bucks. Only on DraftKings. The crown is yours.\nGambling problem? Call 1800 gambler. In New York, call 8778 hopey or text hope and wy at 467-369. In Connecticut, help is available for problem gambling. Call 888789-7777\nor visit ccpg.org. Please play responsibly. On behalf of Boot Hill Casino and Resort in Kansas, 21 and over. Age and eligibility varies by jurisdiction. Void in Ontario. Bonus bets expire 7 days after issuance. For additional terms and responsible gaming resources, see dkg.\n\n\nOkay, cutting hair is not as big an issue. I think we should go back to the houses.\n\nAll right, go ahead.\n\nLike, if you want to save lives, you want houses that you can escape in the case of a fire. And if you don't absolutely if you don't hold the builder accountable, the person who's making that house, even if they're making it for themselves, they will then sell that house to someone else most likely, and that person will not be in a house that's necessarily the safest it could be. It just makes sense.\n\nIt would result in big problems.\n\nYeah, it makes sense for it. But it makes sense. No, no, no, no, no. It makes you. You have to be. Listen, when I was a kid, I grew up in construction sites. My father was an architect. My stepdad was an architect. So, when I was real young, I got to see like real shitty construction, how dangerous it is when people like [ __ ] around, don't follow code. Yes. What? How many like shady guys do a bad job? How many people try to like use lesser materials than they're supposed to be used? It's constant. And if you don't have regulation, you put people's lives at stake.\n\nI don't think America has the same problem with regulation here because you guys seem to be able to build houses like houses.\n\nWell, we have a lot of regulations though. Like that's giant contention with people.\n\nThere's a way to do it in a way that is just to help industry make house prices stay high. Well, that's true, too. Both things can be true. I think there there's definitely people that take advantage of regulation and there's definitely people that most likely stifle other businesses growth through promotion of regulation. That's probably true, too.\n\nBut also like for some stuff like for safety stuff in homes, you [ __ ] need regulation because if you sell it to my mom and she doesn't know how anything works and then the house catches on fire cuz Yeah. It's just do it the right way. They know how to do it the right way. People have established a system. Now, there's a bunch of [ __ ] that's arbitrary that gets aesthetic and I'm not in favor of that when people get to decide what, you know, the front of your house should look like or what color you paint it.\n\nI mean, you can make something safer forever though and there's no limit. There's no like there's no zero that you can reach of safety. Yeah.\n\nAnd there comes a point where the effort goes up to the extent where it's not.\n\nNo, but you hit a reasonable level and then you stop. And that's what the regulations say.\n\nWe never stop. I mean, I think with driver's licenses, you should have some uh test for competency to drive a car.\n\n100%.\n\nIt should be something. But when I mean in Australia when I was trying to get I didn't get my license till I was like 27 cuz it took forever. Like you got to get a 100 hours registered. You got to do a weird test. I got a driver's license in Ohio where I don't think road fatalities are that much higher than the rest of the\n\nWell, and you know, you get in the car, you drive around the block, the guy goes, you know how to operate this vehicle. We're going to say it's not going to cost, you know, $1,000 and yeah, it's more straightforward. There's like there's a balance to be gotten to be gotten right and\n\n100%. I think you're 100% right.\n\nI relish in America that you're closer to the freedom side of things.\n\n100% definitely much more than Australia is. And you got to see that during the pandemic, too.\n\nBut the the thing is like there's a difference between overregulation and wild west, right? There's like a fine line. There's like a there's a comfortable middle and I think that middle has to be fought for because I think it really is important to have people that are actually experts that their job is to make sure that someone builds a house correctly go and look and make sure you do. But then again, you open the door, the possibility that that inspector guy is a douchebag and then he's got a chip on his shoulder and he's got a big [ __ ] ego and people bribe him and you know, there's there's always a possibility of that kind of stuff happening too, where people love to have control over people. They love to tell you you can't build. They love to tell you you got to repaint your house because it's the the the color doesn't match our community.\n\nHow do you check that? How do you like what is the other than like everyone having a gun and getting ready to a simmering level of violence and revolution?\n\nYou got to fight back before they ever get to that point. It's real hard to regain ground once someone takes ground with like ridiculous legislation. Like look, they've been trying to legalize weed in this country for [ __ ] 50 years and it's they barely put a dent in it.\n\nThey've only done a state level.\n\nThey've only done it on a state level. But the point is it's like once you lose rights, you know, like if they tried to if marijuana was legal just like alcohol and all a sudden they tried to make it illegal, people would riot in the streets like what are you doing? You can't do that because it wouldn't make sense. People would be furious. But once it's done, even if it's the same exact situation, the same exact data, the same exact safety profile, the same exact number of people using it in the country. Yeah. It's just it's been it's been [ __ ] because it got put into this weird position.\n\nBut you guys you got prohibition somehow. You got alcohol taken off the streets for\n\nYeah. But it was it was bad.\n\nBad and it lasted a long time and it led directly into marijuana prohibition.\n\nYeah.\n\nSame exact people.\n\nBut you just need to find something to have prohibition against.\n\nHow about cartel prohibition? How about that? You know, how about fentanyl?\n\nDon't stop thinking about things. But then you you find out like, \"Oh, wait a minute. Wait a minute. There's a lot tied to this. It's like the alcohol lobby doesn't want marijuana to be legalized. So, they fight against it and they get politicians that are on their side. Hey, Ralph, you're going to vote for this issue on our side, right?\n\nThere's no way Ralph came over.\n\nRalph\n\nRalph Nader.\n\nNo, no, no. Not that guy. He doesn't do that. But, you know, that's that's part of the problem too, man. It's like there's a lot of money involved in keeping it illegal and like Jesus Christ.\n\nBut, at least you can have I think America is one of the only countries that primaries. You can actually like get into a political party and if there's enough will, you can do something. You can like change.\n\nThey wouldn't even allow it for the Democrats.\n\nThe primary\n\nfor the last election there was not even on presidential level they're more uptight. But on like\n\nwhat does that mean? What does that mean?\n\nThey got the superdelegates and they got secret emails and it's not good. But the fact that you could even have a system to [ __ ] up is I think unique to like in Britain the party picks who the person is. And if you're in the party, you get a huge benefit.\n\nOh yeah.\n\nThat you can't have like a grassroot. You can't have like the branch of the party go we're putting forward a guy who's we're going to primary somebody.\n\nYou really can primary people in America.\n\nYes, you can sort of. But not for president. Not not last time.\n\nAnd they they don't let certain people in the primaries like they're keeping RFK Jr. out of the primaries.\n\nYes. And then running as an independent is very bad.\n\nBut that's not good.\n\nI'm not saying you're living up to it. I'm not saying you're living up to the standards you set, but you're also the only ones who there's even like people go, we should be able to do it.\n\nPeople wanted Trump to lose so badly. They were willing to throw democracy out the window.\n\nThat's kind of what it is. I mean, kind of what it is.\n\nIf you if that was coming from the Republican side, people would have been outraged.\n\nTo do it in the name of democracy was very weird.\n\nWild. And then also I remember one of the\n\nso Orwellian\n\nso like my first week here there was a Biden speech where he was talking about how like violence has no he was like hopping on about January 6 and stuff and he was saying violence has no place in the American system but then the example he gave was the American revolution like I think that gets for you're meant to have I think Benjamin Franklin wanted everyone having an armed uprising every like 12 years or something to wipe the slate clean.\n\nYou're meant to that's part of democracy. Ah do you know about Castro?\n\nWhat about him? I've just I've I'm in a big Wikipedia wormhole about Castro. I didn't know that he hid that he was a communist until he he wasn't a communist or he kept that quiet. He was like a middle class revolutionary and then uh his brother was a commie but he was like he didn't come out and say he was a communist until later and the CIA helped him. I've been reading Castro speech helped him take over.\n\nIt looks like the CIA might have been and then towards the end they said we got to get out of this. This is no good. They really they changed horses.\n\nJesus Christ. They were really involved on both sides, but they were uh\n\nDo we do that everywhere?\n\nThere's one Aussie there's one Aussie that you might have done. Uh Goff Whitlam might have been taken out by the CIA.\n\nJeez.\n\nNo, he was uh he was also a problem and people were quite happy to have him go, but the governor general, man,\n\nbro,\n\nI don't have to go into too much detail is look it up Pine Gap. you have a military base in Australia and he wanted to like get rid of it or get off American energy subsidies or something and then all of a sudden he was removed.\n\nOh boy.\n\nAnd we haven't rocked that boat again.\n\nWe are so good at that.\n\nYeah.\n\nBetween us and the Israelis. The Israelis do the wildest assassinations. Like did you see the one of them that they did with the Iranian generals?\n\nLet's see. Make sure that this is true. Jamie,\n\nI can get my visa removed for criticizing Israel.\n\nNo, no, no. It's this is a this is not I'm impressed by their beautiful assassination.\n\nThis is not a this is not a criticism. This is saying like this is one of the most gangster things I've ever seen in my life. They made a fake phone call to all these military leaders and said everybody's got to meet at the bunker and then they blew the bunker up.\n\nThat's very Godfather.\n\nThey know what they're doing.\n\nIt's gangster as [ __ ] And then you add that to the pagers.\n\nThey they sent pagers out like didn't they send them out like a long time in advance?\n\nYeah, I think so. And they got in on the supply side of it. Like they made the pages and they managed to\n\nI mean you think about how incompetent some forms of our government are.\n\nYeah.\n\nAnd then how good they are at killing people that they want dead.\n\nThey could do that with holes in the Midwest. That would be great. We could move people out of the CIA.\n\nSame level of Well, that's not CIA. That's the MSAD. But that's the same level of int or the IDF or whoever does it over in Israel. But the same level of intensity with other things. You could dominate the world.\n\nI mean, we could get a train going an actual fix highspeed rail in Texas. I believe in it.\n\nImagine if they took that same kind of ingenuity and tried to fix poverty in America.\n\nBrian Simpson had said a good he was on stage for bottom of the barrel and he knocked like someone knocked the barrel over and they all had to pick it up and he goes, \"That's the one thing that could go wrong. We should really fix that. We're never going to. It's like America. We have the resources to make sure that never happens and we won't.\"\n\nYeah. No, we won't. But it's we put all of our effort into making [ __ ] that kills people quicker. That's like the most amount of money, the most amount of effort other than like consumer goods.\n\nI would I would say also sport is it at some weird very high level here because that's war.\n\nIt is. It is a very militarized society. Everyone's getting ready to\n\nYeah.\n\nI Yeah. I mean, football is just military strategy.\n\nHave you ever seen Serbians play basketball? Uh, yes,\n\nbro.\n\nYeah, I've seen clips of that.\n\nI've seen Crips clips together Serbian crowds play basketball.\n\nThey're big.\n\nIf that [ __ ] doesn't feel like war, the way the crowd is responding, the cheering, the [ __ ] enthusiasm, like, dude, I watch it all the time just for inspiration.\n\nThey're also the only guys other than black guys who can compete in. It's the only whites who are contributing to basketball at this point is the Yugoslavian.\n\nYeah. The giant whites from a warlike culture.\n\nYeah. No one else. Sometimes an Aussie gets through. We've had like two Aussies break through.\n\nBro, Serbian fighters are terrifying.\n\nThe dudes from like the Caucus region, like all the guys from like Dagistan for Georgia animals.\n\nThey couldn't get it to work, dude. Someone just printed something or posted something about the UFC's top pound-for-pound list and six of them are from the Caucus region.\n\nSix of them.\n\nThat seems high. But there's also sometimes that's like a genetic like all the like marathon runners tend to be from one mountain in Kenya. There's like the elite of the elite.\n\nYeah. Like people go black people are good at marathon running. But then when you boil it down it's like okay but 90% of them are from Kenya and then 90% of those people are from one mountain in Kenya where like the air is very thin.\n\nOh. So they've adapted.\n\nThere's a book called Taboo which is about race difference in the in like all sports.\n\nUhhuh. and they break and they're like you're this likely to you know you can't be a white corner now there is one I think but like rare that there are it's very rare and it's very strange and some of it's social stuff but a lot of it is uh like I was reading a thing about\n\n\nMexicans can't get knocked out.\nThat's not true.\nNo, there must be some, but there's like some gene that is very common in the Mexican population that makes it less likely that you'll be knocked out.\nWhat, really?\nI think that's why they have lots of boxes.\nAm I... I'm... I'm half remembering something I read on Wikipedia late at night.\nWouldn't that be crazy if they have such a history of boxing that boxing has somehow or another gotten into their genes to have strong chins?\nWhat came first?\nYeah, right.\nThe chicken or the egg.\nAm I right?\nAny connection between Mexican men, the specific gene ACTN3?\nSaw a video on how Mexicans are so good at boxing.\nMexico's produced 209 champions.\nThat's pretty incredible.\nVideo explains how Mexicans supposedly have a gene that has the ACTN3, which determines endurance and/or strength, one or the other.\nI was wondering, is there any truth to this?\nWhat's the answer?\nThis is about what I need to believe something is a Reddit post from four years ago.\nNo, if you... if you look down there, is this just one person's post?\nDid someone answer them?\nWell, I didn't want to get into the answers because you never know.\nThat's where, like, his point.\nYou never know where this goes, right?\nI was just going to start there and then start.\nLet's find out if there's... Yeah, anything to that.\nIt's fascinating.\nBut I would wonder because if, like, you think about, like, a history of boxing.\nYeah.\nBoy, Mexico has such a history of boxing.\nAnd also, there's a high level of poverty.\nSo whenever there's a high level of poverty, there's a lot of sports where you don't need a lot of money to play them.\nSoccer's one.\nBoxing is another one.\nYou just need gloves and you could just [ __ ] around and guys be good.\nIf I'm... so there's... I was doing a bit about this, and I could never get it to, like, really fly, but like Kyrgyzstan, they have a wife wrestling.\nYou wrestle a woman into a van.\nIf you want to marry a woman in Kyrgyzstan, you like...\ntoday...\nyeah, they call it Alaku.\nAlaku.\nAnd there's a big Wikipedia page on that.\nYou got to get this lady in the van against her will, and then once she gets in the van, she's so ashamed that she marries you.\nBut like, the one sport they're good at at the Olympics is women's freestyle wrestling.\nThey're great at that.\nSo what came first, the medals or a van?\nDid they have to get good at wrestling 'cause men kept putting them in vans?\nOr were they so good at wrestling the men were like, \"Let's let them show off their beautiful skills?\"\nThat's a really good question.\nI would imagine they were fending off men for a long time, so they had to develop technique.\nI assume it was a horse before it was a van.\nJesus.\nYou can wrestle because they only got the van quite late.\nThere's no way.\nAnyway, that's one day I'm going to make that fly.\nIf it's a part of your culture, I would, you know, Jesus.\nYes.\nBride kidnapping.\nJesus Christ.\nYeah, there's a lot of vice.\nUh, we are breaking the law, says Mediev.\nBut everyone understands the tradition and you can't change it.\nWow.\nMember of a local government, a small village outside of Kirr's capital.\nHow do you say that?\nBishquek.\nBishkek.\nYou think?\nI guess it's as good as mine.\nBut everyone here understands is a tradition and you can't change it.\nOh, okay.\nMedivh kidnapped his wife Elmyra more than 10 years ago.\nHe's one of many Kirrs men who have gotten married through the Central Asian practice of bride kidnapping.\nAnd they go like 80% of the time, it's consensual, like they organize, but then 20% of the time, you're just wrestling a woman into a van against their will.\nSo there are consensual kidnappings where two people know each other and it's kind of roleplaying.\nThen there's full-on off-the-street abductions.\nUnfortunately, they both look the same.\nYou really want a safe word for them.\nWhoa.\nIt could be hard to tell if the girl you see crying for her mom and clawing at the faces of her abductors is merely acting out her part for her boyfriend and his family's sake or is actually on her way to being married against her will.\nLike, what the [ __ ]?\nVery important to be able to tell the difference.\nI would say I don't want to pass judgment on the people of Kyrgyzstan.\nThis is the thing about the world.\nIf you go back like 6,000, 7,000 years ago, it was all like that.\nYou can go back to a hundred years ago and everyone... they were footbinding in China.\nThey were having beautiful...\nstill doing it.\nDidn't they... can't still be binding the feet?\nPhotos of it.\nThey still footbinding in China.\nI mean, I don't know how widely practiced it is.\nThey're older ladies.\nYeah.\nI know when they stopped, but I don't think it was that long ago.\nLike, there's people that are alive right now that have those feet.\nWell, I'm for it.\nYou don't want some filthy peasant foot on your wife.\nYou want a humble, graceful...\nbro.\nYou better keep those socks on.\nThey do.\nI was reading about those.\nThose feet are weird.\nThey are.\nThey look like they're folded in on themselves.\nIt's so painful to walk.\nSo I think it's Cameroon, they do chest bind, like they... they flatten a woman's... when she starts getting breasts, they, like, you flatten the breast.\nBut what's weird is that it's the Christian progressive people who are doing it because the culture is once a woman has breasts, she has to get married and she has to come out of school.\nSo because you love your daughter, you iron the boobs down so that she doesn't have to get married for a couple years.\nIsn't that funny?\nJesus Christ.\nThey should put an end to it.\nUm, last shoe factory making Lotus shoes closed in 1999.\nWow.\nIt could be some Michael Jordan lotus shoes.\nLotus shoes.\nOh my god.\nSo, when did this start?\n1200s or something like...\nWow.\nThe 1200s.\nOh, we got... Look at that lady's foot.\nLook at that lady's foot.\nLook at that.\nThat is so crazy.\nI just see... I just see beauty.\nI just see...\nI see painful pinky toes.\nHow is that lady ever going to take, like, an aerobics class?\nLook.\nLook how it's become part of the bottom of her foot.\nThat's so crazy.\nHow badly does that [ __ ] with your back?\nIt's so big on that screen.\nI'd never seen them that big before.\nBro, those feet are busted up.\nBut the commies stamped it out mostly.\nThe commies got rid...\nNo, you got to be...\nYeah, you can't partake in the great glorious revolution.\nOh, the Lotus shoe.\nThey are beautiful shoes.\nThat's so crazy.\nYou can't buy them.\nStraight to shopping.\nYou never know.\nIs that the same thing?\nNo, that's a brand name.\nThat's a brand name.\nYou walk into your house, it's all OJ Simpson merchandise and footband Lotus shoes.\nActually, is pretty good.\nThat's hilarious.\nWhat a [ __ ] up practice.\nYeah, there's a lot of them.\nYeah.\nWhat about the one where women put plates in their lips?\nOh, plates in the lip.\nThe neck extension.\nMhm.\nI love the ring neck extension.\nThe ring neck extensions don't even make sense.\nLike, how does that work?\nLike, if you take it off, will your head fall off?\nLike, do you have any muscles left?\nDo you have any muscles left to support your head?\nI would doubt it.\nLike, do you have to keep that on for the rest of your life?\nI don't think they're meant to be that long.\nNo, I think... Bro, that's [ __ ] insane.\nThat's insane.\nJust one guy saw a giraffe and he was like, \"Can we do that?\"\nSo in... Is that a Photoshop?\nIs that Photoshop?\nIt's the same person in multiple...\nThat's really legit.\nBut there's a young lady doing a photo.\nThat can't be real.\nThat can't be real.\nThat lady's head is 15.\nThat's like... That last one's like AI porno for neck guys, bro.\nThat's so dark.\nThat's so weird.\nLike, I don't like that at all.\nYeah.\nVideo of it.\nSo...\nOh, don't show me.\nOh, they just keep piling those things on and fitting them.\nYeah.\nWhat a... what a weird thing to do to your neck, man.\nThat's got...\nBut we do weird stuff.\nWe inject lips.\nBut, bro, that's crazy.\nShe's got a towel under her chin, but they could be watching it being like, you know, in America, they chop off a little boy's penis and they turn it into a pretend vagina.\nIsn't that sick and wrong?\nWell, they probably do that there, too.\nAnd I would agree with them.\nThat's a very important part of our culture.\nI wonder if they do do it.\nYou know, I... I... someone in the green room was saying the other day the reason why there's so many lady boys in Thailand was because being homosexual was illegal.\nIs that true?\nIt wasn't illegal everywhere.\nBut like this person that said it is just... they said it in passing.\nI don't know if it was true, and I was... I meant to Google it and I totally forgot until now.\nI mean, it could be...\nI'm pretty sure it was illegal all over the place and no one else was doing that.\nNo one else had that particular reaction.\nWell, you know, that's the... the thing about um... um... what is that [ __ ]?\nTuring.\nAlan Turing.\nYeah.\nAllan Turing was the guy who invented the Turing test.\nAnd he was gay and they...\nYeah.\nAnd they [ __ ] poisoned him.\nThey gave him, like, hormone blockers.\nWas it just 'cause he was gay?\nYes.\nThere were so many gay British guys, though, who they had, like, a long history of, like, Oscar Wilde.\nEveryone knew he was gay.\nAnd it was only when he went after a guy's son that I think they went...\nOh, yeah.\nI think he went after a guy's young son.\nWell, they could always target you for it, though.\nIf they want to get you for something else, they will.\nYeah, they use that.\nBut I think Byron was off.\nBut he was like hospitalized.\nLegality of samesex activity.\nPrivate adult consensual and non-commercial sodomy was decriminalized in Thailand in 1956.\nHowever, samesex attraction and transgender identities were still seen as socially unacceptable in many cases.\nThose with gender expression or behavior falls out of social norms are less likely to be tolerated or accepted.\nSo what happened?\nJust this year, they've allowed samesex marriage.\nAnd uh...\nthey've allowed adoption from this year, but uh, that's very late to it because I think a lot of gay couples have been going there to get children for a long time, and now they're saying you can have them here.\nLike, that's a big... that's not spoken about is the... the renter womb and the...\nit's kind of bizarre.\nI'm against it.\nIt's very strange.\nThe idea of a surrogate is very odd.\nLike, you're having a baby, but it's not really you having the baby.\nLike, okay, I get it.\nIf someone can have a baby, the couple wants to have a baby, they hire a surrogate.\nI get it.\nIt's your genes.\nIt's your baby, but it's still... it's like...\nbut also there's... I mean, I know Elon has, like, a lot of kids with different ladies, but then I mean, that's the public one.\nHe's like a... a one of the only public-facing billionaires.\nThere's got to be guys out there who are like, \"I'm getting... I'm getting 10,000 kids.\nI'm like, take my [ __ ] and move it out across.\nI'm going to be Genghis Khan with science.\"\nWell, guys have done that that are doctors.\nThey just put their own [ __ ]... there's a breakout case in one of those.\nThere's a guy who's... there's maybe a thousand siblings in Adelaide, my hometown.\nOh, man.\nIt's every time guys get a chance, they do it.\nSurrogacy has a long history dating back to ancient times with the real examples found in Babylon and the Bible.\nWhile traditionally involved natural conception, modern surrogacy, including artificial insemination and invitro fertilization, has been developed through scientific and legal advancements.\nOkay, but the thing is, it's like they're just playing with words.\nHold on.\nLet's go back because they're saying surrogacy for someone having sex with someone and getting them pregnant and having a baby.\nThat's not surrogacy.\nYou got a pregnant with...\nthat's a mistress.\nYou... Yeah.\nYou... you got another lady pregnant.\nThat's all that is.\nSo what we think of as surrogacy is you taking an embryo and inserting it into another woman's womb, right?\nYeah.\nThat's a completely new thing.\nAnd I think it's weird.\nIt's common in, like, wives of soldiers.\nThe other one's like an agreement.\nLike, if the wife can't get pregnant, but she wants to have a baby and she says, \"Listen, if you [ __ ] my best friend, she'll have the baby and then we'll... we'll take care of the baby.\"\nYeah.\nAnd I know that I can't have babies, but you... you know, if that's... if you guys were that kind of swingers and you're down with that, and that's... that's up to you.\nThat feels different from the science.\nIt's not surrogacy.\nYou just had a baby with a different human.\nNo, surrogacy seems right... bad and wrong.\nI'm... I'm... I'm digging in.\nWell, bro, it's going to go to artificial wombs.\nAll right, that's going to be the new one.\nAnd whether that's 20 years from now or 50 years from now, you're going to be able to make a baby outside of a human body.\nIt's going to get real freaky.\nWe got to be... We got to draw a hotline.\nWe pulled this up.\nI was... The IVF thing gave me a weird thought.\nI'm a little stone thought.\nIt's not possible how Jesus was born, was it?\nThey didn't have any sort of way to show fertilization back then.\nIVF just, like, forgot about it.\nCould be.\nCould be that they had that technique.\nTammy was the Holy Spirit.\nI'm just... I... I know what they say.\nI'm just...\nBut like...\nYeah.\nWell, devil's advocate, obviously, but...\nWell, for sure they could have um... inserted sperm into her without her ever having sex.\nThey could have impregnated her.\nI think there's like...\n\n\nDolphins that can do it.\nIf dolphins are on their own for a long time, then an egg can fertilize another egg.\nWhat?\nIt doesn't happen often, but there are examples of it.\nReally?\nYes.\nThat's nuts.\nI think I believe that I've read that.\nYou sure?\nI've said that loudly and confidently at a party before.\nMammals.\nIt might have been.\nThat sounds so crazy that a mammal could do that.\nDolphins don't lay egg.\nOh, inside.\nI guess inside of them.\nThey can.\nI'd be so happy if I was right.\nI think it's like a couple examples of auto insemination.\nSo, it's like one of the eggs has so much jizz in it that it leaks out.\nYou get a very butch egg.\nYou get a trans egg.\nYou get maybe one of the eggs is male and it just jizzes on the other egg.\nYou know, it's an early developer.\nYeah, just like comes out of maybe jizz is like in some of them out of the box.\nI think there's virgin birth in nature.\nIt's not common.\nDefinitely animals switch genders that the animals like especially like primitive reptilian type [ __ ] weird animals.\nYeah, they can there's certain animals that can switch their genders.\nI think seahorse ladies have a penis.\nI think so.\nAm I getting that?\nYou know hyenas have a penis.\nFemales?\nNo, I didn't know that.\nBigger than the males just for show.\nJust No, they dominate the males that they're bigger than they peg the males with their female hyenas.\nThey're one of the rare matriarchal mammals.\nSo, the females are bigger than the males.\nThey have more testosterone than the males and they have bigger dicks and they hold the males down.\nYeah.\nYou want some of this [ __ ] And then the male has to take his little dick and stick it inside of her big dick.\nWell, but the big lady dick just slapping against his belly.\nYeah.\nHey, you want to hear even worse?\n60% of all hyenas that are born suffocate to death during childbirth coming out of that dick.\nCuz they're coming out of They come out of the dick.\nThe vagina's on the tip of the dick.\nNo, it's it's really a vagina.\nIt's a vagina, but it's like a Can we see the hyena?\nOh, it's it's bananas.\nIt's bananas.\nI want to cuz I It's called They call it like a faux penis.\nNow, I think last time Shane came on here, I think you guys were talking about the trans penises, and then he just kept texting me the trans penises.\nOh, he's horrible at that.\nHe's horrible.\nJust wake up in the middle of the night to trans skin graph scars.\nYou're like, what am I looking at?\nWhy is it so much bigger than mine?\nWhy can't you have a humble penis?\nI've got to see.\nWow.\nYeah.\nAll right.\nSo, female hyenas have this giant fake dick and um Ah, yeah.\nIt's huge.\nThey have to put their penis the the boys have to put their dicks in Exactly.\nAnd that's how the the babies come out of that.\nAnd a lot of the babies die on the way out.\nDestroy all the hyenas.\n60% I think.\nI think that's the number.\nLet's make sure that that's the correct number.\nI'm pretty sure it is.\nI think it's the hyena people will be furious if they 60% suffocate during childbirth.\nAnd then on top of that, like then they fight over who gets the nipple.\nAnd some of them get killed.\nWell, that's why they're so unhappy all the time in the Lion King.\nThey're just in the most ruthless environment and they're not the biggest animals.\n18% mortality first time mother.\nThat's the mother dying.\nOh, 9 to 18% the mother dies.\nJesus Christ.\nThat's crazy.\nGot eyes out.\nCould you imagine 80% of the women dying because they they're giving birth?\nYeah.\n60% of all spotted hyena cubs uh die in the early stages of life, especially from the first litter.\nSome scientific observations place the survival rate of firstborn cubs at around 40% or less.\nWow.\nSo, siblide is huge.\nMhm.\nSiblide's very huge.\nThey they fight to the death over like little nipples and like stepdads I know come will in the animal kingdom.\nWell, that's also why female hyenas I think are bigger.\nI think they're going to protect.\nYeah, I think they're there to because the men hyenas are [ __ ] and the men probably eat the babies because that happens in other commun like that happens in bears.\nIn the bear world, female tigers or female bears rather.\nThe reason why when you stumble upon a female bear, she's ready to [ __ ] you up.\nLike that's the worst thing that can happen in the woods, you stumble upon a female bear with their cubs, you're in real trouble.\nIf you stumble upon a male and you let go, he might he might not have any interest in you at all.\nBut if you stumble, if you're too close to the Cubs, if like she is in front and the Cubs are behind and you're behind them, you run away.\nNo, bro.\nYou might not have the time.\nShe might just come for you and you can't do a goddamn thing about it because she's dealing with male grizzlies eating her cubs all the time.\nSo, she's always on 10.\nI mean, if we go to Yuseite, should we bring a gun?\nYou shouldn't go off trail for sure.\nYou shouldn't go off trail.\nYou should definitely bring bear spray if you're anybody.\nYoseite is in California, right?\nI've [ __ ] this up before.\nYellowstone has the grizzlies.\nWyoming.\nYoseite has the black bears.\nBlack bears generally aren't as dangerous as grizzly bears.\nAre they grizzly bears in California?\nNo, there's not.\nEven though it's the flag, the state flag.\nIt's the bear on the flag.\nThe flag misled me.\nWell, they killed um too many people and they they killed them all.\nBut they've got coyotes still running around.\nCoyotes don't really kill people though.\nThey kill your cats and dogs.\nMountain lines occasionally kill people, but grizzlies were killing a lot of people.\nI feel like you guys have way more animals that kill people than we do.\nOh yeah, for sure.\nPeople talk about our animals all the time.\nWe got a snake and we've got a spider that you want to watch out for.\nYou got saltwater crocodiles, [ __ ] Yeah, but if you stay away from the crocs, what are you talking about?\nYou just just keep away from far north Queensland.\nBut they are are Yeah.\nBut you So you have to avoid a whole part of your country because it's infested by monsters.\nWe were happy to give that one up to the Japanese.\nWe made a deal that if the Japanese invaded, we'd let them have the saltwater crocodile part of the country.\nHave you seen uh is Bob Kata?\nThis is like our best clip from a politician.\nHe's talking about gay marriage and he turns it into talking about crocodiles.\nNo.\nOh, Bob Kata crocodile.\nThis is my favorite.\nHe he wins his far north Queensland seat every year.\nHe's not in any party, but he's like I'm Yeah.\nLet let a thousand blossoms bloom.\nOh yeah.\nLet me hear it.\nI mean, you know, people are entitled to their sexual proclivities, you know.\nI mean, let there be a thousand blossoms bloom as far as I'm concerned, you know.\nBut I ain't spending any time on it because in the meantime, every 3 months, a person is torn to pieces by a crocodile in North Queensland.\nHe's the man.\nHe needs more power in our government.\nEvery three person is torn apart by a crocodile in North Queensland.\nIs that true?\nI believe it.\nJesus Christ.\nWell, there's a lot of, you know, a lot of people.\nThere's a lot of every imagine this.\nYeah.\nWhat if every 3 months someone got killed by a werewolf?\nWould you still go out at night?\nYeah.\nYes, I would.\nEvery 3 months someone gets killed by a werewolf in your town.\nI mean, how many people are dying on the roads every day?\nI understand, but there's something uniquely terrified about getting eaten.\nThe Crocs never got Steve Owen.\nThat was the That was the raise.\nI'm more upset by the rays.\nWell, how to handle the Crocs.\nWhat's that?\nFour deaths since 2020 and nine non-fatal attacks.\nOh, it's [ __ ] Well, that's No, it's still getting You just didn't die.\nYou got ripped apart, though.\nNine.\nYeah, but that's not three.\nThat's not like what he was saying.\nHe saying come down.\nHe was bad.\nWhat was his number that he was having?\nHe said three a month.\nDid what did he say?\nThree months.\nAlso seven years.\nEvery 3 months.\nEvery three months.\nOh, every three months.\nWe might have clamped down on it.\nThat's only four a year.\nYeah.\nBut also there's, you know, you're not walking through the city.\nYou're not walking through the city and going the crocs are going to come and get you.\nYeah.\nBut if you go anywhere near a lake and you make the wrong kind of vibrations.\nYeah.\nThey they were very I went to cans once and they were all very scared.\nThey come out so quick.\nThey come out so quick, dude.\nBut also, what a beautiful way to die if you have to die.\nNot beautiful at all.\nNope.\nNope.\nHe was eaten by reptilian evil.\nThe last moments of your life will be horrible energy that you will pass on to the cosmos.\nYou will die in the most horrific way possible.\nIt's not that.\nThey all fit on two pieces of paper.\nYeah.\nWell, he's over.\nHe's over.\nThese are all the people that have been killed.\nCans cans.\nBoth.\nCape York.\nCape York.\nThat's up north.\nSo, there's a lot of non fatals in there where dudes very few people here.\nNo one, you know, we don't have We've got Cans.\nThat would be the the biggest city up north.\nWait, are those uh as large as the Nile crocodiles?\nThe saltwater crocodiles?\nI don't know how big a Nile crocodile is.\nWell, I think I only just saw an alligator for the first time.\nThey're not as scary.\nWell, you got to see a big one, dude.\nLady just got killed in Orlando by one last week.\nSalt water larger, more vicious.\nSalt waters are larger than the Niles.\nMore aggressive.\nBro, you have the most aggressive crocodiles in the world.\nWe got them and we got It's a lot of koalas and kangaroos.\nKangaroos are so friendly.\nYou have the most aggressive dinosaur in the world in your country.\nThat's why to get torn apart by one would be an honor.\nYeah.\nOkay.\nIt would be No.\nYou know what I would like to do?\nI'd like to get together with some special forces dudes and kill those [ __ ] from the air.\nOkay.\nEverybody thinks you have to keep them around.\nLet that pass.\nYou got to keep them around.\nYeah.\nI think maybe we keep three in a zoo and everybody else is dead.\nThey're beautiful.\nTurn them into shoes.\nYou know about the cage of death?\nWhat's that?\nYou can get into a cage.\nYeah.\nIsn't that Don't you show me that.\nThat's a good cage.\nThat's a strong cave.\nYou'd be fine.\nNo.\nNo.\nNo.\nPeople, why do you want to do that?\nDon't want to do Jesus.\nThat is such a monster.\nSuch a [ __ ] heartless monster.\nIf that thing opened up somehow accidentally, it would love to eat you.\nWhat is wrong with people?\nThere's a lot of scratches on it, too.\nGod, he's trying to get in there.\nLook at that thing.\nIt's so big.\nThey're so terrifying, dude.\nI mean, it is a [ __ ] monster.\nAnd that's not even a big one, man.\nI have a a friend, his name is Jim Shaki, and he's a professional hunter.\nHe lives in Canada.\nAnd uh they sent him to Africa to shoot crocodiles because they were killing so many people in this one village.\nAnd he said when he got there, there was this one particular big croc that was there that was just killing everybody.\nIt everybody was like missing a foot.\nEverybody had one arm.\nLike for real, like the jaws, but for crocodile.\nYeah.\nHe said it was crazy.\nIt's like so many people in this town had been bitten by crocodiles.\nSo they had developed this system where they put posts in the ground in the water so that they knew the crocodiles couldn't get into that.\nRight?\nSo what the crocodiles did was go around it and sneak into the water when the people weren't around.\nThey're impressive.\nBeautiful.\nHave you seen in India when they get like a puma in the village and everyone's standing on the roof and the puma's like running around the streets and the guys are trying to throw a net on it?\nYeah.\nNuts.\nIs that it?\nThe Philippines.\nOh my god.\n20 It's over 20 feet.\nIs that a saltwater one?\nIt looks bigger cuz they're very small people.\nBut that's so big, dude.\nThat's so big.\nThat's such a dinosaur.\nAnd then we turn it into handbags and shoes.\nThank god.\nI went down a rabbit hole the other.\nIt's so funny that people want to keep them around.\nI know.\nI'm like, I want to be real clear.\nI don't want them to go extinct for sure.\nI'm just mostly just [ __ ] around here.\nThey shouldn't be in residential.\nIt is weird that we tolerate a certain amount of monsters.\nIt's weird.\nTo reintroduce them seems nutty.\nOh, when people are bringing the wolves back, bro.\nThe thing they're doing in Colorado is so stupid because this is what they did.\nOkay.\nColorado took these wolves from Oregon that had been preying on cattle and then they moved them into Colorado where they prayed on cattle.\nYeah.\nAnd then the people whose cattle they were praying on got pissed off.\nSo they took a bunch of them and removed them and put them in Pitkin County over by Aspen where they prey on cattle.\nIt's the dumbest thing.\nEveryone's like, \"Oh, it's going to balance out the wild industry.\"\nNo, they're dumb.\nThey don't know what they\n\n\n're doing. It's wildlife. It's ballot box who's like, \"No, it's the the governor. The governor and his husband wanted to do it this way. They wanted to reintroduce wolves.\" Like, and but wolves were already on their way to being reintroduced to Colorado. They were doing it naturally. There's wolves. There's a pack of wolves that was established that had already made their way into Colorado. Colorado boils borders Wyoming. Wyoming has wolves. So, they were getting wolves. Is this a tourism thing or they just like\n\nLook, there's some there's some like real thought that could be put into whether or not an ecosystem should be balanced with the proper amount of predators. And if you, the human race, were responsible for killing off this one major predator that was in this ecosystem.\n\nYeah, that seems irresponsible and maybe we can bring that animal back and it would balance out the system. This is the thought process behind it.\n\nThe problem with that is these animals have become accustomed to just killing cattle. They did it in Oregon, then they did it in Colorado, and then they're doing it where they are now. And everybody wants to pretend it's not happening. So they want to pretend they didn't do that. They didn't do a giant [ __ ] up. These are not wild wolves that are going to go out and hunt down elk and and make the population smaller. No, they're used to preying on cattle.\n\nYeah. So, they're killing cows all the time. There's a lot of people who want to hunt, right? Like there are people who want to take out the animals that the wolves would have taken out.\n\nWell, yeah, but you you should have a balance. You should have mountain lines. like it like the wild can't you can't sterilize certain aspects of the ecosystem because they're dangerous to you.\n\nBut what you shouldn't do is take these animals and then moved them into an area where nothing is prepared. The the ranchers aren't prepared. No one warned them. They moved them to that area without letting anybody know. One of my friends has a ranch there. They release some of the wolves on his property. And these wolves now all of a sudden wolves that are used to killing cattle are killing cattle down there.\n\nYeah, cuz it would be way easier. They're easier. They're all together.\n\nYeah. They don't run away. They They stand still and you kill the cows.\n\nThey're like like in Britain they got rid of all the wolves.\n\nThey got rid of all the wolves everywhere, dude.\n\nThere's a reason why they did it was because wolves are like the most intelligent. They're like psychic super predators. They're the most intelligent of all predators. They're the only predator that we have in North America that hunts in a pack and they're big. You're dealing with a 100 pound plus animal that hunts in a pack.\n\nThey're bringing back the direwolf as well.\n\nWell, so that's different. Okay. This is not\n\nBut they were not bring\n\nThey're not going to put it in the wild. They brought it back to show that this this gene editing that they do for animals is legitimate. So to do that, they reproduced an animal from the genes of one of them. What was it? What were the numbers, Jamie? One was like 50,000 years old and one was like 70,000 years old when Beth Shapiro was in here.\n\nThe the lady who's like the head geneticist and brilliant woman. Uh she was explaining it all to us and it's just the whole thing is bananas. So they essentially didn't even know what they were going to look like until they came out.\n\nIs the hope that we get the dinosaurs?\n\nWell, they're trying to build Jurassic Park. 100% that's going to come if they have DNA from a dinosaur. I don't think they do. I don't think it's possible. I think it's too degraded when it's that old that you don't find like But maybe they'll find some.\n\nBut the Tasmanian devils definitely they're always trying to bring that back.\n\nNo, the Tasmanian tiger. Tasmanian devil.\n\nTy devils is they're around.\n\nThat's a weird one because they get cancer from biting each other. They get face cancer.\n\nThey all have weird I mean all the koalas have chlamydia.\n\nDo they really?\n\nYeah. Some Australian.\n\nWell, they're very cute. They're very It's the uh It's the Dong of the land. Those Tasmanian um devils. They bite each other in the face and they get these horrible face deformities. It's like it's like um communicable cancer. It's like cancer that they transfer to each other. It's really weird.\n\nBefore we got there, I don't think it has anything to do with us. I I don't think that's I think it has something to do with like whatever the [ __ ] is in their mouth, you know? It could be just all the horrible [ __ ] that they eat.\n\nYeah. And then they bite each other and their teeth are probably rotten and disgusting. I don't know. Like find Why do Tasmanian tiger or devils rather give each other cancer?\n\nLet's find out.\n\nWell, what are they?\n\nI mean, we could let them know. What are we going to brush their teeth?\n\nCan't do anything unless you can come up with a medication that stops it from happening like an antibiotic or something. I I just don't understand like how cancer can be communicable like that. Like you can just transfer it by biting. Seems crazy.\n\nYeah. If you if you got covered in a tumor, you wouldn't get cancer, would you?\n\nOkay. Devil facial tumor disease. It's a contagious fatal cancer that um primarily affects the face and the mouth area of Tasmanian devils. Disease has significantly impacted the wild population, posing a serious threat to their survival. What is it? DFTD is a transmissible cancer, meaning it spreads through the transfer of living cancer cells, primarily via biting.\n\nThey didn't notice till the 90s.\n\nWow. The tumors usually start as lesions or patches on the mouth and on the face and grow into large disfiguring masses. The disease is almost universally fatal.\n\nWhoa.\n\nSo, we must have done this. We must be somehow. But if if it started in the '9s and now they're going extinct because of it, but that does happen with animals sometimes.\n\nYeah. That feels like weird timing that they were they were getting by for a 100,000 years and then 200 years after Whitey gets there.\n\nBut that's it's possible, right?\n\nIt's good to be cynical.\n\nWe're about to name a football team after them.\n\nThey're a crazy animal. You ever hear them the sounds they make?\n\nNo.\n\nLet's play that.\n\nPlay the sounds of a Tasmanian devil.\n\nThey sound so cool. Like he was my favorite character for sure in the Warner Brothers cartoons. The Tasmanian Devil. We'd spin around.\n\nIt was fun.\n\nI like Bugs Bunny. When I found out that was at university, people kept going like, \"He's black. Do you know he's black?\"\n\nBugs Bunny's black.\n\nThat's like a big thing that he was a blackcoated character. He's always like relaxed.\n\nOh, and he's got a cool plan that he's working on. He's like a zoot suit guy from the 20s.\n\nYeah.\n\nLet me hear some of this.\n\n[Applause]\n\nYeah, look, Devil was an easy name to pick.\n\nNo, no points for the guy who came up with that, right? I mean, if you called it anything else, I would be disappointed.\n\nI miss our beautiful Australian animals. I miss the trees. I got to go through California and see all the like the gum trees again. I haven't seen gum trees in forever.\n\nLook at that.\n\nThat's so nice.\n\nWhat a ferocious little [ __ ]\n\nSomething gets in the blood where it's like that's what I think an animal should look like.\n\nYou know what I saw? I think foliage should be close recently for the I think maybe the first time. Uh a wolverine.\n\nAre they real?\n\nYeah. Yeah. Yeah. No, the real animal.\n\nYeah. It was at a badger. No, it's a badger.\n\nIt's in the badger family, I think. Um but I saw one at like this uh nature preserve when I was on the road. was pretty interesting, man. You see those little [ __ ] like they're unbelievably ferocious. They scare bears off of carcasses and they weigh like 50 pounds.\n\nBut there are This is the year that I've seen the most animals cuz I've I've got kids and we travel around and I go I've been to like eight zoos this year.\n\nOh, cool.\n\nThere's a lot of zoos, but there Man, did you know in New York they had a guy at the zoo? They had a human zoo.\n\nWhat is he fighting here, Jamie? Yes.\n\nWait, that's the Wolverine?\n\nYeah, it's a Wolverine. If we get at the animal fight videos, I\n\nWolverine.\n\nI think he pissed himself while that was happening.\n\nOf course, he probably pisses himself all over the place. Just probably to make himself more ferocious.\n\nLike the wolf gets a hold of them. I've seen mountain lions get a hold of them and they don't kill them. They're like unbelievably durable. You ever watch the like the bird and the fish that goes on for like the bird and the fish?\n\nThere's like a heron trying to get a a small fish and they play it in slow motion. They put classical music behind it. Animals trying to get away from other. That's a big\n\nOh, I've watched a lot of those. Animals trying to get away from animals. Yeah. Running fast across the wilderness. You want them to get away.\n\nSo, your animals, you have a lot of weirdness going on over there, right?\n\nCuz you have kangaroos. Sometimes they get like an infestation, right?\n\nYeah. Then they go up in a helicopter and they gun down the kangaroos.\n\nWhat used to kill the kangaroos back in the day?\n\nI don't think anything was killing them.\n\nSo, how did they get to\n\nI think there might have just been less arable land. Maybe they had like less to eat.\n\nOh, really?\n\nI assume they would starve, but like I don't think anything kills the emuse. We lost all our big predators. Uh the predators aren't too dingoes and but dingo came. Dingo I think came from India.\n\nYeah, but here's the thing, man. Some kangaroos are like six feet tall.\n\nThey're [ __ ] huge. Like but they'll only bother you. There's that one video of the guy with the dog.\n\nRight. But what I'm saying is good luck to the dingo.\n\nYeah.\n\nThese [ __ ] get big.\n\nWell, they they're in packs, though. The dingoes are.\n\nYeah.\n\nOh, so the\n\nI think they're impacts.\n\nWell, they probably don't hunt the big males either, right?\n\nBro, look at all [ __ ] I miss Australia.\n\nDo you?\n\nYeah.\n\nWhat do you miss the most?\n\nOh, I miss the football. I miss the Look at the accent. Look at all these [ __ ]\n\nI don't remember that. That doesn't usually happen. when we don't usually get together and what's called the demon cults.\n\nIt was during co when everyone was inside there was like kangaroos came back into the town. They were jumping about.\n\nSo this is a mob of kangaroos.\n\nThat was that does look like a mob.\n\nYou'll see them. You'll go on like a nature walk and you'll just see a kangaroo in the distance just looking at you.\n\nJeez.\n\nBut they're like, you know, they they seem friendly and mysterious and then they jump away.\n\nSo was there like more dingos all over Australia at one point in time?\n\nI think we clamped down on it at some point.\n\nClamp down on the that lady who lost a baby and she said a dingo got it and no one believed her and now they think the dingo maybe got that baby but also the dingoes are all in the I've never seen a dingo.\n\nImagine a dingo eating your baby and nobody believes you.\n\nYeah.\n\nIsn't that crazy? Like not only is it horrible that a dingo ate your baby, but then also think you killed your baby.\n\nAll right. My favorite one is the poet Ted Hughes. He's married to Sylvia Pla. He comes home. She's killed herself in the oven.\n\nOh, very sad. Very difficult.\n\nShe killed herself in the oven. I don't I don't think he came home. He'd left her by that point for another woman. She gassed herself in the oven.\n\nOh god.\n\nThen he the woman I think it's the woman that he runs away with couple years later. She also kills herself in the family oven.\n\nHis second wife. So like from the outside people in the British literary establishment start going I think he's killing his wives in the oven. You can't have a second oven suicide. That's it's a for me once type situation. Well, you could if the second wife obsessed about the death of the first wife to the point where boy, you'd be careful with wife number three.\n\nWell, you'd say, \"We're going electric oven.\"\n\nIt Well, these are ex-wives, right?\n\nYeah. Once they\n\nWell, I think he was still married to the second one.\n\nOh, okay.\n\nHe didn't have to leave her. But he\n\nSo, while they were married, she asked herself like that.\n\nYeah.\n\nYeah. Well, that guy's probably got shitty choice in ladies.\n\nHe I believe it.\n\nBut you be so cautious. I'm the second one in the same way.\n\nYeah, that's an issue. You'd be like, \"This keeps coming up.\" Um maybe I'm doing something wrong.\n\nYeah. If like that's the thing about like the Clinton body count. People go like if 51 of your friends commit suicide.\n\nVery sad.\n\nLike something's going on.\n\nThat's a That's a giant number. Most people don't have 51 close associates whack themselves in strange ways.\n\nSome people are unlucky.\n\nOne of one of the guys hung himself from a tree by um extension cord and then shot himself in the chest with a with a shotgun.\n\nYeah, cuz he was a hard worker. He was probably a good part of the DNC operation. He didn't want to leave it to chance.\n\nYeah, the mysterious suicide they keep it's hard not to get into the conspir I try not to have a conspiratorial mindset cuz I get unhappy.\n\nWell, we already talked about what Israel did. They made the fake phone call to the military. It was only because it was impressive and I thought it was cool.\n\nRight. It is cool.\n\nBut the beepers, they came out and they said, \"We did it.\"\n\nBoth of them are cool, but\n\n\nIt's a conspiracy. They conspired to whack somebody. They did conspire. Yeah, and they did it, and they pulled it off. Well, they also, they were getting like the last Nazis for a while. Oh, yeah. Over the latter half. Hunt them down. 50 years later, 60 years later, hunt them down. Yeah. You think they'd managed to clear up Hamas quicker? That's uh, one of the weirder... You ever see that show, uh, uh, Hunting Hitler or Finding Hitler? No. Okay. I've seen shows like that on the History Channel a lot. I don't know if I've seen that one. Tim Kennedy was on it, and they all went down to Argentina, and one of the things you find in Argentina is like entire towns where people speak German. Yeah. And so what... Italians, too. Well, yeah. Right. James Donald Forbes McCann's guys. Yeah. And so they found all these photographs of like SS soldiers on the walls in people's houses. Like there was a television show about it. We have a, we have a German town in Australia where they say there's a pub with like Nazi stuff on the walls. I've never seen it, but the Germans, there's like a, there's a Bavarian town where everyone's nice and relaxed, and then there's like a Prussian town where people are very... But also, sometimes you will go around to like a German guy's house, like they've got an old German family, and then you look over on the mantle piece, and there's a knife there. There's a very special knife. It's like, \"We can't get rid of it. That's grandpa's knife.\" The weird thing is, like, they have full towns down in Argentina that practice Oktoberfest. Yeah. They put on the lederhosen, the whole deal. Like, it's a German town. I think there's something about the black population disappeared. I don't know if this is... I think it might be Argentina that they had like a big black population, and then over a hundred years people go, \"I don't know where they are anymore, but they're not here now.\" And I think it coincides with the... maybe it was before the Nazis got there, but that's a weird... that's a weird rabbit hole. There's not a lot about it. So many rabbit holes. Some people say like they just integrated and... and what whitened up... like it's kids after kids, and you can't see it, but like there... what they had a big black population, then it... Am I right? I... I need that one. I don't want to just say that and have it... we have to look that one up. But like it disappeared, and this is Argentina. It could be Europe. Black genocide. The true history of the whitening of Argentina. Thank you. Travel Noir, a website. I've never heard of that website, but I assume it's a... Whoa. Today, many Argentinians hold the erroneous belief that Argentina neither participated in the slave trade nor witnessed the presence of Afroargentinians as if they had left the country naturally. Such misconceptions persist despite historical evidence. Former Argentine President Carlos Manm, uh, once shockingly declared, \"In Argentina, blacks do not exist. That is a Brazilian problem.\" No one's bringing that up. Whoa. Less than two centuries ago, black individuals compromised over a third of Argentina's population in 1800. That seems like a question. That seems like someone should find out what happened there. Holy [ __ ] Holy [ __ ] man. The factors be behind the disappearance. Sudden and profound disappearance of black Africans from Argentina is attributed to a confluence of factors. The 1870s though, first is the war against Paraguay, spanning from 1865 to 1870. Thousands of black individuals fought in the military during these conflicts and other wars, resulting in significant losses. The fatalities led to a considerable gender gap within the African population, prompting unions between black women and white men, which effectively diluted the black populace. In addition, many Afroargentines sought refuge in more welcoming political climates in neighboring Brazil and Uruguay. But you don't lose a third of the population by like a... They're saying all of them. Like there's no way these factors would make all of them go away. Another devastating factor was the outbreak of yellow fever in Buenos Aires in 1871, which claimed the lives of numerous locals. But still, wouldn't it be like... proport... here it is, but many sources point to a far darker and more sinister force at work. A covert genocide orchestrated by Domingo Faustino Sarmiento, who served as Argentina's president from 1868 to 1874 and played a pivotal role in decimating the Afroargentine population. Okay. So it is a genocide. Yeah. But this was about a hundred years before I thought. Wow. But then no one... no one's going after Argentina for this. Well, I didn't even know about it until everyone goes about like, \"America's a racist country, their racist history.\" Holy [ __ ] Why is no one talking about Brazil's slavery? Brazil had way more. Brazil was like, I think they kept doing it for 20 years as well. They were... It was huge. And then everyone just acts like Brazil is a cool place to go by the beach and relax. Maybe it is. Have you ever seen the City of God? No. City of God is about the favelas in Brazil in Rio. And it is, uh, it makes Eddie Bravo said this, that it makes Boys in the Hood look like Sesame Street. It really does. Like if you... you watch that movie, it's so violent and so crazy. And apparently when you talk to people from Brazil, particularly from the favelas, Yeah. it's actually accurate. Like the... there were gangs of kids like this. There were like young 10, 11-year-old kids committing murder every day. They had guns. They were moving drugs and getting money and like young. They still have it. Still an issue. I mean, they've done their best to try to like the, you know, the soldiers will like do raids into the favelas at times, especially when someone does something crazy. But I know I was saying positive things about slums before. There's negative things to have in slums as well. I would just like there to be more... more housing. Yeah, housing would be good, but good housing would be better. And there's enough money. There's enough money to do that. It's like you just have to... we have to prioritize like what are we spending money on? I mean, we shut... we shut Australia down for like two years. No one was doing anything. Yeah. You guys went nuts. We... if you ever lead the world in something bad, that's... I think a bad sign once you have the longest lockdown. What is it about Australians as a culture? Yeah. That allowed them to be kind of ordered around like that? We love rules. Is that what it is? I think about this a lot because it's... I mean, like, like driving in America is feels wild and free. Like no one's doing the speed limit. If you do the speed limit on the freeway, it feels way more dangerous than going five over. We have cameras every... you can't... if you go one, two miles over the speed limit in Australia, you get a fine. They've recorded you. You're in. And we don't push back. I have no idea why other than because people don't like it overall. People don't want to go through the bureaucracy, but maybe there's no... we have no like animating sense of freedom that people should be free. It's like, I think if the motto here is \"don't tread on me,\" we've got \"pull your [ __ ] head in.\" You hear that quite a lot. Pull your head in. Pull your head in. What's that mean? What are you... What are you [ __ ] doing? Pull your... pull your [ __ ] head in. Like get in... get in line. Go with the flow. Do what you meant to do. And for a while, I guess we were also prosperous for a long time, and that worked. If you just like laid low and you did what you know, you went to school, you went to uni, the government's going to pay for your uni, you get a... you get a nice job, you'll get a big, beautiful suburban family home. Don't buck the system. You don't have to do anything crazy. And as that falls apart now, which is falling apart quickly, the rents out of control, the inflation's so much worse, the... it's all... you know, the immigration is like... kind... it's silly, like we're not building houses in line with that. Um... and so it's like, I don't... a lot of comics are moving overseas, like in a way that no one moved overseas when I was... for the first 10 years I was doing comedy. I think a couple guys went to the UK, and that was it. And now Aaron Chen's here, Blake Freeman's here, Amos Gill's here... what do you think is the big motivator to... what was the biggest thing that was a problem over there that... post-co... I mean, co... was co... radicalized a lot of people? Is that what it was, just the kind of control they put down on you guys? It was, and then the... I mean, there... there's so much opportunity here. People keep saying the cost of living is going up in America, and it is, but it's like still... it's wacky that eggs are only 370 or something. That's so cheap for eggs for us. Really? How much are eggs over there? More substantial. Yeah. Like how much? Give me... I don't know. I'm buying... I'm buying free-range eggs 'cause we... my wife insists on it. But still, I would... I think if you did an... if you did like a milk to milk egg to egg, you dominate. Interesting. America has so far to go before it gets to be a revolutionary. 14 a dozen. Whoa. 14 bucks a dozen you guys pay for eggs. That's crazy. Oh man. It's... if you got coals and I mean, the dollars... the dollar is a bit different. So there's less opportunity. Things are more expensive. And also there's... I mean, but what about co... radicalized a lot of people. You got locked in your house for... I mean, it's literally in Melbourne. We were in Melbourne when it kicked off, my wife and I, and we had a newborn child, and she was pregnant with the next one. And, uh, they said, \"We're locking everyone down for six weeks. You can't leave your house.\" And it was... we had better not... better... we had like stronger state-by-state regulation. So if you moved back... we were from Adelaide in South Australia. They said it was two weeks if you came from interstate. So we just drove all night and got out, but then watched as people... It's like a 300-day lockdown. Jesus Christ. Uh, you couldn't do... It was one of the only places you could do shows was in Adelaide. We did have... I saw... I like Josh. He seems great. I saw him on here talk like about the... I think you confronted him about the concentration camps, and it's like, \"Yeah.\" We had camps where we concentrated people. I don't know what else you meant to call that. Yeah. Yeah. We had a disagreement too about myocarditis, and it was interesting. It was like you would get all these different... now it's like firmly established as a higher risk of myocarditis for young people that took it, but back then it was really confusing, and I was like, \"Why did I read articles that said it was a higher risk?\" And then he brought one up that said there was more of a risk of getting myocarditis from COVID itself, which really didn't make any sense even in the argument because back then we didn't know that it not only doesn't protect you from getting the virus, it doesn't even protect you from spreading the virus, so you still get it, so you still have a chance if that's true. Yeah. But it turns out when I talked to Dr. Masim Aim Mahhatra, who is, um, he's a part of this whole Maha thing, too, and he was another doctor that was initially pro-vaccine and eventually just realized there was a a bunch of horseshit going on with all of it. He said they... that's not what they measured. They were measuring troponin levels. They were measuring like what... what happens when you get sick, and that those levels are higher in a viral infection. And he was saying that that... that's not indicative of what true myocarditis is, which is an enlarging of the heart and a scarring of the heart tissue. It's like it's a different thing they're looking for. They're elevating the number of people that are getting it from COVID by doing it this way. He was saying, \"Oh, I can see why you...\" It's hard to lose trust in the establishment. Like you want to believe that the people running the medical side of things and who are setting all the rules have your interest at heart, and you should listen to them. Especially if you're in so certain social circles, right? So if you're in certain social circles where people are very pro-science and very logical and rational, and they are all in agreement of one thing, you don't want to be cast out of that social circle. You don't want to be thought of as being a fool. And so you don't want to have any opinion that's opposing what is this consensus narrative amongst these people. It's also... I mean, it's nice to be in that group because you get to... you get to live in a world where the government cares about you, and they know what they're doing, and this politician in a suit, like there was a... Yeah, but you got... the realm for personal expression and politicians was tiny for a long time 'cause it was... you were... you know, that's what you want. Trump's blown this up, but I remember like... Howard Dean did a weird scream, and his career was... that's what it took back in the day to ruin your candidacy. Yeah. Well, how about, uh... because they had to keep that illusion going that like these are very competent people who will not make a weird noise at the wrong time. Oh, for sure. That was all they would need to latch on to, and then they would like throw it in everybody's face. It would be all over the news, and it would be over. Yeah. There was no internet, you know. What a... I mean, isn't that a nice world to... that world... like that '50s world of like, \"Ah, you can... we've got a man in a white coat, and he knows what's up.\" You don't have to do all the... It's taxing to try and figure out how disease works. Oh, it's... Yeah, it's not fun. It's not fun to not trust anyone and always want to read like hundreds of different articles on any complex subject to try to get an understanding of who's telling the truth and who's not. It's a pain in the ass. And the cost for getting it wrong is in... like if you get 19 things right and one thing wrong, they just go, \"You're a [ __ ] idiot.\" Oh, 100%. Yeah. But the... I think the key is like you have to say why you got it...\n\n\nWrong, and then express yourself.\nLike I get things wrong, but I'll tell you why I got it wrong.\nAnd then I, I won't lie, and I'll tell you what I know now.\nSo if I know now that something's different than what I thought, I definitely always say it.\nAnd I always say, I was wrong about this, and this is why.\nI like get it out.\nYou got to get it out because it's important.\nLike the the whole thing is we're trying to figure out what the [ __ ] is actually going on.\nAnd when you're looking at like really complex, like you get into something like the Kennedy assassination.\nYes, which is one of the big ones in this country, 'cause there's a lot of people like, \"Oh, let it go.\nLet it go.\"\nBut then there's a lot of other people go, \"No, no, no, no, no, no, no, no, no, no, no, no.\nThis shows you how they did it in 1963.\"\nAnd they've evolved.\nAnd anything that's alive that's still a part of the systems are all still there.\nYeah, for sure.\nThey're just way better at doing that.\nAnd they've learned how to not use a magic bullet and, you know, not [ __ ] you know, the grassy null and not kill all the witnesses.\nYou know, they learned how to do stuff.\nThey got a lot better.\nWho is So, it's like, so Jack Ruby kills I'm going to get a lot of this wrong.\nLee Harvey Oswald.\nJack Kennedy kills.\nWe have a photo of it right out there, right the moment he's shooting.\nBut then when he's under arrest, there are like two journalists who come and interview him, and I think one of them kills him.\nJolly West.\nJolly West, the head of the MK Ultra program.\nYeah.\nYeah.\nJolly West visits him and he goes insane.\nHe had never had any history of mental illness.\nJolly West sees he sees Jews burning in hell, and he's he's going crazy.\nHe's hide because he was a Jewish man.\nSo he thought he they were coming for him.\nHe's hiding underneath a [ __ ] bench.\nHe was screaming.\nHe went completely they doeds him with acid, man.\nYeah.\nThis is the the MK Ultra people visited.\nI think a journalist who talked to him before he died got killed by a some sort of gay karate chop.\nA gay?\nIt was like a gay It was like a gay journalist and then he took a home in the ass.\nYou you chopped him in.\nI think he took a man home for a sexual encounter and then he was karate chopped to death.\nI think that's the official explanation.\nIt's a very rare thing to karate chop a man to death.\nThat's a weird choice.\nIt was cool to karate chop somebody.\nWhy did they know it was a karate chop unless they have a video?\nI think that's the medical examiner said karate chop.\nOkay.\nThat medical examiner doesn't know what the [ __ ] they're talking about.\nThey probably just stomped him.\nWell, do you think Well, who's the the Manson family?\nThe Manson.\nYes.\nHe was dosed with some sort of\nOh, 100%.\nAnd I'm I'm sorry if you've heard this before, ladies and gentlemen, but uh the book Chaos by Tom O'Neal is amazing.\nAmazing.\nHe's Greg Fitz Simmons' old uh neighbor.\nUh so Greg, who's at the mothership this weekend, who's awesome, one of my best friends, and I've been friends with I started doing comedy with him one week apart when we did open mic night.\nIs he a busting guys will?\nYes.\nKnown him forever.\nHe's awesome.\nSo he and hilarious comic too, but I think it's all sold out.\nBut he um was next door to this guy and um this guy was a journalist, super nice guy.\nThey became friends and he's saying, \"I'm writing this thing about Manson.\nIt was supposed to be for uh a magazine.\nIt was supposed to be like 25th anniversary of the Manson family killings.\"\nBut he starts finding all these inconsistencies and he keeps going further and further down the rabbit trap and he thinks the prosecutor's full of [ __ ] and there's some sort of a connection to the government.\nHe's like, \"What the [ __ ] is going on here?\"\nSo he doesn't meet the deadline.\nSo he keeps going and so then he gets a book deal and it's just like he's going on and on and on and on and on for 20 [ __ ] years.\nFor 20 years this guy studies nothing but the Manson case.\nHe's got stacks and boxes and he's been interviewing people.\nAnd then he puts together this book with help.\nHe had to get someone to help him organize it because he was so deep in the weeds.\nHe's got enough for another book.\nI mean a pure obsessive but a brilliant guy.\nAnd this book, Chaos, it outlines all of the MK Ultra involvement in the Manson family and all the different things that they were doing at the time with the CIA mind control experiments, how they were running brothel,\nwhich they did definitely seem to have.\n100%.\nYeah.\nAll 100% real.\nDo you know about this lady, Dorothy Killgallen, reporter cloaked in controversy.\nI'd say read this.\nOkay.\nDorothy Gilgalan is best known for her column The Voice of Broadway in the New York Evening Journal, which was published in over 140 papers and for her role as the game show panelist the 1950s television program What's My Line?\nShe was hailed by the Post as being the most powerful female voice in America.\nKill Gallon spent a vast majority of her career cloaked in controversy, most notably surrounding her investigative work into the John F. Kennedy assassination.\nAs a longtime skeptic of the Warren Commission, a study conducted by the United States government into who killed JFK as well as who killed Lee Harvey, well, we know who killed Lee Harvey Oswald.\nJFK's supposed assassin, Kilg Gallen, dove deep into the controversy.\nSome may even argue too deep.\nKilg Gallen was under suspicion that Oswald did not commit his crimes alone and published several articles reflecting this belief.\nJack Ruby, who allegedly killed Lee Harvey Oswald on November 24th, 1963, was only interviewed by one reporter throughout the trial, Dorothy Kilgallen.\nSince her interview with Ruby, many noted that Kilg Gallon uh carried a file with her at all times.\nIt remained under lock and key when not physically in her hands, according to those close to her.\nKill Gallen's file continued to grow throughout the investigation.\nIn a conversation with her lawyer Jim Garrison prior to that's the guy who prosecuted um that was the in the movie Kevin um Kevin Coer played him in the the the uh JFK movie.\nYeah.\nUh prior to a trip to New Orleans with Dorothy, later inexplicably canled, he remembers her saying, \"I'm going to break the real story and have the biggest scoop of the century.\"\nKill Gallant's first trip to New Orleans was planned two weeks prior to her death when her husband, Richard Kmar, found her with files missing by her hairdresser in a bedroom she never slept in, dressed in clothes she would never wear to bed, reading a book she had finished and disliked, wearing glasses she didn't need for reading.\nInitial autopsy report, a Brooklyn medical office, as opposed to the office in Manhattan, where she lived, found her cause of death to be a lethal combination of alcohol and barbituates.\nThe report later amended to note that the barbituate originally found schanol, a sleeping pill for which she had been prescribed, was in fact a combination of two twe uh tuinol and nembutall, which she did not have access to.\nAlthough her death was eventually ruled a suicide, Kilgen's husband noted that when she returned from a taping of What's My Line early that evening, she appeared chipper.\nWell, a lot of people do seem chipper before they go.\nI decided um yeah, a researcher by the name of Mark Shaw, who investigated Kilgen's death, found that she was under surveillance by the FBI through the Freedom of Information Act.\nFriends of Kilgallen recall her expressing fear for her life leading up to her death and she supposedly even purchased a gun, a rather uncharacteristic thing for her to Yeah, they whacked her.\nYeah, they whacked her.\nYeah, they've got to finish releasing.\nIn a recent release of the JFK files on October 26, 2017, a file entitle entitled Dorothy Kilgallen by Richard Nixon was released, but its contents remain sealed due to reasons of national security.\nThey whacked her.\nYeah, it does.\nWas there a gay karate chop or did I make that up?\nI didn't see that part.\nThey whacked her.\nThey whacked her.\nIt seems likely.\nYeah, she was digging into the investigation.\nLook, you know, when you talk to like I talked to Oliver Stone about it multiple times and Oliver Stone, despite his advanced age, is still brilliant and his recall is incredible.\nHis recall on the assassination, like he's obsessed with that assassination.\nSo, he can tell you like who was involved and who did this and Alan Dulles and this and that, the Warren Commission report, and then it goes back the the rabbit hole just goes so deep.\nIt goes all the way.\nIt goes all the way to Richard Nixon because it it goes all the way to Gerald Ford who was on the Warren Commission's report and when they kicked Spiro Agnu out, they got Spiro Agnu on, you know, corruption.\nYeah.\nThey kicked him out.\nThey put in Gerald Ford.\nThen they kicked Richard Nixon out.\nYeah.\nWith the Watergate thing, which I always thought was Richard Nixon got caught being a crook, but that's No, it was he was not a crook.\nIt was an intelligence agency plot.\nThe whole thing was Tucker Carlson lays it out.\nYeah, there's the Nixon reputation is starting to come back.\nWell, you know, people are starting to love Nixon again.\nThere's a lot of Maybe for the first time stuff that he did that's not good.\nUh Jim Cy wrote uh decided to write a book about the assassination of John F.\nKennedy.\nHowever, he died on the 21st of September 1964.\nOh, there go and see that a man broke into his Dallas apartment and killed him by a karate chop to the throat.\nThat could happen to anybody.\nThat's a real thing that happens all the time.\nThis This is the thing.\nLike, how do they know they didn't just strangle him to the throat?\nLike, if you have damage to your throat if you don't see the guy karate chopping him.\nWell, it does seem like a weird flourish for the secret police to put out there.\nBut that's like one of those things that you would say.\nCody just Oh.\nUh, it seemed like a man broke into his apartment.\nTom Howard.\nTom Howard died of a heart attack age 48, 1965.\nWho's Tom Howard?\nOh, attorney.\nOh, his attorney.\nOkay.\nThey both visited Jack Ruby in jail.\nOkay.\nAnd they both died.\nThey definitely give you a heart attack.\nThey definitely could give you a heart attack.\nThey also searched his apartment.\nThe karate chop comes.\nI really always held on to Karate Chop.\nThat's the one detail that really stayed with me through the How are you sure?\nYou can't tell.\nI've seen so many guys get beat up and you can never tell what hit them.\nIt could have been a very long bruise across the big forearm.\nShin shin to the neck.\nEasy.\nPeople weren't people didn't have that sort of kicking ability in the West at that time.\nSure, some people did.\nYeah, there was people that trained like an assassin.\nIf you were going to be an assassin, you would learn Muay Thai.\nThere was like legit Muay Thai.\nYou also have a knife.\nYeah.\nYou also have But if you wanted to make it look like it was like a That was a bachelor flat.\nIs that why I thought it was some sort of uh cause of death exfiation from a broken bone at the base of his neck.\nApparently the result of a cry shop.\nYou know, I'm suspicious.\nI think they probably thought of it as a karate chop because this is how people thought back then, but I would imagine that was like a baton on the neck where you choker got it down.\nThere was a time I know in Austin Powers karate chop is like a cool thing.\nEarly 60s people just found out about karate.\nThe other guy was accidentally shot by the police a few hours before.\nThat can happen.\nThat can happen.\nJesus Christ, man.\nWhen you read stories like this, like if you're not a conspiracy theorist, you're like, \"Yeah, it was the karate chop that made me think it was something had gone wrong.\"\nKarate chops the only thing that drew me in.\nI was happily signing up with the rest of the official narrative.\nDude, I've seen a lot of guys get karate chopped in the neck.\nThey're all fine.\nNone of them died.\nYeah.\nMy dad is like a big That's not what breaks your neck.\nMy dad really like he really believes the JFK assassination happened the way they said it did.\nAnd he went to he made a whole trip of it to Dallas and he went up to the building.\nHe was like, he could have done it.\nHe could have done it from here.\nWell, here's the thing.\nThat's so I I've never really dug into it.\nWell, here's the thing.\nHe could have shot JFK in the head from the book depository.\nYeah.\nAnybody says any different has never shot a rifle.\nIt wasn't that far.\nIt was I think it was 140 yards.\nIf you have a scope and you have an accurate rifle, 140 yards is not a long shot.\nAnd if you have practiced and you know how it's going to go down and you're prepared, you're going to know exactly where he's going to be.\nYou're going to have the crosshair on him.\nYou pull the trigger, you hit him in the head, and you might be able to get off a couple of shots.\nAnd some people have been able to recreate the three shots and they think that he got off three shots and they said, \"That's impossible.\"\nThey recreate it.\nYeah.\nPeople have done it.\nThey like closed down central Dallas.\nNo, no, no, no, no, no.\nThey they shot off three rounds from a Carano rifle in that same period of time.\nYeah.\nThey didn't do it there, but they did it.\nIt showed, look, you can shoot three times in the amount of time that it took him to drive.\nBut this is the problem with any conspiracy theory is that like Well, you got to look at all of it.\nThere are a bunch of things that don't Yeah, there are like a thousand conspiracy theories about JFK and some of them are nuts, but then some of them hold up.\nThere was my point though is that that\n\n\nIt is undeniable, but it's also undeniable.\nThere was a lot of people that reported that they heard gunshots from the grassy null.\nYeah.\nThere's also the whole magic bullet theory, which is total horseshit.\nThat's the most horseshit theory that's ever been promoted.\nThere was like an ice bullet that dissolved inside of\nNo.\nDo you know the magic bullet theory?\nOne bullet caused a whole ton of injuries inside.\nNo, this is what they had to do.\nOkay.\nThere was a guy that got shot in the underpass.\nYes.\nSo, um, there was an underpass and a ricochet hit the granite, the curbstone, and he got hit in the head.\nSo, he got [ __ ] up and he had to go to the hospital and then they found the impact and they found the bullet.\nSo, they knew that this accounted for one of the shots that it missed.\nSo, then they had to account for two different entry holes on Kennedy and entry hole in Connelly.\nSo, and Connelly was shot in the wrist.\nSo they in the thigh as well.\nSo it had you had to say that one bullet did all this damage in both people and then there was the head shot.\nYeah.\nBecause they had the third bullet.\nSo they had came up with one wacky theory and they found this bullet in pristine condition on the gurney in when they went to visit in the hospital.\nSo when they when they had JFK's gurney in the hospital, they magically found this pristine bullet.\nThis is like when the passports fall out of the plane on 9/11.\nYeah.\nAlmost as ridiculous.\nBut this one is so ridiculous because you have the physical evidence of the bullet, which is impossible.\nIt's impossible for a bullet to shatter bone, go through two different people, leave more residue, like more bullet fragments were in Conny's wrist than we're missing from the bullet.\nThat bullet that bullet supposedly went through two different people, shattered bone on both of them.\nAnd that's a special bullet.\nAs a person who's shot guns before, that's horseshit.\nThat's not what happens when a bullet hits bone.\nSo it's supposed to have gone through his back.\nThis is the officials out his tie hole.\nYeah.\nLike right where his tie knot is, goes into Conny's wrist, and then goes into his thigh, shatters his wrist, leaves fragments in his wrist, the wound left in the thigh, and then they find this magical, perfect bullet, pristine condition on the gurney in the hospital.\nI mean, it seems weird.\nWas it Conny's gurney that they found it on or or JFK's?\nI might might have got it wrong.\nIt might have been Conny's gurney that they found the bullet on.\nBut either way, listen to me.\nShut the [ __ ] up.\nNo, I look I usually stop at this point.\nShut up.\nCuz I don't want it to happen.\nAnybody who says that's what happened, shut the [ __ ] up.\nThen there's also the problem of the bullet hole in his neck.\nNow, they're trying to attribute that as an exit wound.\nBut the thing is in the there's two different autopsies.\nThe autopsy from uh Dallas and then there was the autopsy from Bethesda, Maryland.\nAnd the discrepancy was the one in Bethesda, Maryland, I believe, called it a tracheotomy scar or tracheotomy cut.\nOkay.\nSo like they opened him up to put a tra.\nThe only reason why they would do that is they don't want to attribute that to a bullet that hit him in the front of the neck.\nI think there was a bunch of different people that were trying to figure out how do we make it so that it was only this one guy and Lee Harvey Oswald might have pulled the trigger.\nHe might have been\nhe does kill the policeman later, right?\nI believe so.\nI believe they they most people believe he did that.\nYeah.\nYeah.\nAnd well he he already knew that he was on the run at that point in time, right?\nAnd then when he gets arrested, he says, \"I'm a psy. I'm a psy.\"\nOkay, maybe maybe he was involved.\nMaybe he didn't pull the trigger.\nMaybe somebody else who was a real expert marksman.\nBecause if you if you he wasn't that good.\nLike people say he wasn't a good marksman.\nBut let me tell you something about\nBen, he was like Dan Grid to mark.\nYeah.\nBut here's the thing about shooting rifles.\nAll right.\nWhen you're talking about like 500 yards, you're talking about really long shots where you're required to be prone and lay perfectly still.\nYeah.\nYes, I would say you really want to be an elite marksman to do that.\nAnd there's a lot of technique involved in training and they're very meticulous about their preparation, their breath work, and it's like a very intense thing because you can't move at all.\nYou have to be like so precise.\nBut 140 yards is not far.\nIt's not that far.\nIt's like with the Trump thing, they said a child could have done it when if he had a scope.\nThat kid didn't have a scope.\nSee, the Trump thing was [ __ ] because that guy was using iron sights.\nSo iron sights are that's what it's like standard.\nThey don't.\nYou can adjust them slightly, but like towards your side, closer to the shooter, there are two posts and at the end there's one post and the the the the like the scoop from the upper post, it lines in a scope of some kind.\nHe did have a scope.\nYeah.\nOh, so why why did they say that he didn't forever?\nI don't know.\nI mean, well, like down here,\nbut there was a photograph of it.\nSo, this photo down in the corner with my cursor doesn't have a scope, right?\nThis is from the FBI.\nOkay, but here's the thing.\nI'm pretty sure there was a photograph of it laying on the roof and it didn't have a scope.\nAnd this is why, and this is not my theory.\nThis is all the people that I know that are in like the tactical world that have talked to me about this.\nThey were saying that he had iron sights.\nSee if you can find it.\nIf they show a photo of the actual rifle and then there's just nothing about this that's come out since then.\nSo, if he had a if he had a scope that's even crazier that he missed.\nUm because that's a chip shot.\nIt's not a hard shot.\nIt's you're 140 yards.\nYou have a an accurate rifle.\nSo, let's see.\nScoom bit on that.\nIt kind of does look like he has a scope.\nGo back to that again.\nA lot of these pictures from the just talking of it though are using a picture of a gun without a scope to confuse people to maybe interesting.\nOkay.\nSo, it's hard to tell, but go to the the top one again and make that larger like this one.\nNo, the one in the that's on the right hand side.\nI get it.\nOkay.\nOkay.\nThat looks a little bit like a scope to me.\nThere's something above the barrel at the the middle point of the gun.\nIt doesn't look flat.\nIt looks like there might be a scope.\nOkay.\nWhich is even crazier that he missed then because this guy is shooting from a very close distance, but he probably [ __ ] panicked.\nHe's a 20-year-old kid.\nAlso, he turns his head just at the right.\nIt's the miraculous head.\nYeah, but the thing is that's not an expert marksman.\nHe did train a lot though.\nThat was the other thing.\nLike there's a lot of people that trained uh in firearms with that kid.\nSo they knew that someone either told him to do that or he was preparing by himself to do that.\nWhy is nothing come out about it?\nBro,\nyou would think\ncuz I think that MK Ultra [ __ ] keeps going.\nI think that it's like that Aerrol Smith song, Train kept it rolling all night long.\nI think it just keeps going.\nI don't think they stopped.\nI think someone, whether it's our government or another government or some giant business interest, someone probably talked that kid into doing that.\nGave him the resources.\nHe had five different phones.\nHis entire someone into doing it.\nHis entire home was professionally scrubbed.\nYeah.\nThere was no silverware in his home when they searched his home.\nI mean, it's weird that there wasn't more.\nI know there was like a guy at the golf course and there was like a third guy maybe.\nMhm.\nBut the temperature in the country at that time was\nno one was like actively coming out and begging.\nThe Dems weren't coming out and saying someone's got to kill this guy.\nBut they were going this is a insane.\nBut it might not just be the Dems.\nThis is what you have to understand.\nIt's probably business interests if you're in another country.\nOkay.\nAnd this guy's actively campaigning saying that he's going to raise tariffs and he's going to c we're going to make China pay.\nWe're going to make Russia pay.\nEveryone's going to pay.\nIf you're in some, you know, military controlled country that's going to lose trillions of dollars because this guy's going to make everybody pay.\nYeah.\nYou might hire someone to do something.\nWell, this is why he goes, \"Vance immediately out.\nThis is the what I put together is the theory.\nSomeone else must have done it, but you pick someone who seems scarier than you, right?\nYou go, well, if you kill me, you get him.\"\nYou think Vance is scary?\nI think at the time he seemed like the furthest right protectionist candidate that Trump could have picked from on the VP list.\nI don't think he really is though.\nI don't know what he\nhe's pretty reasonable when you have a real conversation with him.\nHe's definitely conservative.\nHe's pretty reasonable, but he's also like a nononsense, no [ __ ] guy who is not he doesn't lack in compassion, but he was the like he was not the easiest electorally.\nThere were other people he could have gone with who would have been.\nHe's young.\nHe's very religious.\nYou know, there's a lot of aspects of that that make people uncomfortable.\nThe young one is pretty big.\nYou know, people don't want like some young guy being the [ __ ] president of the world.\nYou know,\nwhen was the last time it was like Teddy Roosevelt?\nUh Kenn Kennedy was what?\nHe was like late 40s,\nbut he'd also have been around.\nHe was a known commodity.\nHe senator for a long time.\nHe was handsome and he's pretty young.\nHe didn't look like an old leader.\nHe didn't look like Eisenhower, you know what I mean?\nYeah.\nHe didn't look like Ronald Reagan, but he was he been to the war and that added like when you go to the Have you been to the Fredericksburg Pacific War Museum?\nNo.\nIt's great.\nIt's a two-hour drive.\nIt's tremendous.\nYeah.\nBut like they have a they have a mural out back for all the presidents since that war and everyone's in World War II.\nLike that's the it's not that America's looking for an old guy.\nIt's like who it's everyone is somehow until like Clinton, everyone is a World War II vet.\nWell, you got back then everybody signed up for the war.\nYeah.\nLike\nbut generationally America didn't want to move on from the World War II guys.\nThat was like a comforting, right?\nBut it was also World War II was the last just war in their eyes.\nLike we had to defeat the Nazis.\nYeah.\nYou know, we had to stop the takeover of evil in the world.\nAnd then you got to the Vietnam War and it's like, wait, what's going on here?\nThis is not\nKorea seems more\nKorea.\nWell, there's a lot of people that would disagree with you, you know, but Korea is also, you know, there's North Korea is fighting South Korea.\nNorth Korea's communist.\nSouth Korea.\nIt doesn't have the same light.\nIt Korea doesn't occupy the same.\nNo.\nDoesn't have the same spot in people's heads.\nAnd then really, it's not one war that everyone's getting behind after that.\nNo.\nNo.\nThere's not one.\nAnd you know, mo most people are real down on a war right now for for good reasons.\nYou know, it's like, are we [ __ ] for real still doing this?\nYou know, and this was one of the things that that Trump campaigned on is no more wars.\nYeah.\nThat scares the [ __ ] out of people, you know, because then right away we're involved in this Iran thing.\nLike, okay.\nBut, you know, I'm so easily taken in like I was I was terrified.\nI was like, \"Oh, I don't want there to be a war.\nThis is terrible.\"\nAnd then as soon as the bombs are dropped and Trump comes out and goes, \"We're very strong.\"\nI'm like, \"Oh, yeah.\"\nLike I It's so easy to get whipped up into a fervor.\nThere's There's some truth to that, right?\nAnd there's some truth to maybe it wouldn't be the best thing in the world if they developed a nuclear program and had nuclear weapons and used them on Israel.\nBut then, you know, you say, well, were they really close to doing that?\nWell, then you find then you find out that Netanyahu has been saying they've been close to doing that for like 15 years and Tulsi saying they have no information on it.\nYeah.\nBut the thing is like what do we know?\nYou know, if they don't let inspectors in, what do we know?\nYeah.\nYou know, I would for see both sides to pull together over something.\nI found someone sent me the like that Reagan towards the end of his term just kept giving speeches about how he wanted there to be an alien invasion.\nYes.\nAnd he said, \"If only there was some alien force that we could all get together again against the aliens.\"\nYeah.\nBut it is that seems like America's ready for that.\nSome coming together.\nI can see that if you were in charge, you wanted to have civil unity.\nYou would want there to be something like a war.\nWell, to pull people back together.\nI think there's a lot of value in having no civil unity.\nI think there's a lot of value in keeping us at each other's throats.\nThis is what I always try to tell people.\nMost of us are in the middle.\nMost most of us, especially after you get to a certain age, you realize a lot of [ __ ] things that people do, it's cuz you know they're allowed to do it and it's stupid and it [ __ ] their life up and maybe you should get your [ __ ] together.\nAlso, there's a lot of poor people that need help.\nAnd the idea that you're going to cut that off from\n\n\nThem is kind of [ __ ] up and uncharitable and unamerican. Yeah. But also, there's people that take advantage of those programs and they stay them forever and it kind of [ __ ] up the whole community and like that's true, too. Okay. So, how do you set the standards and what do you do and how do you do? But most people socially are very much in the middle. Like most people want gay rights and civil rights and women's rights and trans rights. We want rights. We want everybody to be free. We want everybody rights to you. But right, that's how you get something. You chuck No, you just chuck the word rights on something. It's rights are important. Like people say abortion rights and then people say gun rights. Yeah. Like that's how you know if the media is in favor of that thing or not. When I was coming up, if they say rights, then they go this should be like abortion rights were confected in Roie Wade. They just it didn't exist beforehand. And they said there was a I mean maybe people can pass that people can legislatively have abortion on the books but that's not what happened. The Supreme Court just said we infer that there's a right to privacy somewhere in the Constitution. We're not going to be clear about where that is and so the judiciary can just make it happen. Well, that's how it got overturned, right? Yeah. Cuz what can be done by the judiciary can be overturned by the judiciary. But there's heaps of stuff in America that just like the Supreme Court decided it was going to happen. No one came in like gay marriage was just a Supreme Court thing. They just I think that's kind of also the will of the people. Like most people are like let him be married. Like what's the problem? Like how does that [ __ ] with your life? But they're like California votes votes it in and then votes it out again. Right. Well, here's what's hilarious. Up until 2013, Hillary Clinton was openly stating I I don't think Barack Obama I think he said he was against it for the first time. Yeah. I think it was 2013 where Hillary finally said she was in favor of gay marriage. But they used to always like if you ever seen those videos of Hillary being more MAGA than Trump about the border. I believe it. Oh my god. She would be queen MAGA. She would be she would have a a diamond encrusted make America great again hat. She would be the president if she was running today. And I'm not bullshitting. I am not I think there was I'm 100% not bullshitting. I think it's a Sam Talent bit where I don't know if he's still doing it, but he was going like if Camala had come out and said the word [ __ ] she would have won. That's all she had to do. Sam Talent's funny. But he Yeah, there was some there's I mean the Dems are always against the like the progressive wing takes over. The woke thing happens at some point. But like Biden was out saying super predators, bro. The Democrats were the ones who wanted to keep slavery. Some of them, the southern Democrats, but understand. Yeah. Yeah. That the the Republicans are the ones that were trying to free the slaves. It's like things just get weird and get reversed. So now the Democrats are anti-free speech if it's hate speech. Yeah. And disinformation and misinformation and malinformation. And this is all right. This is the Castro speech in a big way. This is Castro. So they ban it. The revolution takes over in Cuba. They ban a film. They haven't had to ban a film up to that point, but they ban the first film. And Castro comes and gives like a two-hour speech to the intellectuals explaining why they're going to start banning movies. What was the film? It was called PM. It was a It was just a film about like poor black people having a good time. It doesn't seem like there's a lot of uh political content in the movie. But he gives this like it's this long beautiful like two 3,000 words at the top going I'm listening to you and you're listening to me and isn't that great that we have a conversation and then just out of nowhere he goes uh the revolution's in control and your freedoms are not. You don't have a right to make whatever film you want. We're going to decide and people are clapping and going for but if you like if you take revolution and sub that out for progress or safety or anti-racism people would totally get behind that. Yes. And this is what everyone who's been sounding the horn, you know, including guys like Constantine Kissing from Trigonometry and Jordan Peterson and people that understand the history of Marxism. They're like, \"This is how it always comes. It comes in the guise of doing the greater good for the people and letting the state control things. This is what happened in North Korea. That's how they all lost their farms.\" Yeah. Yeah. They come in and then they it's centralized power and then everybody has to shut the [ __ ] up because that's how people operate. I think from a like if you have a materialist worldview of the universe that makes sense. I can see how you would you would get there. Like it's a weird thing to say God has given you a right to express yourself and to hang out with who you want. This is like a we this is this is why it has to be in the declar what is it's either in the declaration or the constitution. But like these are god-given rights and they're self-evident because you would if you were designing a utopia which is what every revolutionary wants to do. You're saying we're fixing society. We're fixing human nature right? There's nothing that would intrinsically make you say people have a right to say whatever they want. Like that has to come from somewhere. That's like a That's a weird It's beautiful. I love it. I try and live my It comes from being under the brutal heel of a dictator for the entire country. But then as soon as they have a revolution, they take that away. You know, you use the weapon of your master. The revolutionaries having been under Batista and oppressed and not allowed to say what they want, they come to power and they go, \"Yeah, we're going to be doing that now.\" That's what the guy in power gets to do. But to say the state is seing that this is like a beautiful strange Well, isn't there a difference outside world view? Yes, this is. But isn't there a difference between taking over an existing country like Cuba that had been around for a long time? Yeah. A communist regime taking over versus the establishment of a place like the United States, which is an exercise like an experiment really in self-government that never been achieved before. And it's not a coincidence that it's the newest country in terms of like superpowers and yet it's the one that's achieved the most in terms of cultural impact, artistic impact, intellectual impact. It's a hard argument that United States hasn't achieved more than anybody. I mean, the [ __ ] nuclear bomb was created here, you know, shut your mouth, right? Allegedly, we went to the moon. I don't think we did, but allegedly back on the moon. Yeah. I don't think I think we did. Um but you know also a lot of assassinations, a lot of like overturning governments and other countries. A lot a lot of [ __ ] Yeah, that's not good. But the point is like this is the most free place and the most [ __ ] gets done. [Music] I mean I don't disagree with that at all. And I think this is the progress that the human civilization goes through. It realizes that suppression ultimately is bad for everybody. It's bad for GDP, bad for like it's bad for patriotism. It's bad for everything. Yeah. It's bad for people's appreciation of each other. It's it's hard to govern when people are [ __ ] angry. And and then the breakoff civilizations always seek more freedom. Yeah. You know, I think we got to try one more time with Greenland. Give it a go. I think if Trump takes Greenland and global warming is real, that's the spot. Well, Canada might have to become a state and then there's a lot of good land up there. I have a friend who went up uh to Greenland and went um stag hunting or caribou hunting. They hunt caribou in Greenland. It was beautiful, man. The area they were at was [ __ ] gorgeous. It was incredible. There's like these these insane hills and these herd of caribou come through and there's just so many caribou. It's so beautiful. Yeah. It's so clean. They're just they're camping. They're sleeping on the ground. Chick-fil-A up there. No. [ __ ] it. Get a freeway and a Chick-fil-A. You ever have caribou? No. I can't compete with Chick-fil-A. You don't know what you're talking about. I know. I've never had caribou. All right. I want to go back. This thing of like Yeah. America's done a great deal. It's very free. But like the rate of change in the culture is also unparalleled. Like you look at the Egyptians and they're doing the same pictures for thousands of the feet all point in the same way and we don't mess with the artistic style or like the medieval era. There's like a there's a homogeneity through time and a culture that gets passed on. If you look at America over the last 70 years, it's wacky. Mhm. Like I know a couple nights ago I was I was watching like the number one song in America consecutively on YouTube. So like they play 20 seconds from that number one song and then the next number one song. And early on it's all like guys in suits going my baby. She's so beautiful. I love her. I'm going to take her to a dance and then by the end it's like you know I'm a fisty ass and kill someone with my rifle. Like it's there's a huge shift got like all the institutions are ostensibly the same. The way people vote, the way people go to school, the actual culture that's inhabiting all those things is like radically changing all the time. All the time. Yeah. And there's a bunch of different factors, right? So you have the 1950s factor, you know, which was like Elvis on television and Buddy Holly and all these people. Then the drugs come in. Then the drugs come in. And so they were probably doing drugs back then too, but just probably not the good ones. And then the 1960s psychedelics. So in the 1960s you get Hendrickx, you know, you get the Doors, you get Oh, when the Doors come through, when the Beatles and the Doors and the Stones come through, it's like here are the first cool people ever, first cool people ever. And so then that all dries up when they pass the laws in the 1970s through the Nixon administration to kill the civil rights movement and to kill the anti-war movement to make everything illegal. Then you get the cocaine era. So cocaine ruins music. The 1980s was like there's some great music in the '8s, but there's also is a great album. There's a lot of horseshit in the 80s, too. There's still still brilliant artists. There's always going to be brilliant artists, but there's a lack of that psychedelic progression that Hendrick definitely shifts into a weird Everything gets weird. Everything gets weird. Yeah. And but by the 80s, late ' 80s, they figured it out. They figured out how to appropriate the counterculture thing and put a corporate look on it. Well, it was cocaine. They they they killed they killed the psychedelics and it entered into an area of cocaine. Like you see movies get real weird. Like a lot of movies are like like real stupid. Like they don't make any sense. They're dumb as [ __ ] And then you go back to like 1963 and you see The Hustler and you say, \"Okay, why were they so good back then? Why why were so many of these movies so early, late 20s?\" Yeah. Early Frank Kapper just watches like a normal modern film. Yeah, there's some great movies, man. When you started comedy, what is this early 90s? 88. 88. So you there would have been a period like it seems like cocaine was big in American comedy circles for a time and then retreated. Yeah. But it it disappeared at a certain It doesn't disappear everywhere. There's some places that are still they love the coke. I don't run into active drug addicts very often. Well, people do cocaine. They don't last. The the weed comics last. The [ __ ] coke comics don't last. Heroin people keep going. Well, until they don't. Yeah, but the red hot chili peppers look great. They've been preserved. They're clean. I think they're clean for a long time. I think they did back in from time to time. You think so? I don't know. I I think after By the way, I think they But they were a heroin band for ages. Yeah. Iggy Pop. I don't know if he's still on heroin, but he's looking Oh, he's terrible. Poor Iggy. He looks so But he looked that way 30 years ago. He's like Alice Cooper. He looked like a weird guy. He looked but he looked old 30 years ago, but he had like he was lean. He moved around on stage with a shirt off, but now he looks like he could barely walk. Yeah. guys. Like something's wrong with his Did you see the AC/DC one? That was like last week. You got to see Iggy Pop first. How bad? I saw Iggy Pop like 10 years ago and he was great. He's great. No, dude. I I had to kick a woman in a mosh pit. I was He was dragging people. He was saying, \"Come on stage, everybody.\" And I One of my favorite green room songs is Passenger. Yeah. [ __ ] great song, man. After the show, I couldn't listen to Passenger before a show. I'd be too sad. Really? Yeah. All right. All right. I'm a passenger. Um, what's he look like now? Is he Is this 2023? Yeah, he still looks good in the face. No, no. Like he's still killing it. It's just he has a hard time getting around. It looks like there's something wrong with his See, like it does look like he's got spinobipid in there. I think he's got something wrong with his hip or something, which is super common, especially for\n\n\nPerformers who dance around on stage a lot. Go crazy.\nYeah.\nOh, yeah. See?\nOh, so he's having a hard time moving.\nStill killing it, but like, let me hear some of that. Check out after that.\nBring up the AC/DC at the moment. It's very\n[Applause]\nOkay. He's very old.\n[Music]\n[Laughter]\nIt's just he's still got something.\nHe's got it. He's still Iggy Pop, but his body's struggling. And like I know a lot of guys like Ted Nent had to get both his knees replaced because he was jumping off amplifiers. Yeah.\nUm, Maynard from Tulle, he had to get his hip replaced. His hip was [ __ ] up.\nThat's why Neil Diamond had the right plan. Just stand there.\nStand there.\nJust sing your beautiful songs. You can do that forever.\nYeah, it's a good move.\nUh no, they all get\nIt's hard, man. You're bouncing around on a stage all the time, stomping the ground. Like Anthony Ketus, his knees all [ __ ] up, man. Ah, he like I I went to see them. Great.\nHe's great. He killed it. We went to see the Chili Peppers when they were in town and then afterwards he's got an ice his knee up real bad.\nYou know, he's still on stage though.\nYou don't notice it.\nEvery time someone says they don't like the Chili Peppers, I distrust them immediately.\nThey're great.\nSuck my Kiss is a [ __ ] great\nThat whole album is start to finish.\nI found a different video of them. AC/DC shirts. I think that one video we saw was just kind of weird thing. He looks all right. There was one. He looks okay in this one.\n2025. Yeah, there was a viral video going around where they looked a little slow and\nno, he's still got it. I take it back.\nBut this is I mean, if you were a classical composer, you just get to be old and wear your big powdered wig and keep writing till you're 80. As a rock star, a big part of it is that you physically threatening and that women want to have sex with you, right? Like this is this is\nHave you seen Have you seen Mick Jagger's girlfriend?\nUh, yes. She's a beautiful baby. She's so hot.\nShe's so hot. She's so hot. And she's like 30 or something like that. And he's thousand.\nI got to meet Aluccino's baby mama.\nBut but you got to see the pictures of Mick with the girl.\nLook at this.\nYeah. This is the one.\nWhat's that?\nThis is the one that went viral.\nBut he's just stomping on stage.\nIt's the way he's saying Oi. Wow.\nLet me hear it.\nAC/DC urged to retire after recent concert footage goes viral. [ __ ] we hear this.\nHe does seem tired. I don't think he should have to retire, but\nstill play a long set. He probably is doing all right.\nThat's our greatest export.\nThat's for sure. We've never done anything that great before since.\nListen, guys get old. It's hard to come up with the the full power always when you hit that age. But what was the point? Oh, MC Jagger and his new girlfriend.\nHe's Fly Honey.\nOh, she's so hot. And he's at least a million years old.\nHe\nHow old is he?\nYeah, I got to see him like 10 years ago and he seemed old then, but he was still grooving.\nOh, dude. I saw him in town as well. I saw him at uh the Circuit of the Americas. They did this gigantic outdoor concert. It was [ __ ] incredible. Look at her. Bam. Son, what's up now? Dude, she's so hot.\nAnd she's like, I can't believe I'm with MC Jagger. That's what talent does.\nHe seems happy as well. He seems\nI would imagine that would make you happy.\nI mean, yeah, but then she's talking about her young woman things and you just want to read the Financial Times in peace. And\nI don't know, man. Maybe maybe that's why he's so good still. Maybe he stays young.\nHe's still hip.\nThey [ __ ] killed it, man. They killed it at Kota Aluccino. I She was backstage and I\nAnother kid\nI got another one.\nYeah,\nanother one.\nI got dragged away when I met her cuz people thought I was going to ask weird stuff.\nSo, this is a new gal.\nYeah.\nOh, boy.\nHe's 85. Holy.\nHe still looks good.\nWhat do you want me to do?\nShe's got a great I mean\nWow, she's hot.\nIt does start to look like your Oh, they split. I think that's the one I meant.\nThat was the one that he split with, but he's got another one.\nWow.\nGood for him.\nHe loves breeding. He's still out there doing it.\nListen, don't give Elon [ __ ] Don't give him [ __ ]\nI just like it done the oldfashioned way. I like the Genghask Khan rooting his way across the step. I'm I fear.\nAlso, like Elon's in he's one of the only billionaires who allows himself to be seen and judged and thought about.\nBut if we had a list of the top hundred richest people in the world, we would know\neight of them. Like these are the hidden figures who are doing that. That's\nWell, the real richest people in the world are probably the oil bill,\nthe SS.\nYeah. Because they don't even have to tell you how much money they have.\nYeah. Once they're building an ice\nYeah.\nWhat a toboggoning room in the desert.\nBro, they they're building that that the line. Have you seen that? Like\nthat's going to be nice.\nMaybe it will be. They have so much money. They can make it nice.\nYeah. Look what they did to Dubai. You ever see those timelapse photos of Dubai?\nBut they didn't even put you can't even go to the toilet in that in the Burj Khalifa.\nWhat do you mean?\nThey didn't put like It's so big they couldn't get plumbing to work it. So they have like trucks come along and pick up the poo from downstairs every day and have to drive it out. Like it seems like a fake.\nOh, that's an error. Someone needs to be fired. Somebody's probably killed.\nSomeone has uh has been quietly chopped into pieces.\nOh, 100%. Right. They've got\nbecause how are you going to fix that?\nThe Burge Khif is like how many stories?\nIt's too big\nand it's all buckets of [ __ ] being carried out.\nI believe I could be getting that wrong, but someone told me that they have like semi-trailers that come by in the morning.\nAn old hoax.\nIs it a ho? I take it back. I got one wrong. I was right about the footbinding. I was right about\nWe should probably edit that out so they don't kill you.\nNo, it's Hey, I No, I love the kingdom of SA. I'm a big fan. I could be God on Compromat so easily. Send me a new car.\nI'll say great things about the regime.\nNo one has come to me. Not even someone selling dick pills or nothing. I want to get to that level.\nIt's coming.\nIt's uh I I don't see I\nCome on, bro. More more appearances like this and\nit'll all happen.\nI'd be doing gamble. I'll be doing DraftKings.\nYeah, there you go.\nI don't think I could I'm trying to figure out what companies I would have on my podcast and I wouldn't. But\ndo you gamble at all?\nYeah, but I don't like the companies. I like, you know,\nregular gambling.\nRegular. Oh, but yeah, money for this.\nIt's ruined footy in Australia.\nEverybody,\nI think we're the Now, I will I will write on this with Australia's the highest per capita gambling losses in the world.\nWow.\nAnd it's we beat Singapore. We shouldn't be beaten the Asian countries. Asians should have gambling down pat.\nIs that because you don't have freedom in any other place? So, you went crazy.\nI think so. I think everything is so safe that it's like I've got to lose everything on this.\nYou go crazy on that one thing. The gambling thing. Yeah.\nOh, no. cuz booze is expensive. And but then the way that they advertise on you, you always have to see the line.\nYou can't watch a game of football with someone cuz they go they don't just want their team to win anymore. They want like this guy to get 27 disposals and the second goal of the game. It's like just I want to watch footy. But gambling is very exciting.\nYeah, there's a thing like that in MMA, too. You know, it's a it's a big factor in MMA.\nI think like if your guy gets, you know, he wins but by submission, then you're upset because you didn't knock the other guy out and you lost money. There's like the Drake thing too because Drake spent he he bets like the rapid big money on the UFC and\ndid he bet on Charles Olivera or Ilia Toporia?\nThat was nutty.\nOh my god.\nI wish that Also, it was uh\nthat was the first one of those I've since I met you.\nHe bet 200 grand on Charles.\nYeah, see that's they call it the Drake Curse.\nYeah, there's a website that whoever he bets on goes down.\nYeah, Drake betting history\nreturned zero dollars. Um, who is he?\nHe's not cursed. When it comes to UFC overall, though, he's up a million bucks.\nOh, all time from his public UFC bets, from his public ones. Over 25 bets, he's wagered 13.45 million, returning 14.48.\nYeah, but everyone knows.\nHe's won 10 out of those 25 bets, losing 15 times.\nYou go public when you win.\nInteresting.\nIt's a guy who comes back to the office on Monday and goes, \"Look at that. He's only won 40% of the time. His average UFC bet size is 538K.\nThat's interesting though because he's only won 40% of the time. He just bets big when he's sure and so he's ahead.\nHis biggest single loss was uh Adosnagna to beat Alex Pereira in 22. The one that uh Pereira won the first one. Single bet victory was Jon Jones over serial gone.\nSuccessfully uh predicting Jon Jones to win by submission. Interesting.\nHold on. But this is a whole website dedicated to it. He could have set this up.\nNo. No. It's commonly known.\nHe's betting on cricket.\nYeah.\nWhy is he betting on cricket?\nHe likes to bet, dude. He's rich as [ __ ] He gets his jollies off like throwing large numbers at stuff.\nThree bets on cricket returning 2.65 mil.\nSo he's ahead.\nThree for three. So he knows what he's doing.\nThere you go.\nHe's making money.\nYeah, but you always bet on the Royals in the cricket.\nWell, if you're going to bet though, betting on sports where you actually know the game. Yes, that's a smart thing to bet on. Like I bet if I bet on fighting,\nI bet I'd be right 60% of the time.\nYou'd be There'd be a You'd have a deal where they'd say, \"Don't you dare.\"\nOh, no, you can't. The UFC won't let you. But that was only recent, man. That was recent because there was an accusation that one of the trainers had been posting on some website and um that they knew that this guy was injured.\nYeah. And the guy lost in the first round and there's a bunch of money that's not on him losing in the first round cuz he had a blown out knee.\nI think there was a footie player in Australia who was betting on himself to kick goals which was like not like you have to he was backing himself and it was like $15 or something. It was very small but he just\nhe got in trouble for that.\nHe got in trouble for that even though like\nhe's betting on himself. He's bet on himself to do well.\nI think if you bet on yourself to win, that should be legal.\nIt seems I bet on the Eurovvision Song Contest. That's my go-to.\nFighters have made like personal bets with each other. Like I'll bet you the entire first. Yeah, that's that's what makes it more exciting.\nYeah. But there's definitely room for if if if there's room for someone to throw it, that's an issue.\nThat is an issue. That's an issue with fights. Eurovision is a good bet.\nIf you found out that a fighter bet against himself, like, oh god. Or if the trainer bet against the fighter, which has happened before. That has happened before.\nIt was like anonymous back in the day, like in the old boxing days, like people could throw fights and you know that that [ __ ] happened all the time.\nUh was it on the waterfront? That's why.\nYep. Yep. Yep. Yep. Marlin Brando. Yeah.\nThat also um that that has 100% happened in MMA, especially in Japan. In Japan in the early days, there was a lot of fixed fights and you could kind of tell some of them. You watch them, you're like, \"Oh my god, it's fixed.\" But it was be like because a lot of the Japanese stars originally in Pride came from the world of pro wrestling.\nYes.\nWhere they had determined outcomes.\nAnd so some of these guys were stars and there's a few fights that they had as stars where it was a fixed fight.\nBut like that that Logan Paul uh Mike Tyson fight.\nYeah.\nHe could have knocked him out earlier and clearly was choosing not to. I mean he bows to him at the end.\nIt seemed to me like sparring.\nYeah. when I watched it, which you know, look, I paid for it. They got me. I thought it was going to be a real fight, but I'm not mad because I'm just happy that Mike Tyson made a ton of money and I'm happy for Jake Paul that he made it and and look, if he decided not to try to hurt Mike Tyson at 58 years old, sure, but there's some guy out there who had a million dollars on\nThat's the problem. That's why, look, maybe it was a real fight. Maybe that's just the level that they both fight at.\nHm.\nBut, you know, it seemed it seemed a little sus,\nyou know,\nit was I mean, we watched that in the green room, I think, and we couldn't get it couldn't get it going.\nYeah. But I think that, you know,\n\n\nAt the end of the day, it's okay. It doesn't bother me. It's a different, that's a different situation than someone like Terence Crawford fighting Canelo Alvarez. And I don't think that that fight's legit. If I saw that and I didn't think it was legit, I'd be furious. Like, you guys are in your prime. These are the best fighters on planet Earth. We finally gonna get to see you guys box and then you threw a fight. But that's not what's going on. You know, Mike Tyson Jake Paul was the most heavily wagered fight in years. Okay, that's a problem. That makes it a problem.\n\nUm, my opinion is I just want to say in case someone calls me into court, um, I'm a [ __ ] idiot and I don't know nothing. And don't take my advice. I love the Saudis. Don't take my opinion. I love the Israeli government. I love that nothing to do with them. That was Jake Paul promoting it. You know, it's just like but doesn't bother me. There's compromising the sport and that's like bad. It's just like if I bet on it watching it with people who have who are so in on it and then also the like man the sports betting apps they've like they introduced like chat apps in them in Australia. So it's like they're trying to take the place of social media companies where you go together and you meet your friends. Like betting should be exciting enough without having a weird, they're just trying to draw. They're just trying to make money, right? So they're trying to draw you in any way they can. Yeah.\n\nYeah. When I was uh first starting to work for the UFC, um I bet a bunch of times because uh and then I thought like I probably shouldn't do this. But I couldn't I was think I was justifying in my head. I was like I can't affect the outcome. Yeah. And it wasn't a there was no rule. It doesn't matter how you're calling it. It's not going to I'm not going to change. And also like I like the fights and I'm not going to bet that much anyway. But then my business partner on it and I, Aubrey, he would bet on things I would tell him to bet on. He was up like 80% at one time. Yeah.\n\nBecause in the o early days, like in the early like 2000sish when they were bringing in guys from like Japan and Russia, there was a lot of dudes that I knew about that the bookmakers didn't know about. Yeah. You know, like where like like when Anderson Silva come came over to America, I was like, \"Bet the house. Bet everything on Anderson.\" I mean, bet everything cuz Chris Leeben, who's a great fighter, is tailorade for that style. Anderson is one of the nastiest strikers that's ever competed in the sport. He's so good and so accurate and he just ran through Chris Chris Leeben in the first round. I was like called it cuz there's certain fights where you like this guy's special like Ilia Taporia, like if I is fighting a regular guy like bet the house on the Spaniard. Bet the house like that guy's special. There's like when Alex Pereira first came to the UFC I was telling everybody bet the house on the Brazilian. I'm like, if he touches you, you go into orbit. Yeah. Like he's just different. This is a different guy. And you just have to know about that before the bookies and then you can Yeah. But people knew about Pereira sort of, but they didn't have a lot of evidence of him being that good in MMA. They had one fight in the LFA. There was another fight before that where he lost by submission. I think maybe had one other win, but it was the kickboxing. So, I'm a big kickboxing fan. And in kickboxing, he was a two division world champion in glory, which is like the the elite kickboxing league. But the thing wasn't that he was winning. It was how he was winning. Yeah. He was flatlining people. But you have to have actually watched the fight to get that. You'd have to wa You have to also be able to critically analyze his movements. They're just different. He's just doing something. He moves different than people. And the the the way when he hits guys, it's like, \"Holy [ __ ] man. Yeah, they can all knock each other out. They're all elite fighters. I mean, the last I watched that Olivea fight and so I was we were with Nate Nate's team in uh in San Jose. Someone says this man's the man who knocked him out. He's like his punch is incredible. No one knows this like within the they were all saying like this is an easy an Oliver is going to lose because of this man's. And then when he hits him in the head, you go because he knocks him out on the first punch and then catches him on the second and hits him twice after that. But it's like If you just I don't know about fighting and then watching that I couldn't believe he was knocked out from it didn't look like it should have had that impact. Oh, it should for sure. Yeah. When you watch the punch being delivered in slow motion, it looks everything like a knockout punch. He throws his punches with so much conviction. There's so much torque and they're so perfect. Like his whole body weight is coming in. It's the the coordination of the mechanics of his movements. So like that's a big part of he also has very big fists but that's a big part especially for 145 and even in 155 like he's unders sized compared to like guys like Rofy who's like 6'2 there's like some elite guys that are big in that weight class but the way he delivers his punches it's like you just can't get hit by him man he's got so much commitment and so the the timing is so perfect when he went blam with that right hand that had everything on it no buns has eaten that shot. No one. No one. He's got the what Ferasa Hobby likes to call the touch of death. It's a perfect name for it cuz like he hits guys, they're just done, man. They're done. That seems the greatest threeight win streak in the history of the sport. He knocks out Alexander Vulcganowski, Max Holloway, and then Charles Olivera. It's the greatest threeight win streak in the history of the sport. And Vulcanowski is currently the champ. So he'll he is now he is now he came back but that's at 45 though. Okay. So he went up to 55. So Vulcganowski is the champ because he abandoned the belt at 45 because he wanted to pursue the belt at 55. He didn't want to make weight at Ilia. Didn't want to make 145 anymore. Except felt like it's too draining. Yeah. For his body and he'd be even better at 55. Turns out he was right. He's even better at 55. Like Charles Alivera is really good, man. Really good. For him to starch him like that with essentially one punch is extraordinary. But he called it, which is even crazier. He said, \"I'm going to knock him out with one punch. He's going to knock him out in the first round.\" And he also he had a celebration for his victory the night before the fight. So he went to a restaurant. He's standing on a bench. They're cheering. That is cool. It worked. I mean, listen, if you're that good and he's going to fight the the Scouseer, the Scouseer kept saying, \"Yeah, Scout kept going, I want him.\" And then Nate's team are going like, he thinks he wants him, he doesn't want him. It'll probably happen eventually because they hate each other and it'll be very marketable. I don't know if it's going to happen next. This is my first year following it. I'm I'm starting that. My brother watches it a lot. There's a lot of really good guys at 155 though. If you wanted to look if you wanted to do it according to like who deserves the shot, it would be in my mind it would be either Justin Gatey, who is a very compelling argument for uh deserving the shot. He was uh the interim champion. Beat the [ __ ] He essentially like changed the progression of Tony Ferguson's career. Like that one just by knocking him out. Just beat him down, man. It was a brutal, brutal fight. And then, you know, I mean, he's got so many victories. He just beat Faze again after getting knocked out by Holloway. He's one of the best of the best. And, you know, he's fought for the title before. He fought uh he fought um uh Kabib. Like he's [ __ ] really good, man. But what would stop him? And he's a big star and he also deserves it. The other guy would be Arman Sarukian. Arman Sarukian was supposed to fight Islam for the title, but got a back injury supposedly during because of the weight cut. He had a particularly brutal weight cut and his back locked up to the point where he couldn't even [ __ ] move. And so they had to call the fight. Yeah. And so then they brought in Hanato Moano and he fought for the title like last minute replacement. So Sukian is elite. He's as good as it gets and he could be a world champion. And so if if I wanted to do it according to not marketability but rather like who deserves it, it would be either Gage or Saruki. How often does that come into it as opposed to the marketability? I don't I don't do that, man. That's the thing. It's like I'm not involved. I I would not be the right guy for the business. Yeah, cuz like I would I would I'm kind of a purist. I feel like if you're the number one contender, you get the shot. Like that's how I feel. But I also don't know if I agree who the number one contender is all the time. I think like that should be up for debate. Like it's very subjective like who decides like what victories count for more or who would be more compelling to fight for the title, who deserves it. Like some guys have to fight a ton of guys and then other guys like Pereira, he got a shot at Adisagna like just a few fights in. Yeah. But this is what then kills this hurts boxing is when like you have a champ who just repeatedly takes on people that they can walk over to extend there's a little bit of that the victory but because the UFC is all it's one thing the UFC makes you fight the big fights and if you don't want to fight the big fights like Jon Jones didn't want to fight Tom Aspenol like then they can strip him well he didn't didn't strip him just retired but I think Jon just decided to retire legitimately I think he's you know he's partying a lot he had a long career career and he's the greatest of all time. Like at a certain point in time, you have to say enough. And at 37 as the heavyweight champion, retiring undefeated, that's probably a good move. You know, he's got one loss, but it's a [ __ ] Have you seen those late Muhammad Ali interviews where he's going back? He's going back again. And people are begging him. You don't have to do this. It's over. It's fine that it's over. You're the greatest. Any money, man? How did he not have any money? Cuz he got ripped off. He got ripped off, man. He got ripped off. And a lot of these like wild impulsive dudes, they spend all their money. Like Tyson spent hundreds of millions. Yeah. He bought Tigers and [ __ ] He was joking around about it. He had Lamborghinis and Tigers and mansions. He had a mansion in Ohio that he just abandoned. What? And like you could go like there was an online tour of this mansion and you can go and like online like someone broke into the mansion, took photos of it and everything. There's a guy who did that with Kanye's mansion in LA recently. There's an Aussie. He's written a book about John Saffron, who's one of our best. Really? Uh yeah, he wrote a book about He trespassed. He wrote a book about squatting in Kanye's mansion. He was like, you could just come in through the shrubs out the back. And I finished the book sitting in Kanye's house. He was always doing wild stuff. He was uh he was a filmmaker. He like ran naked through the streets of Jerusalem, I think. Jesus Christ. Uh what else did he got crucified in the Philippines? Crucified like on a cross. Yeah. Like at Easter they they ritualistic. They really drive nails through your hands, but they crucify people in the Philippines. Yeah, he did that. He did that. He went and got for the end for the season finale of one of his shows, he got crucified in the Philippines. Oh my god, what a [ __ ] nut. He's wild. He's a very exciting What's his name? John Saffron. Yeah, he is the man. He had Sounds like he'd be a good podcast guest. He stole a lot of Eurasian women's underpants to see if he liked the smell of them better. Oh, [ __ ] this guy. Why? Stealing chicks underwear. No. And he like he took other underpants that were not Eurasian to see if he was attracted to he he stole his Eurasian friends underpants. Jewish Australian comedian journalist. That's a lot. Yeah. Uh spent a week living in one of West's homes in Los Angeles. This what he as if Kanye didn't hate Jews enough. Well, this might I've never heard him speak on this. I've never heard him speak on John. Isn't it kind of funny though that a Jewish guy is the guy who squatted in his house? I think that's why he did it. I think he was like, \"Oh, that's hilarious.\" No, he's wild. He's hilarious. Yeah, he was that's crazy. Now that he's writing books, but his Yeah, his documentary series were great. He was in a show called Race Around the World, and everyone else would like take it very seriously. They had like six aspiring filmmakers. You know what the nuttiest spending of money was? Was um Evander Evander Holyfield, who was the heavyweight champion of the world. He made the biggest [ __ ] house. It was an insanely huge house. And then uh I think he sold it to Rick Ross, the rapper. But it's the the house is insane. I don\n\n\nI don't know how much it cost. I mean, I don't know how much it cost. I'm, I'm, I would, I don't even want to guess, but it's the craziest house I've ever seen in my life. It's like a house that you would say, \"If I'm the baddest [ __ ] on earth, I want the baddest [ __ ] house on earth.\"\n\nIs he a gypsy?\n\nHe's a Vander Holyfield.\n\nI don't know.\n\nYou don't know who Vander Holyfield is? Oh my god. One of the greatest heavyweights of all time. Have you seen the gypsy? He beat Mike Tyson.\n\nVander Holyfield beat Mike Tyson when he was Mike Tyson. very little about he knocked him out. He stopped him and then he went and bought a and then Mike Tyson bit his ear off.\n\nOh, he was the ear biting guy. The ear biting guy. That was the second fight. I didn't know about the ear bit. That was after Tyson beat him up in the first fight. In the second fight, he bit his ear.\n\nWas he losing the second fight before?\n\nTyson was losing. Okay, that's why I did.\n\nBut show, show Vander Holyfield's house. Look at this place, bro. 44,234 square ft and has 109 rooms. actually very tasty. Including 13 35 ft, uh, excuse me, 135 seat theater, a bowling alley, and a dining room that accommodates 100 people.\n\nWhere is it?\n\nSo large they named the highway on which it sits a Vander Holyfield highway.\n\nThat's crazy.\n\nThat's a, that's, I thought it would be bad for me.\n\nNo, it's not bad. No, it's gorgeous. It cost 200, estimated worth of 230 million in '94.\n\nLook at that. The wood paneling.\n\nIn '94 around that time, he had an estim, oh, excuse me. Around that time, he had an estimated worth of 230 million. Uh, it's, it's an amazing house. I mean, it's [ __ ] spectacular. And now Rick Ross the rapper lives there, which is like the perfect rapper house.\n\nYou got to spend it on.\n\nBut see if you can get photos of, oh, it's gorgeous. It's, and it's a giant piece of land, too. I think it's 100, yeah, 105 acres. Um, see if you can see an image of it from the, yeah, there, that, that one where you see, like, look at that. It does look like the Georgia sun.\n\nIf you're a Vander Holfield, that's the kind of house you want to live in when you're the baddest [ __ ] alive. Look at that place. So beautiful.\n\nI get hung up on Holyfield.\n\nYeah.\n\nI, the yachts. I like looking at the super yachts. I look like a Jeff Bezos super yacht.\n\nOh, they're nuts. But this house is [ __ ] incredible. You'd feel so lonely.\n\nRick Ross about buffaloos and [ __ ] to put on.\n\nYou have your friends live in there.\n\nYeah, but you got buffaloos. You see them every third day.\n\nOh, that's cool. He's got his own buffaloos. That's dope as [ __ ]. That's such a rapper move. Have your own buffaloos on your property.\n\nI love it. Rick Ross thanks his neighbors for helping him return his buffaloos.\n\nRick Buffalo just hanging out.\n\nThey wandered over helping him return his wander buffalo. He had to hire some cowboys to bring his [ __ ] animals back home.\n\nYeah. No one needs that.\n\nWhy not? Maybe. Maybe you do. Maybe if you become [ __ ] huge and you start doing arenas in America and you develop an insane amount of money and all a sudden you got giraffes at your house, and I got to say, very hard to say no to what the [ __ ]. I thought you weren't going to go full Rick Ross.\n\nNo, I mean, I, I would go, I feel very lucky that I got to open for Shane and he lives very humbly.\n\nYeah.\n\nUh, but like Matt still drives his old car. No, I'll be getting a big fancy car.\n\nYou're going to go crazy.\n\nI would like a Rolls-Royce. Jane lives humbly, but he's also got a Mercedes S-Class. Tyson's house.\n\nHe, this is Mike Tyson's house. They got abandoned.\n\nGiant TV.\n\nOh, somebody. It looks like somebody broke.\n\nOh, yeah. They broke, I mean, it was abandoned for a long time, so they broke all the [ __ ].\n\nThat's crazy. So, people just would break into his house when he wasn't there. So, did he just leave it there or did he just...\n\nWell, I mean, he probably was trying to sell it and no one bought it. So, that makes it abandoned. You know, there, I think Michael Jordan's house, he sold at a loss because of everything he done to it. Some guy just actually bought it and was trying to make it an Airbnb.\n\nHe tried to take the shoe gate off. He'd like the gate was a pair of Jordans with him.\n\nThat house is only worth 1.1 million. That's how crazy.\n\nAfter it's out forever.\n\nThat's a steal.\n\nOh, after it's out for how much work you have to do to fix it back up, bro. If I lived in that town and I found out Mike Tyson's house is for sale, I'd be like, \"Let's go.\"\n\nThere's been a lot of...\n\nYou think so?\n\nIn Ohio.\n\nIn the abandoned mansion. Yeah, but I'll just use some sage. I'll clear that out of there. Someone did sage last night backstage.\n\nHe left in...\n\nThere was an odor backstage last night and I came off stage sage and I, yeah. God working scary said we burned sage. I didn't know there was a big sage.\n\nSomeone evil in the room that...\n\nI think someone might have just, uh, I won't, I won't name who it was, but someone might have left a terrible smell.\n\nOh.\n\nI think someone was, uh...\n\nThat definitely happens in that room. There's a lot of people eating weird food that gets delivered to that room.\n\nYeah. I mean, I, oh, man. Cam Patterson. I don't want to, I should have said just a guy. I shouldn't have added it as Cam Patterson. But when, no, when he headlined, he bought, like, he bought, like, enough fried chicken for 50 people and it was just me and his in whole. It was like one of the first times I was hanging out with all black people in America. I just quietly whizzing.\n\nGus's. Did they get it from Gus's?\n\nI, it was like, no, I don't know where it was from. It was huge and it was beautiful. And I thought, I didn't know we had to do that in headlining. Do we have to get food for everybody?\n\nNo, we don't have to. You could definitely order food if you ever want a headline there. We'll order you food.\n\nWell, I, man, I have had good meals in that green room.\n\nYeah, me too. We get, uh, Terry Blacks delivered right there.\n\nWe'd have not a damn chance, not a damn chance burgers.\n\nBrian Simpson ordered ramen and didn't want to eat the eggs. Everyone looked at me funny for eating it. He said, \"I don't want these.\" I said, \"I, I'll eat that. I'm hungry.\"\n\nWhy not, man?\n\nThere's also, it's kind of a food. There's a pizza place next door. There's Chick-fil-A way down the road. There's a really good taco truck up the street, too.\n\nThe, and the Diddy Dog is good. There's a lot of things in vans, but I am more suspicious of eating out of trucks and vans now than I used to be. I've had enough exp, what I like is the Mexicans doing the weird hot dogs with like what they've got huge onions and capsicum.\n\nOh, yeah.\n\nI...\n\nhot, hot sauce guy.\n\nI love, I just like those men with, like, a thousand things on a little hot plate. There's less of them now there than there used to be, but who can say why? I hope they come back.\n\nWe'll see.\n\nIt's, uh, that was what I'd always like, there was always a contingent of the American, like, people chatting on cable news who would say that illegal immigration wasn't a huge thing and that people were inflating the numbers. And then when I got here and I, no one warned me, but I was like setting up a house and I went to a Home Depot in the morning and it was like, I was like 150 guys just out there. This, I mean, this is old hat and Americans don't talk about it anymore because you've just all known for decades that this is what happens out in front of a Home Depot.\n\nWell, especially LA. If you go to LA, it was, it was way higher numbers in LA. I think Texas actually has some pretty high numbers, too, though.\n\nThey just, they have to figure out a pathway to citizenship for these folks and amnesty for people that have been here and established.\n\nGetting in the front door is a [ __ ].\n\nYeah.\n\nAnd also a lot of those people are good people. Good people. Hard workers. What I liked is that the, the hombres out front of the Home Depot, a lot of them wearing, like, pro-American gear, like big American hats and bald eagle shirts and things. So, it's like, I'm going to be the most pro-American.\n\nYeah. Well, they just need a pathway. Let's make sure that they're not cartel members and criminals and murderers. That seems easy.\n\nYeah, it seems like it's doable. And it, it's also, they're valuable. Like these are people that come over here with ambition. That's what this country wants. They want a better life. There's so, like, I think if you pled Americans, like, huge numbers of people would support that.\n\nI agree.\n\nSo why doesn't anybody...\n\nIt's a good question.\n\nWhy can't anybody get it together?\n\nWell, the thing is, it was so, I think it's an overcorrection because it was so bad for the last four years where they had an open border and they were encouraging people to come in.\n\nThey were encouraging people. They were helping people. They were moving people to swing states. The problem is when you have...\n\nThey were admitting it. I watched the Fedman one where he was going, \"Yeah, I mean, it's what you got to do.\" Yeah, admit it.\n\nThis is crazy.\n\nIt's crazy because the thing is, it affects elections in more ways than one. Even if they can't vote, it affects the amount of congressional seats. Yeah. Dependent upon the population, regardless of whether that population is legal or illegal. So, if you have 20 million people living in a place, you get a certain amount of congressional, regardless of if they're registered. I mean, that's, that's where things get weird. That's the reality of politics in America. And they wanted to stop that. And the Democrats did not. The de, the Democrats wanted that to keep going. That was one of the things that Trump ran on.\n\nBut then also he gets in, he's like, \"Can we get the white South Africans out here immediately? Can we move a million white South Africans to...\"\n\nRight? 'Cause, like, what, you're bringing them in, but you're not bringing the persecuted Mexicans in, like, okay.\n\nIt seems like a pathway would be...\n\nBut it's also like...\n\nThe things I had to do to get...\n\nThe Africa thing is nuts, man. The South Africa thing, the killing, killing of the farmers, like, people want to deny that that exists. I have seen the rally, the kill the boar, kill the farmer. He's really, he's doing it. And then he gets on trial and he goes, he goes, \"I was saying kiss, I said kiss the bo,\" right? Yeah.\n\nWith his cold dead eyes. He's a spooky cat.\n\nYeah.\n\nI forget his name. He's, uh...\n\nYeah.\n\nYeah. They got some things to sort out.\n\nIndeed. Well, listen. Sorry. I'm glad you're in America.\n\nThat's a Johnny note to go out on.\n\nJohnny me. Johnny Bone said, \"I just re-entered the testing pool that lasted about two weeks. Figured we keep everyone's options open.\"\n\nA lot of the fighters are tweeting right now. They're very excited about fighting on the White House lawn.\n\nOh, that's right.\n\nThey're going to fight on the White House.\n\nJuly 4th, 2026. White House lawn. I knew about it. I kept it under my hat. Okay. For months. Sorry, people.\n\nThey're going to fight in the Rose Garden.\n\nThey're going to fight on the White House lawn.\n\n20,000 people.\n\n25,000.\n\nConor's in.\n\nIt's the, yeah. He says he's going to be the president of Ireland by then next year.\n\nThrow it down.\n\nHe's chosen a weird time to run.\n\nYeah, but the world's weird. James McCann, love you to death, brother. Thank you for being here. Thank you, sir. Been awesome having you around for real. You're, you're a [ __ ] great guy. If I said anything crazy, I didn't mean it. You're very, very funny, too. And if anyone hasn't seen you do stand up, go see him. I, I can't recommend you enough. You're awesome.\n\nYou've changed my life. Can I say something touching at the end?\n\nOkay.\n\nAll right. I was, I mean, I was poor. I have no opportunities. I got passed at that club and it's revolutionized. I get to pay my rent on time. I get to do comedy often and people are nice about it. This is, it's been very, very strange and I couldn't have done it if you hadn't set that club up.\n\nI appreciate that very much and that's the whole reason why we set it up the way we set it up in the first place. We wanted to make it a place where that can happen. And like I said about, like, open micers that are good, they just never saw a path and couldn't figure it out. I think we can save some of those people in the future, you know. I think we could make, we can lessen the attrition rate and we can make better comics.\n\nYeah. And, and make a real supportive community, which is what we're really doing. And, you know, that was the whole goal of the place is to make the best club possible. And the best club possible has to have development. You have to have people coming up that are really good. It's like that's the key that a lot of these, like, improvs and stuff, they miss. They don't have, like, a, a night where you can just a bunch of people are doing 15 minutes. They don't develop a local community and so they only rely on the headliners to come in on the weekend and the rest of the shows you have various headliners do one night or two nights or something like that, which is fine occasionally. But the reality is you want a vibrant development community and if you don't have that, you're not going to get new talent.\n\n\nYou're only going to have import talent every weekend.\nThere's three cities in all of America where you can reliably do it.\nUsed to just be two. This has changed it.\nAnd uh, Shane brought me over here.\nI want to shout him out cuz he...\nI was in Ohio.\nI was having a good time, but I had no... there was nothing happened for me.\nAnd then the fact that there is a place that you can come and if you're going to work hard and do it well, that I mean that's insane.\nIt's awesome.\nAh, look, I don't want to go on about it.\nWe're happy to have you, brother.\nI'm very touched.\nGod bless you.\nUh, tell everybody your Instagrams they can follow you.\nJames Donald Forbes McCann.\nUh, the James Donald Forbes McCann Catamaran Plan.\nIt's a great podcast that everybody should check out.\nI think they got books of poems.\nThat's it.\nOkay.\nBeautiful.\nHey, thanks so much.\nThank you both.\nBye everybody.\n[Music]\n[Applause]\n[Music]\n"
}