{
  "episode": {
    "id": "D7HlnKdkz7M",
    "title": "Joe Rogan Experience #2350 - Ryan Callaghan",
    "publishedAt": "2025-07-16T17:00:16.000Z",
    "description": "Ryan “Cal” Callaghan is MeatEater’s Director of Conservation, a national board member of Backcountry Hunters & Anglers, and the host of the “Cal’s Week in Review” podcast.\nwww.themeateater.com/people/ryan-callaghan\n\nGet anything delivered on Uber Eats. https://UberEats.com\n\nThis video is sponsored by BetterHelp. Visit https://BetterHelp.com/JRE"
  },
  "channel": {
    "id": "UCzQUP1qoWDoEbmsQxvdjxgQ",
    "name": "Joe Rogan",
    "slug": "@joerogan",
    "url": "https://www.youtube.com/@joerogan"
  },
  "transcript": "Joe Rogan podcast. Check it out.\nThe *Joe Rogan Experience*.\nTrain by day. Joe Rogan podcast by night. All day.\nGood.\nAll right. Ryan Callaghan. Ladies and gentlemen, we brought you in here. Hopefully, we were going to kill that public land sale deal from the big beautiful bill. And we did it.\nWe did it.\nBefore we even got you in here. Well, I mean, we're not out of the woods yet is the reality. Yeah. I mean, we're I I was hoping that you and I were gonna we're going to team up and tee off on these sons of [ __ ] and watch it die together.\nThat would have been ideal.\nI think it's dead.\nIt's It is dead. It is dead, but we're a long way from this stuff being dead ever.\nDead ever. Right. Exactly.\nIt's got to be dead forever. That's not It's not theirs to sell. It's very unique to the United States. It's an amazing thing that we have. And I don't think people in other countries understand this. I don't think people in America even understand how unique it is. Like our public lands, what what they did when they set that up, not just national parks, but all the public lands. We created this insane resource, this beautiful resource where we can go into the mountains, into the woods, and and enjoy nature. And it's ours. It's it's all of ours. And I get I mean the amount of response from listeners that live outside the country and and to a person they're like are you guys really going to screw this up? They're like how how do people not know? How do people not appreciate what you guys have? Don't turn into this country or this country or this country. Basically any other country outside of Canada and the US. I think the the real issue is the people in America that don't experience it and don't go there and don't know how insanely unique this situation is. Like I don't know how to say Chimath's last name.\nPolyhopia. Is that how you say it? Even he was tweeting that this is a great deal. Sell the land and you know we'll make some money. Like what the [ __ ] are you talking about, man? Like you don't you don't understand like that. This this was an incredible gift that they gave us when they set America up this way.\nOh yeah. And and it's not that they need to go out and experience. They can also understand just where food comes from, right? How how we get cold water and fresh water in our taps. um that public resource is working on our behalf 24/7 365. Always has been and always will be as long as we don't screw it up, right? Um so it's not just the recreational part of it. It is I mean it it is no different than if you want to think of it in these terms than some you know one arm jack pumping oil out of the ground. like it is constantly working on our behalf and it it being public land needs to be intact an intact ecosystem to do its job and there's less and less of it every year.\nSo like for instance, right, like America's grasslands, we're living, we are losing two million acres. And grasslands are kind of like a catch-all phrase a little bit, but it'd be like sage brush ecosystem, short grass prairie, mixed grass prairie, but we're losing 2 million acres a year. It's the most threatened ecosystem, not just in the US, but in the entire planet. And people are like, \"Oh, it's just grass not doing anything.\nWe're losing that development really.\"\nWell, there's development, but also uh encroachment of tree species. So, um cedars, junipers, stuff like that, working their way back out on to the prairie to the plane. And we used to have all these natural deforesters out there, bison, that wouldn't allow those trees to grow because they like rubbing up on stuff and and they'll destroy them. So, uh you know, millions of bison out there physically removing or preventing that uh tree encroachment onto the plane. Those trees are sucking water out of the ground, making it more aid, more dry. Uh water table goes down. uh you lose a lot of species diversification and people just do not know, Joe. They just don't know and they look at it and they're like, \"It's just grass.\"\nYeah. I never knew that it was 2 million acres a year. How many acres in the United States?\nUh about 2.23 billion acres in the US.\nSo that that's a lot. Like 2 million acres a year is a lot.\n2 million acres a year is a is a lot.\nAnd like I was hacking on Jamie for his uh golf swing, right? We got about Jamie's got a solid golf swing. You better leave him alone.\nThat's about all I got is the golf swing.\nLeave him alone. He can He can swing.\nJamie, what's the longest drive you've ever hit?\nI've hit it over like I mean 310, whatever. 305.\nThat's legit as [ __ ]\nI've done it.\nThat's legit, right? I don't play golf, but I I think that's pretty legit.\nI'm nodding my head cuz I'm like, \"Yeah, I have no idea. 300's.\nI set someone up to hit over 600 yards before, but it's like with the wind and the elevation and elevation helps a lot, right? Like Montana or something.\nYeah, you can hit I could hit it 400 yards in Montana, I think.\nReally?\nI have on the simulator.\nOo. Oh, that's interesting.\nThe simulator. Oh, the simulator accounts for that.\nYeah, but you don't have to dodge bears on the simulator.\n2 million acres of golf courses in the US.\nIs there\n2 million acres of golf?\nSo, that's a good way to look at it.\nLike all the golf courses in the United States get lost every year in grassland.\nExactly.\nWow.\nYeah.\nWow. That's a good way to put it, right?\nYeah. Yeah. And so we talk in as far as like the public estate, right? We have 640 million acres is the the number that you hear all the time. 83 million of those are our national parks. But thanks to the great state of Alaska, you can hunt inside the boundary of some national parks up there to the tune of about like 43 million acres. big big chunks, right? Um\nand then you you know remove a little for structures, roads, uh you know, we have over 400,000 miles of road on forest service and BLM ground.\nWow.\nI mean, it's a lot a lot, right? And then when we get into like talking about like the budgeting of things like BLM, Forest Service, they're maintaining a lot of stuff that people take for granted. Um, and then, you know, so we're down to like 580 million acres of what I would consider like usable.\nAnd then you consider what those acres can actually produce, right? which you know if you go to a super aid state you need a lot more land to support uh like mammal unulate type life than you do in a state that's got a lot more water that's growing a lot a lot of food and a smaller amount of space right\nso\nto make things palatable for people we're always doing the work of like dumbing things down dumbing down the messaging.\nMhm.\nAnd yeah, you're right. Like people don't know. They don't know because we try to distill things into like all public land.\nYeah.\nRight. But it it is so diverse which is what makes it amazing. And that diversity provides all this opportunity. And one of the things that that people need to keep in mind is we have nothing but bad examples.\nAll these other countries have gone the complete opposite way of what we have now. And one of America's largest exports are is hunters. Like we we send hunters all over the world to support these other economies. And what we have here at home is insanely valuable. And it just becomes more and more valuable because we have large intact ecosystems that you just more and more cannot find anywhere else. Right.\nYeah. And I just I wish more people appreciated it. I wish more people experienced it. There's just too many people that just are landlocked. And when I mean by landlocked, I mean in cities, urban locked is probably the best term for it. There's just too many people that just don't go out. They don't they don't know how amazing it is. It's like I always say that it's it's like a vitamin that you didn't know you needed.\nYou know, you get out into the real wild, the real woods, it's a it's a it's some kind of a nutrient that you didn't know you needed.\nOh man, I was just up on uh went up to the Arctic went up to Arctic National Wildlife Refuge to check that place out and\n24 hours of sun, right? land in the midnight sun. Uh, never gets dark and I was the only person on that trip who didn't bring like some sort of an eye cover to sleep with and and I just can't tell you like how hard and good I slept up there like really even without all over myself and it's just clean air and lots of space, man. It was magical.\nMagical.\nHow do you sleep with no eye cover? I swear to God, Joe, man, when it was time to go to bed and it started out like bed was at 10:30 and then bed was at 2:30 in the morning and then bed was 3:00 a.m.\nUm cuz you would get as that sun's kind of like making this low orbit.\nUm I'm sure you seen like the time lapses of the sun like kind of does a little dip.\nYeah.\nYou get this like hazy gorgeous light that you just wanted to stay up and and see. Um, but I'd close my eyes and and I could see like the sun going down to darkness and in my brain cuz it was just time to go to bed. It was really bizarre. And then if I had to wake up for something, it was bright light and I couldn't figure out why. Yeah. But I mean, it was so cathartic, man. like we've been running so hard and because of this public lands battle that we've been in um I think most people are like oh god it just popped up last week and then we crushed it and big win and a little larger group of people or smaller group of people is like oh it started in the house about six weeks ago and then there's a real small group of people who are like\nAugust 24th Four, the state of Utah submitted a lawsuit for uh the United States Supreme Court to take 18.5 million acres of BLM land in Utah. August 2024 is when we were like, \"Oh my god, we got to be on top of this. This is what's coming coming. Um Trump's going to win the election. It's going to set all these things up and we're going to be in this fight.\nYeah.\nAnd people were like,\nI don't even know why you're talking about this. This isn't a big deal.\nI'm like, oh, it is a big deal. This is happening.\nWell, it's such a slippery slope, too. This is what people don't know or don't appreciate. If you say, \"Oh, it's only like 1 million acres. We'll sell off 1 million acres. It'll help fix the debt.\"\nNo, it's not. The debt's $37 trillion. It's You're not going to fix the debt by selling off public land. And if you open up that slippery slope to these [ __ ] vampire developers, they're going to keep doing it. They're going to keep sucking on that blood until there's nothing left, until it's just the national parks. Oh, we preserved Yellowstone. Oh, great. And and that quite literally, you know, like Mike Lee is like the figurehead of this right now.\nUm he's on the record saying, \"We're going to sell everything. We need to sell everything. That's the plan. We're gonna retain the national parks and maybe a couple other things like and he's been on the record for damn near 20 years saying this stuff.\nWhat is who's paying him?\nThere's a lot there's a lot there, right? Like where he grew up in Utah. There's a lot of like um\nChaffet is from, right?\nYeah.\nAnd he was the he was the guy we were fighting a few years ago.\nExactly. Yeah. I mean, that's exactly why I dug this shirt out, Joe.\nYeah, I got one of those somewhere.\nYeah, I wore this shirt on your show the last time this [ __ ] was happening.\nOh, yeah. Right.\nThat's right. It was happening back then. That was like what, five years ago?\nOh, I mean, you were still in California. I mean, it was 5 years ago I moved here, so it had to be six or seven years ago.\nYeah. Exactly. Right. And it's just it's cyclical.\nYeah.\nAnd I swear to God, people didn't pay attention to this Utah lawsuit.\nWe were I went back to uh DC for you know Steve's on the board for Teddy Roosevelt Conservation Partnership TRCP.\nUm they have a a policy meeting that I try to go to uh twice two or three times a year and um I was in there with all these people that are super smart went to school for all this stuff and a couple of us were like why is nobody why is nobody talking about this? why is nobody concerned about this? And then this idea of selling public lands got really conflated with like, oh my god, if you talk about anything that's going on with the federal government, you're anti-Trump. And it was just this ultra politicized hot potato. We're like, \"No, no, no. Public lands, they're for everybody. Like, this is a nonpartisan thing. We've been talking about it since August. Here's this lawsuit.\"\nlike they're selling land that belongs to everybody. Doesn't matter what state you're in. And then like the next domino fell and a bunch of states and counties signed on a amicus brief for that Utah lawsuit, which is like a friend of the court filing because they wanted to get in like stuff's going up for free or cheap fire sale. they wanted to be in on it. And then the next domino fell, which was\nuh oh, Mike Lee's getting pulled into the White House and he's cutting deals and we know exactly what's on his mind. And it was literally just like this opening in the world where nobody's talking about 18.5 million acres. So, what if we started talking about 200 million acres or 500 million acres and it just like totally kicked the door open to this whole enchilada fire sale.\nUm, and had the dude not been as greedy, people may not have gotten as fired up about it, but you know, kind of thank God he did.\nSo, who's paying him?\n\n\nMan, I think, and I'm not an expert on this, there's some like real uh ideology here, like uh Mormon church ideology.\nUm, you know, there's like a billion people in the Mormon church.\nSo, not everybody thinks like this.\nA billion.\nI don't know what the number is.\nThere's a lot.\nIt's Wasn't it like the the most fastest growing religion there for a while?\nIs it because you get extra chicks?\nWhat is the deal?\nThere's a lot of pretty people.\nThere's a lot of pretty people, man.\nThere.\nThat's a hook for sure.\nWell, I have a friend who lives in Salt Lake and he said that like they'll literally send hot girls to try to recruit people.\nYeah.\nLike they knock on your door and they're hot.\nI mean, I can't blame him for going with what works, right?\nI mean, and also is in terms of like it's a weird religion, right?\nCuz here what's the number here?\n17 million global membership.\nGlobal membership.\nSo global 17 million.\nSo you were off by a few hundred million.\nYeah.\nA few hundred million.\nYeah.\nYeah.\nUh in 2024 they reached a 27-year high.\nWow.\nSignificant surge in in uh convert baptisms in 2024.\nI wonder what uh those hot girls going door to door.\nUm but they're the nicest people.\nThey are the [ __ ] nicest.\nMormons are the nicest.\nUh, I had a few neighbors that were Mormons when I lived in California.\nThey're my favorite people.\nLike, out of all the people in a weirdo religion, absolutely.\nThis episode is brought to you by Uber Eats.\nSummer is here and you can now get almost anything you need for your sunny days delivered with Uber Eats.\nWhat do I mean by almost?\nWell, you can't get a well-groomed lawn delivered, but you can get chicken parmesan delivered.\nA day in the sun?\nNo.\nA bottle of rum?\nYes.\nUber Eats can definitely get you that.\nFor almost almost anything delivered with Uber Eats, order now.\nFor alcohol, you must be legal drinking age.\nPlease enjoy responsibly.\nProduct availability varies by region.\nSee app for details.\nI got uh asked I was fishing down in Louisiana with a super uh grumpy old fishing guide and he's like, \"Hey, Ryan Callaghan, what do you think about Muslims?\"\nAnd I like kind of put the fly rod down for a second and I was like, \"Where are we going?\nWhere are we going with this?\"\nI was like, \"Like like all of them?\"\nYeah.\nI'm like, \"There's a lot of Muslims, bud.\"\nLike all all of them.\nI'm like, \"What do you think about Louisianans?\"\nLike all of them.\nRight.\nRight.\nI'm like, \"Come on, bro.\nHow you going to do that?\"\nYeah.\nWhat What I'm sure there's some really good ones and I'm sure there's some real bad ones and everything in between.\nLike all humans.\nYeah.\nKind of like all humans.\nSo, on the the Mormon church side of things, there's um you know, there's some doctrine, some church doctrine that says that the land is put here for the benefit of the people and you're basically, and I'm very much paraphrasing here, you're you're spiting God if you're not developing that land for profit, like for for the profit of the people.\nAnd so there is a a strong theory that Mike Lee is is he Mormon?\nYes.\nIs so indoctrinated into this part of the church that this is like his divine mission.\nOh, that's a problem, right?\nAnd so it it Yeah, I mean it's religious zealotry, right?\nUm\nI I was not aware of that.\nAnd so, but again, like that doesn't have to be representative of the entire religion.\nAnd to the people that I hang out with that are Mormon, it's absolutely not right.\nThey they're like public lands that are set aside for multiple use, don't get locked up, don't get developed in certain ways are the best thing, right?\nUm but and this is something that just like has got to get talked about.\nUm Mike Lee is like very much in power.\nHe is the chair.\nHe's a senior senator.\nHe is the chair of the energy and natural resources committee in the Senate.\nAnd like I said, he starts getting drugged into the White House.\nHe starts consolidating power and he starts telling everybody, \"Hey, I'm going to put this amendment in and you better not go against it or else for the next six years,\" which is technical.\nAs long as Republicans stay in power, he's not going to lose his chairmanship of the uh Energy and Natural Resources Committee.\nUh as long as he's there, none of their stuff is going to be read cuz it's the chair that decides what they're going to review, what they're going to look at, and what they're going to pass.\nSo, here's this dude who is leveraging everything for his personal thing and he had his shot and he took it.\nAnd fortunately, people started cluing in and there was enough of an on-ramp that there was blowback literally in every every state, all 50 states.\nPeople wrote in to first their representatives, then their senators, and it created enough of a, oh my god, this is going to set back the entire big beautiful bill.\nThis is only one part of the dumpster fire that is the big beautiful bill, but it's going to take this whole thing off the tracks, and that's that's why it's killed.\nNow, Lee issued a statement which is like a gutshot if you're in my position who've been like tracking this thing, you know, since August.\nAnd, you know, it said, \"Oh, I listened to the American people, right?\"\nWell, he rewrote the language.\nHe and his team, his staff rewrote the language four different times to get it passed the Senate Parliamentarian.\nIt it did pass.\nAnd you don't do that if you're listening to the American people, right?\nThe American people by the end of this were very united in saying not one acre.\nIt started as not one acre in the budget reconciliation process, which is, you know, part of what they're doing here in the big beautiful bill or is what they're doing.\nUm, and the the phrasing there really matters, right?\nLike we have systems in place for land sales, legal framework.\nThose both of those, you know, it's acronyms, government acronyms, FlipMA, FlitNma.\nUm, and the revenues from land sales go back into acquiring land of greater value.\nUm, there's all these acts since 1781.\nAll of these acts for the disposal of federally managed land.\nAnd and that those two that I named are are the the most recent.\nAnd they're designed to uh maybe not retain the same acreage, but provide the most value to the American people.\nAnd what Lee was doing in this reconciliation process was completely circumventing that.\nAnd as you mentioned, like nobody no citizen of the United States is going to feel any change from dumping $100 million into the federal treasury right now.\nAnd that's where the money was going.\nWow.\nNo.\nH.\nSo going forward in the future, how do we make sure that this never happens again?\nDo we have to just keep doing this every few years when it comes up?\nYeah.\nWell, yeah.\nI mean, and that's that's the like the the best thing that could have come out of this like we are going to make we made this huge stink, right, from PE all the different buckets that politicians pay attention to, right?\nAll the different user groups, Democrats, Republicans, independents, everybody came together and more than likely a shitload of people, the 36% of Americans who didn't vote in the last election probably chose to spoke speak up, some large percentage of them, um, and said no public land sales.\nHopefully that created enough of, you know, what they call it in Washington is like a third rail issue.\nIt's like doesn't matter what side of the aisle you're on, you can't have this as part of your agenda because you're going to get shot down, right?\nThat's that's like the the nearterm win because that feeling won't last forever, right?\nThere's a piece of legislation out of Ryan Zinci's office who's our Montana congressman and he was actually uh started as Secretary of the Interior under Trump in his first term.\nUm, Zinci has this public lands and public hands act and it would not have prevented what just happened, this budget reconciliation thing, but it does um put some more guard rails around the sale of federally managed land and that would be like a really positive thing.\nHowever, just like I explained, like Mike Lee's position in the Senate, it would have to get through him.\nLike, it's got he's got to be circumvented.\nThere's no way he's going to vote for something like this.\nAnd it's got to go through the House and everything I've heard about uh in on the uh House committees is there's some people there that don't want to see this thing happen.\nSo, um, more people are signing on to the Public Lands and Public Hands Act, which is awesome.\nShow of support.\nUh, Senator Hinrich out of New Mexico's got it written for the Senate.\nNo Republican co-sponsors.\nHe needs Republican co-sponsors in the Senate just to get the ball rolling there.\nUm, but we still have like these knuckleheads that are saying, \"If you didn't vote for my thing, I won't let a single good thing happen for the next six years.\"\nThat goes, you know, provided they don't get removed somehow someway.\nYeah.\nThere.\nSo, it's really interesting when you see these bills because these bills are like I think they read the entire bill on the floor and it took 14 hours and no one was there.\nThey just read it to an empty audience cuz nobody sat around for 14 hours.\nSo what was it 900 pages?\nYeah.\nYeah.\nYeah.\nIt's just like how who's how are you signing off on things that I know you're not reading?\nLike how crazy is that that this is a part of our process of government is that they pass these bills that have all sorts of weird [ __ ] piled into them.\nYeah.\nGood things and bad things all together.\nAnd you have to figure out like how much of the bad stuff do you allow because you want the good stuff and they all have to make these weird shady [ __ ] deals.\nYeah.\nI mean, I got that text, the official text, you know, essentially as soon as it came out and public land sales were page 202.\nSo, I just went straight to page 202 and read through the new language uh to see what because it was another revision by Mike Lee to see if he could get that thing passed.\nUm it was just typical crap like he's not listening to anybody.\nHe's still push pushing his agenda.\nSo, when he revised it, what were the revisions and why did he put those revisions in?\nSo he started at uh US Forest Service land and BLM land uh which would be how many acres all told?\nWell, it would have been a possible like 500 million acres area in 11 western states and I I want to say it would have been two to three million acres actually sold within five years.\nSo, you're identifying out of 500 million, then you're narrowing it down to uh 2 to 3 million acres of um uh forest service and BLM land.\nAnd then, you know, he says it's for housing.\nIt's for housing, but a lot of that is nowhere near development.\nA lot of it's nowhere near development.\nAnd the language of the text even on the very last revision where he's supposed to be listening to American peoples and he did throw in the word hunters there.\nHunters, I'm listening to you.\nUm it it says like bullet point one must be near existing infrastructure and then bullet point number seven I think it was was like or very hard fire far away and hard to manage.\nRight.\nWhich is all the rest.\nYeah.\nSo like somewhere in between here.\nThat's so crazy.\nThat's such a crazy piece of language or far away and hard to manage.\nSo all of it.\nYeah.\nExactly.\nLike it just it's so vague.\nHe wants to get it through.\nAnd then there's super fun language in there too where it's like okay right of your first refusal is going to be state um then local government uh through tribes in there and then uh the only other group would have been land owners within the checkerboard pattern how we have like that you know grid system of uh federal land ownership and and private land ownership.\nUm those land owners could also purchase more than anybody else would have been allowed to purchase.\nSo state local then your uh tribes and local land owners.\nSo basically like a huge handout to you know like you know the corner crossing case that we've been talking about right Iron Bar Holdings they would have just purchased all those checkered board pieces and would have been legally allowed corner crossing to people.\nSo what corner crossing is is like say if there's an enormous piece of public land but the only way you can get to it is to cross over a very small corner of private land.\nFor the longest time that was prohibited and you would get arrested.\nSo you get arrested for trespassing, you know, and we're talking about like a couple of feet.\nOh, not I mean not we're talking about something so small you can't even possibly see it, right?\nThat's that's why it's been it's like a theory, right?\nIt's it's like for all the physics majors out there, right?\nIt's like that game of like, well, how do you get someplace if you only go 50% of the way, right?\nYou'll you keep going 50% and 50% and 50%.\nIt's like a a theory.\nWhereas in reality, like all it is is a footstep.\nYeah.\nLike you're going to cross that corner in a footstep.\nAnd we know where corners come together because it's right here.\nBut that theory thing is like well the and then the airspace all the way down to the center of the earth and to the heavens is how it's written.\nThe crazy thing is like you could legitimately do it in a hop.\nSo you would never have stepped foot at all.\nMy 97-year-old grandma who's hooked up to an oxygen tank could have stepped across.\nLike I mean it's we're not talking about a feet of any sort.\nWe're not talking about like a football field that you have to cross.\nNo.\nNo.\nWe're talking about like a couple inches.\nYep.\nSo just like so nuts.\nOh, it's it's infuriating is what it is.\nSo, just like on your your checkerboard at home, pick any four corners that come together where the two reds, imagine those are public and the two blacks are private.\nHere it is.\nThere you go.\nExplain it.\nRight there.\nSo, those little tiny spots in the corner, you were not\n\n\nSupposed to cross, right? Which is so crazy. Yes. That is so bananas that that was a real issue. Exactly. And look at this. No trespassing. Yeah. And so that's really interesting. That's the corner right there. Yeah. Isn't that nuts? Like that little spot. No trespassing. That little tiny gate is all you need. Those two posts that are in the ground, those two signs to prevent people from accessing land that's theirs. So that is where the corner is. So if you go through that little thing, that little area right there, you're breaking the law, which is insane. And now currently in the state of Wyoming, and I got to give a shout out to Wyoming Backcountry Hunters & Anglers for having the spine, the backbone to um bring this help bring the people who were caught and prosecuted for corner crossing uh you know, and support them financially. We did a ton at MeatEater, too, to help that legal case. Um, it went to the state court, then the Supreme Court, and then the ninth district court, and the last I heard is Iron Bar now wants to take it to SC, you know, the Supreme Court of the United States, Scotas. Um, and have which is ultimately really good. Uh we always joke that we're going to send old Fred Echelman, the owner of Ironbar, like a public land owner t-shirt because he's going to make this stuff public for everybody. Uh cuz it's going to be right now there's only two federal cases that have defined corner crossing. They're both in favor of the people of the United States. So you can legally step across, shocking, I know, from one piece of public to the next piece of public. Um and then if and when this thing makes it to the Supreme Court, the only reason he hasn't filed is because of this stuff with Mike Lee, right? It would have solved all of his problems. He would have just purchased those checkerboard pieces of BLM land within his ranch boundaries and just been done with it. Yeah. Right. And and that's a really there's a lot of those pieces in a lot of states and states actually fund the uh ability to trespass for hunting on a lot of those landlocked pieces um in to create easements. Yep. Exactly. Yeah. But and you know, but it's typically done through like the state wildlife agencies where you get an easement so people can go out there as if you got a conservation license, you can go hunt out there. This is an advertisement from BetterHelp. Stress in the workplace is becoming an issue around the world. Did you know that 60% of the global workforce has reported experiencing higher than normal levels of stress? So, it's more important than ever that we learn to take some time for ourselves. Plan a nice long holiday this summer. Go hiking. Read a book, play video games. I found that even a few minutes of meditation can help. Another great option is therapy. Everyone can benefit from it, and it's arguably one of the better long-term solutions to stress. Therapy can teach you how to positively cope and manage anxiety while improving your self-confidence and self-awareness. It can be very empowering, and thanks to BetterHelp, therapy is becoming more and more convenient. All it takes is a few clicks to join a session. You can also join from anywhere, whether you're at the beach, on your vacation, or at home after a grueling day of work. Plus, as the largest online therapy provider in the world, BetterHelp can provide access to mental health professionals with a diverse variety of expertise. Our listeners get 10% off their first month at betterhelp.com/jre. That's betterhp.com/jre. Well, it's it's also today I could imagine how a long time ago you would get a lot of confusion and it would lead to people trespassing accidentally on public land or on private land rather because we're looking at maps, you know, and people would be, you know, 100 yards to the left, 100 yards to the right and maybe not good navigators. But now when you have things like Go Hunt, OnX, Spartan Forge, all these apps that hunters use now that use GPS, you're 100% accurate. Yeah. Like one and a lot of the law enforcement agencies are using those same things. Mhm. So they can be on the same page as the the hunter or access seeker or whatever you want to say. Super easy to follow. Yeah. Yeah. And there's no worries at all about encroaching on private land. Yeah. And and also it's like what's the harm, right? Like when you sue somebody, you have to establish what what the impact is, what the harm is. And in in these cases that went to the Supreme Courts, they're like, \"Well, what what are the damages, right? Explain to me what the damages are.\" Right. Right. And they really can't. Right. Right. There's no damages. They just don't want hunters on their property. people that have a lot of land for whatever reason, I guess it's how they acquire a lot of land in the first place, a lot of them are greedy. Well, there's some purchasers, right? Yeah. Yeah. Yeah. Um, but that's a greedy thing. Like I, you know, you have 800 acres and there's this like little sliver and you're like, \"No, can't have that.\" Mine. I know, man. Mine. And and then I mean there's absolutely wonderful humans on the spectrum. Oh yeah. This dude uh that I I grew up with. We guided on on parts of his place growing up. Um right when I got my first ever GPS and the OnX was a a card that you inserted into your GPS. He used to come pick me up so I could open the gates for him and then he'd just BS and it was amazing. And we'd drive all over. for Eastern Montana all on his property. And and um his name was Leo uh Sul. Leo Sulf. And and we came up to this fence line and I was like I was like, Leo, did you know that this brand new fence is 100 feet on your side of the property line? And this was a a whole section, right? So it ran for a mile. and and he goes, \"Ryan, can't own the whole world.\" And just didn't say another thing about it. Like, not worth me worrying about. Yeah. Well, how much how many acres did he have? Like 30,000, probably. That's a rational gentleman. Yeah. Exactly. Right. Exactly. Somebody up. But there's people there's people on the other side, too, you know, and that's like that old rancher mentality of like, you know what? there's going to be a fire and we're all going to need to get together and help each other out and maybe I'll talk to him then about it or you know whatever cving season, harvest season, all the things that bring those communities together, these very independent people. Um they got to work together at different times of the year and that's like kind of a a beautiful thing. You can only be so much of a dick. Right. Right. Right. But then there's that other side now where it's like I'm going to patrol my property from Florida via drone. Oh god. And I'm going to hot dial the sheriff's department. Anytime I see anything that looks like uh stepping over that property line, right? Whether it's to fix a fence that I'm not there to fix or get your cattle off of my property, I'm calling the sheriff. Oh. And that that exists, too. Sure. Right. Yeah. And there it's that community breakdown which is horrifying to me. Um but also man like people don't understand the jobs that these lands do right and like you're saying like the urban folks where that steak comes from where their groceries come from. It it's not the grocery store. Like there should be an instructional video before you can enter the the supermarket, you know? because it takes space. It takes this land. And we think people think in terms of like, oh, a million's a big number. Let's say we do have 640 million acres of public land, right? Well, there's like 1.2 billion acres of land in the US set aside specifically for agriculture. And I think some like private timber land falls in that too, right? So that's that's private land. 1.2 billion where the bulk of our food's coming off ideally. Um on the public land side of the fence, we have grazing leases. Uh so you can run cattle and sheep on on public ground. You pay a a minimal I would say a very minimal fee for that, right? Um and it's based out off of an animal on that ground for a month. animal unit month aum and on our public ground that's like a dollar I want to say it's a dollar 35 per animal unit month and just in the state of Montana it just got dropped again but it it hit as high as $24 animal unit month so if you're have those federal leases it's a big thing that you want to protect too, right? So, you have to in theory show that stewardship aspect out there on the on the public land because everybody can come check it out um to retain your ability to keep running cattle out there or sheep or whatever it is. What What is going on with that American savannah? Yeah, the American prairie thing. Yeah. So, that's in the home state of Montana. Um I you know, I wish Explain that to people. Yeah. Yeah. So, basically the fear is it's going to be a privatized national park um that people aren't going to be able to go out on. Well, I don't think that's true. It might be, but I think it is. Explain what it is. It is a bunch of private philanthropic dollars, a lot of which is coming from overseas. Uh I think the the Dutch have somehow someway dumped a bunch of cash in there. Um, and it is to connect a bunch of private land and uh, Bureau of Land Management land out there, BLM, um, into one contiguous chunk, remove as many fences as you can, and allow that chunk of prairie to basically revert back to its natural state with natural species. Uh the American buffalo being like their their their big goal species, right? Um they're raising they've been done an incredible job raising cash to get this done. Um they're they're purchasing these places. Um they would say at fair market value. There's a big argument there because they have so much money they're they're going to win a bidding process. So, is it really fair would is what the the local ranchers would say. Um, but right now, and knock on wood, for as long as they exist, they're going to keep providing public access, and they have a really good public access program. So, um they they can work with the state of Montana for our private land public access program where um you know you can sign up uh either at just like a kiosk type deal sign in box and walk out on their place. Um but then they have like yurts that you can rent and they So the kiosk is just it's just set up as you get there and you you just put in your name and what time you're going there and do you have to have any kind of ID that you put in there? Nothing. No, no. I mean, the state of Montana want to ask for your license plate number. Um, and your your home address and phone number and that's it. So, um, and then it's I mean, they they have a lot of gorgeous ground, honestly. You know, when we did our our big float in Montana Mhm. Uh, they own uh some of that property now that that runs right up to the Missouri right there around Cow Island is kind of where we took out real close to there. Um, and they they own I mean they own some of the stuff that we hiked around on. Oh, wow. Yeah. Yeah. But their their their vision is to have this big contiguous chunk and have it run like uh you know pre-European civilization here on the North American continent. Wow. Yeah. Yeah. And it's I mean it's gorgeous stuff. And uh they they provide for some uh buffalo hunts out there. So you can draw a tag and uh go out and shoot uh a yearling or an old bull and they give you It's not like a handhold thing. When they say an old bull, uh how do you determine? Just by sheer size. Just size. Yeah. So, you have to be experienced. You have to know what you're doing. Yeah. And they'll they'll give you some some classes and some pointers, but they don't hold your hand and say, \"Hey, come shoot this one.\" It's like, \"Here's this information. Return it when you're done. Rules of the ranch, all that stuff. Go through this gate. Enjoy it. Leave it how you how you found it type of thing.\" So, and I've I've never done it myself, but people have had really fantastic experiences out there doing that. And obviously that's an absolute shitload of meat, right? Oh, yeah. And if they do that widespread, like what is the ultimate goal? Like how much land are we talking about? And like are they bringing animals in or are they allowing the existing animals to breed? And like how are they doing it? So yes to allowing the existing animals to breed and yes to bringing the animals in. So um they're coming out of the I think the Yellowstone population more than anything and then they work with the the local tribes up there to kind of uh bring those animals in and uh some go to the tribe and then some go stay on the prairie I think is how it goes. Um, and then the reason that they're allowing uh for these old bulls to be shot is because they're no they're no longer breeding, right? Yep. It's interesting. Have you ever read Dan Flores's piece on American buffalo? Yeah. The Buffalo diplomacy. What was it? Buffalo ecology. Buffalo diplomacy. Oh, it was the I read the American Serengeti. Yeah, that's great, too. the what his theory is and I think it's valid that the time where they saw millions of buffalo was because the Native Americans had been wiped out by disease. This is the the idea is that there was never a time where there were that many bison. Yeah. And that the reason why there were that many bison was because the Native Americans weren't hunting them anymore because they were 90% of them were wiped out by disease. That's why when they, you know, made their way across and I guess it was like the early 1800s. Oh, like Louiswis and Clark. Yeah. When they saw millions and millions of bison, the reason for that was that human predator\n\n\nPopulation was in a trough. Yeah, exactly. And it allowed the bison to be in a spike. Yeah. Yeah. Yeah. It completely makes sense. Oh, it totally makes sense. Yeah, cuz yeah, we always have those conversations about like when would be the best time to go back if you could, right? And um, and also how could it be that that big total buffalo population number that always gets thrown out there was really on the landscape, right? Like why wasn't there a balance of predator and prey where there always is if it was really natural? Mhm. Right. It does make sense. Oh, it totally I mean humans have been stirring the pot forever. That's why it drives me insane when people are like, \"Well, before people Yeah, [ __ ] that. I'm like, well, what are you talking about? One that doesn't get us anywhere right now, right? Before people's the dumbest [ __ ] argument ever. They were here first.\" Well, this is the argument they use with wolves, you know? Like, they were here first. Like, shut the [ __ ] up. Just shut the [ __ ] up. Stop. Stop. No, they weren't. First of all, I love people, okay? I'm only concerned with when people were around. So before people [ __ ] off, you want to kill all the people off so the wolves can run things. Like what are you even saying? You're right. What are we going to learn from a prehuman time? Doesn't make any sense. And there was obviously some sort of an imbalance that led to these enormous populations of bison. And I think Dan Flores is an incredibly brilliant guy. I think he makes a really compelling argument because we do know that the Native Americans were wiped out, that 90% of them were killed off by disease. We know that that's we're talking about millions of people. And if millions of people were subsistent hunters and you know they were riding around living off the buffalo following them around, which we know they did, completely makes sense. Especially when you take into account the long gestation period, you know that bison I think they have to be pregnant for a long time, right? Boy, I don't know about that one, but woolly mammoth I know is a long time. I'm sure it was cuz Yeah. African elephants. Yeah. I wonder what is for a long time. What is a buffalo gestation period? Nine months. So like a person. Yeah. Yeah. Very different than like a deer. Very different than a lot of other animals. Um Yeah. I mean, it it's badass seeing those things out there. Like, I mean, it it really really is because there's some part of like your whatever people call it these days, your lizard brain or whatever where like you know that that's their home, right? And then you see that thing on that landscape and something just clicks and you're like, \"Holy [ __ ] man.\" Pretty cool. Oh, it's it's amazing. It really It's pretty cool just to see him in Yellowstone. Yeah, you know, which is kind of weird, but the Yellowstone thing is weird. I I went there a few years back with my family and it's really beautiful and I enjoyed it, but I did not like the fact that all the elk were hanging out at the visitor station, right? Cuz they know they can't be hunted there and they know the wolves won't go there. It was real weird. They're like so domesticated. They're just like 30 yards away from a [ __ ] vending machine. Yeah, you see this big herd of elk just laying down on the ground staring at people and people taking selfies with the animals. I'm like, I don't know about this. I know. I know. Yeah. Habituated as [ __ ] as a lot of my biologist friends would say. Um, yeah, it's the national park system, right, is like it's a absolute wonderful thing. Um, I know there's lots of dedicated civil servants within the National Park System that bust their asses, educating folks, but they just can't keep up. Have you ever seen the the Instagram page toons of Yellowstone? Yeah. Yeah. Doing God's work right there. Yeah. Darwin in action. If you go to it, it's like people just getting launched through the air by bison. Yeah. And God, how do they not know by now? I mean, how do you not know that you can't get close? Because of the exact exact thing you're describing. They're like, \"Oh, it's on the tour.\" Right. Right. Yeah. It's like it's Fortunately, they've trained the bison to stand right next to the visitor information sign or the bull elk or whatever. Right. It's like this just is the way it's supposed to be. And then they'll walk right up to it to try to get a selfie. Yeah. It's [ __ ] There's one. Oh, wow. Nothing happens here besides this. They're just close as [ __ ] Well, that that in the middle. No [ __ ] way that guy should be standing there. No. If I was that guy, I would be in that car as fast as I could. I climbing through the passenger side like [ __ ] this cuz danger. Do not approach wildlife. I went uh up to watch the the bison hunting season there in Yellowstone in the the gardener entrance, south entrance to the park. Um, and a bunch of the tribes were down doing their harvest and I was riding with Montana Fish, Wildlife, and Parks. Got to do a little ride along and it was the most successful hunt they've ever had. So, this was three years ago now. Uh, tons of snow in the park. Um, some old cow bison decided to just lead everybody out. And um there's like hunt rosters, so you draw your your bison tag, but then you can also be on a list in case those tags get filled, which they never do. But this this year it did happen. And then uh all the tribes came up for their harvest. And it was amazing. Like there were people knocking buffalo down everywhere. And in fact, so many that they had to come up with a system to where they'd be like, \"Okay, between daylight and like 9:00 a.m., nobody's going to walk beyond this line. Let every because let everybody shoot and then we'll all go out together and start cutting up bison and get them out of there and then the next round of hunters can can have at it.\" It was like a safety issue. Oh, yeah. Yeah. Uh, is this actually on the park? No. So, this is it's called the zone of tolerance, which is a creepy uh creepy name if if you're asking me. Zone of tolerance. So, um, all the states, Idaho, Montana, Wyoming that surround, uh, Yellowstone National Park, they, uh, have the cattle producers have real fears of brucyosis, which is a disease that that bison and elk, uh, pack around and it causes domestic cattle to abort calves. So, hurts them in the pocketbook. Bad deal. Well, they want slash need to reduce bison populations within the park. Can't hunt inside the park, but at the same time, all the cattleman associations, they don't want those bison coming out of the park. So, what do you do? Well, they came up with this zone of tolerance idea, which is a hunting parameter perimeter around the park. uh they remove all the domestic cattle from within that zone and then the bison if they come out of the park into that zone, they're fair game for hunters. If they make it beyond that zone somehow some way, then anybody can shoot one. And uh but but typically there's like a brand inspector there to take care of any bison that make it beyond the border of the the zone of tolerance. What do you mean by brand inspector? What does that mean? Uh cattle brand. Oh, yep. Yep. So, how does that work? Well, so he's an agent of the state. Uhhuh. And he is there to in this particular case like protect the interest of of the cattleman's associations, cattle ranchers, right? And so, yeah, somehow someway he's authorized to whack those bisonas if they make it beyond. But really what And what do they do with the meat? Uh, it gets donated to uh any one of those those tribal members that that's there probably has right of first refusal at least. If not, it goes would go straight to the food pantry. Yeah. I mean, no waste. And in years past, there's been groups that go up there um just to go pull all anything that's left in the field, the um bones, stuff like that for making stock. There's groups that go up there and and literally like take the carcasses off the ground. Uh because it is like highly soughta food stuff, right? It's a lot of bone broth you can make with a 2,000lb critter. M Yeah. Wow. Yeah, that was an amazing experience. And and like the each tribe brings their own tribal game warden with them. Um they're kind of like in charge of their people. They're coordinating to maximize the the harvest. And um so they're they're helping very willing to help people like coordinate to to get their animal and get out of the field so they can get the next person in there. And that's that's part of the system outside of trapping. So they trap inside the park. Uh and then they'll take those animals, move them to a separate facility where they go through um I can't remember how long of a period of monitoring for brucyosis and then once that herd is the trapped herd is considered brucyosis free then um they can be given to the tribes or sold. Interesting. So, so that's how when people have bison on private land, that's how they get them there. I mean, there's a couple other populations, but yeah. Yep. That's one of them. And what's the population of bison in the United States now? I don't know. I mean, I think they're gunning for 6,000 just inside the park. What do they have now? Oh, I don't know, Jamie. You'd have to look that up. Um, weird. Oh, I don't know. It says estimated at around 500,000 smaller portion 31,000 managed and then like six grand in Yellowstone there. Yeah, it is very varying numbers though. Boy, they came so close to being wiped out. Oh, it's so wild. It's so It really is crazy. So wild. I was staring at uh I was like, Jeff, what's the deal with this skull? Your bison antiqua skull that you have out there? Yeah, that thing is amazing. That's from my friend John Reeves in Alaska. Yeah, I was wondering. Yeah, I was wondering where you know about the boneyard. You know about that place? Oh, yeah. That place is nuts. For a dude who likes to pick stuff off the ground, that's a that's like a porn page. Oh, yeah. It's a It's a crazy place. And there's no real explanation to why there's such a population of dead animals in this one spot, you know. you know, and he thinks it's connected to the younger dry impact theory because there's a very clear distinct line of carbon in his ground like that, you know, when you go deep deep deep into the ground which represents where these like a lot of these things that he's pulling, they're plus 10,000 years old. Like that that step bison head, we didn't get it checked. We didn't have it sent off, but yeah, a lot of the stuff he has dated, you know, older than 10,000 years. And so what he thinks is that this is one of the areas where there was an impact. You know, this younger dus impact theory. There's two time periods. One is around 11,800 years ago and then there's another one somewhere around 10,000 plus years ago. And uh he thinks one of those areas is where he was or where where his spot in Alaska is. And this deep rich layer of carbon seems to indicate some massive burn that happened through that area. And it coincides with this immense pile of bones and ivory and and you know mammoth skeletons and cave bears and all this [ __ ] like it's a small area. You know his area is only like the area where they're pulling these bones from is only a few acres. No way. Yeah. He thinks it was a wash. So with the impact came this immediate um melting of a lot of the ice caps, you know, and this is what they think happened that ended the ice age in North America. You know, 10,000 plus years ago, you're looking at more than a mile high ice in a giant chunk of North America. And then almost instantaneously that stuff gets melted. And this is this coincides with Randall Carlson's theories about this too which are also was unsubstantiated until they came up with the core samples for the younger dry impact theory andor they go no this happened like there there was a [ __ ] massive impact somewhere around 30% of the entire world was hit by comets and um this area where John has look at this 2.1 to 2.3 acres so if you look at the amount of stuff that he has I mean 2.3 acres is like a nice yard, right? It's like a nice a person's really Oh, you got a nice piece of land here. Nice yard. That's where he's pulling thousands of dead animals. Yeah. And if you look at his his boneyard, if you look at some of the um some of the warehouses that he has, this is his Instagram page. Um, Boneyard Alaska is the Instagram page, but he's got enormous warehouses filled with tusks and it's only from a couple acres. Yeah. So, they didn't walk to that spot and tip over. They got Exactly. They all got into there. Yep. Exactly. And very similar time. Look at all this stuff, man. [ __ ] crazy. And look back at the other picture when you Right before. Look at that truck filled with heads. I mean, this is nuts, man. And this is like a day's hall. Oh, this is crazy, man. It's really crazy. It's really pretty extraordinary. And thankfully, John has both the resources and the desire to um blast the perafrost with these high-pressure hoses to get all the stuff out of there. But I mean, he's trying to set up a legitimate research facility out there. You know, these scientists, they want to take the stuff and bring it somewhere. He's like, \"Fuck off. If you want to do it, you're going to do it right here\n\n\nThis is my land. We're not... He already had a problem with the museum, um, Museum of Natural History. Is that what it was? Yeah. In New York, they dumped tons of his bones into the East River. So, the property that he owned before he owned it, someone else owned it. That is his property. They took it. They were supposed to do research on it, but they had so many bones that they dumped a lot of it in the East River. And the museum denied it. And so he got divers to go look for it, and they found it exactly where they said, and they found step bison and bones and all kinds of crazy [ __ ] that's not supposed to be there. No, in a pile in the East River. Um, when we were looking at the, the, the zone of, um, tolerance, not the zone of tolerance, the, um, the range, sorry, of, of bison, of buffalo. I was thinking of your skull that you have out there, but I found a, a gorgeous one in this wash in Alberta. And it would, would be like their summer range, so north of the Montana border, not all that far up near the Saskatchewan River breaks. And you get up on these, these bluffs that overlook the river, and you're like, \"Oh, you just feel like somebody would have been sitting there watching stuff.\" And then if you look around, there's all, I mean, thousands over a lot of miles, but thousands of tepee rings. So all the tribes would go up there to hunt bison and and camp out. A little bit of cooler weather, and that's, that's where I found this bison skull. Did you find any arrowheads up there? There's a ton of them, but you can't, can't take anything up there. Yep. Yeah. Yep. Yeah. And I called Alberta Fishing Game on this thing because I was so stoked about it, and, um, they were like, \"Oh, we just consider that cattle up here.\" Like, you can take it. Like, okay. Wow. Yeah. Yeah. How old is a skull? Do you know? Well, it was such a pretty skull. People were like, \"Oh, it's got to be bison antiquis.\" But it's just, it's nowhere near. That's amaz... Is that a freshy? Did somebody make that or no? No way. No. That's a Comanche head from here. That's crazy. Yeah. I showed it to Remy, and he said it's really big. So, they're probably using it for fish. Wow. Yeah. That's amazing. It's interesting that the bigger ones like that is like kind of a normal arrowhead for elk or deer. Like if in, you know, today's standards, you know, if you look at that, that's like, that looks like an iron will. That's basically an iron will wide, right? Yeah. And they didn't use them that big. They had smaller ones 'cause they didn't have the much, that much power. They wanted real penetration. Yeah. Yeah. Um, pretty cool. Oh, so cool. So cool. There's a, a friend of mine has a ranch out here, and they've got thousands of them, you know, like the Comanche must have used that area, and he has literally thousands and thousands of arrowheads. He's got boxes of them, all just, all of them are dated and certified, like they know like what time period they came from, and Yeah. So like, why was that chunk of ground in use for that long, right? If he's got that many... Yeah. It's not because one group of people camped there for a couple of days. Those thousands of years probably. And well, it's because it's really rich, you know, it's like it's right off the Colorado River, so a lot of, a lot of resources, a lot of, lot of foliage, a lot of animals there to this day. Yep. Yeah. Um, that's one of the things, uh, that you can tell people. It's like, do you want, you want to know why public lands matter? Uh, 97% of winter vegetables consumed in the US that are from the US are irrigated by the Colorado River. 97%. So if your mommies and daddies are out there eating a nice green salad in the winter months, and all that is fed by water from public land. Wow. Like, do we want that [ __ ] to be privatized? Right. Yeah. Like, what happens then? Yeah. Yeah. Yeah. Well, Bill Gates already owns more farmland in this country than anybody. You know, I keep hearing that. Is he doing good stuff with it? There's no way. No. No. There's no way. I can't imagine that. What's his angle? I don't know. Well, I know he was in the, the [ __ ] veggie burger business for a while, but that [ __ ] went tits up. Dude, I am so anti, anti the lab grown and and... Yeah. Well, that stuff's not even a real burger. It's filled with seed oils and all these [ __ ], all this goo that you need to make sure that it connects together. And then people would pretend that it's delicious. Oh, this is delicious. You can't even tell the difference. You can't tell the difference. Where are you getting your burgers? 'Cause you, you're eating cardboard burger. This is [ __ ], and it's just bad for you. You know that that's where it went tits up when they, those studies that came out that said it's given lab rat cancer. Oh, yeah. Well, I listen, I think it's just bad for all of us because if people think that your food can come from someplace other than the land... Yeah. Then there's no value to that land. Well, it's vegetable-based, right? But then it's highly processed. It's not like, you know, you're eating an eggplant. You know, you're not eating a squash. You're, you're eating something that's gone through this insane process to make pretend that it's a burger. And you know, there's a lot of investors who lost a [ __ ] ton of money because they were lied to. They were told that this is going to be easy to make, and it's going to be really convenient, and people are going to love it, and people are looking for an alternative to meet. No, they're actually, they're not. You know, and this is the only thing that was my buddy Duncan, uh, he was living in North Carolina, and when COVID came, and you know, there was a lot of shortages in the supermarkets and the lockdowns and all that jazz. He's like, the only [ __ ] that's available here is this [ __ ] [ __ ] fake meat. Like fake meat was the only... He sent a picture, it was the only thing left on the shelf was like Beyond Meat or Beyond Burger or whatever the [ __ ] it's called. Impossible Burger. Yeah, that's a good litmus test, right? Yeah. The world's going to end, and nobody wants, and people still aren't eating it. It's [ __ ]. It's actually bad for you. Seed oils are bad for you. And those things are filled with seed oils. And there's also filled with a bunch of process, 'cause you can't just... It's not, you know, like if you want to be vegetarian, just eat vegetables, okay? Don't, don't pretend you're eating some [ __ ] fake burger. Oh, yeah. Remember one of my biggest pet peeves in life, a buddy of mine was like going down the vegan train, and we had to stop in all these towns that had like the best vegan restaurant, and I'm like... they're, they're stealing our names for food, right? The meateers name for food and toe. Oh my god. Yeah. And be like chicken fingers, Reuben sandwich, you know. And I'm like, can't you just be proud of what you're putting in your in your body? I don't care if it's just vegetables, but just eat Indian food. There's a lot of like really great Indian restaurants that are totally vegetarian. I used to eat at one that was in Woodland Hills. It was great. It was really cool 'cause you'd go in there and everyone was speaking Hindi. Nobody, you know, the, all the, the, like it was like a cafeteria place, and all the menus were all in another... I had to point at things. I didn't know what the [ __ ] it was. I'm like, \"Give me one of those. Let's try.\" Tasted great. That was great. Yeah. But it was all vegetarian. Like there's vegetarian food that you can eat that's really good. It doesn't, you don't have to pretend that it's a [ __ ] burger. It, it is a, a mental exercise, right? It's like, no, no, no, love vegetables. Can't eat meat. Meat's evil. I just happen to need all my vegetables to resemble meat. Well, and then there's the problem of what actually happens when you have monocrop agriculture because this is a lot of that stuff is coming from that. And by the way, there's way more death per calorie of food that you get from monocrop agriculture from growing just one crop in an area than you're ever going to get from meat. Like there's thousands of animals, millions of animals have to get killed in for in order you to grow this food. That's just a fact of life. Well, you used the word convenience earlier, right? Like convenience is like the killer of conservation because it, it's hard work, man. It's not convenient. Like these animals on the landscape that have been, been doing things for ever. Mhm. Like they just don't adjust to things. You know, I was talking about like the, the, the prairie, how we're losing 2 million acres of prairie a year. Well, uh, there's this super badass little chicken, lesser prairie chicken, super charismatic little dude, dances, puts his tail fan up, big cheek flares, and, uh, game bird used to be in the possibly into the millions in that, that time that you described when Lewis and Clark were, were coming out onto the prairie. Um, it is a prairie bird to the point where it will not nest within, I god, I want to say six acres of a vertical structure of any size. Interesting. Right. So, there are no trees on the prairie, no fence posts, and this bird can't nest if it's around any sort of a vertical anything like 'cause that's just the way its brain is wired. Wow. And that [ __ ] is so inconvenient for people that, uh, it's just hit the endangered species list. So, is that because it has to be completely away from all predators that it has to know where everything is? I think it's got to be, it's got to be something like that. Yeah. So, it doesn't fly. It does fly. Does it fly like a chicken does? Like short periods? No. Or does it fly like a turkey? Um, there's like a colloquial, you know, uh, hunter name where they just call prairie birds chickens. Um, it's not a chicken at all, but it's, it's like a little grouse species. What does it look like? See if you can pull it up. Yeah. So, uh, but it's a great test case for the greater sage grass. What a cool looking little animal. Oh, which one? So, which one is it? Those all the same. We can't tell. It's the... It's a smaller version of that. That's the greater prairie chicken. We're looking for the lesser prairie chicken. Uh, so, the greater prairie chicken. How big is that? Um, you're looking at like 16 to 18 ounces, I bet. We got a size on that sucker. That's the big one. So, the little one's tiny. Um, but 95% of the native habitat left for that bird is on private ground at this point. Oh, wow. Yeah. And that private ground is used for grazing. So, 24 ounces to 42 ounces. Oh, that's a big one. Adults. There you go. That's the greater prairie chicken. What a cool looking little bird. Oh, charisma. When I was in, um... This guy's got ears. Oh, whoa, that's crazy looking. Rabbit ears. Yeah. How weird. There's this awesome group of ranchers kind of in the, uh, Colorado, Oklahoma, New Mexico zone. Um, and they, they formed the Lesser Prairie Chicken Land Owner Alliance. And what they've been trying to do is get, because there's this, this huge conservation bill, biggest conservation package in the world called the farm bill. And it has a lot of, um, incentive subsidy for, um, farmers. Isn't that thing amazing? I've never seen a bird with ears like that. Like other than like an owl kind of has them, but those are so pronounced. How cool is that thing? Is that his actual ears or is that just like a weird feather structure? Those are just feathers. Yeah. But where's his ears? Behind that? They're right behind his eyeballs. So, do you think those, that feather structure enhances hearing? I mean, it has to, right? No, that feather structure is there is to enhance his sex life. Oh, let the ladies know what's up. Yeah. What's up? Look at my ears, baby. I got it going on over here. Do they wiggle them or something? Oh, they're, they dance. Interesting. Yeah. And so it's almost kind of a grouse. So it does... it is a grouse. Yeah. Yeah. Ground nesting. Yeah. Yeah. Um, it's probably also one of those animals that feral cats [ __ ] up. Oh, for sure. Yeah, for sure. Oh, wow. Look how cool it is. Wow. So beautiful looking. Look at his eyebrows. Oh, yeah. Let's go get it on. Let's go, baby. Look at that guy's [ __ ] blocking. See that? Wow, what a cute little animal. Yeah. And, uh, this thing is tied to wide ass open grass. Wide ass open prairie, right? And so, uh, what this group, the Lesser Prairie Chicken Landowner Alliance, uh, is doing is, you know, they're trying to get folks in the Department of Egg to set up some, some funding specifically for grassland ecosystems that are used for grazing. So, it's going to be good for the ranch, rancher and and good for the grouse in this case, too, right? Um, and that funding doesn't exist, but there's lots of programs to take like monocrop agriculture and turn it into CRP, which you know, mixed grass, um, basically like rest that ground. That was one of the, the programs that came out of the dust bowl era. So instead of turning the ground over and all that dirt dries out and can get blown away, we lose that top soil. Mhm.\n\n\nPlant it with grass and let it rest for, um, like a three-year period, a five-year period. Um, part of our, like, big egg incentive structures, balance out markets and all that fun stuff.\nYeah, monocrop agriculture is such a problem and industrial agriculture in general. I had, uh, Will Harris on a couple of times from White Oaks Pastures.\nYeah.\nAnd so his family farm was an industrial farm forever, and then when he took it over, it was like a 20-year period of converting it to become regenerative. And in that process, what's really, if you look outside, um, in our, um, lobby area, we have two jars of soil that were given to us by Will. And one of them is from his neighbor's property that's an industrial farm. And it's just like this weird, pale-looking [ __ ], just, you know, it's all industrial fertilizer that they have to use and pesticides and all that [ __ ]. And his is like this rich, dark soil. He's like super proud of, like, what they've turned it and converted it over to, you know, just this natural process that's supposed to exist. When animals graze, they undulate, they poop, and they make manure, and then the grasses grow, and the animals eat the grass, and it's all that's how it's supposed to be. And we've...\nBut you know what else it is?\nInconvenient.\nYeah, it's hard freaking work.\nOh yeah, right.\nIt's hard work. Well, fortunately for him, he's got a big name now, and so people seek out his food. They want to buy from him.\nBut you know these, and there's a lot of, like, bullshitting from supermarkets. It's like he had a real issue with Whole Foods lying. And even after he had stopped selling them food, they were, they were saying that it was coming from him.\nOh, yeah.\nNo.\nOh yeah. Oh yeah.\nUh, even the concept of, like, grass-fed, like, for how long? Like, and how are you feeding them the grass? Are they in a pen? Are you feeding the grass? Are they actually wandering around eating grass like they're supposed to?\nA lot. There's a lot of that, you know, like when you hear about, like, chickens, you know, they're free range. Like, what, what does that mean? Like, how much of a range?\nI just had dinner with our buddy Jesse last night, and it was insane. It was so good. Did I do...\nOh, yeah. That's an amazing restaurant here.\nOh, but we were just, I was like, \"Okay, well, tell me about this. Tell me about, you know, Longhorn and what Wagu means on his menu and and all the pigs and the things that he's seeking out and like the breed of chicken that they have. Um, but like you were saying, like, it's not just the breed, what, what's that chicken doing, right?\"\nAnd it's insane. It is so freaking cool, man. Like it's a heartwarming place to eat. And it was just like knock your freaking socks off.\nYeah, Jesse does it the right way. And he's such a good chef. He's so amazing. He, when Steve and I, uh, went to, um, uh, Utori down in South Texas to hunt, Jesse came and he cooked for us. It was the most incredible experience because, and he cooked diver duck, which everybody says is gross. He's like, \"No, no, no. This is just, you just have to prepare it properly.\" And it was some of the best duck I've ever had in my life. He just has a marinating process that he does, and then he grills it, and it was insane. It was so good, man. It was so good.\nYeah. I mean, they got nominated for James Beard on his turkey book, which is super awesome. Um, the people down there just, you know, his employees stay there. They've been there for, they're like, everybody in that house has been there for a decade, and they, they, they're just loving the stuff that they're doing and putting out, and, um, the stories that you can tell on that menu, right? Like the bread, right, is, uh, he's like, \"Yeah, I went and picked grapes out of the alley across the street,\" which doesn't sound all that great, \"but that's how he, like, started the yeast for the bread, and that's been going for six years. Uh, they got yogurt that came from a culture that's been going from, uh, for 200 years from, uh, one of their employees whose family's from India, and they brought it over.\"\nWow.\nYeah. I mean, just, I love that stuff.\nYeah.\nI love that stuff. But it takes, like, dedication and commitment to know where your food comes from.\nRight.\nRight.\nYeah. And I swear to God, when I go back to DC and I'm talking to people, like, they are so disconnected from this stuff, and I just often think, I'm like, \"God, if you guys just knew where the food comes from, right? What the land actually provides.\"\nYeah.\nWe wouldn't be having these conversations.\nNo. I mean, human beings, for the most part, in urban areas are completely disconnected. If you had a survey of how many people really understand where food comes from in your average city, I, I would imagine it's a less than double digits.\nOh, yeah.\nProbably a small percentage of people really understand.\nYeah, man. I mean, I mean, the economics of food, I've gotten really into, uh, recently because there is a real inability in certain areas of the country where the cost of getting anywhere near an actual grocery store is prohibitive to a lot of people. And so, you know, they're just like, they're [ __ ] out of luck for, for real food. And then it's a cultural thing of, \"Mom didn't know what real food was, Dad didn't know what real food was, so I don't, and my kids won't.\"\nRight.\nYou know, and, and then on the flip side of that, it's like, food comes from Door Dash. Food comes, you know, people spending big bucks.\nYeah.\nAnd they don't, and they're just as disconnected as the folks who don't have any bucks to spend. Now imagine a younger dest impact today. Imagine some kind of impact like that today to force people to actually find their own food. You know, first of all, you'd be dealing with a small amount of survivors, right? Let's, let's imagine an apocalyptic, apocalyptic scenario where 20% of the population survives, which is probably happened numerous times in human history. If that happened today, how many people are equipped to find food? How many people are equipped to live off the land? It's such a small amount, man.\nSuch a small amount. I also such a small amount...\nThink about the, uh, anthropologists digging through that bone pile.\nOh, yeah. And they're like, \"Why is it that when we do cross-sections of these bones, they're so much more unhealthy than, than the cross-sections of the bones from 4,000 years earlier?\"\nI know. Or, you know. Yeah. Yeah. 'Cause I think that's...\nConvenience.\nConvenience, man. We love our convenience.\nConvenience is killing us.\nYeah. Yeah. And I think there's a moment here. We had all these different walks of life come together and be like, \"Oh my god, public lands matter.\" We had all these businesses come together and say, \"Public lands matter.\" I got to tell you, when I was, uh, chatting with our buddy Ryan Callaghan the other day, when I was about to be disconnected for a week, right? And I've been, like, eating and breathing this, this fight, this stupid lawsuit that came out, uh, last year. Then, uh, it's in the House. Oh my god. We get it pulled out of the House. Thank God. Then it goes to the Senate. Oh my. Mike Lee introduces the damn thing in the Senate. Sneaks his language in. Blindsides everybody. And I got to get on a plane to go to the Arctic. And there's this little, like, bellweather moment where I look at, I make, like, a last Instagram post. Last thing I can do, and I see Cameron Haynes is like, \"You guys, you got to get off your asses and and call your senators. They're selling our public land.\" And the same day, um, uh, Josh Smith from Montana Knife Company did it, too. And I bring those two guys up as examples because they were also, like, like on the, the mega train, right? They were like, uh, pro-Trump in through the election. They're representing the, the right side of the political spectrum. And when that moment happened, I did draw, like, a little, little breath of relief right there. I was like, \"Okay.\"\nAnd people that aren't afraid to criticize aspects of the big beautiful bill.\nYeah.\nRight.\nYeah.\nAnd, and they're not afraid to say, \"Yeah, we voted for this guy, but this part of the, the pie sucks. It's super important to us that this gets pulled out of here, and we're going to go to go to the mat for it.\" And I'm like, \"That is, that is the thing, right? We have people who aren't so self-conscious that they're like, 'Oh god, I said this thing a month ago. I can't come out and say what I really think right now because that would kind of contradict what I said a month ago.'\"\nRight. Right. You know, and that gave me, like, really, really made me feel good. I'm like, \"Okay, things are, are starting to go our way now because all the other people who were afraid to say the same thing were like, 'Oh, thank God some other people with a big microphone came out and said it.' So now I feel emboldened to stand up publicly for what I believe in.\"\nYeah. Such a terrible thing to be so trapped in the ideology of your party that you can't stand up for what's right. That's, that's gross.\nYeah, man. And, and so unamerican, and it's being promoted though, too. Like one of the things I feel when I go back to DC is there's a lot of people spending time on making sure, not that America is better, but that that system persists so the next, next generation of short, short little boat shoe, no-sock-wearing people can have jobs.\nYeah. Those boat shoes.\nYeah. It's gross. It's really gross, and it's, uh, prevalent. You know, it's been around for a long time. This, this weird system that we have, they're, it's, it's not effective. It's not good. It's not good for anybody. And, and it's all being fed by lobbyists and special interest groups, and they're all just, they want to keep it going. They want to keep the, the grift going. But there, I mean, there's, there's palpable frustration out there. Like, I feel it every day. A long time ago, you told me. You're like, \"Dude, don't, don't read the comment section.\"\nWell, and you're a thousand percent right. I can't say how right you are, but during this time of, like, why aren't people clicking into this, right? I was getting real depressed, like, shake and pissed, tears at times over feeling so underrepresented. And, um, then when we started gaining momentum, I was like, \"Okay, what the hell else can I do? I'm calling my senators. I'm calling my, uh, representatives. I'm, uh, I'm establishing contacts with their staff. I'm, I'm talking to them about how important this is. I'm asking them what else we can do. Um, trying to build these bridges for this goal of protecting my public lands that I love. Right. Um, we're working with all these nonprofit groups are coming together. Even groups that traditionally don't focus on public land access issues, you know, like your Rocky Mountain Elk Foundation, who has done a bunch of stuff for access, but you know, they have an elk on their logo. They're, they're the elk people. And then Pheasants and Quail Forever, they're the pheasants and quail people. National Wild Turkey Federation, they're the turkey people. But they started being like, 'Uhoh, this is real serious.' And then we started getting all these people in the same room together, sharing information instead of being competitive. And then businesses started coming out and saying, 'Well, what, what can we do?' Little, little breweries down, um, in Arizona, this guy, Ren House Brewing, called me, and he's like, 'Hey, what, what can I do? I have a brewery. What can I do?' And we came out with a beer that has a QR code on the label, and it's just called rep because at that time the, the fight was in the house. So, call your representative, and you hit the QR code. You put in your, your zip code, and it connects you with your representative, right? It's like, crush beers and crush the phone lines, whatever tag you want up to. I was on, I'm on a steering committee that has REI, Patagonia, uh, Rivian, all, like, big, big companies, right, that are like, we, we want to put some muscle behind this. We want public lands to say stay public. Then we launched a hunt brands for public lands coalition and had, uh, a huge name. Sig Sauer is on there, right? They have military contracts, and they had the guts to stand up and be like, we don't want to see public lands get sold off.\nThat's awesome.\nYep. Weatherby, another firearms manufacturer. Um, you know, First Light, Mediator, obviously, but we started, like, building all these bridges and unifying groups and people and businesses around this common cause. And it's that public persistence that, that we, the people part that folks tend to kind of forget, um, that is literally saving public lands about, like, being out there public and loud, and it's working, but we need to take it to the next step, right, and maintain the momentum and stay unified. And the, the thing that was really interesting, right, is like, we're up to, up to the date, up to the absolute second that language is pulled. Before it's officially pulled, Mike Lee's team has his statement out on, \"I listened. I still want to sell public land, but I listened to everybody, so I'm not going to do it right now,\" is really what it says. And he's completely fabricating this story. He was told, like, \"This is going to get pulled. So, you can do it now and save some face, or we can pull it, and you're going to look like a loser, right?\" And unfortunately, you got the option to, like, fight again another day, which is brutal. But, um, I get that information, and I get to announce it to this awesome group of people at this off-road rally trash pickup deal that I'm out at called the Gambler 500, which is super cool. And then, um, I put that online, and I'm like, \"Hey, thank you to the Democrats, and thank you to the Republicans, and thank you for all the voices that came out and the businesses and all this stuff.\" And then I was just like, set my...\n\n\nClock as to when people were going to just start tearing each other apart. And it happened, right? And it's like, you guys voted for this. You were getting exactly what you deserve.\n\nOh, right, right, right. I did see a lot of that. You know what I mean? Yeah, I did see a lot of that. Like, no, we didn't, stupid. No, we voted because we felt like the country was moving in a terrible direction. It doesn't mean that they can't also move in a terrible direction once you get them in. The important thing is people stood up, people like you, luckily, that are very invested in this and used the considerable resources you have access to and got a lot of other people involved like Cam and Josh Smith and everybody else, and I jumped in too. That's we're just lucky that a lot of people care and recognize that this is a slippery slope and that if they got through with this and they did this, this is just one step. And if you let them sell one acre, that's why just not one acre was the best motto. It really was. Not one acre was the best motto.\n\nYou can't. It's not yours. It's ours. It's everyone's. And if you sell it, what you should make zero profit. It should go. It literally, if you did sell it, it should have to go to every person that lives in the planet or in this country rather.\n\nYeah. I mean, and we don't want it. We don't want that money. Keep it the way it is. No. The value of this stuff only goes up. Not only that, again, we're 36 trillion dollars in debt. You're not even going to put it. If you sold all the public land, all of it that we have, it wouldn't put a dent in it.\n\nNo, it wouldn't. You could strip all the timber. Yeah. Sell the land, everything, minerals, everything, not going to put a dent in it.\n\nNo, it's not. So, we got to find a better way. And you know what? It's not going to be convenient. No, it's going to be hard. And that's that's like the thing that I keep coming back to. I'm like, all they're doing is being like, \"Oh, see, we did something.\" They're not doing the hard work.\n\nMhm. Right. And this particular thing would divest the American people of, in my mind, and we we started doing it as a slogan for Backcountry Hunters & Anglers is like public land freedom. Like you are divesting the American people of the ability to be free. Like these places represent like a lot of goofballs, man. Unstructured fun. And I feel like there's a lot of people in the law making side of things that get very nervous about American people out there having unstructured fun.\n\nReally? Is that really what it is? They're like, \"What's going on out there on that BLM land? There's somebody riding a motorcycle and there's somebody shooting a gun and there's somebody fly fishing and there's somebody bird watching. There's a family camping. Can't have that.\"\n\nDo you really think that's it? Do you really think it's like they don't want unstructured fun? I I'm coming around to that thought a lot, man. A lot. Like, right. They're like, why? There's no kiosk, right? Nobody's out there charging, right, for your use of America's public lands. You're not signing a liability waiver. Oh my god. And once you're out there, you just kind of make up whatever it is you want to do that day. That's freedom, buddy. Right. And I think people are nervous about that.\n\nThat's a weird perspective. It is. Yeah. I don't know if I agree with that. I just think they look at it as an opportunity to cash in. I think they look it as an opportunity. Like, we have all this land. It's public. Let's sell some of it. I think it's just like incredibly shortsighted. I think they think in terms of literally in terms of terms where they're elected. And it's not sell some of it, right? They're like, \"We're going to maybe hold on to the national parks, but there's another play there where we're gonna turn those over to the states, right, or privatize them completely.\"\n\nYeah. Um, get full control of, like I said, like Colorado River, right? Like we're going to control the the pipes for the water sheds.\n\nYeah. I've heard that language before that water's not a right. Yeah. That people are gross, man, if you let them be. If you let them be though, they'll they'll be gross. And Yeah, absolutely. And some of these people want it purely for the fact that they can't have it, right? And it drives them insane.\n\nThere's definitely that. Yeah, there's definitely that. There's a lot of short-sightedness. It's uh a lot of people could use a mushroom trip. A lot of people that are just you're missing so much of what this life is because you're so concentrated on your election cycle. You're so concentrated on making more money. You're so concentrated on things that when you're 90 and you're in your deathbed, it ain't going to mean man. It's not going to mean a damn thing.\n\nNo. No. You could have been having fun and enjoying life with your neighbors. Yeah. It like you can't keep it. You're going to die. You can't take it with you. You're going to die. And they don't see that while they're on the hunt. While they're in the middle of this process of trying to accumulate zeros in their bank account.\n\nYeah. Got a little endorphin high, saw another zero hit. That's all they want. They're and they're competing with other people that are doing the exact same thing. So, they're in their little short-sighted echo chambers, you know.\n\nYep. Yep. Keep hope to God people learned, right? Like there's a lot happening in between elections and and you got to know if you uh weighed in during this, you made a difference. Like everybody who jumped in and wrote to their representatives and and senators and told their buddies about this and asked businesses, why aren't you on that list?\n\nYeah. You can actually make a difference in this country. Absolutely. And it's not not just at the election hash marks. Yeah. Like if people didn't hold our elected accountable, they would have been like they they just want to get this stuff passed. They're like ah path least resistance. There's some really good ass kickers out there uh on the Democrat and Republican side of things for sure, but we need to lift those people up in order to get the the rest of the the coasters involved.\n\nYeah. And we need to also let people know that this isn't this is an issue going forward now that we know this is an issue that can affect whether or not you get elected. You need to know that like we're going to be on you. You can't do this. Exactly. Like we're going to be consistent and we're gonna be on your ass. And now that this has happened and we've had some success and it worked, now people know it'll work. And so now all the Randy Newbergs and all the all the people that were like really enthusiastic about this that really did their job. Um, you know, they're getting more support now and it's it's going to build and then we'll be much more aware of whether one of these things is trying to get snuck through in the future.\n\nAbsolutely. Absolutely. I would say the early folks, right? Like, uh, Randy, uh, I feel like we were kicking ass at MeatEater. Uh, Katie Hill at Outdoor Life. Uh, Andrew McKeen, Outdoor Life. Um, uh, Travis Hall, Field and Stream. Like, those people were on it. And I think all those people have a significant following on social media, you know, and and they have a lot to lose, too, man.\n\nOh, yeah. Yeah. Yeah. Yep. Um, uh, National Wildlife Federation, Backcountry Hunters & Anglers uh were talking about this way early and then a lot of other orgs jumped in and and some early Pheasants Forever, Quail Forever. They they started, they were awesome. I just got to I got to mention them because they're like they're farm bill oriented uh hook and bullet organizations. uh they do an amazing job, but that's largely private side of the fence and they came out and started talking to their membership about this early. Um and you kind of get punched in the face. I got to be honest, like we took a lot of on the MeatEater side of things. Reella took a ton of .\n\nHow so? Just people being like, \"Uh, well, one, they're like, \"Steve, aren't you a Trumper? You can't also support public lands because that's going against Trump. Uh but this is just people in the comments, right?\n\nOh, yeah. Yeah. Yeah. Again. Yeah. Yeah.\n\nWho are those people? Oh, way too much time. Yeah. Don't Don't read them. You're dealing with such a small population of morons. The problem with comments is especially negative comments. It's such a small population and almost all of them are losers. I got sucked in though because I'm like I don't know. I was like I was so desperate to make an impact right at the end. I'm like I'm feeling like I've pulled every freaking lever that I can.\n\nYeah. I'm asking the experts. I'm like could we get and this is a screwed up piece of information. I was like, \"Okay, I want to do a Freedom of Information Act uh request, sue for information for all the senator's offices and find out how many people called on behalf of public lands and how many people called to sell them off and I want that information to be public.\" Well, those offices, they don't have to give over that information, I found out.\n\nOh. So, like where the hell's the accountability on that, right? Yeah. But anyway, I'm going nuts trying to figure out what other levers I could pull. And I would just sit there and be like, \"Okay, I'm going to find one person on the feed and just understand their side of things and see if I can pull them over to my side of things and maybe that butterfly wing effect will do some sort of good.\"\n\nYou're not those people. Yeah, you voted for this. Those people are just trying to win. They're just trying to like get you. And there people that for whatever reason thought Kla Harris would be a good president. And then there's also people that I don't even know if they're real humans. I think there's a lot of this stuff that we have to understand about social media is coordinated bot farms. And so anytime you have a hot button topic that could, you know, maybe get a bill rejected or get a bill passed, it's not organic. The comments. There's some organic comments. Some of these people that are negative, you voted for this. They're just a real loser who doesn't like people that have public profiles, doesn't like people that are successful, doesn't like people, and they just want to find some way to call you out. There's a lot of that, but then there's a lot of coordinated artificial interaction. And we've we've highlighted that and we've we've been on that for quite a while because we found out through this one former FBI guy that 80 his estimation was 80% of Twitter is bots.\n\nYeah. 80%. You know, people are having their their whole life is talking to bots then if that's the case.\n\nOh, it is the case. I I know it's the case. I don't know if it's 80%. But I I do know that it's an enormous number because I I don't interact and I'm I'm now I've I've since separated myself so far that I'm kind of not even on social media anymore. I might check it in the morning. I check Twitter in the morning to see what everybody's mad at, you know, and then I usually feel bad after I check it. I'm like, why am I even looking at this? Jesus Christ. And I just get off. And when you you do that, you feel better. You just feel healthier, you feel better. But when I do check and like there's any sort of a hot button issue, I'll look at someone is saying something outrageous, then I'll click on their profile and then I'm like, it's like a bunch of letters and a few numbers. And then I look at their profile, I'm like, oh, you're not even a real person. And then you see, oh, this is like half of the people in this aren't real people. And it's there's no laws. Like there's no I'm First of all, let me be real clear. I'm against a law where it says you have to post under your name. Your your social security number has to be registered to this account so we know you're a real human being. The reason why I'm posted that is because I think whistleblowers are essential because I think corruption is real. And I think if you hold someone accountable for everything they post, man, you're going down a dark road. You're you're don't you're going down a dark road where you could possibly get people fired for posts that you know like England is out of control right now. Like I don't know if you know this, but England I think it was somewhere in the neighborhood. How many people got arrested for social media post in England this year? We've looked this up before. I forget the number. It's in the thousands. Arrested for saying immigration's a real problem. We got to stop these grooming gangs. We got to, you know, stop these Muslims from, you know, illegally immigrating into England. Arrested, go to jail. Like, for real.\n\nThat That's insane. People do time. They're doing time. Like, no Real time for saying things like, \"I could kill for a cheeseburger. I've always said I killed.\" Not like that. Yeah. Yeah. Not like that. But, but it's mostly about policy issues. And what they're trying to do is make sure that everyone stays in line. And so they're doing this by scaring people away from being critical of the government. And the way to start it is to attack people that say anything bad about immigration. Attack people that say anything bad about the government. In fact, they just tried, they're just doing this in Brazil right now. They just passed this huge law that it you can get removed from social\n\n\nMedia for anything that's critical of the government. Anything that's critical of Lula, who's the president of Brazil right now, you get removed from social media. Like you can't be critical. Like they don't have freedom of speech anymore. And this is the slippery road. This is a slippery slope that we were going down with the last administration. What they had done during the pandemic. It's scary stuff, man. And people have to be aware of it.\n\nAnd well, I think there's a version of that, too, with what we were talking about on like the hard party politics people, right? Where it's like the social backlash of being a critical thinker.\n\nYep.\n\nIs so much that it then creates a non-thinker or you just totally leave that zone. You don't pay attention anymore. You're not going to talk about it.\n\nYep. Yeah. It's um you self censor. You self censor out of survival. You know, you realize like this is this is too dangerous. I'm not going to say anything. And that's how they get things passed because then you don't have any criticism and then you don't have any you do you don't have any people that are opposing you. It's very scary because again a lot of this stuff that you're seeing that's causing people to self-center is not real self-censor is not real human beings.\n\nYeah. Yeah, it's bots.\n\nAnd and that's my fear is that when you finally get that person to be like, \"All right, you know what? I'm going to leave this part of it behind and step out to advocate for what I believe in.\" And the first response they get is, \"You voted for this. [ __ ] you. You're getting what you deserve.\"\n\nYeah. Right.\n\nPolice make 30 arrests a day for offensive online messages. Oh god. Isn't that nuts? So, uh, officers from 37 forces made 12,183 arrests in 2023, the equivalent of about 33 per day marks an almost 58% rise in arrests since before the pandemic. In 2019, they but still like 2019, 7,000 detentions for online [ __ ]. So, what we have in America is incredibly unique in that regard. And other countries are setting a standard and it's a dangerous [ __ ] standard and we have to really make sure that that doesn't happen here and we also have to make sure I wish there was a way where you could identify bots and Elon tried to find this out when he bought Twitter. So when he purchased Twitter they told him that it was less than 5%. And he's like well how did you figure that out? And well they only figured it out they it's not real. It's not a real number, but they just took a random cross-section of a 100 users and found 5% of those people were clearly bots. That doesn't mean anything.\n\nJob's done.\n\nYeah.\n\nFound it.\n\nBut you could also do that a you could take a random section of users that interact with very non-controversial subjects and find a small number of bots. Like let's say you find a bird watching group of people on Instagram or on Twitter. Like what are the odds that those people are going to be bots? Very small, right? There's no reason. There's no benefit financially or otherwise politically.\n\nBig bird seed.\n\nYeah.\n\nYou know, coming in.\n\nExactly. Exactly. Like, so if you go after bird I I use bird watchers because I I see them all the time. You know, that's like the purest form of just this is what they're into.\n\nGreat group. Great group of people. But there's no financial incentive to support or deny bird watching, you know? So, if you go to the bird watcher group on Twitter, Yeah. It's probably 5% bots because they're [ __ ] everywhere. But if you I guarantee if you go to abortion or if you go to immigration or if you go to anything that's a hot button contra ICE raids, whatever it is, any anything hot button controversial subject there's a [ __ ] ton of them, man. And it's kind of creepy because who is paying for it? Who's paying for it? And why do we don't how come we don't have any laws to stop that from happening? Because it's not real. You're you're getting this artificial sense of what the general public wants because they've they've, you know, monetized it and they figured out a way to artificially inflate these numbers.\n\nYeah. I I think it gives this illusion of this consensus amongst people and they can do that and even with like ridiculous conclusions and I think consensus though is is so dangerous to any political party, right? Like what we just saw, there was an agenda and everybody had to stand up and say something because of one freaking person who wanted to make this happen, right? And I guarantee you, I guarantee you that what they're thinking about right now is, \"Holy [ __ ] how do we break up this consensus?\"\n\nMhm.\n\nLike, what do we need to do? We can't have bird watchers agreeing with off-road users and bow hunters, right? That's that's We can't win that, right? We need them to be only bird watchers, only bow hunters, only off-road users. But what we need to do is be apolitical. And I think we were with this, which is beautiful. So the Democrats, the Republicans, and the people like me that are [ __ ] politically homeless, they they all came together on this and said, \"No, this is stupid.\" And and all these people, you voted for this. [ __ ] you. Nobody voted for that. [ __ ] you. Like this is one guy. And if history if that didn't work, if we didn't have an impact and if nobody stepped up and people like you weren't so steadfast, that would be in the history books. That Mike Lee guy would be the guy that you see, you know, your kids see in 40, 50 years and they read the history books, they go, \"Oh, that guy that guy did this.\"\n\nYeah. He'd have a proud statue inside a giant strip mall something that used to be public land and be like, \"Why is that here?\"\n\nProbably wouldn't cuz we gave up.\n\nYeah. That's what happened. Well, it depends on who's writing the history books, right? It could be that he would be a hero. He turned it up. They generated 200 extra billion dollars that did nothing. Did nothing for this. I mean, this big beautiful bill, doesn't it raise the debt by 3 trillion?\n\nI think that's what they came down to. It started at four and now it's at like 3.3 trillion.\n\nYeah.\n\nAnd there's so much to it, too. Like like I said, this is my own personal dumpster fire.\n\nWhat Trump wants is growth. He wants economic growth and he thinks he can get it out of this and that's the overall net benefit.\n\nOh, and there's some bending over backwards, right? Like that Arctic trip that we were talking about. Um we went up to the 1002 area on the Arctic plane just\n\ndebt ceiling increased by 5 trillion.\n\nDid that just happen, Jamie?\n\nI'm just looking up. It did pass this afternoon when we started. Yeah.\n\nOkay. billion in additional border security. Well, we probably need that. 154 billion in additional defense spending.\n\nThat's you got to you got to feed the demons.\n\nThe the golden dome thing, which is not\n\nWhat's the Golden Dome?\n\nThat's spaceb base golden dome missile defense system.\n\nYeah. Trump was enamored with Israel's missile defense system and wanted one and most of the experts were like that doesn't really work with our land mass.\n\nOh boy.\n\nUm there's also hypersonic missiles. There's a lot of [ __ ] it doesn't work with.\n\nThere there's a um there's a line item in here for I think it's a few billion bucks for uh our next big birthday. America's Next Big Birthday, which I always think of affordable housing when we think of like I bet the folks like having their own little individual parties and might think it's okay to throw that couple hundred million at an issue versus fireworks and parades, you know? I don't know. Maybe, maybe. Uh but yeah, man, we got to we have got to stay unified on these things.\n\nStay unified and avoid the comments, folks. And don't be scared. Don't be scared to speak out against something that you know is wrong.\n\nAnd you jackasses, if you want something real bad, like I want public lands, public waters, public wildlife for the people real bad. I don't when that [ __ ] talker converts and is like, \"Yeah, public lands are sweet. I called my senator.\" I don't say, \"Fuck you.\"\n\nRight.\n\n[ __ ] talker. I say thank you, dude. Really appreciate it.\n\nYeah. Well, most of those [ __ ] talkers don't have good friends. The people that actually are actual human beings that are losers, the reason why they're losers is because they're in a bad spot. Okay? And any one of us could have been that person. Any one of us could have been that person that's surrounded by bad people. They have a bad job. They got a bad relationship. They live in a bad area. There's not a whole lot of hope. There's not a a whole lot of happiness. And so you try to tear down everything around you.\n\nYeah. You take put your petty [ __ ]\n\nYeah.\n\nover the top of the real [ __ ]\n\nYeah. But my perspective is look, I can't fix everybody. So I can't help you. But I don't want to interact with you. So I'm not going to I'm not I don't have the time. I don't have the resources. It's impossible. And I don't like it. I don't like arguing with people. So I don't want to do it. If you talk to people oneon-one, most people are pretty [ __ ] reasonable.\n\nPretty amazing. But really, when they're just shouting out into the void like that, guess what? You don't have to read it. You don't have to listen. You don't have to interact. It's It's [ __ ] bad for you. It's bad for your brain. Everybody that I know that's on social media all the time is super unhealthy. Every one of them.\n\nYeah. For good reason. It's a It's a trash pit.\n\nYeah.\n\nUhit worked really well in this case.\n\nYeah.\n\nBecause it allowed that community to build fast and be reactive.\n\nUm But you have to curate your community online the same way you curate your community in the real world, you know, and this is a part of not reading the comments because the comments is the whole world, you know, or the the the people that are interacting. It's not really the whole world. But again, it's just it's it's not worth it. It's just not worth it. It's not worth going in there. And people, if you want to win, like identify that freaking goal and and think, \"Okay, what's going to help me achieve that goal?\"\n\nIt's not putting your petty [ __ ] above the goal.\n\nRight.\n\nRight. You you bury that stuff deep down inside and you say, \"Great. Thank you. Thanks for hopping on board. Please tell your friends. We're going to get to this goal together. That's awesome.\" I think that's best done on a group basis. Like just make a post. Thank you to everybody that did it, but don't interact with individuals. It's just not worth it. The people that I know that do it that all get they all get [ __ ] up cuz it's just like it just takes one comment that gets under your skin that you carries you around while you're hanging out with you're at your kid's baseball game and you think that [ __ ] on Twitter, you know, and there's a lot of people out there that are doing that, man. You're watching your kid hit a home run and you're not even happy. You're you're you're mad about some [ __ ] random dude who you don't even know if it's a real person.\n\nNo, it's the truth. I told that uh that group I was with uh up in the Arctic, man. I'm like, I read them because I want to understand the argument and and see if that's really the argument. Like, is this really where people are coming from or is it just an [ __ ]\n\nThere's mostly just an [ __ ]. And even their argument probably sucks, but also a lot of it's artificial. You got to think about how much money is involved in selling off this public land and how much of an interest do people have in pushing a narrative that would say that selling this public land is a good thing.\n\nYeah.\n\nYou know, there's there's money involved in this. Whenever there's money involved in this, there's you can pay for there's services where you can start a campaign like it's not real. You there's services where if you want to push a narrative, you can use their service and they will incorporate this bot farm and they will push it towards whatever you want to do. And it's legal. That's what's [ __ ]\n\nThat's so [ __ ]\n\nYeah. It's fake. It's lying. It's just lying with computers.\n\nYeah.\n\nAnd unfortunately, there's still a lot of people out there on the interweb going, \"Well, I read it on the internet.\" Oh, yeah. Well, there's a whole article reading. One commenter said, \"No, they didn't. You know, if that if that's a [ __ ] robot, what are you you going to make a retraction?\" No, you're not. You're not. If it's AI, are you going to are you going to say something about that? Are you going to say there's a problem? No, you're not going to say because you your whole business is clickbait. And the more you have negative comments you could use to start the formulation of an article. Okay, that's how you make a living. And so don't read their [ __ ] articles either.\n\nThis is the key. Just like you have to just interact only with real humans. I uh got in the practice of just being like, \"Okay, what I'm about to say is going to be political, involves scary words, Democrat, Republican, it's going to make you uncomfortable. Don't believe me. Go to the Federal Register.gov. That's the source material. Read it for yourself.\"\n\nYeah.\n\nI'm just going to tell you what I read in there on these pages.\n\nThat's the source material. Go read it. Like, that's where the land sales are happening. That's where it's outlined. The text is there. It's the journal of the government printed every day online. Go read it.\n\n\nAnd uh, you know, for the\nlittle stuff on the podcast, I don't\ndeal. It's like the Montgomery teller\nsaid, \"An alligator came out.\" Uh, I don't\nsay that.\nCal's Week in Review. Yeah. Yeah. Tell\neverybody your podcast.\nCal's Week in Review. We do news,\noutdoor news, and we cover legislation\nlike this.\nIt's a fun podcast.\nThe legislative desk.\nYeah. Yeah. Yeah.\nFun. You have a good time with it,\nthough,\nman. There's some good times. There's\nsome burnout times, right? Yeah. Where\nI'm like screaming into the void\nlike, \"Guys, this land sale's coming.\"\nYeah.\nYeah. Coming hot.\nWell, people listen to you, fortunately.\nOh, it uh, it's got to feel a little\ngood,\ndoesn't it feel good that people united\nand listened?\nI am trying to make it feel really good,\nbut you're scared that's going to happen\nagain. It cuz I know it's going to\nhappen again.\nAgain. I'm wearing the same shirt\nthat I wore on this show talking about\nthis same stuff six years ago or whenever\nwe decided it was, right?\nLike um, and I, I do, I feel really, really\ngood. Like we, a lot of people came out,\nthey threw political baggage aside and\nthey, they talked about how important\nthis stuff is, and it's incredibly\nimportant to me. Um, and I thank them\nall from the bottom of my heart because\nit is so important, and one voice is just\nnot going to do this, right? Yeah.\nSo that, that does feel good. That does\nfeel good. I just kind of wanted there\nto be a vote\non this amendment so all the American\npeople can see exactly who voted for it\nand exactly who voted against it.\nYeah.\nAnd just lay it out on the table for\neverybody.\nThat would be nice. Yeah. And it'd be\nnice to see like what special interests\nwere involved, like what, what money was\npushing it in that direction.\nYeah, absolutely. Yeah. I mean, just\nwe need a higher, and most people won't\ndo this even if we had the ability, but\nwe need uh, more peaks behind the\ncurtain, right? We need more\naccountability. Like, so just a great\nexample, I'm up at the the state capital\nin Montana. Uh, we just, our legislative\nsession just ended um, at the beginning\nof the year, and there's some knucklehead\nbrings this um,\num, judicial amendment up to join for the\nstate of Montana to join\nUtah's lawsuit to sell off 18.5 million\nacres of of public land, and 115 people\nshowed up to testify against the state.\nThis is during, during work hours in a\nMontana winter. 115 people show up to\ntestify against this. And there's some\non online too, there to be fair. Um,\noriginally there were 10 people signed\nup to testify in favor of joining the\nlawsuit. Um, all 10 of those people drop\noff. They only give everybody two\nminutes to testify in front of\ncommittee. Everybody testifies, \"Don't do\nthis. Bad for Montana. Um, bad for all\nthese other reasons.\" Professional\npeople, um, some lobbyists, uh, nonprofit\npeople, but just a lot of people being\nlike, \"Yeah, I'm a dad, and that's where\nI take my kids.\" Like, why would we do\nthis? Uh, that committee\napproves it and sends it through.\nWow. And there's no accountability. You\ncan't say, \"Okay, how many people called\nyour office? How many emails did you\nget?\"\nNone.\nRight? Your representatives just decide\nagainst the will of the people.\nThe ones that showed up and were vocal,\nright?\nSo, how do it work? And, and I understand\nwhy people do not trust this stuff.\nWell, like that's a hard experience to\nhave.\nIt's hidden on purpose, you know? They\nwant to be able to do what they want to\ndo.\nYeah. And there's a lot of money that\ngets them elected. And once they get in\nthere, they get these phone calls from\nthese folks. \"Hey, I need you to do this.\"\nYeah.\nYeah. Montana's a good example right\nnow. All right. We So, John Tester, who\nwas an awesome public lands guy,\nDemocrat, farmer out of Big Sandy,\nMontana, that's the only political\nuh, donation I've ever made in my life\nwas to his campaign. Uh, because he was\nawesome on public lands. Uh, he got, he\nlost this year, but uh, so we have uh, Tim\nShei is our freshman senator in Montana.\nUh, so he's brand new. He won John\nTester's seat. And then we have Steve\nDaines who's been in for a long time.\nHe's a senior Republican also on the\nSenate Energy and Natural Resources\nCommittee. And\nRepublicans, and they said,\nnot in as strong a words as I would\nwant,\num, that they're not for the sale of\npublic lands during this fight, during\nthe House, and then during the Senate\nfight again.\n\"We're not going to sell public lands.\"\nOur Republican Ryan Zinci also, uh, he's a\nrepresentative in the House, you know,\nhe said, \"That's my San Juan Hill.\" He's\nlike, \"I'm, I'm going to die on San Juan\nHill before I vote to sell off America's\npublic lands.\" Right? So, I think for\neverybody else who's naysaying\nwhether a Republican can do this or it's\njust the Democrats that are willing, I\nthink we have a good example in Montana\nright now. And I'm not saying give up.\nI'm gonna hold these people accountable,\nand I think everybody else should too.\nUm, that these Republicans are willing to\ngo to bat for public lands right now, and\nand we're making it that like third rail\nissue where it's like if you want to win\nin the state of Montana, you better be\ngood on public lands.\nWere there any Democrats that were in\nfavor of selling off public lands?\nYeah. Yeah. One of your uh, one of your\nCalifornia folks came out early in the\nhouse.\nThey're not mine. I abandoned those\npeople.\nUh, you know, because\nI identify as a Texan now. I converted.\nI transitioned.\nYes, I, Oh, I support you, John.\nThank you. Thank you. Thank you for\nseeing my truth.\nUm, but you know that\nit's just, it's another easy\nanswer to the very hard question of\naffordable housing. Right. So, I think\nthere's plenty of Democrats out there.\nI think it's a [ __ ] answer. That's a\ntotal [ __ ] answer.\nI think they just want to sell the land.\nI don't think they had any, any\ninterest in turning it into public\nhousing.\nNo.\n[ __ ] off.\n[ __ ] off is right.\nPut public housing in the middle of the\nwoods. [ __ ] off.\nNo.\nIt's not what you're doing.\nNo. No.\nThis is one of those things you, you say\nto people. So, oh, it would go to the\ngreater good.\nWell, my god, we've been talking about\nurban renewal for how long in this\ncountry, right? Like there's a lot of\nplaces that are not going to be good for\nwildlife, not going to be good for the\nmetriculation of clean water.\nThey're not producing clean air.\nYeah.\nThat could be great\naffordable housing or just housing in\ngeneral for people.\nYeah.\nBut that's hard. It's not convenient,\nJoe.\nExactly. Not convenient. That's the\nthing.\nWell, thank you for doing what you do,\nbrother, and thank you for being such a\nvocal spokesperson during this time\nbecause it was really, really impactful.\nIt made a lot, made a lot of difference.\nReally did.\nWell, I'm going to be here for the next\none, Joe.\nAll right. Let's hope we don't have to\ndo this again.\nWell, I want to change my shirt.\nLet's hope we don't have to do it again,\nbut if we do, we'll do it again.\nAll right. Thanks a lot.\nThank you, brother. And Cow's Week in\nReview, it's available everywhere.\nApple, Spotify, all that jazz, right?\nYeah. Yeah. Um, Ocal 406 on the\nInstagram, and, and if you want to do me a\nhuge favor, I'm the North American board\nchair for Backcountry Hunters &\nAnglers, and uh, we put in over 150,000\ncomments, phone calls from, from real\npeople who used our action alert center\nduring this public lands battle. And\nthat's made a big difference cuz we can\ngo into those offices and say, \"Hey,\n2,500 people called your office today.\nHave you heard about public lands?\" So,\nbecome a member. It helps us out, and\nwe'll help you out, and we're not going\nto give up on this stuff. I'm a lifetime\nmember. Love you, buddy. Love you, too,\nbrother. All right. Bye, everybody.\n[Music]\n[Applause]\n[Music]\n"
}