{
  "episode": {
    "id": "DKUCkIkB4Zw",
    "title": "JRE MMA Show #167 with Cory Sandhagen",
    "publishedAt": "2025-06-26T17:00:25.000Z",
    "description": "Joe sits down with Cory Sandhagen, a professional mixed martial artist competing in the Bantamweight division of the Ultimate Fighting Championship. \n⁠https://www.corysandhagen.com⁠\n\nThis video is sponsored by BetterHelp. Visit https://BetterHelp.com/JRE\n\nDon’t miss out on all the action - Download the DraftKings app today! Sign-up at https://dkng.co/rogan or with my promo code ROGAN.\n\nGAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit https://gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit https://ccpg.org (CT), or visit https://www.mdgamblinghelp.org (MD). 21+ and present in most states. (18+ DC/KY/NH/WY). Void in ONT/OR/NH. Eligibility restrictions apply. On behalf of Boot Hill Casino & Resort (KS). 1 per new customer. $5+ first-time bet req. Max. $150 issued as non-withdrawable Bonus Bets that expire in 7 days (168 hours). Stake removed from payout. Terms: https://dkng.co/dk-offer-terms. Ends 7/20/25 at 11:59 PM ET. Sponsored by DK"
  },
  "channel": {
    "id": "UCzQUP1qoWDoEbmsQxvdjxgQ",
    "name": "Joe Rogan",
    "slug": "@joerogan",
    "url": "https://www.youtube.com/@joerogan"
  },
  "transcript": "Joe Rogan podcast. Check it out.\nThe Joe Rogan Experience.\nTrain by day. Joe Rogan podcast by night. All day.\nGood to see you, brother. Good to see you, too.\nWe were talking about golf and uh Jamie, who's a full-blown addict.\nWhat's up?\nWhat's up?\nFeel like everyone is now.\nSo, you're saying Gage's fully hooked?\nOh, fully hooked. It's crazy. He uh Yeah. I don't know. Do you know what Fanatics Fest is?\nNo.\nSo, Fanatics Fest is I was just at it on Sunday, but it's just like it's like kind of kind of like Comic-Con but for athletes. And Gachi got to do like the Fanatics game, which is like a celebrity thing where it's like 50 pro athletes do it, 50 normal people, and they compete in a bunch of sports or whatever. He said he won because he was good at golf. So, the [ __ ] guy won a Ferrari cuz he got second place. Tom Brady got first. He got a million dollars and then like a normal like nonprofessional athlete got third place. Got like 200k.\nWhoa. Ferrari.\nYeah, dude. Golf got him.\nHoly [ __ ]\nGolf got him for this [ __ ] Ferrari. I think he took\nHoly [ __ ]\nYeah. So he's So that kind of just enforced his addiction more than\nDamn, he's that good.\nYeah, he's pretty good. I mean, for I don't know [ __ ] about golf, but from what Daniel told me, DC told me that he started off and he was just kind of okay, but over the time between the Holloway fight and his fight with Phys, he didn't do anything but play golf for a year. He played like 260 days in a row. And he said his handicap just kept getting better and better and better and better. He said the next time he played him, he's like, \"Holy [ __ ] he's really good now.\"\nSounds about right. Yeah.\nMakes sense, though. He's a psycho. You know, he is a psych. Yeah. completely dedicated to something and he's single.\nHe's going to Yeah, he's going to excel. If that guy gets his mind on something, he's going to excel.\nYeah, he's a he's a unique dude for sure. I've really liked cuz obviously, you know, I started working with Whitman not too long ago. Um I really enjoyed getting to know like that crew like Trevor Gate.\nTrevor's a unique guy.\nYeah, he Yeah, all of those guys are pretty unique in their own way. He makes the best [ __ ] MMA gloves that have ever been made and the UFC should have bought them out a long time ago. I think he wanted some crazy amount of money or something. I think it was like some nutty deal.\nMhm.\nUnfortunate.\nI know.\nYou know, they should have just licensed it. They should have just made some sort of a deal like you we'll sell the gloves, you make the money.\nYeah.\nLet's just get the athletes the best gloves bought. They're so much better.\nThey're way better. Yeah. The foam in them is really good. Uh I think the shape is better. The protection of your hands is better.\nYeah, Trevor's one of those guys where uh I'm kind of similar too. Like most things aren't stimulating enough. Like TV kind of playing on my phone isn't really super stimulating to me. So like he's always like doing something. So he's always like making [ __ ] but he'd be when I would go into Onyx, he'd just be in the back like with this smile like working on the gloves like every single morning that he's there. And uh the style that they have is real cool. People keep asking me when they're going to come out with them, and I think he's getting pretty close. So, I just really wish that him and the UFC could make a deal.\nI know.\nCuz they try they spent so much time and money to develop those new gloves, and then they threw them out.\nYeah. I hate that, too.\nI like the new ones.\nDid you?\nI have really thin like my hands aren't massive like some of these guys. Um, the old ones are better for like if you have like a really thick hand, the old ones are way better. But I have a thin hand, dude. And those things used to fit me like perfectly.\nCuz the old ones when you when I would make a fist, they would stick out like this much.\nBut the new ones, they would be like perfect. So I can make a fist and not have this like really awkward big space right there.\nBut what is the what's the issue with the new gloves? Like what did they not like about them?\nI uh I honestly don't know. I think some people were just complaining probably because they were just guys with thicker hands.\nCuz that's what it would come down to. There was no other reason that it was. I mean, the leather was different and stuff, but I mean, how important is that?\nIt can't be that important. And I think the whole idea was it was easier to close your hand, so it was gonna eliminate some of the eye pokes.\nThey were a little bit curved, but honestly, I mean, maybe. I mean, even if you bring it down like 10 percentages, I guess that's saving 10% of people's eyes, but yeah. Um, but I mean it honestly I don't think it was like significant enough to be like, \"Oh, no one's going to poke me in the eyes when they're wearing these things.\"\nWell, I think the Whitman gloves would cover that because they're much more curved.\nThose ones were curved.\nYeah. I mean, your hand is in a permanent position like this. So, for you to do that, it's an effort.\nYeah.\nWhich when do you do that? You only do that when you're blocking things or, you know, maybe, you know, when you're sliding an arm under like to get a choke or something like that. But I don't think they were specific significantly bulkier.\nYeah. Yeah. I'm not I'm not too sure honestly. I don't really recall wearing I think that that was a while ago when they were doing all that. So I kind of don't recall super close what the curved ones how how impactful it would have been on grappling.\nI think the idea of the new gloves was that there weren't as many knockouts which also doesn't totally make sense.\nThat doesn't make any sense to me.\nNo. They they probably ran a number that was from like all of the years of the UFC and then maybe just when they started using the new ones instead of like just last year, how many knockouts?\nI don't think they would do that.\nNo.\nNo. I think but there were a lot of people complaining said that they weren't hard as hard as the old gloves. Like\nI should have brought you some.\nYeah.\nYeah. I mean gave me some of his and I was like these are the best gloves ever.\nYeah, for sure.\nJust [ __ ] Hey, man. Work it out.\nI know. They're good to train in too. like uh like you can actually feel like you could hit the person and not be like sorry, you know, because that's a pain in the ass when you always have to when you get like a stiff pair of gloves and then you have to hit someone and you're just like sorry man, I know that you but with these ones you can fire away, you know?\nYeah. Yeah.\nYeah. That how important is that? And like having training partners that are that are conscientious and that aren't going to [ __ ] blast you like the the miles that guys take off of the clock when they're training is so big. Yeah, it's big. I think I don't I mean we spar I spar pretty hard still. I know that like not a lot of people are crazy about that, but\nyou don't get hit a lot though.\nThat's true.\nThat's the thing is you're slick.\nYeah, that's true.\nLike for a guy who's just like a [ __ ] face first, you know?\nYeah.\nYou know, that's there's there's styles that enhance longevity and you have a style that enhances longevity cuz not only do you not get hit a lot, but you're also like you're a puzzle, you know? You're not it's not like, oh, here he comes. It's like where where what's going on here? You know, there's a lot of thinking that a guy has to do when they're interacting. You know, you have so much so many faints and so many stance switches.\nDefinitely.\nIt's such a smart style, man. I love watching you fight because it's like it's so you can see that the the fighter if they don't and and by the way, they're probably not used to training with somebody like you because there's not a lot of guys like you. You could see how there's all these adjustments that they have to make on the fly that makes you think.\nYeah. I mean, uh, I always really looked up to all of the defensive guys that I would watch. Like, I know that in boxing, defensive, just winning the defensive battle is a big piece in boxing. And the judges almost even score a little bit for it. But in MMA, it's just all like only offense scores, right? So that's not really the way that I grew up thinking was good martial arts really cuz my some of my favorite guys were Mayweather, Pernell Whitaker, Nito Daire, like all of these really awesome like movers that did a phenomenal job at protecting themselves and but now man people I feel like even more so now people want more blood and more offense like the casuals.\nYeah. Yeah. That that [ __ ] drives me nuts.\nIt does, man.\nIt just drives me nuts. and and catering to the casuals. Like, [ __ ] off. Like, whenever someone like booze and then they separate people or stand people up, I go crazy. What are you doing?\n[ __ ] the crowd.\nI think grappling is really hard to understand unless you've done it.\nLike, striking is easy to understand. Like, okay, that guy hit the [ __ ] out of that guy more than the other guy hit him, right?\nGrappling is like it's a whole it's like super propriioceptive, you know? Like a lot of what's going on in grappling isn't it's like hidden to the eye, you know what I mean? It's where am I sitting my weight? Where am I doing this? And um and yeah, so it kind of just people just don't think it's cool. But when you understand grappling like it's amazing to watch. Yes.\nYou know, like Amarab for example, who's obviously a guy that I watch a ton. It's amazing. Yeah.\nLike he does such a good job with like the little nuancy things in wrestling that's just like Yeah. that. But it's hard to appreciate unless you really understand it.\nWell, it's hard to judge, too, which is a real problem cuz there's judges that don't train and never have trained, which is to me [ __ ] crazy.\nI know.\nThat's like judging a Chinese spelling bee and you don't speak Chinese. Like, who knows who's [ __ ] winning here?\nI know it.\nThey don't understand it. They understand when someone's on top. Oh, he's on top. I know. But, you know, there's so many like near submission attempts that I think should count like like I always go to the AA Arman Sukian fight cuz I think Olive won that fight cuz Olivea came close to finishing him twice and Sarukian stayed on top and he had a lot of control and it was a very close fight. But I think those [ __ ] moments where a guy is like at nine, you know, if 10 is checkmate, he's at nine twice, that's big, man. that you don't want to be there. That guy got you there. He's got a [ __ ] locked in triangle. Yeah, you got out of it, but still that that's big, man. That should count. And damage leading up to a KO or that doesn't lead to a K.O is very significant in the scorecards, but a submission that doesn't lead up to a submission doesn't count. And I don't understand that. You can't just count damage. You have to count like near falls or near near subs.\nI agree. Yeah.\nI mean, if you if you want to take for example too, like even like a me and a TJ fight, like TJ was limping out of that cage and I was kind of, you know, like, oh, cool. You know, and I don't think that that should count for everything. But like you're saying, like the reason that he was limping out of that cage is because I popped his knee really bad, you know, like he had to spend the next 18 months making his knee better so that he could fight again. And I was able to fight, you know, pretty shortly afterwards. So, yeah, there's got to be something to that. like if you pop someone's [ __ ] really bad, it it should count just as much as a knockdown or something like that. What do you think about the idea of uh like 108 rounds for like things that are known, not just like, okay, this person won by a mile, but it's like in kickboxing they do if you get knocked down in a round, it's automatically a 108 round. You like that for M&amp;A or No,\nI do. But if a guy is tuning you up for like the entire round and you clip him and drop him and he gets back up and he's still okay, I don't think that's a 108 round. I think I think MMA should be a completely different scoring system than the 10-point must system because I think the 10 we just stole this boxing system which is a great system for boxing because you only have two weapons and you only have your hands. You don't even have elbows, right? So, think about all the different factors in MMA and we're limited to 10 points. To me, that seems silly. I think it should probably be 10 points for each aspect of the sport. Like, okay, who who landed more kicks, who landed more punches, who and then calculate all that [ __ ] up together, you know, who had more takedowns, who who landed damage from the top. Add all it should be a comprehensive system. And I think there should be more than three judges, you know,\n\n\nWhen you know when you have a split decision and like some of them are so crazy, you know, you see like a five-round split decision and it's they gave like four judges or three two out of the three judges rather give like three out of five rounds and the other person gives them the whole five rounds.\nLike this is too much variability.\nThere's too much weirdness to it.\nAnd and if you're a fighter, especially in MMA, because of the win bonus, which also drives me crazy, I think you if you had three more judges, so if you have six judges, six judges would balance it out.\nSix good judges.\nSo the ones that [ __ ] up and make mistakes, they'll be canceled out by the better judges.\nWe could do like a submission or knockout only league.\nThat'd be pretty cool cuz then you'd definitely know who was winning that one.\nWhat would you think about a no time limit?\nYeah, no.\nNo time limit, submission or knockout only.\nThat would be wild.\nThat'd be pretty sick, actually.\nYou could probably sanction that.\nOld school UFC.\nYeah.\nYeah.\nI mean, it's UFC 1.\nYeah.\nIt wouldn't really pay off for me, though.\nI need weight classes in order for me to [ __ ] for my career to be good.\nYeah.\nWeight classes, sure, but but no time limit within the weight classes.\nYeah, that'd be sweet.\nThat would be pretty that would be pretty wild.\nYeah, that'd be pretty wild because, you know, you know, like two guys are facing off each other like and they know like there's no rescue every five minutes.\nYeah.\nAnd and you go into it knowing you're either getting knocked down or submitted or you're doing that to the other person.\nOh, that would be real.\nBut again, the casuals would have a hard time with it because it would probably be a much more moderate pace or or you unless someone just tries to go for it right off the bat.\nYeah.\nAnd that could be a strategy.\nSure.\nI mean, it does work.\nIt's like there's so many fights where did you see the the past the Azerbaian fight?\nUh I didn't watch those ones.\nNo, I watched Curtis's fight and a guy named Muhammad's fight on my team, but no, I didn't watch the other ones.\nThere was uh who was it?\nUh Ma and the other guy from Azerbaijan.\nSee if you can find his name.\nSalakov.\n[ __ ] I I hadn't seen him fight before.\nWhat weight class was it?\nUm I think it was 45.\nYeah.\nNo, it was lightweight.\nYeah.\nSodikov and Nicholas Moda.\nNazim Sodikov and Nicholas Ma.\n[ __ ] crazy fight, man.\nIt was so good that Dana White gave him double bonuses.\nOh, nice.\nSweet.\nBut Mot landed a 75 punch combination.\nLike, I'm not kidding, man.\nHe landed like And then Sodakov came back and stopped him.\nOh [ __ ]\nIt was wild.\nLike a wild fight.\nLike a fight like that where two guys just f and Mot like basically emptied out the tank, but Sodakov had fantastic defense.\nJust kept covering and moving and just getting bombed on to the body and to the head, but he kept it looked like it was getting close to stop and all he comes back and you see Mo's taking these big deep breaths and woo it was wild.\nYeah, when that strategy works, it works.\nBut when it doesn't, yeah, you're in some [ __ ]\nThat's the problem.\nThe the blit sprint and very few guys, you know, we were talking about Gachi and golf and I was saying that I'm scared of golf and you you know, you were like, I don't have time for golf.\nThere's the thing that happens with golf is it takes so much time and it's so addictive that it's going to take away time from other stuff no matter what you do.\nAnd when you look at a guy like I always point to Morab because the day after he beat Shawn the first fight DC went to his house to to go talk to him and he was out running the day after.\nLike that's a guy that does not stop and that extreme physicality and that extreme endurance because he is just constantly working that means something that counts.\nIf you take months off, you take you know like like this was the thing that I was thinking about with Jon Jones.\nJon Jones said he need needed six months to prepare for Aspenol if he's going to fight Aspenol.\nSo they were trying to make a deal and then he decided to retire.\nBut it's six months because he's not training like at all.\nLike he just doesn't train.\nLike in between fights, just doesn't train.\nYeah.\nWhich to me, he used to do that a lot when he was younger, too, which is I always thought was crazy.\nThat is crazy to me.\nI always saw guys do that like when I was in my 20s and like I would watch these really big fighters just not train unless it was a training camp time.\nI'd be like, &quot;Fuck that.\nI'm never being that way.&quot;\nUm I don't know, man.\nThat's that's like a really weird one to me, but I don't want to bash it too bad because I do know a lot of guys that do do that.\nBut look at John.\nGreatest of all time.\nIt's like, how did he do that?\nI really talented.\nI don't know how that works.\nLike, I want it to make sense in my head that like the harder you work, the more [ __ ] you'll get from it, you know?\nWhich is like true to an extent, but then you have like these weird outlier guys that maybe have something more figured out than me that I don't have figured out or whatever.\nBut I mean, that to me is like completely unacceptable in my head.\nLike I I I think that um I really hate when people say that they want to be something and then they don't do any of the actions to like actually do that thing that they're saying that they want to be, right?\nSo I don't get to walk around being like, &quot;Yeah, I'm going to be a world champion.\nI I want to be a world champ.&quot;\nAnd then not do any of the [ __ ] actions, you know?\nLike then I'm just a stupid person, you know?\nWell, I think John is just so [ __ ] talented that he could pull that off.\nYeah.\nThat's the outlier.\nIt's like he was just so good.\nHe was so good.\nHe just he could do it.\nHe could he could party and still [ __ ] guys up like what he said to Cormier at the press conference for the second fight.\nI beat you when I was on co.\nOkay, I know.\nI saw that video the other day.\nThis episode is brought to you by Better Help.\nSometimes it can feel like you're carrying the weight of the world on your shoulders.\nAnd for guys especially, it can feel like you have to carry that burden on your own.\nThere's a lot of stigma around men being the provider to keep it all together by themselves.\nBut that's not good for you, your family, or anyone.\nDid you know that 6 million men suffer from depression every year in the US?\nAnd it often goes undiagnosed because of these stigmas.\nReal strength isn't bottling things up inside, though.\nIt's admitting to your faults and doing something to better yourself.\nSo, go talk to someone, a friend, your partner, family, a therapist.\nTherapy is an excellent tool everyone should utilize.\nIt's a great way to learn more positive coping skills like how to manage stress and help you live a more balanced and fulfilling life.\nBetterHelp is a great place to start that conversation.\nJudging by the millions of reviews and the 4.9 rating in the app store, it's helped many people across the globe.\nAs the largest online therapy provider in the world, BetterHelp can provide access to mental health professionals with a diverse variety of expertise.\nTalk it out with BetterHelp.\nOur listeners get 10% off their first month at betterhelp.com/jre.\nThat's betterhp.com/jre.\nThis is the thing.\nWhen guys are that talented, there's so much like they're playing with their food essentially until you know like like I always point to with John the first Gustiffson fight which by all accounts he didn't train.\nOh really?\nYeah.\nBy all accounts like barely trained for that fight.\nBarely trained just partying.\nYeah.\nAnd beat Gustiffson and pulled it off in the last rounds which was really crazy but then comes back in the second fight and is like okay [ __ ] now we're trained.\nAnd just destroys them.\nJust runs right through them.\nWhich god does he worship?\nYeah, I know.\nRight.\nStart going to that church.\nWell, I think it's just talent, man.\nAnd it's also genetics.\nLike both of his brothers are super athletes.\nYeah.\nYou know, he's just a phenomenal specimen.\nAnd then he's got a great mind for fighting.\nHis his it's you can't discount his in cage IQ cuz it's [ __ ] phenomenal.\nI do think two people have different wired brains too where some people need like cool down time in order for them to Yeah.\nI don't know, man.\nI I really I don't know how it works.\nI spent a lot of time thinking about it.\nI don't Yeah.\nI'm more on the other end where it's like I'm going to give every inch of myself to this thing, you know, in hopes that I get it one day.\nBut then I know a lot of guys, man, a lot of guys that are really successful that are just like, nah, man.\nI need my like off time.\nBut that to me is really uncomfortable.\nBut I kind of got a little bit I don't like chilling, you know, like me and my wife were just in Maui a couple weeks ago.\nIt's like the first vacation for 7 days I ever taken like since I was a kid probably.\nDid you get stir crazy?\nI got a little stir crazy.\nI kind of liked it though.\nLike a piece of me liked just completely being like, &quot;Oh, my home my like life doesn't exist back there.&quot;\nSo I liked it a little bit in that, but I I didn't like the feeling of being completely like turning my nervous system off completely.\nThat was like weird to me.\nI like being like a little stressed or having something going a little bit all the time.\nIt kind of just makes me feel like alive or something.\nI don't know.\nBut I didn't really like that feeling.\nI was kind of ready to come.\nI like didn't like that.\nI liked it too.\nIt'd be like if I started playing golf and I was like, &quot;Oh [ __ ] this is fun.&quot;\nAnd then I got to like do that more and more.\nI don't really want to get addicted to relaxing either.\nWell, the golf thing is a six-hour plus thing every day.\nWhen you're a guy like Jamie, you know, you're whack like Jaime's got a simulator out there, so he's whacking balls every day.\nIt it gets you.\nIt gets in your blood.\nBut the thing about like relaxing, one thing that I do like about vacations is that at the end I'm ready to go to work.\nLike when I when I'm done, when the when it's like day, if I'm on an 8 day vacation, it's day seven, I'm like, I can't [ __ ] wait to get back to work.\nI can't wait to get [ __ ] going.\nI don't get that.\nYou know, when I was out there, I was like, I could stay here forever.\nI was like, I'll stay.\nI was like, [ __ ] home.\nI was like, we can we afford this?\nI was like, let's just stay here.\nIsn't that the It's a weird thing about momentum, right?\nLike when you're training really hard all the time, you have this like constant momentum in your head of improvement.\nYou're like you're you're on the path.\nYou're you're in the process, you know, and you're feeling that.\nAnd when that gets disrupted, when guys get injured and they have to come back or they get sick and they have to come back, there's like you got to like rebuild that momentum and get it going again.\nSo it's like a part of your mind you wake up like time to go, you know?\nI'm pretty familiar with like the process of like having to kick back into camp, you know, and I do realize that it takes me about two weeks to get like, all right, this is my normal life again, you know, which is why I really like training camp and I really like fighting more than real life is what I say just because it's like organized.\nI know what I'm doing.\nI don't got to think about stuff.\nI'm not traveling places.\nPeople like traveling.\nI hate traveling.\nIt makes me feel like my life is moving on fast forward, which I don't really like.\nI like feeling I feel most alive when I'm in a routine and I have time to myself and I can sit and kind of reflect and all of that [ __ ]\nBut um but yeah, I uh\nWhat is the difference between your training like regular training and then training once you get into camp?\nHow much like what is a normal day when you're not in camp for you?\nUh it's all the exact same.\nI'm just less competitive when I'm outside of camp.\nUm, and I won't if I if I'm like beat to [ __ ] dead tired, I'll miss a practice.\nBut that's really the only time that I'll miss practice.\nIn camp, I won't miss.\nUm, unless I have like a two week rule where if I'm like dragging really bad, I'll make myself go for another week and a half, two weeks until I'm like, okay, I I I do actually need a rest, you know?\nAnd then so I'll do that in camp.\nUm, but yeah, I uh but outside of camp is pretty much the exact same.\nI've been traveling a a lot which I really don't like doing.\nUm, just because again like I I don't really feel like I'm alive.\nI feel like I'm like fast forwarding through a bunch of stuff.\nUm, but it's been like useful stuff like seeing family and then like me and my wife going on our honeymoon or whatever.\nSo, it's like normal life [ __ ] that I guess I got to check in and do every once in a while.\nBut if it were up to me, it would just be like training camp life all of the time, just cuz it's easier.\nIt's way easier.\nIt's fun.\nIt's easy\n\n\nI go to the gym. I do my hard workouts. I'm competitive as [ __ ] I get to get that out of me. And then I just hang with my friends for an hour afterwards.\nWhen you say you're less competitive when you're just normal training, like is that conscious? Like, do you decide to be less competitive? And why do you do that? Uh, I do that because I can't. I think that um if I'm too competitive, I won't work on stuff. Like it like uh a lot of camp for me is getting better at stuff. And then the last four weeks is figuring out how to win. It's not like I think that practicing winning is just as important as being able to practice a certain skill. So a lot of my camps will be developing those skills. But then like the last four or five weeks, it's just I need to focus on winning each round regardless of who it's against or whatever. I'm not like practicing a certain technique or doing anything like that. It's just win, win, win.\nJust doing whatever it takes to win that round.\nExactly. Yeah. Because that's an important skill to build.\nAnd when you're less competitive, when you're just training and you're not in camp, you'll try things. You be a little more playful, try to like sort stuff, try new skills. And I'm definitely not sparring hard as [ __ ] like I do in camp, too. Um, like I won't do that outside of camp unless I got a guy that's been giving me a bunch of rounds in my camps and he has a fight coming up and and then I'll like gear up to give him a good one, you know? But, uh, no, outside camp comp like just less competitive. I don't show up as early and get my mind right before when I'm in camp. Every single sparring session that I do, I try to put myself in the locker room while I'm warming up. Um, I think that that's like I've had a lot of success doing that. Um, just making my body make good decisions when I'm in a super elevated high-intensity state is something you got to practice, too. I definitely won't do that outside of camp because that's a lot of energy.\nSo, you visualize the walk out, you visualize like stepping into the octagon, all that. uh essentially um it's not as so I don't do as much of\num I more so go off a feel a little bit more now where I'll be like okay I need to do this today because I know that I really don't want to do it\num or I'll be like okay this day for whatever reason I'm really distracted I'll do a little bit more visualization mindful stuff or whatever because every day is different in sparring um as you know where some days you're good to go right off of the bat and then other days you're dragging it's those days at your dragging that I make sure that I'm like those ones I'll be like okay [ __ ] visualize because your body doesn't want to do this right now and I'll put myself in that state twice a week which is um has helped a lot a lot a lot.\nI know for a while you were organizing your whole camp, right? Are you still doing that?\nNo, I don't do that anymore. That has actually been like a super significant piece in one my life getting a lot better and then two I think that like it I think it's going to transfer over really well into my next few fights. Um, for a really long time, for a lot of reasons, I was like really micromanagy over my own my stuff. Uh, I don't like when people do things for me. Like I I kind of like live in a way where everything is my responsibility and if I [ __ ] up, it was like on me regardless of what happens, which is like a fine way to be, but also it's not like crazy realistic either. Um, but that's just kind of the way that I am, just the way that I grew up. like it was kind of like take care of me type of thing, you know, and if I'm messing stuff up, it's on me. Um, so I I was like that for a really long time. It was actually after the Umar fight where I realized how in the way I got of myself in that fight.\nHow so?\nUm, overdoing it.\nUm, from insecurity a little bit. Um, over like that was my first camp with Trevor too. And Trevor's a phenomenal coach. I've known him for a lot of years. He has a lot of champions. There's no like there's no reason to doubt any of what he has going on or my other coach Carrington Banks or anyone really. But because I kind of have this mindset on life or did used to have this mindset on life where it was, \"Hey man, like manage everything like make sure everyone's doing their work like blah blah blah.\" Like after that Umar fight, I really got into\nuh I was like, \"All right, [ __ ] it, guys.\" Like I messed that one up. I felt like because I was trying to be too micromanagy over this thing. I started getting outside of myself. You guys take over. And the reason that I did that wasn't necessarily because I lost. It's because I'm coaching a couple professionals now. And coaching a professional is different than coaching an amateur. Um it's like a it feels like a lot more responsibility. And I realized what was happening when I would try to help these couple guys that I was trying to help is that they they are too close to it. The same way that I'm sure you get too close to your art as well. Like in comedy, you're too close to it sometimes where you don't really you can't see things from a perspective that is like true and real because you're so locked into what it is that you're doing. I really big time realized that that was a thing in my other guys. So when I would try to help them and they'd be like, \"Hey man, like I don't like they'd kind of get a little bit argumentative,\" I'd be like, \"You could keep doing that, but I'm I'm a thousand% sure that I'm right about this, you know, but do your own thing.\" And I started to realize like, \"Oh, [ __ ] That's what I do all the time.\" Like, I got to I was like, \"Fuck, dude. I got to stop being argumentative and just shut the [ __ ] up and listen if I really trust these guys.\"\nAnd so I started doing that big time, man. And it made my It changed so much stuff for me.\nI forgot who you fight fought your last fight.\nUh, I fought Figgy last.\nThat's right. Figgy blew his knee out. Yeah. So that's essentially the same position that you got in with TJ, right?\n50/50.\nAnd what that that's like you're So this is all Ryan Hall stuff, right?\nYep.\nAnd so you're putting him in a position where if he doesn't know what you're doing and he tries to get out of it, he's going to blow his knee.\nYep. Essentially, I I I like 50/50 a lot because one, I get to learn it from the guy who essentially invented it and is the best at it in the world. The only guys that I feel like can beat me at 50/50 are guys that train at 50/50. Um, and so it's kind of like what it feels like 50/50 the position and just kind of leg locks in general if you really know how to do them in MMA. Um, are a spot that you can pull people into and have them be completely lost.\nUm, because they have to think, what do I do now? And you're already moving.\nIt's super niche, too. Like understanding the position is super niche. It's like judo almost a little bit in wrestling where it's like, \"Okay, cool. If this guy's going to just wrestle with me, great. But if this guy has good throws, that changes a lot of the way that I have to do things. I can pull people into these really niche spots um where I where I know that I'm going to win them. Um so 50/50 is one of those. It's kind of like what jiu-jitsu used to be a little bit before people have started to understand jiu-jitsu, but now people fully understand jiu-jitsu, so you don't really get to like catch people in guillotines or whatever. But 50/50 and a lot of the leg locks and a lot of stuff that Ryan teaches me and does is so niche that like you would need an absolute expert to understand it. And I like get the fortune of having that.\nYeah, that's awesome. He's so [ __ ] smart, too.\nThat dude is just like his analysis of jiu-jitsu and the way he's broken down different positions. It's it's really exciting to watch. Is he fighting? I know he's had like nine surgeries.\nCrazy, right? It's like closer to a thousand. But uh but uh but yeah, he I mean he's doing good. He says he wants to fight again. I I hope that he does.\nWhy is he having all these surgeries? Like what's going on?\nI think it's uh just one of those things where like you let one thing go and then another thing breaks and then another thing breaks and you kind of like are taping yourself back together and then one day you wake up and you're like, \"Shit, I gotta like take care of this.\"\nHow many What are the surgeries that he had?\nUm I'm not sure specifically.\nlike you name it, he's probably had it.\nUm like\nI've never heard of anybody having that many surgeries.\nThere's a couple knee ones, a couple shoulder ones. Um honestly, I quit asking after a certain point. Um but yeah, I think that he's kind of coming back. Ryan more than anything. I'm like a super conceptual thinker. Like I don't really like details. Like I don't remember names of stuff.\n19.\nYeah.\nGeneral anesthesist. First of all, that is so bad for you.\nI know that is really bad. So bad for you to go under general 19. Can you go back up there? What it says there?\nIt says tearing his ACL the following years and many surgeries. Jiu-Jitsu specialist wasn't out of the woods just yet. That is so crazy.\nOkay, so he had to fix a planter plate. So that's his foot. Uh got got fallen on again. Had to have a tightroppe surgery. The one that Pat Mahomes got and a lot of other people have had. I don't know what that one is. Do you know what that is? Tightroppe surgery.\nNo, no idea.\nACL got infected. had to have a couple of septic uh septic arthritis. W the tight rope was actually allergic to the hardware they put in me some. Oh my god. So he had to have that redone. Boy came to injuries he said completely bulletproof for 15 years until his training camp for Taporia where he tore his hip right before the fight.\nTightroppe is uh used to stabilize ankle.\nOh wow. That is crazy.\nHe said more than half the surgeries of ones where Oops, we screwed up. Let's do that again. Had six elbow surgeries and five knee surgeries. Holy [ __ ]\nHoly [ __ ]\nYeah, I don't like taking any type of medication ever. So, that would probably really bother me having to be under that much. It would probably really [ __ ] me up.\nHotels in Vegas may be booked solid this weekend, but there's one vacancy left to be filled at UFC 317. A new lightweight champ will be crowned. Grab your own crown at DraftKings Sportsbook, the official sports betting partner of the UFC.\nTaporia takes on Olivea to fill the vacant men's lightweight title. And Allesandre Pantoia defends his flyweight belt against Kai Cara France in the co-main event. Who are you taking? First time betting on UFC at DraftKings? Just pick something simple like a fighter to win and make your pick. It's that easy. And if you're new to DraftKings, check this out. New customers who bet five bucks will get $150 in bonus bets instantly. Download the DraftKings Sportsbook app now and use the code Rogan. That's code Rogan for new customers to get $150 in bonus bets instantly when you bet just five bucks. Only on DraftKings. The crown is yours.\nGambling problem? Call 1800 gambler in New York? Call 8778 hopey or text hope and y467-369.\nIn Connecticut, help is available for problem gambling. Call 888-789777 or visit ccpg.org. Please play responsibly on behalf of Boot Hill Casino and Resort in Kansas. 21 and over. Agent eligibility varies by jurisdiction. Void Ontario. New customers only. Bonus bets expire 168 hours after issuance. For additional terms and responsible gaming resources, see dkg.co/audio.\nGeneral anesthesia is very bad.\nI know.\nIt's kind of scary, dude. It's [ __ ] scary.\nI've only had a couple surgery.\nHow many surgeries have you had? Like under the knife, like had to go under.\nUm, three knee surgeries under the knife. Uh,\nI think those are the only general anesthesia ones that I've had.\nIt's kind of I get really I've only had to do it for my elbow uh when I tore my tricep.\nYou tore that [ __ ] off the bone, right?\nYeah, it was pretty [ __ ] up.\nBut you still won the fight. I did still win the fight. That one that was like a whole [ __ ] thing though. Um I I got bcitis in that elbow because I got a bunch of loose floating bones and [ __ ] in there. So then it just swelled up really bad. And every time I've gotten berscitis, I've gotten really bad staff infections in in it.\nYeah. Cuz I mean, you got to think it's just like sitting pulled Oh yeah. fluid in your body and then when you're still in the gym training and it gets like in your bloodstream or whatever, it just like it's like a swamp and then it just\nWasn't that what happened to Ben Ascrin? Wasn't it a staff infection that turned into a pneumonia?\nOh, really? I don't know.\nI read.\nIs he doing okay? I never\nHe's not doing okay, man. He needs a lung transplant.\nOh, [ __ ]\nYeah, he had I think they call it necrotic pneumonia. So, essentially, it was rotting holes in his lung tissue. And so they had to put him on\n\n\nA ventilator and apparently one of his lungs is just gone, and they have to replace it, which is, that's so crazy because then you have to be on medication for your entire life because your body wants to reject the lung because it's not your lung.\nSo you have to take these immunosuppressants.\nSo now your immune system is severely suppressed because you have to take immunosuppressant drugs in order to have this.\nLike, I have a friend who had a heart transplant, and he's all [ __ ] up because of it.\nYou know, it's just like you're always worried about getting sick 'cause your immune system is very compromised.\nDamn.\nThat's going to change his life.\nOh my god.\nI mean, he's still in a medically induced coma, I believe.\nI think he's, he's out of the coma now.\nLike, he looks at people and he can kind of talk a little bit, but I mean, this is all going on for many, many weeks now.\nMhm.\nYeah.\nAnd I think what happened was he was feeling like [ __ ] and he didn't know how bad it was, and he went to a Bitcoin conference, you know, he traveled, did, and then it got real bad, and then he realized, oh, this is serious.\nSo, it was a staff kind of inside of his lung.\nCan you see if you can find that if it was, it started with a staff infection?\nThat sounds like it would really hurt.\nCool.\nStaff infections by themselves hurt really bad.\nI couldn't imagine having it in your lungs where you're breathing into.\nI don't think enough people pay attention to staff.\nI mean, how many guys like fight and they're on antibiotics?\nIt happens all the time.\nMorab, like when when Morab fought Umar, apparently he had staff on his shin, and he was on antibiotics when he fought.\nSo, dude, the type of antibiotic that I was on, I forget the name of it, unfortunately, but the reason I tore my tricep was because that antibiotic made my ligaments super shitty, pretty much, which because, dude, like I should never tear my tricep.\nI'm pretty sure it happened when he was camoring me.\nDude, that shouldn't happen, you know, like maybe something else, but definitely not tearing my tricep, right?\nUh, so that's when it happened.\nAnd then I was like, yo, what the [ __ ] is that about?\nLike, that shouldn't happen.\nAnd then when I read into it a little bit, they told me that that specific antibiotic, it doesn't mess with your respiratory stuff, like your conditioning as much, but it makes your ligaments just really not good.\nOh, that's terrible.\nI know.\nI know.\nAnd then you have to fight.\nYeah.\nWhich is crazy.\nI know.\nLast camp I didn't get one, dude.\nI was so happy.\nI didn't get sick.\nHow many times have you had staff?\nUh, not too many times, but man, so this time with my elbow against Font, I got it really bad.\nI was on one round of antibiotics for seven days or something, and then it came back immediately.\nSo then I was on it for two more weeks, and then I got off it the week before the fight.\nSo I was essentially on it for like a month, which, which sucks.\nAnd then, uh, and then against Umar, I got it really bad in my knee.\nLike super bad where, uh, I'm not a crazy anxious person, dude, but I finally got to like experience what it was like to have a panic attack because I was in Virginia training, got it.\nI was like, \"Something's up with my knee.\"\nIt hurt really bad.\nUm, couldn't put weight on my leg.\nThis was probably like a month before the fight, maybe, maybe a little bit before that, five weeks or so.\nI got a really bad knee infection.\nUm, I started taking the antibiotics, but they told me like, \"Hey man, if this doesn't get better, like if you start taking these antibiotics and tomorrow it's not better, we need you to cut it.\nCome in.\nWe're going to cut your knee open and clean it 'cause that's how they take care of it.\"\nAnd I was like, \"Sure.\"\nI was like, \"I'm not coming back here, you know, like I'm going to take these antibiotics because otherwise you can't fight.\"\nThen I can't fight.\nSo, uh, yeah.\nSo that was a shitty situation, but um, just pretty much really bad.\nMaybe three times.\nThree times.\nYeah, three times.\nMaybe like pretty bad.\nYeah, it's such a scary thing 'cause it [ __ ] kills people.\nYeah, it does.\nStaff gets, it gets systemic.\nGets in your bloodstream and you can die, dude.\nThat's why I think I freaked out really bad with my knee is because I remember laying in bed and being like, I called my wife and just set the phone next.\nI was like, \"Hey, like until you get home, like can you just be on the phone 'cause I'm kind of afraid I'm about to die a little bit.\"\nYeah, it was really, it got like really scary there.\nWas it swollen?\nWas it, so, it's an external.\nIt was super swollen.\nYeah, it was super swollen.\nIt, no, no, no, it wasn't an abrasion one.\nIt was like inside of my, so, it was internal.\nYeah.\nWow.\nYeah.\nSo, that really wasn't good.\nBut I remember every time I've taken antibiotics with a staff infection, my experience has been that it gets really painful and a lot worse for like the first few hours when the antibiotics kick in and start killing it, and then it starts to get better.\nBut the first couple of hours is like kind of scary.\nSo when I first started taking the antibiotics, that's when I called my wife 'cause I don't take a lot of medicine.\nLike if I take a ibuprofen, I will feel that [ __ ] working through my entire body.\nUm, and yeah, so I like took the antibiotics and I started to feel it through my body, and I was like, \"This is scary.\"\nAnd I was like, \"Hey, like to get home, let's, uh, be on the phone 'cause I'm afraid I'm about to pass out and die here.\"\nThat's [ __ ] terrifying.\nBut I didn't want to go to the dock and then get cut open and not be able to fight 'cause that fight had already got canceled and [ __ ].\nSo I was like, \"Yeah, I know.\nWe're always put in tough spots.\"\nI know.\nBut it's like sometimes you just got to do that.\nSometimes you have to cancel a fight.\nAnd I know nobody likes to hear that, but, I know, it's so different than boxing.\nBoxing, you get so few fight cancellations, you know, it's much less.\nBut when you're wrestling, when you're grappling, you're, you're constantly getting kicked and punched and you're [ __ ], you're doing so many different things.\nThe odds of you getting injured are so much higher.\nI know.\nGordon got staff for a [ __ ] year.\nLike that's why his stomach is all [ __ ] up.\nGordon Ryan was on antibiotics for a year.\nAnd his internal gut bacteria, his flora is just torched.\nDamn.\nHe's just a mess.\nDamn.\nHe can't keep food down.\nHe has this like constant fight or flight reaction in his body where he wants to vomit all the time.\nAnd he's going through training camps and beating everybody in grappling matches against the best in the world.\nThat's how good he is.\nLike with staff for 12 years or excuse me, 12 months.\nAnd then on top of that, this lingering stomach thing because of that that no doctor seems to figure out.\nThey can't fix it.\nHe's gone to like every, they've given him a bunch of different [ __ ].\nHe's tried peptides and this and that, and you get a little bit of improvement.\nHe starts training hard again.\nComes back.\nYeah.\nThere's probably some like old lady in the Amazon jungle that knows how to cure that [ __ ].\nI told, like, just eat this stupid.\nI told him try like a seven-day fast.\nTry something nutty like that.\nBut or like a only avocados diet.\nI mean, it's got to be, there's got to be something.\nThere's got to be something.\nBut I would think like a fast where you just have to like, you just completely let your gut reset.\nYeah.\nI mean, I don't know.\nDo you do those?\nNo.\nNo.\nYeah.\nI've done a day.\nYeah.\nI've never done like the long one.\nDana just did a long one.\nHe did like three days.\nHe said it was awesome.\nSaid by the end of it, you feel [ __ ] amazing.\nYeah.\nI did the three-day one and then I was like, \"Fuck, dude.\nI was just hungry for three days.\nWhat the [ __ ]?\nI don't feel like a superhero at all.\"\nYeah.\nI don't know.\nI don't know.\nI mean, maybe it's variable.\nMaybe, the one thing that I'm really big on, uh, is I like won't [ __ ], like, um, I'm really in touch with what's going on usually with, uh, like my body and stuff.\nI'm really big on, I, I don't know why it doesn't get talked about more, but like digestive, like things that mess up my digestive system, I don't mess around with at all kind of stuff, like bread, pizzas, too much cheese, stuff like that.\nLike, um, bread's [ __ ] terrible for you.\nIt is, dude.\nEvery time I eat pizza, I like can't [ __ ] the next day.\nIt's not, it's not even pizza.\nIt's American pizza.\nIt's our wheat.\nOur wheat is poisoned.\nIt really is.\nIt's sprayed with folic acid and it's [ __ ], all the nutrients are pulled out of it.\nThere's glyphosate in the wheat.\nIt's like that's what's really going on.\nIt's also a re-engineered wheat, so it's got more gluten.\nIt's more complex gluten.\nSo, it's got a higher yield per acre.\nSo, your body's like, \"What is this?\"\nCauses all this inflammation.\nWhen I go to Italy, I eat pizza over there.\nI eat a whole pizza.\nI feel great.\nOh, really?\nYou could [ __ ] nice the next day.\nYou feel great.\nI never have a problem [ __ ].\nBut I do feel bloated.\nLike I get my gut swells.\nLike I'll eat a giant bowl of spaghetti or something like that, and then I look like I'm pregnant.\nIt's horrible.\nTer, I feel so tired, just like I got shot with a tranquilizer dart.\nLike, but I'm so dumb.\nI keep going back to, I know, dude.\nIt's hard not to, dude.\nYou're just like, surely this will work this time.\nIt's just, it's so delicious.\nJust like I see a plate of lasagna, I'm like, \"Fuck it.\nWe're going in,\" you know?\nBut I know what I'm getting into when I do it.\nI know.\nI don't, I, I actually don't get like that anymore.\nI have like a weird relationship with food now where that [ __ ] is just fuel to me kind of.\nYeah.\nWhen I'm like low in weight, I get cravings, but right now when I'm like just kind of good, not hungry, not like overdoing it and stuff, I don't really feel like I get too many cravings.\nDo you have a nutritionist or anything like that?\nUh, I use a nutritionist inside my camps.\nYeah, she's great.\nUh, her, what's an average meal for you?\nUm, I wish that I like actually gave a [ __ ] so I could follow and actually be more helpful.\nThere's two things I really don't care about.\nIt's strength and conditioning and nutrition.\nI'm like, just like tell me, I like don't explain it to me.\nJust make it, yeah, just tell me what to do and I'll just do that thing.\nUm, but it's actually a lot more food than what you'd think, and I can lose a lot of weight when when she has me do it, she do it.\nUm, trying to think what it is.\nIt's more so a lot of carbs more towards the end of the day.\nUm, like before, 'cause I really don't sleep good usually when I'm really training a lot.\nMy nervous system is like not ever down.\nSo at night I usually won't sleep well.\nSo I'll eat like a big bowl of oatmeal at night.\nEveryone is kind of different.\nWhat I will say though that I would big time recommend to fighters and stuff is after hard workouts drinking dextrose or Gatorade with like some electrolytes if you have multiple workouts in a day.\nThat's a giant gamecher.\nM, um, like 'cause there's a little bit of a window from my understanding.\nI don't really know how this [ __ ] works, but there's a little bit of a window where it's like 45, like 20 to 45 minutes after you're done working where your body will just take sugar and put it back into your muscles.\nAnd so I'll drink a shitload of sugar after like really hard workouts, like really hard sparring sessions, like 50, 60 grams of sugar, which is insane.\nBut, but not when you're training that hard.\nYeah.\nNot when you're training that hard.\nFloyd Mayweather drinks soda.\nYeah.\nHe drinks, like, he'll drink a Coca-Cola after training, and it's probably good for, it's probably good for you when you're training that hard, like it's not like, you know, people say, oh, soda's bad for you.\nWell, sure, if you're just drinking soda, but if you're [ __ ] running marathons or something crazy like that or you doing something like really exhausting, it's really good for you right after a workout.\nYeah, definitely, especially if you have multiple workouts.\nLike that's, that's one big thing that she does that I added in, um, in the morning.\nIt's still, it's like a pretty balanced thing though.\nIt's like not like no fat, no carbs.\nIt's like nothing like that.\nIt's like a pretty balanced, it's a lot of protein.\nUm, what's the sources of protein?\nUh, I drink a lot of protein shakes.\nUm, I get it, uh, I'm like a part owner in this company called Vegan.\nSo I just get like a shitload of protein for free, pretty much, pe protein.\n\n\nSo, it's vegan protein. It's vegan protein. The other ones kind of mess up my stomach a little bit. Like the just the ones that are made out of, uh, um, like milk and, oh, like whey, whey makes you fart like crazy. Yeah. Yeah. Those ones. Yeah. I'm, if I drink, if I take something, I almost immediately know if it's going to mess with my digestive system, and I can't be having that while I'm like rolling around with dudes and [ __ ]. I know. There's certain protein bars like, uh, Peteria has this great protein bar called David. They're [ __ ] so delicious. But whenever I eat one, I have to like go outside cuz my farts are so bad. I didn't want to be in the house. What is it? The fiber or the protein? I don't know what's in them. They're delicious. It's low calorie, high protein. I think it's like a small bar. It's like 30 grams of protein. But whatever it is, it just make your body's just like, \"Fuck this. What is this?\" It's just, I, I generally think that anything that does that to you can't be ideal. It just can't be good for you. So, I'd rather just eat a piece of steak or something like that. That's like better for you. Yeah. Um, outside, but I also have different cravings in camp, too. Like outside of camp, I'll, I'll do a little bit like more fruits and stuff like that instead of a bunch of rice or potatoes or whatever. You don't have fruits when you're in camp? I still do, but it's not as much as you'd think. Like, it's like maybe a cup, cup or two a day. Um, I'll do that. It's not a ton of vegetables, but it's like specific vegetables because I've been getting a lot of staff. It's like ones that counteract like staff stuff. She's, do you like take fermented stuff like kimchi and things along those lines? Uh, that's a piece of it. Um, fermented stuff is good. It's like a decent amount of garlic stuff, like turmeric stuff that garlic, apparently there was a study that was done with garlic with like external staff infections, and it's as effective or more effective than antibiotics. Yeah, I believe that. Yeah, garlic [ __ ] kills everything. There's a reason why like a lot of people use it in their food. A lot of cultures use it in their food. It's to prevent food poisoning. So, dude, when I got, when I got that, uh, the knee infection staff, I was like, \"All right, I'm just going to try to kill this with a bunch of garlic.\" And dude, I was taking like 10 or 15, dude, I was taking like 10 or 15 garlic pills, like the high potency ones. Dude, after about two days of that, I [ __ ] out every single piece of [ __ ] inside my body that ever existed. The ones that were up in the attic just chilling, bro. All of it came out. I was like, \"Oh, a little hack there,\" you know? So, maybe you don't have to fast for three days. You could just [ __ ] eat a bunch of garlic and [ __ ] everything out. Why did you go with the pills and not the cloves? Just cuz it's more convenient. Like just eating garlic cloves. Yeah, eating garlic cloves. I don't know. I don't know if I would do that. I eat garlic cloves sometimes. Yeah. You cook them? No, I just eat them raw. Okay. Cuz it, it, it, it feels like it's doing something. Like if I'm not feeling good, I'll eat garlic. Um, I'll eat like raw cloves, like three or four cloves, and you, your body's like, \"Whoa.\" Oh, really? Yeah. They don't give you indigestion and stuff. A little bit maybe, but it really, what it does is like, it's, it feels like you just took a drug. It feels like you took a medicine. Really? Yeah. All right. How many you eat? Four. Three. Four. Four. I'll try that. Some fat cloves. Just chew them down. They taste nasty. Okay. Like while you're eating it. I feel like I've tried that. Yeah, I've tried that. Yeah. But I mean, I think there's something to like ancient medicine. Like people have been taking garlic. I mean, obviously it has something to do with taste. Thousand-y old onion and garlic eye remedy kills MRSA. Thousand years old. Whoa. Look at that cool. Is that the recipe right there? Look at that cool language. What is that language? It's Anglo-Saxon manuscript. Whoa. Look how wild that language is. People used to draw some old English, I guess. Wow. I guess you probably read it. So astonished to find an almost completely wiped out, uh, methasylin resistant stafocal. How do you say that? Staf, stafalocalus. Yeah, I always try to say that. Stafacilus. Stafac, stafylocus orius, otherwise known as MRSA. Their findings were presented in National Microbiology Conference. The remedy was found in Ball's leechbook, an old English manuscript containing instructions on various treatments held in the British Library. Ain't that wild, man? Like there's stuff that works that like people have been doing for thousands of years, but people dismiss it as being voodoo, you know? You know what else is a cool one, too? Is like a tip. Do you cramp up a lot ever? No, I take a lot of electrolytes. Okay. I used to, I used to, but then I really, I drink Element like every day, basically. Um, my PT a long time ago recommended that cuz I used to cramp up a lot if spicy food, I guess, makes you not cramp up as much. Oh, really? Yeah. So like about 10 years ago when he told me that. Now I love spicy food and I don't really need to force myself to eat it. But when he first told me that, um, I started eating a bunch of spicy stuff and I stopped cramping up as much. Maybe that's why I don't cramp up. I, I, I eat a lot of spicy food. Yeah, that, that might be why because, uh, they have these little things that the UFC gives us, too, called hot shots where if you're cutting weight, you're supposed to drink it and it's pretty much just cinnamon and cayenne, um, and like some other stuff. Yeah. And it's supposed to stop you from cramping. It works though. No kidding. I wonder what the mechanism is of that. That's interesting. Yeah. Yeah. I, I love hot sauce, so I, I have my own like kind of hot sauce. Like Senior Luga made like a little line of three hot sauces for me. But how do spicy foods prevent cramping? Okay, science is simple. If your neurons are too busy firing off to your mouth, they won't have time to bother cramping up your muscles. What? That sounds pretend. Wow, that's crazy. That sounds pretend. Dr. McKinnon, just trick them. Trick your body. Look over here. Found that spicy drinks help prevent these short bursts of muscle cramps. He teamed up with a biotech company to produce a product that can be sold online and found on the shelves at select stores. Hot shot. There it is. A drinkable shot mixed with ginger and cinnamon. Iron Man champ Craig Alexander is an avid user of the supplement along with several other Rio Olympic runners. Interesting. It works, dude. Cuz the second I started doing that, I stopped cramping up. I still get one every once in a while. It's not like a 100% thing, but it works. Yeah. Yeah. Muscle cramps must be brutal when you're cutting weight, right? Because you're draining your body of basically everything. Yeah. Um, yeah. I don't, my weight cuts, I'm pretty like, I kind of got down to a science a little bit. But I don't really cramp super bad. How much do you cut? Like, a week before I try to be like 16 to 18 lbs heavy over. Um, and then I'll lose that last bit that week. But I'll walk around if I'm really fat, like on vacation and [ __ ] not giving a, just not caring. I'll be about 162 when I'm training good and like all of that. I'll be about 157, 158, and then I just got to lose until I'm about 52, 51 the week before. And then that week I lose. The week. Is it calorie restriction in the beginning and then water restriction or like how do you do it? It's a decent. So 10 days away, I start loading up on water. Uh, like the rule of thumb is, however many pounds you got to lose, that's how many pounds of water you'll drink that day. So if I have 16 to lose, I'll have to drink two gallons of water. Also, don't take any of my advice if you're listening to cuz I don't really [ __ ] know. I know that like water [ __ ] can get really scary. So I don't, you know, like people chugging distilled water have like killed themselves and stuff. Yeah, distilled water. Is that what you drink? No. No. No. That's not good for you. Yeah. Um, but yeah, 10 days away, I start loading up on the water and then on the Tuesday, so we weigh in Friday, so however many days before that is. On Tuesday, you'll do the, uh, cut the sodium, and then that pretty much, you lose a lot when you're chugging that much water and cut sodium. So I would say on Tuesday, a lot of it is water, and then it's kind of up to me how crazy I want to go with food. I'm obviously not eating like super huge meals that week, but I don't let myself get too hungry. I'm pretty good about a lot of stuff where now I can kind of be like, if I go to bed like at like an eight amount of hunger instead of like a seven, I'll know almost exactly how much I'll lose the next day, which is like kind of cool. How much of a performance hit do you think you have? I mean, obviously you're in phenomenal condition, but how much of a hit do you think you have in dehydrating yourself 24 hours before a fight? Um, yeah, good. I think it depends on how much water you lose, too. Um, I think just off the top of my head, maybe 15 or 20, 15 or 20%. Maybe. So, what do, what would you think about if the UFC instituted more weight classes and they eliminated weight cuts? Like what, what if they said like, because it is for some guys, it is the most dangerous part of the fight because some guys go hard. Some guys are losing 26, 30 pounds within a couple of days, and they just look like hell. Yeah. I think that the way to solve that because one's tried doing that with like the rehydration test, and everyone that I talked to that's like been involved with that has been like, \"Dude, I could cheat that easy.\" Oh, really? Yeah. Um, but how do they cheat it? Uh, I mean, there's just like, if you know that you're going to get like hydrate tested at a certain time, I'm sure that they probably just drink most of their water during that time or something like that. But then your weight would be higher, right? Uh, yeah, your weight would have to be higher. But I don't know that they like test you. Yeah. Yeah. I guess I, I don't really know, honestly, but, um, I mean, if they're going to test you when you're, do they test you like, hey, your weight has to be this and then your height. I think that they just go in and they're like, \"Hey, how yellow is your piss?\" type of thing, you know? I'm pretty sure that that's what it might be. If it's like more scientific, then cool. But if, it might just be like, \"Hey, it's got to be more scientific because sometimes my piss is pretty yellow.\" It just meant I drank a lot of vitamins, right? You know, I think it's there, there's like a, an actual test where they test the, the levels. I think that if you added in more weight classes, that would handle a lot of it. I'd probably just do 140. Would you, if that, would that be ideal for you? That'd be pretty ideal. Yeah. Yeah. I feel like the UFC should have more weight classes, and I've said this for a long time. I, I just think this, there's some gaps that are crazy. Like the 85, 205 gap is nuts. 20 pounds is nuts. That's crazy. That's nuts. That's three weight classes at least in between fights. Like that's, or in between classes rather. That's nuts. I just don't understand that. Yeah. If you, I mean, I think that the way that old sports kind of do things, they do things for a reason. So like boxing and wrestling, they all have like, it's every seven pounds or whatever it is. The UFC is like, \"Oh, too many champions that way. It's too confusing.\" I'm like, \"What are you talking, what? It's one UFC champion per weight class.\" Yeah. You'd have more champions, and then you could also have more champion versus champion fights for, because it wouldn't be like Ilia going up 10 pounds is not too crazy. But Alex, when he went from 85 to 205, that was pretty crazy. That's a big ass jump, man. Obviously, he could do it cuz he's one of the craziest weight cutters of all time. He was fighting 85 and weighing in at 226 the day of the What? Really? Oh, yeah. When he fought out of, he was 226 when he got into the cage. Is that 41 lbs or 31 lbs of, 41 lbs? So, after 36 hours, he put on that. 41 lbs. Yeah. Holy [ __ ] dude. Holy [ __ ] dude. That's crazy. But he's also giant. He's an enormous guy. He's like a lot of body mass. And apparently it's easier to cut weight like Yoel Romero style. Like when you're that muscular cuz most of the muscle's water, which is kind of counterintuitive. You think like a fat guy would, you could be able to lose more weight, but no, it's actually to dry out the\n\n\nBig muscular guys can lose more weight.\nYeah, definitely.\nYeah.\nI have a theory, too, like the more ripped you are, the easier it is to sweat, too.\nCuz if your muscle is like muscle then fat then skin and you got to like it's got to travel through the fat.\nThis is how I think there's no evidence of any of that because there are some fatsos that sweat but I don't know sometimes I'm like I can just see who's going to be a good sweater and who's not.\nBut that's probably me just being\nYeah.\nI don't know if there's any science to that.\nMakes sense in your head though.\nKind of.\nIt makes sense in your head.\nI kind of see what you're saying.\nI kind of see what you're saying.\nBut you could also, I guess, make argument that fat makes you warmer too and maybe that sweats it out too.\nYeah.\nBut I don't think that there would be a problem with doing multiple weight classes because then you would just have like what you do in boxing where you just have like a ton of you have like one dude with like eight belts, right?\nThat would be cool.\nLike look at Pacquiao.\nYeah.\nHe just keeps going up in weight classes and Yeah.\nI think that it'd just be better for the athletes and I think it'd be better for the sport in general.\nYou're still going to have like incredible fights because the level of competition particularly at the lowest weight classes is so high right now.\nLike I think your weight class, featherweight and lightweight are the most competitive weight classes in the sport.\nAnd there's almost too many top contenders where guys are forced to take fights that maybe you really shouldn't take that fight because you're kind of in title contention and then a you lose a close decision.\nNow you're back to the drawing board.\nNow you got to fight this guy.\nOh, you got injured in camp.\nYou lose to that guy, too.\nNow you're set back when you could have been a champion.\nYeah.\nYou know, it's there's a lot of like weirdness going on with possibilities and, you know, just luck, bad luck, and good luck.\nBad luck and good luck.\nTiming I think is a big thing.\nUm, like I think that I'm pretty I was even saying this before the Cory Sandhagen fight.\nI was like, \"Watch, like if I go out and finish Figgy, which not a lot of people are able to do, the timing of everything is going to be perfect for me because there will be no one else.\"\nAnd that's and that's me also, you know, coming off of a loss from Umar just a year ago, which anytime you lose is kind of devastating.\nYou're like, \"Oh, it'll never happen for me, you know, but then it's like, oh, wait, no, if I just if this thing gets timed out right, you know, like it could work out.\"\nSo, a lot of this is\nit was a competitive close fight.\nYeah, I know.\nI that up.\nSuper.\nWhat did you think went wrong?\nLike when you say it up more than anything.\nOkay.\nIt was It was like a It's never just one thing.\nIt's always like things get compiled and then they exponentially get worse.\nOne big thing was I knew I was fighting in the Middle East and I wasn't going to get like a nod um if it was a close fight.\nAnd Umar is a defensive guy and I'm a defensive guy and I knew that it would be there was potential for rounds to be really close.\nMy game plan wasn't going to be to take him down.\nSo, anytime you're going to be like, hey, like I'm committing to striking, there is a little bit of a level of roll in the dice because one, striking matches in a fiveminute round are really hard to like hammer down and be like, I won this round against really high level guys.\nUm, that's my opinion.\nI thought that I would be able to stuff most of the shots.\nI was like, okay, most of this thing is going to be done striking.\nI need to have like big moments in order for me to feel like I'm really winning these rounds so that there can be no argument that I'm losing.\nAnd if we just are point scoring each other, which Umar's good at and I'm good at, I'm kind of rolling the dice a little bit and kind of leaving it into the hands of who God knows who the judges are, you know?\nSo, a piece of it was I didn't want to lose another close split decision.\nLike a lot of my losses or a couple of my losses are just close split decisions and I'm like, \"Fuck it, man.\nI'm not I'd rather just go for it than lose, you know?\"\nBut that pulled me out of my game plan um and just the way that I typically fight.\nLike I'm not the guy that hunts for knockouts, you know?\nI'm just not that guy.\nAnd so I just got pulled out of my strategy.\nI got really frustrated in the fight um by it not working, like me not being able to have really big moments.\nAnd now looking back, I'm just like, man, what were you thinking?\nLike just go out, fight like how you do, and you'll do awesome.\nWhat do you think specifically like you would have done different in exchanges?\nUm, I would have fought him the exact same way that I would have fought the first round.\nLike that entire fight, I was being really defensive and just looking for one big shot.\nIn the first round, I didn't fight like that.\nThe first round, I was cool with point scoring.\nI was like, \"Okay, this guy's going to wrestle me.\nLet's see how good he is at wrestling and if I can hang.\"\nOnce I was like, \"Oh, okay, cool.\nLike, I can hang.\"\nThen I just started going for big shots, which is just like not a good way to beat a really high level guy.\nIt's kind of a lazy game plan, honestly.\nLike um if the plan isn't to completely outclass the person and win in every area and be good enough to do so in my opinion that's just like not an expression of the highest level of martial arts that's a little bit lazy you know and I was I was a little bit lazy in maybe my approach to that which maybe lazy isn't the right word but um I could have done a lot better at just trusting myself more being more confident in my ability to just be like no like I'll I'll beat him everywhere you You know, looking for the big shots is always such a trap.\nUntil it's not.\nUntil it's not.\nAnd you look real cool when it happens.\nOh my goodness.\nAnd we all like looking cool.\nYeah.\nYou land the big ones.\nAnd you've landed a lot of the big ones.\nI mean, you've had so many of those moments like the Frankie Edgar fight or, you know, there's been quite the Marlon Marise fight.\nThat was a wild one.\nThat was a great one.\nThat was probably like my happiest moment maybe ever in life just because I had just come off the most embarrassing loss ever against Sterling and they were like, \"Hey, you want to fight the number one guy?\" in Abu Dhabi during co and I was like and that was like kind of back when Marlin was still a really scary guy.\nHe's kind of been on a skid since then but back then he was real scary and I was like I don't know if you guys are setting me up for Marlin to knock me the out or how this is like what the thinking behind me fighting the number one contender is but I was like yeah cool like if you guys are going to give me that shot I'll take it for sure.\nAnd then when I finished it I was just like yes.\nAnd you finished him with a wheel kick.\nYeah.\nI during COVID was practicing in my basement with my wife like every day.\nIsn't that stupid?\nI was like, why?\nI was like, man, you should have asked me for a cut.\nNo, because it's a thing where you know if you you don't expect it from a guy who doesn't really throw a lot of them, you know, and so like you see his foot turn, you're like, \"What's going on here?\"\nAnd before you know it, it's too late.\nYeah.\nAnd that heel is headed towards your dome.\nYeah.\nPeople that are good at those too, um, it's a problem.\nOh, yeah.\nLike that doesn't need to land anywhere specific for it to like rattle your brain enough to knock you down.\nOh, it's a terrifying trick.\nIt has so much power.\nYeah.\nIf there was one thing I I would not want to get hit with, it would be that.\nMy uh during my taekwond do days, uh I I used to feel like I was always going to be fine.\nLike I'd be I was like I felt like, you know, I was young.\nI was 19.\nI felt invulnerable and I was really good.\nAnd I fought in the nationals in California.\nAnd I hit this kid with a wheel kick and he never got up and he was snoring like out face plant out cold taken off in a stretcher taken to the hospital.\nAnd I never felt the same about fighting again cuz I was always scared that that could happen to me then cuz I was like doing this for nothing.\nThere was no money.\nI was doing this for nothing.\nI had no health insurance.\nI was poor and I was like what am I doing?\nLike this is like I could have easily got hit by that same kick.\nBut I was better than him and I landed.\nBut there's guys that are better than me and if they hit me like that face down snor I mean it was my heel hurt for days.\nI was limping the next day.\nMy knee hurt after the Frankie fight.\nYeah.\nOh really?\nYeah it hurt.\nThat was such a good knee though.\nYeah it was.\nYeah.\nBut I kind of felt a similar way where I I don't know.\nI guess you kind of just get used to that where you're just like\nBut you're a professional.\nThat's your sport.\nThat's your your living.\nThis is what you do.\nFor me I was a young kid doing this thing that I was really good at.\nand it just gave me like some sense of purpose and then I was like what the man.\nSo how how like uh so you didn't have like big aspiring dreams to be like a taekwond do champ or anything?\nI had dreams to be an Olympic uh the Olympic to win go to the Olympics but was that like a realistic dream?\nYes.\nYeah.\nYou were that good?\nYeah, I was that good.\nI had won national tournaments and I I'd beaten guys that had been in like high ranking and I I had a very close decision that I thought I should have won the year that the taekwond do made it into the Olympics against the national champion.\nCool.\nSo I was good and I was really young so I was getting better all the time.\nBut then I started kickboxing and when I started training in kickboxing, I realized that taekwondo is kind of cuz my hands sucked and I would spar with kickboxers and I was getting like cornered in the ropes and I just I didn't have the skills and I was like, \"Oh, this is like I have this distorted perception of my ability to fight based on my ability to fight in taekwond do.\"\nI was really good at that.\nBut then when I started boxing and kickboxing, I was like this is like that piece that's missing in Taekwondo without the face punching.\nIt it nullifies so much of what Taekwondo is good at.\nYeah.\nBut then when I learned that stuff, I realized like, oh, but I have a massive advantage with my legs because they have to close the distance with me and I can do things they can't do.\nlike regular kickboxers.\nI was amazed at how many of them were just kind of boxers who learned a few shitty kicks and they would stand on the outside and they would take a step forward and I just blast them and they just had no idea what to do.\nLike a really hard kicker.\nAnd then I started doing Muay Thai and I was like leg kicks.\nAnd so I went from American kickboxing above the waist to Muay Thai.\nI was like there's too much to learn.\nYeah.\nAnd then I was doing comedy at the same time.\nSo I just quit fighting.\nYeah.\nI was like, I I got to get out before I get hurt.\nWhen did you start grappling?\nWhen I was 30.\nCool.\nYeah, I started grappling right at I guess I was 29.\nIt was right after the first UFC.\nDid you uh like wrestle at all or anything?\nYeah, I wrestled in high school, but only one year.\nUm because I was doing taekwondo at the same time and I had to pick one and I I did a a year of both and then I was like the problem with this is like I would rather kick someone and knock them unconscious.\nIt was so to just quack and hear the whole crowd go silent was the wildest thing and watch someone cry.\nI loved it.\nIt was my favorite thing in life and I was like wrestling is cool.\nLike it's good to know.\nIt's good to be able to pin people.\nBut there was no UFC back then.\nSo it's like everything you were doing was just like you had to find a thing and get really good at it.\nBut the disillusionment of going from taekwondo to boxing and kickboxing and then to Muay Thai and then jiu-jitsu.\nSo when I started doing jiu-jitsu, I was like, \"Oh my god, I'm completely helpless.\"\nSo I had this thing in my head, well at least I know I know how to leg kick.\nI know how to box now.\nI know how to fight.\nOh my god, I'm tapping out constantly.\nAnd so then I was like, I got to learn how to do jiu-jitsu.\nYeah, but it was this thing where, you know, I feel real fortunate to have grown up in a time where no one knew what was the best style and then see the UFC emerge in 93 and then watch this incredible transformation of martial arts where martial arts advances more in 10, 20 years than it had the last 30,000 years.\nIt was incredible to watch.\nYeah.\nYeah.\nI'm glad that they did it, man, because that's such a cool question is whose martial arts is the best martial arts?\n\n\nNo one knew, man. It was all, and we were all delusional. I was so delusional. Like, I remember I used to do uh Taekwondo with a friend of mine. We were uh kickboxing at the time, and we were doing at this gym where these judo guys were, and I was like, \"Look at these idiots. This stupid judo that's useless.\"\n\nMeanwhile, I had no idea if those guys got a hold of me. I was [ __ ] helpless.\n\nYeah, cuz the judo guys will slam you on your head, dude.\n\nRolling with judo guys. Like, I remember I rolled with Carl Parisian once. I was like, he's like a chimpanzee. Like, he was so strong. Like, it didn't make any sense. We were roughly the same size, and he was just ragdolling me around. I was like, there's something to throwing bodies all the time. You know, you're taking, if you're a 180 lb guy, you're throwing a 180 lb person over and over and over again, and your whole core is just [ __ ] primed for that. Boom. Yeah. And their balance and their ability to adjust your weight and use it against you.\n\nWatching it in the Olympics is awesome cuz they'll they'll like spear their own heads.\n\nOh yeah, that's crazy. That is crazy.\n\nI like watching that [ __ ]. That's like I'm like some [ __ ] up necks, too.\n\nYeah. Oh, you'd have to, dude.\n\nLike the way that they land on...\n\nYeah. They have to.\n\nSo many of those guys, like you see them later in their career, they got like one small arm because their [ __ ] nerves are all shut off in their neck and then fused discs, and they're just like, \"I did a good job. I had a [ __ ] great career.\" You can't even walk, man. It's nuts.\n\nEvery taekwondo guy I know has like one super strong oblique and they're like shaped like this.\n\nWell, you got to learn how to kick from both sides. That's so important. That's one thing that I really admire about your style because I think that there's there's going to be a time where that is just ubiquitous where everybody switches because there's so many guys that are just like, \"Oh, he's a southpaw. Oh, he fights orthodox.\" It's like, man, that's just leaving too much to predictability.\n\nYeah. I think about striking like a dance dance revolution game where uh like uh cuz you're making all the reads with your eyes. It's like left arm's coming at me, move like right leg, whatever. Uh it's not like grappling where grappling we get to interact with each other and feel each other and move each other that way. And I can pretty much sometimes do it with my eyes closed, right?\n\nStriking is done mostly with our eyes. So, we have to do like these dance dance dance revolutiony, like, okay, react to everything that we're seeing. So, if I'm just switching my stance and now you have to like read the sentence backwards.\n\nExactly. It gets really hard, you know, and um especially if you're just as good with both sides.\n\nYes. Yes. And I would say that if you're starting, you don't need to be like super stellar at both, but just have a couple good attacks to do from your other stance and then just like build off of there or whatever. I got I started switching stances. One because I really liked watching Nanito Daire, um, who wouldn't like fully switch, but he would have like kind of steps like that that where I was like, \"Oh, cool.\" And then also I dislocated my elbow really bad about like a week and a half into training, just landed on it, posted, dislocated it, and so I could only, or that was my left arm, so I could only use my right arm. So, for like six months, I just went lefty and only used my right arm, um, as like my lead hand. And that's how I got really good at it.\n\nYeah. Just forcing yourself to just constantly be in that position because everybody wants to be in the position where they're the most strong, especially if you're trying to be competitive in sparring, right? That's why it's what's so important about like the Gracies always talk about keeping things playful, like learning how to like not don't try to win. You're trying to develop your skills and to be able to switch. I think like TJ in his prime, like when TJ fought Hennon Barrow, that fight to me was one of the best championship performances that I ever saw.\n\nI agree because nobody thought TJ was going to win that fight. Hen Barrow was thought to be the number one pound for, it was him and Aldo would people make the argument who's the best? Hen was, I think he was undefeated or maybe had one loss like early his career.\n\nHe was an animal at the time.\n\nAnimal, animal.\n\nAnimal, and TJ pieced him up, and it was like he was sparring. He looks so in the zone and relaxed, and he was constantly switching stances and footwork and angles.\n\nYeah, they uh Dwayne flew me out for that fight cuz that's when they were training at Alpha Male to be TJ's sparring partner for one of those fights. I'm almost positive it was that one. And I remember the whole time I was like, \"This isn't going to go good for TJ,\" you know, because Bar was just that guy at the time that everyone was afraid of. And then when I watched it, I was like, \"Oh [ __ ] that [ __ ] really works good.\" I uh I used to train in the Netherlands a little bit too with Andy Sour and those guys.\n\nOh, really?\n\nYeah. So, that was really cool. But there's it's like traditional, like you stand in one stance like this how we do [ __ ] here, you know? And I was like switching stances. I was probably like the the gay guy at the gym a little bit, you know, like being kind of flamboyant and like show offy. And uh so so I remember going with some of Sour's good guys and just good guys that we would spar with, and I wouldn't really get hit that much, and I was like, \"Oh [ __ ] this like actually works.\" Like this isn't just some like fufu whatever stuff, you know?\n\nIt's crazy that Dwayne developed that style, but he didn't fight that way.\n\nYeah.\n\nThat's what's crazy.\n\nYeah. Like Dwayne had like more of a traditional, you know, he's boss rootin inspired style, and then he realizes like, you know, the best way to fight is actually to constantly be ch, and then he develops this system, and you know, Dwayne's like super focused. I know you know this, but for people who don't know, Dwayne has like a notebook like [ __ ] just filled with notes, and it's all like he's got systems.\n\nYeah. It's not like what Adosana likes to call button smashing when you're playing a game like...\n\nNo, no, it's it's very systematic. And TJ, I think in that Hen Barrow fight was the greatest expression of what Dwayne teaches.\n\nYep. Yep. Yeah, that was a super amazing fight. Um, yeah, just switching. I mean, just simple little stuff, you know, like um it's a lot of striking is just like how coordinated you are. Like that's like a big piece of striking. And then can I just overwhelm you with information? Like that's like a strategy to run, you know? Some some people choose like, \"Okay, I'm willing to take a few to like land my big one,\" you know, that's like a okay strategy. It works for guys like Ilia and stuff. Um, but Ilia is not that easy to hit.\n\nThat That's true, too. He has like a way good guard.\n\nHe rolls with stuff like the Josh Emtt fight. Yeah. You know, he like takes the he like slides away from stuff, and these big bombs are coming his way. He's doing like the highest form, like intellectually he's doing that style at its highest expression with the strategy of \"I'm about to knock you the [ __ ] out,\" which shouldn't be everyone's strategy, you know.\n\nWell, you have to have that that touch of death.\n\nYeah, that's true. And he's got that god-given power. His power is [ __ ] crazy, man.\n\nIt is crazy. Uh Trevor's actually helped me understand why it works really good. Um so, okay. So, uh not to get crazy technical with it. I guess technical.\n\nLet's get in there.\n\nAll right. Cool. Um, so squared and bladed stances, when you're in a squared stance, you can move really good left to right. That was most of my career was being like, I'm I came from a basketball background. I know that I'm very quick and agile, and I can move left, right, really good. Um, if I just keep my hands up, whatever, it'll be fine probably, you know. So, a lot of squared stance stuff is I'm just going to cut left, right, overwhelm this person with all of my weapons and angles, and always constantly make them move off of the things I'm doing and not the other way around. That's good, but it's really hard to uh like get a ton of leverage in anything that you're doing when you're standing square. Like I can't like if I'm going to throw a ball, I don't throw a ball like this, right? I throw a ball like this.\n\nRight. You have your shoulder behind the other shoulder.\n\nYeah. Um, so squared stance is super good for being agile, moving left, right, and overwhelming people with the amount of attacks that you could throw at them because also if I'm standing square, all of my weapons are really available for me to throw. Like it doesn't take like this is faster than this and just cuz it's like 6 in closer or whatever.\n\nIn a bladed stance, you get a fuckload of leverage because if you watch Ilia, he's always standing like he's about to throw a javelin. And that's pretty much what he's doing is just like, and this is kind of like the science of boxing a little bit, like I said, that Trevor helped me with. So, I'm a lot more bladed now than I was because now we're trying to get like some serious leverage on stuff because five round fights, moving the entire time, fighting these really good wrestlers, it can get to the point where it's like it just gets quirky and just like a little [ __ ] looking, you know, and like I don't really want to like tap people to victory, you know? Right.\n\nUm, for a long time I would compensate in being like, \"All right, but I'll but I'll have wheel kicks, knees, and elbows.\" And that like took me a decent amount of ways, too, where it's like, \"Cool, now I can finish guys like that.\" Also, um, but these bladed stances where you can make a shitload of leverage with them are really cool. I think finding a balance between the two is really awesome. Elia is like only, and that's just my expression of my martial arts. I want to be like the jack of all trades, guys, and be able to be like, \"Oh, you're that style. I'll just archetype you in this style.\" But Elia is like always ready to throw a javelin, and he's really good at closing space with his lead leg. Like uh he'll like jab, hook, and really creep his lead leg near and then just bomb a right hand because he is a shorter guy, but he never seems like he's having that much of an issue getting super inside.\n\nWell, it's going to be interesting seeing him at 55.\n\nThat would be interesting.\n\nMuch bigger guys. Like think about Mauricio Rufi.\n\n55, and he moves good and has leverage, and he's [ __ ] gigantic. Like what how tall is Rofy?\n\nI mean he's got to be 6'1, maybe 6'2, and he's 55, and he's not thin. I mean he's lean, but he's not like scrawny. He's got muscle.\n\nHe's [ __ ] huge for 55. There's some 55, and Ilia as powerful as he is, he's not that big.\n\nMhm. And it's going to be interesting to see cuz because of this 10 lb, 10 lb is just like it's a lot of weight, man. You know, it's like when you're dealing with a 155 lb person, it's a significant percentage of your body weight. Especially when everyone's cutting like 30 lbs.\n\nI don't know what roof he cuts, but when I see him walking around, he looks like he's 190 lb.\n\nYou know, like Islam. Islam's [ __ ] huge.\n\nHe's big, dude. When I interview him in the cage afterwards, I'm always like, \"How how are you 155? How...\"\n\nI know how he's thick as [ __ ]. He's got a giant back.\n\nYeah. And when he gets a hold of guys, it's like he's just got this leverage, this grappling squeeze that it's I remember when he fought Drew Dober, and like when he got Dober down to the ground, I was like, \"That's a wrap. It's a wrap.\" As soon as he gets on top and then he starts clamping down and squeezing, and guys are just like Olive was tapping like the moment it was on, he was like, \"Fuck this.\"\n\nYeah. A lot of those really good grappler guys, they're strong definitely, but they're really strong at closing up all of the space.\n\nLike I can, if you let me get an under hook, like I could feel pretty strong. Like even if you're much bigger than me, I'll like make you take a couple steps back, which really shouldn't happen. But if I just close up all of the space, which I think is a big component of being a really good grappler, is being able to be like, \"Nope, that's my space. You don't get that. This, you know, and you're not going to get inside of mine.\" I can feel strong as [ __ ], you know. Um, and yeah, those types of guys, they're just so used to being so compact and never letting anyone get inside their arms or wherever it is that they need to get that it's just it's like impossible to feel like you can move them. I feel like there's two types of being strong in grappling. There's being strong in like \"I don't let you move me,\" and then there's strong in \"I get to move you really good.\" And the good good guys get...\n\n\nTo do both. Like if I can grab you and move you really easy, I'll feel really strong. If you grab me and I feel like a rock, I'm I'll feel really strong. Um, and I think that some people do both of those really well, and then some people do one or the other really well. Um, but those types of guys like the Islams, they do both really good. Yeah. And his striking has leveled up significantly. Like his striking is much, much better than it was when he was younger. Was he's just he's a threat everywhere. Like when he knocked out Cory Sandhagen with that high kick. Yeah. Granted, crazy. But granted, if I was in Vog's corner, I would say, \"No, you're not taking you've been [ __ ] drinking beer and eating kebabs.\" Like, there's no way you're taking this fight on 10 days notice. I don't care how confident you are. I don't care how much you like fighting. That's a crazy thing. I don't care how much money they're paying you because you look at the slide that his career took, right? He arguably won that first fight with Islam. Very close fight. Loses a decision. Or was it a draw? Uh, it was a decision. [ __ ] Was it a draw? That's actually a good question. I think he lost. I think he lost. I think he lost, too. Yeah. Either way, Islam keeps the title. Was it a draw? Why do I think it was a draw? Maybe one judge had it a draw. Maybe it was something like that. Um, so super close fight with the pound-for-pound best fighter in the world. 10 pounds up. Everybody's like, \"Vog might be the best pound-for-pound fighter in the world.\" And then he takes that fight on 10 days notice, gets head kicked, and then he comes into the fight with Taporia, what, four months later or something like that, compromised. Clearly, you got head kicked, shin to the dome, stopped, unconscious, and then you've got to fight the scariest [ __ ] boxer in the division, and you get knocked out, you know. So, then this big slide, and then he comes back full year off, and you see against Diego Lopez. Looks like the Vulk of old. Looks like he's back. Well, I would like to seen that Vulk versus Ilia. Yeah, that would have been an exciting fight. First one was a decision. Second one was a Yeah. KO. Okay. So, it was a decision. Yeah. Yeah. I feel like the casuals like to exist in a world where, oh no, if you're a if you're a better fighter, then you're just a better fighter. But it's like, no, man. Like, if I have three months to train versus two weeks to train, like difference. That's giant difference. Giant like giant. I don't do Z. This isn't a Zen. What is it? I just don't want It's like uh I just started taking them. They're called They're like They have 50 milligrams of caffeine in them. They're called NZ. Oh, yeah. I've taken those. Those are good. I like those. I like those. Um they're uh brain stimulants. Yeah. Yeah. I got a one that I got that I bought called Alpha. That's pretty good. Although I did kind of get a little annoyed that they ripped off Alpha Brain. It's a It's You know, I like these. These are great, too. These gummies. These Alpha Brain gummies are [ __ ] awesome. Um Yeah. I don't do caffeine anymore. That's like one thing that I stopped. Well, I do like this amount of caffeine. I do like 50. How many milligrams is that? Just 50. Okay. Small cup of coffee. Yeah. You know what's crazy is uh so um I didn't drink like a lot of caffeine or whatever. I would drink like a coffee in the morning like normal people. But dude, what I learned is cuz once I stopped, I immediately had way, way more energy. Or maybe not immediately, but like 10 days, two weeks afterwards. And you know what I looked up, bro, is that I already have like low iron. But I noticed or I looked up coffee gets in the way of iron absorption. Really? I Yeah. You have low iron. Do you eat red meat? Uh, yeah. I eat a lot of It's like a genetic thing. My mom has super low. I think it's like a ginger thing. I got like a [ __ ] Yeah, we're just born. Caffeine can inhibit iron absorption primarily due to the presence of tannins and other polyphenols in coffee. Dude, I swear this has changed me big time. So now I do the mud water stuff where I drink all the mud water. I like matcha still, so I'll still do like 50 milligrams in the morning. But dude, the coffee I stopped and I immediately started feeling way better. And I don't know how many people don't know this, but this is a thing, bro. I'm a coffee junkie. I know a real problem. It tastes good. I still drink decaf sometimes cuz I really like the taste of it. I take days off of these things. Like these are Breakers Lucy's. These are nicotine. Um I like them when I do podcasts. I like them before I do standup. But I take days off because I was like, \"Boy, am I addicted to these things? I'm [ __ ] sucking on these things all day.\" But I took a couple days off like, \"No, I feel I feel fine.\" But I've taken days off coffee and I'm like, \"Yeah.\" Yeah. Yeah. It takes like a week or so. [ __ ] falling asleep in the morning just like Yeah. I I honestly don't think everyone would have the same experience I did. I think it's because of the iron thing. That makes a lot of sense, man. Yeah. Drinking coffee and other caffeinated beverages with a meal associated with 39 to 90% reduction in iron absorption. Dude, it was crazy. Yeah. And so I So this how so, bro, this is how I found out. It wasn't like I was seeking this. It was I take a iron supplement in the morning usually because I have a little bit of low iron. And when I stop drinking coffee, one of the signs that you you are you're taking too much iron is that you'll get like a iron metallic taste in your mouth. And so about 2 weeks afterwards or whenever I started tasting that taste in my mouth and I looked it up and that's what it was. So I stopped taking the iron supplement because I was actually absorbing the iron from my food and [ __ ] Wow. Isn't that crazy? That is crazy. [ __ ] I'm gonna have to try it. Yeah, it it was it was kind of rough though. Oh, yeah. I bet. Yeah, it was rough. It It was like um I quit everything at that time just cuz I was like getting like my body was getting anxious. My mind is pretty much like stupid the whole time to life, but my body will get really uh I'll just like notice different [ __ ] I'll just like be more tired or anxious or whatever, you know? Well, you're so in tune. Yeah. You know, a fighter is probably out of all the professional sports, I think a fighter probably is the most in tune with their body because there's so like the consequences of not being in tune are so grave. Like there's it's so different than any other sport. Definitely. There's a lot of ways to get hurt and we have to watch what we actually eat. Most sports you don't really have to do that. It's just right. Um like we're super like food the relationship with food for a fighter is way, way different than I think almost everyone else on the planet. You know, when you like out of never cared about his nutrition, never took care of some people until he got older. Yeah. And then he got older, he realized like, hey, I've got to really [ __ ] do everything. I know, dude. I used to I used to be able to just down a Chipotle burrito with all the hot sauce on it and then just train afterwards like it was nothing. And now I can't do that, which kind of sucks. Yeah, that's also youth god to be. When you're really young, you can get away with anything. You really can, dude. I used to just be hung over rolling in and just I'd fight hard. It's crazy how much you can get away with when you're young. Yeah. But it's like the the other thing is like hard training for long prolonged periods, years and years and years. You get all these little micro injuries, the little things, things start slowing down. You're just demanding so much of your body. If you're not taking care of your nutrition, it's like, are you serious about this or not? Like what are you doing? You were [ __ ] 6 hours in the gym and then you're eating pizza. That's crazy. I see people [ __ ] up their weight cuts all the time just cuz after they cut weight they want to eat like an [ __ ] And I'm like, what are you doing, dude? You literally did for 8 weeks you were the most disciplined person in the world and now you're eating cake the night before the fight. You're an idiot. So dumb. So dumb eating cake the night before a fight. It's so cra I famous. Well, he said he only did it twice, but he was and they made it seem like in the countdown shows that he did it a lot. He would drink wine while he was weight cutting. Yeah. The whole time I was watching that, I was like, \"He doesn't do that every time.\" You're absolutely. I was like, \"Come on. This is like media stuff.\" You know, I was like, \"You're not convincing me that he does that.\" You know, he did it twice, he said. And he said, but I was like, \"What am I doing?\" Sounds fun. Bet you got drunk as [ __ ] off of one glass of wine, which is probably pretty awesome. And you were probably It probably tasted so good, too, being that dehydrated. And then you're dehydrating yourself more because of the wine. So, it probably aids a little bit in the water cut because it does dehydrate you. Yeah. But then that hangover when you got no water in your body. Yeah. I don't [ __ ] with hangovers anymore, dude. That's why I stopped drinking. I stopped drinking. Um I guess it's like close to four months ago. Mhm. And I used to have days where I would get, you know, I'd work at the club, do stand up, have a couple drinks, and then the next day I'd be working out going, \"Oh, what did I feel?\" I was like, \"That's just life. Just deal with it. Drink your electrolytes, get through it.\" I have no days like that now. That's nuts. Like even if like last night I only had like five hours sleep. Um but I worked out this morning. I feel [ __ ] great. Like I'm all the bad days have gone away. It's kind of like I'm like you [ __ ] You've been poisoning yourself for decades. That's how I feel too. I'm like so now I'll still go out and like do social [ __ ] and just not drink. I'm like this is just as fun you idiot. I was like you could have just been doing this the whole time. I know. That's the thing is like I thought you missed like I remember Boss Rutin telling me that that I quit drinking and have just as much fun. I'm like right. Yeah. Just as much fun. But it's true. It's like you you're you're having fun because you're with fun people. Yeah. And you're just having laughs. You don't have to be drunk to have fun. Yeah. You know, unless you were me in college. Oh, yeah. Yeah. A little bit. I think that part I think a big piece of me thinking drinking was fun is because I would just do really stupid crazy [ __ ] and so would my friends and then we'd just talk about it the next day like, \"Hey, that was so stupid and crazy.\" You know? But now that I don't do any of that stuff, I'm like, \"This isn't fun anymore.\" Yeah. And as a professional athlete too, you realize like this is just not good for you. Yeah. It's punishing yourself. Yeah. At this age, unfortunately, they told me my whole life it was gonna happen and now it's happening. Well, it's just becoming wiser, too. You know, that's why like I when you see that Jon Jones thing, I'm so sure you saw the police cam. Did you see that? Uh I did recently. I didn't know if it was old or the new one. Uh like this week. Yeah, that's a new one. He's drunk on the phone talking to the cops and you're like, \"Oh, no.\" Yeah. I don't know the details of it. Was he driving the car? Who knows? She The girl in the car said he was driving. The car was wrecked and John was gone and she ratted him out. Jon Jones did it and then John's on the phone with the cops and apparently allegedly threatened the cops when he was on the phone, which is not good. Yeah. Not good. And he's already got a history of running from accidents. Yeah. Yeah. I hope he gets whatever that is. I hope that he figures it out, you know. Yeah, I hope so, too. But, you know, it is what it is. Yeah. Some people Yeah, they like riding the lightning, bro. He liked riding that lightning. Yeah. And I think that's one of the things that made him so good, too, cuz he was so wild. He was just a wild dude. Yeah. You know, he just genuinely didn't give a [ __ ] and really had this ultimate confidence and so skillful and so smart\n\n\nBut eventually, you know, one more drink, and then your body is just like not what it used to be.\nYeah.\nAnd Aspenol is a [__] beast, man.\nYeah.\nI know there's a lot of questions.\nNever been out of the first round.\nA lot of questions, but never been out of the first round because he [__] everybody up in the first round.\nLike that's a factor.\nYeah.\nYou know, yeah, I really wanted to see that fight, but also at the same time I kind of I appreciate it.\nI forget which interview it was recently, but John was pretty honest in it.\nHe was like, \"Look, man, like I don't want to fight up-and-coming tough guys.\"\nHe was like, \"I want to fight guys with seasoned champions that have names.\"\nAnd I was like, that could also be interpreted as you don't really want to fight kind of the best guys that there are right now.\nYou want to fight like a certain category of fighter who you're comfortable fighting, but you don't want to fight the guys that are tough and that are saying that you're going to win.\nAnd that's okay.\nBut that's essentially how I interpreted what he was saying in different words, which I appreciated the honesty.\nWell, it's also money fights, right?\nYeah.\nBecause I think he's wrong because I think Aspenol is a star.\nI really do.\nYeah, I do too.\nAnd I don't I think he's saying who is he?\nHe's not no one.\nAspenol is a star.\nWhen I get when people ask questions to me all the time, like casuals on the street, is Jon Jones going to fight Tom Aspenol?\nIt's constant.\nThat's like the constant question to me.\nThe real fight would have been Jon Jones versus Francis.\nThat's the real fight.\nIf I like clearly I'm not responsible for making decisions because I would have made a lot of different decisions and I would have like Francis let's talk let's work this out.\nThat guy's a star.\nFrancis is the [__] scariest heavyweight of all time.\nThat's a star, you know?\nLike that guy as the heavyweight champion is so [__] marketable.\nHe puts people into orbit.\nYeah.\nYou know, he flatlined Stipe, he flatlined Alistar, he flatlin people, he's [__] terrifying.\nLike, that's the heavyweight champion.\nAnd for that guy to walk away from the belt and then almost beat Tyson Fury and then get knocked out by Anthony Joshua and then to come back and destroy that dude in PFL, what's his name again?\nUm, that big tall Brazilian dude that he ground and pounded into unconsciousness.\nFerrer.\nFerrer.\nThat's right.\nOh, okay.\nThat That guy's a Oh, yeah.\nYeah.\nThat guy was He Oh, yeah.\nYeah.\nJacked guy.\nYeah.\nAnd he's the guy that KO'ed Ryan Bader in the first round.\nHe looks phenomenal.\nHe's terrifying.\nAnd Francis just destroyed him.\nLike that's the guy.\nThat's the guy.\nLike, and everybody knows that's the guy.\nLike, that's the fight that that's the big fight.\nIt's a shame when that [__] happens in the sport, dude.\nIt's the worst.\nI hate it.\nI hate it.\nI see it happen all of the time.\nAnd I I can't help but think a lot of it is like hopefully it's just maybe money, business stuff, but I really I think that some of it is ego.\nAnd that's kind of what I try to drift drift like just drift away from.\nYeah.\nUm my philosophy on winning the belt has always been if I can't beat whoever it is, if it's like a number 10 ranked Umar or if it's a number two ranked whoever, if I can't beat that person, then I don't deserve the belt and I don't think that I should get it.\nLike uh I'm it clearly doesn't represent what it represents if it doesn't mean that I beat all the best guys on the way to doing so, right?\nUm not everyone really has that philosophy and I get it because once you start involving money and then money is taking care of your family, which is what you know is kind of an excuse to be greedy sometimes for people.\nUh it just kind of it's just never really been my philosophy.\nAnd I think that it's kind of a shame when that stuff happens because in my head we're doing two things.\nWe're seeing who the best fighter in the world is and we're getting people to watch so that the fans can appreciate something that I find to be the most loved thing in my life next to my wife, you know?\nSo, um I don't know.\nI think it's a shame when that [__] happens, especially when it's like a uh an ego thing.\nBut also at the same time, I don't really think that that's too much of what Jon Jones is doing.\nI'm more speaking in terms of what I kind of see in other people.\nI think Jon Jones also has to have some level of awareness around Tom's a young guy and we age, you know, we age and that's okay.\nJohn's not a natural heavyweight either.\nThat too.\nI mean, John still could make 205.\nYeah.\nYeah.\nHe Yeah.\nEven in his heavyweight fight, he looked like a little soft.\nYeah.\nA little soft.\nAnd like 240 and a little soft is I mean, think about how much Pereira cuts, right?\nHe could cut that weight.\nLike he could still make 205 and might still be the champ at 205.\nYeah.\nYou know, which is kind of wild.\nAnd Tom Aspenol ain't making 20.\nThat guy is [__] huge.\nYeah.\nAnduo is not making 205.\nFrancis would cut to get to 265 natural.\nSure.\nWhich is just bananas.\nYeah, he's a [__] hulking man.\nYeah, he's a scary dude.\nHow do people get that big?\nGenetics, man.\nIs that what it is?\nGenetics.\nYeah.\nI mean, that's just pure genetics.\nIf I was that big, I'm playing a different sport, bro.\nPlaying hockey, hockey, or [__] baseball or something.\nOr football.\nBut the brain damage you get in football is significantly more probably than the brain brain damage you get in fighting.\nYou like hockey?\nI do.\nI like watching hockeyy's pretty cool.\nYeah.\nI like I like hockey culture.\nI don't really understand the game because there's too much going on right now or like when it's happening it just like looks like a chaotic mess sometimes to me.\nBut I recently started watching it because the dude from the ABS I'm getting I've been like seeing him at the gym a little bit.\nHe's been training a guy named Nathan McKinnon who's like one of the better guys in the league right now.\nI've kind of been paying a little bit of attention because me and him will chat sometimes.\nBut dude, hockey culture is cool.\nLike when they score, they smile and cheer for a half of a second and then they're all just like stone cold killers back again, which I really appreciate about sports because I feel like a lot of sports have become like like all of the top players are like really superstar like flamboyanty.\nLike the thing about hockey is it's never been as popular as football.\nI know.\nIt's always been the steps the steps on.\nIt's like not quite the same, not in the same like they don't they don't reach the same.\nYou have a few Gretzkies, you know, Bobby or you have a few guys that become national celebrities, but for the most part there's not like a whole ton of them that everybody the general public knows about.\nSo because of that, they're probably a little more dedicated, a little more humble, a little more on the grind.\nThey're cool.\nThey're cool to me.\nI really like that sport.\nIt's very athletic sport, man.\nThe [__] amount of energy that those guys expend.\nI mean, the speed with constantly sprinting on ice, you know, and maneuvering and gliding around those blades.\nIt's incredible to watch.\nYou like any other sports?\nI like soccer.\nI like watching soccer.\nYou know, when I really enjoyed soccer, when I went to see a live match, I was like, \"Oh.\"\nAnd then I was I was talking to my friend Ed who's one of the owners of the Austin club here, and he was explaining to me like, \"This is the reason why it never becomes popular in America.\nThey don't take commercial breaks.\nThere's no time for a commercial break.\nThe [__] clock is always running.\nOh, I never noticed that.\nAnd these guys, these guys have legs.\nThey're like [__] quarter horses.\nThey have these [__] huge legs and they're just running constantly.\nThey're constantly sprinting.\nThey have to be in insane shape.\nYeah.\nYou know, it's like as like someone who's appreciates athletic performance, like this is a crazy sport.\nLike a really demanding sport.\nHow many miles do you think they run every game?\nI don't know, man.\nProbably at least four or five has to be.\nThey're constantly running.\nIt's like seven to nine usually.\nSeven to nine miles every game.\nThat's bananas.\nAnd they're not jogging.\nYeah.\nThey're [__] sprinting 7 to 9 miles, which is when I did that time in uh the Netherlands that I was talking about.\nI grew up playing soccer a little bit, too.\nBut I only did it until like people stopped thinking it was cool and then I like switched switch sports.\nI was like, \"Dude, when you're growing up, bro, all of the the goal is just to not be called gay.\"\nAnd soccer didn't do that for you, you know?\nThat's so true.\nBut, uh, true, dude.\nIt's just your entire existence as a kid is to not be made fun of and called gay.\nYeah.\nYou were a dork if you played soccer.\nYeah.\nBut, uh, oh, dude, when I went to the Netherlands and I watched some of those kids play, I was like, \"Oh, this is soccer in Europe,\" because they were like 10, 11, 12 year old kids, just freaks, dude.\nAnd like crazy athletic.\nYou could just tell that that's like what they do with their entire lives.\nAnd I was like, \"Thank god I didn't choose that sport cuz I just wouldn't be anywhere.\"\nWell, you'd have to go overseas.\nYeah.\nAnd then the competitiveness of the the soccer over there or the football, what they call it, over there is so much higher than in America.\nYou probably it would probably be a long adjustment to reach their level.\nHave you ever been to a game uh where there's all of the SWAT people and [__] because the hooligans and stuff?\nNo, I've only been to the Austin games.\nIt's pretty chill.\nI went to one in Serbia where they had more SWAT police officers than there were people in the actual stand.\nDude, it was wild.\nI was like, dude, Serbia is more developed than this, man.\nLike, people were climbing on stuff, throwing smoke bombs onto the field.\nI was like, bro, this can't be Serbian basketball.\nUh yeah, they're good at basketball.\nWe played some clips of basketball games in Serbia and you see the crowd in Serbia.\nThey go hard.\nI know.\nThey the the cheering is like it gives you goosebumps like holy [__] man.\nThese are warlike people and they're they're they're putting that kind of [__] that same energy to basketball.\nYou're like, boy, when those guys come over here, everyone's [__] And you're kind of seeing that now.\nThere's a bunch of Serbian players have made their way to the United States and those guys are [__] badass.\nYeah.\nThey're ready to fight the entire time probably.\nAnd they're scary hard dudes, man.\nYou know, which is like really interesting to see this influx of like guys from Russia, Dagistan, Chetchna, like some of these guys that are making their way into the UFC now.\nLike these are [__] hard dudes, man.\nYou know, it's really interesting.\nReally interesting.\nGeorgia.\nYeah, it's it's really cool actually.\nI I mean I really appreciate it, man.\nI think that MMA and martial arts just in general is such a fantastic thing for the world.\nUm and this to me has brought so many people together kind of like I didn't follow I didn't know what Dagistan was or Azeraijan was or anything like that when I it was 2014 so uh you know WKA the organization I did their national tournament and if you win you get to go do the world tournament for them in Italy.\nSo I got to do that and one and when I was out there a lot of the competitors were from all over the world and there was a place called Azure that I didn't know how to pronounce at all and they were whooping guys asses dude like bad like uh spinning hook kicks like all kinds of crazy [__] and I was like damn I hope I don't fight one of those guys but uh the entire time I was like the second these guys start getting into the UFC and stuff They're gonna wreck a lot of Americans, you know.\nYeah.\nUm but I really like that like um just the UFC in general has done a good job in my opinion because they're really the only globalized or one of the only super globalized where people from all over the world are fighting each other.\nKind of.\nI don't know man.\nIt kind of feels like it brings everyone together or at least for me like I could feel like I could walk into another country and have something something super in common with someone which is just like a cool feeling you I think another thing that's really cool about it is when someone is elite, no one cares what country they from.\nThey just love that guy, you know?\nIt's like if if Adisagna gets in there, no one cares he's from New Zealand.\nEverybody gets pumped.\nIf Pereira gets in there, it's Alex Pereira's fighting.\nYou don't say USA.\nNo, they're just [__] psyched to see Alex Pereira.\nYeah.\nYou know, so it's it's it's really great in that regard that you can become a true international superstar and you're embraced essentially by all the nations.\nDefinitely by America.\nI think that\n\n\nThat's a big American culture thing, too. Sure. Like we're, we don't really care where people are from as much. Think about the Russians that are over here. They don't, no one cares. No one's like, \"Oh, Russians, [ __ ] you.\" You know? They're like, \"Oh, that guy's badass.\" You know?\nYeah. I wonder if it'd be the same in those other countries.\nI don't think so.\nYeah.\nI bet not.\nRussia definitely doesn't think I'm as cool as I think they're cool. If I went over to Russia, I'd be like [ __ ] super worried they'd poison my food, you know? Like some crazy Russian like, \"Fuck him. [ __ ] this guy.\" You know, and [ __ ] throw something in your tea. Who knows? You know, like they're [ __ ] they're hardcore. It's like America embraces, but we're a melting pot, right? That's the difference between this country and all the other countries is that we are consistent entirely of immigrants. At one point in time, everyone, unless you're Native American, everyone was an immigrant.\nYeah.\nSo, it's like we kind of accept that people come from different parts of the world.\nYeah. About 300 years ago, we were all like, \"Let's go to this party.\"\nI know.\n[ __ ] party over there, man.\nWe could do whatever we want over there.\nI got to do all this [ __ ] that we got going on here.\nIt's kind of nutty in that regard. And you know, and boy, it's worked out.\nYeah.\nIn a lot of ways.\nYeah. I, I, I'm not really like a, I try not to be like too identified with anything or whatever or like be too nationalist, but every time I think of like just how lucky we are to be from here, dude. It's pretty cool.\nIt's pretty amazing.\nIt is. It's especially when you see stuff like that's going on with Israel and Iran and all of that stuff. It's kind of like, God, man. Thank God.\nIn the UK, people are getting arrested for Facebook posts, are they?\nYeah. Thousands of, they still use Facebook. [ __ ] users.\nWhat the [ __ ] they doing using Facebook?\nThat's how you know it's a political thing. It's all those old people.\nOld people.\nOld people on Facebook.\nAll my old friends from high school, like my old friends that I was friends with when I was like really young, they are, they're on Facebook.\nYeah.\nOld dudes love Facebook.\nMy mom and dad are on Facebook.\nThey argue about politics on Facebook. Like [ __ ] miss me with that [ __ ].\nYeah, they post about which neighbors.\nYeah, I know.\nI got zero time for any of that stupidity.\nBut this, you know, this thing that we've done over here is allowing people to express themselves. Whether you agree or disagree, that is just so gigantic. And what they're squashing a lot of that in other countries and that scares the [ __ ] out of me. That's what I was really scared about in this last election because, because I'm friends with Elon, I knew what was going on in Twitter behind the scenes. I knew how the government was stepping in and silencing posts. I'm like, this is [ __ ] dangerous, man. Because if they, they get a real grip on social media and you no longer can protest about things and express yourself about things, including a lot of things that happened to be true like during the COVID crisis, you people were getting their accounts banned for posting factual information.\nYeah.\nThat, that was scary to me cuz that's very, very unamerican.\nYou have to be okay with that for all the good and the bad that comes with it. Like you just have to, you have to be okay with people saying things you don't like. It's going to come with a lot of good and a lot of bad, but you have to be okay with it because when it's your turn at plate, like you're going to want to be, you're going to want to have your opinion respected, too.\n100%. And that's what people have to realize when it's so easy when like especially in this country, all tech is primarily left and they have a very strong ideology, this very progressive left-wing ideology, which is like all over the tech world. And when they were in control and they were silencing things, I think the attitude was this is good because we're right and we need to stop these fascists or whatever you want to call them, you know. And but the problem is then what if the [ __ ] right gets in place and they use the same rules that you used on them. Now we don't have a country anymore. Now we're [ __ ]. Now we're just like every other dictatorship.\nI don't really know how you solve it.\nI've kind of thought about like how to like get to a place where there can be world peace and all of that stuff. I, I don't know. I think that a lot of people, I know you've talked about it a lot, they get really attached to the egos and the identities that exist inside them and then they see the world from only that perspective. That's why I think that like a lot of the old religions and the old like echoed through time ways of being are to, you know, destroy your ego, eliminate yourself, be like this watcher of your thoughts and all of that stuff. And then start to identify with the watcher of what you think that you really are. And then once you spend enough time doing that, you'll spend enough time realizing that everyone else has that watcher inside them. And that maybe they don't realize it yet, but they're still really connected to their egos that are really just a bunch of ideas that were indoctrinated to them based off of our environment or who we grew up with and all of that stuff. And then you can start to love people a little bit more.\nAnd absolutely, it's, it's kind of a shame that, uh, I, I just know that that's not super big in the West, that idea. Um, just it's kind of an eastern philosophy, you know, like, be, be like we just meditate here. Like that's just such a like a [ __ ] ass way to think about doing it. Like that's what you're doing is you're settling into being able to watch what you think you really are and be like, \"Hey, if I don't want to be that anymore, I don't have to be that. Or if I, if that doesn't serve me anymore, I don't have to be that.\" This is one thing that I walk through a lot of my guys with in fighting is it's like you want to not be scared of something, don't desire anything. And don't be anything if you don't want to be scared because fighting fearless is a really big thing. I think that I do a really good job of performing really well because I'm not scared of a lot of things because I don't have a ton of egos inside of my brain as much anymore. I of course do cuz we all have to. But, uh, but yeah, once you start spending a lot of time with that watcher, you'll, I think that that's kind of why it always ends on the idea of love being the answer is because once you spend time disconnecting from what we think we are, it can, you always end up in the spot where it's like, oh, that person's that, they just haven't figured it out yet either. And I love them for that still. And that acceptance and love is empowering both to you and to them. Whereas like hate of other people, I mean it might motivate you in some way, but it's also crippling. You know what is that old expression that, uh, anger is the, is the emotion that poisons the vessel that holds it.\nYou know, this is, you're, you're wasting energy. You're wasting life and you're, you're wasting your potential because you're, you're thinking only in terms of negative all the time and negative is never constructive. Yeah. You don't have to, you don't have to think like that to be successful or to be competitive or in any way. You, you can be empty.\nThere's, yeah, there's a lot of energies in life that will serve you, I think, up to a certain point, um, that just will stop serving you because it's just not, it's not a fuel that you can sustain for long enough, you know.\nDid you develop this philosophy from reading? Did you, were you taught it? Like how did you...\nFuckload of mushrooms. No, I'm just kidding. Not a ton. Are you kidding? Not a ton.\nNo, I think that's the answer. When you were asking me what's, what's the answer to world peace, it might be that, it might be because I mean that definitely rips you out of your body and [ __ ] scares the [ __ ] out of you sometimes. But humbles you.\nYeah, it does. Um, yeah. Um, no, it, it was, it's a lot of reading. It's a lot of like, I've been fascinated by religion my entire life. I was raised, um, pretty, not like crazy, not like religious in like a dogmatic way, but religious in like a, hey, think about these things type of way by my parents, which I'm really grateful because I, I developed a super healthy understanding of those types of ideas where they didn't feel like they were something I was latched on to as much as they were things to be explored. And so it kind of started when I was really young. I just been fascinated by the idea of God, like in church when they're like, \"Hey, you're going to burn in hell forever if you don't agree with this.\" That became number one priority from that day on, dude. I was like, \"Hell?\" Once I could understand hell and forever, I was like, \"That's okay.\" I was like, \"Oh, okay. So, nothing else matters in life. Like, we got to figure this out right now.\" Um, so that kind of took me on like a really religious thing. And then after I lost my first fight. That was my big first experience with facing an ego that I didn't have control over. When...\nWhat was your first loss?\nUh, it was against a guy named Jamal Emmers who's actually in the Ultimate Fighting Championship now, but it, it was pretty much just I [ __ ] the bed and choked. Um, I would have got signed to the Ultimate Fighting Championship and I just choked and lost. And, um, I was supposed to in my head and based off of what everyone around me was telling me, I was supposed to be this like super big prospect guy, blah, blah, blah. After I lost, I had to face that maybe that's not what I am.\nWhen you say choked, like what about your performance do you think went wrong?\nI just didn't show up like the way, I mean, I was 5-0. I was still really new to the, you know, being a professional and being able to perform under high stakes. If I would have won, I, I think I for sure would have gotten signed to the Ultimate Fighting Championship just because I had been training with TJ. My word was around them a lot. It was went back to when you didn't have to get signed by the contender or anything. They just would call you up on a day, but you kind of had to have a little bit of an in or be doing really well or something. So, um, yeah. So, that was like my first big experience with that. I spent about that entire summer, um, as much as I could in the mountains. I didn't even really train cuz I didn't even know if that's something that I wanted to continue doing just cuz losing hurt my heart so bad.\nHow did you lose?\nUh, just a decision, dude. It wasn't even like gnarly. It was just like afterwards I was like, \"But I was supposed to win.\" Like what the [ __ ]. It's like someone [ __ ] up here, man. It's like I was supposed to win that. Uh, and so it was just like, oh, so maybe this universe doesn't revolve around me and like my ideas and who I think I am and all of that stuff. And then so spent a lot of time in nature, read a lot of books like power and now, a lot of Buddhist stuff, a lot of Ticknanhan stuff, a lot of, um, just spirituality books, but just the overarching idea of separating yourself from your thoughts and your body and all of that stuff. And just whether it's in our imagination or not, cuz I'm still not fully bought into any of that stuff. Like I don't have any beliefs is what I say now. Um, but I'm willing to entertain a lot of stuff and I want to believe something really bad because it would make life a lot easier to like navigate through.\nI feel exactly the same way.\nDude, it'd be so much easier if...\nI've always said, \"Someone come up with a great cult.\"\nYeah.\nCome up with a really great cult. I'll join.\nI'll come up with one.\nIf you [ __ ] like have like a really benevolent leader that really is an actual real guru and they, it makes sense and no one's [ __ ] everybody.\nI was going to say, are we allowing everyone to have sex with each other? No. Well, it's not usually the leader. It's usually the leader gets to [ __ ] everybody.\nThe leader gets to [ __ ] everybody and he wants your money.\nYeah.\nYeah. But if that could be avoided, but it would just make things easier, but it really wouldn't, right? You're better off without a real belief system, but sort of entertaining a lot of belief systems.\nI kind of land on this idea of, so I've been trying to write a comic book for the last couple years.\nReally?\nYeah. I know writing is a little gay or whatever, but that's where I spend a lot of money.\nGay?\nYeah. It's gay to some people, but it's like poetry.\nYeah.\nYeah, they're gay. If you're afraid of writing, you're gay.\nUm, so I, uh, I spend a lot of time writing. It's like what I do with my free time instead of golfing. Uh, but, um, like what kind of, right? Like, how do you write?\nUh, well, for the last couple years, it's been trying to write a pretty in-depth comic book, which has been really fun.\nAre you a comic book fan?\nUh, I'm a comic book fan, but honestly, dude, how it happened is I...\n\n\nI was like, I wanted to come up with this really cool story. I'm just an idea machine. Like, I just think of ideas all day. Like, I don't have many hobbies. I think it's super fun just me hanging out with me inside my head all day. Um, so I, uh, yeah, I came up with this really cool idea, which is essentially like a bunch of ideas from a bunch of religions that I really like and then putting them into a story. And the story is, um...\n\nOkay, we got some time for me to explain this. Sure. Okay. I think it's pretty interesting. Um, but I haven't really like broken it down from start to finish, really. But I got into writing just because I wanted to make this story of mine. Oh, that's what you asked me. Is am I into comic books? I tried writing a sentence like it started out in the August 5th of 20, and I was like, \"Fuck this, dude. We're doing a comic. I can't write sentences.\" I was like, and I read good books, so I like know what a good sentence is. And I was like, \"Oh, no, that's going to take way too long. We're doing only dialogue and pictures.\" And so, uh, that's why I started doing comic books. Although, I do really like comic books, too. Um, but yeah, so it's kind of this, uh, it's like a compilation of a lot of ideas that I like about religion inside of, um, this world that exists today. I actually put, um, a conversation between you and Duncan Trussell in it. I'm not... I'm not going to do anything with the comic book. So, it's really fun like to know that I just have fun doing it. Like I'm not...\n\nYou don't plan on publishing it?\n\nUh, maybe, but I think honestly, it would take like another two, three years for it to be super solid enough for me to want to put out there.\n\nUm, but there's a dialogue between you and Duncan Trussell. I really love Duncan Trussell. He's like one of my favorite people of all time. I got to meet him at the Comedy Works in Denver pretty recently.\n\nOh, he's the best.\n\nYeah, he's really cool.\n\nI love that guy.\n\nYeah. Um, but pretty much it takes place where this guy, uh, goes to the garden of Eden that's being protected by these, uh, tribes people, and inside of the garden of Eden are these trees called khal, where when you eat the fruit of them or you eat the crystals of them, you get teleported to a place where the sixth lives, and the sixth is like the god of our universe. Um, the world takes place in, uh, densities, which are pretty much our chakras. So there's seven of them. The first density, second density, third density, which is what we are as humans. The fourth are aliens. Um, where like we're humans that have merged with the technologies that we've created. It takes place about 20 or 30 years in the future where AI is, um, a real like actual [ __ ] player in the game, you know. Um, fourth is aliens. Fifth is like psychedelic creatures slash angels slash all of that stuff. Sixth is the gods of the universe. Seventh is the all. It's just like love. It's everything. And so it's a heavy comic book, man.\n\nYeah, it's pretty in-depth, dude. I mean, it's not like simple [ __ ]. It's not like [ __ ] some guy goes and saves the world. It's like a pretty... The lore of it is pretty cool, I think. So you go through each density, our souls do, um, for billions and trillions and however whatever p... whatever's past trillions, um, of lifetimes, and you spend time in those densities learning what it is to learn in those densities. So right now in the third density, because it's the power chakra of life, what we're trying to do is discover that the positive path of love is what we're really shooting for instead of the negative one. And what that means is the positive path is, um, in we're doing things in service of others instead of in service of self. So we're choosing love of others over love of self because love isn't like an emotion in the book. It's like a structural building of the world where everything is love. It's this all. It's this... it's not like Disney [ __ ]. It's like a structural way of building the universe. So choosing to be in love of others is what we're doing. But Earth is in its late third density getting ready to move into its fourth density. And this scientist who, uh, interacts with this tribe takes a seed from the Khali and grows them and makes it so that the entire world can take this fruit and then interact with God. And then what it would be like in in this world today if we were actually able to sit in front of God and ask God questions. And that's kind of the basis of the book.\n\nWow.\n\nIt's pretty cool. Yeah, there's a lot.\n\nAre you doing the illustrations?\n\nNo, I call the guy about doing the illustr... when I got... Yeah, which we're pretty close. I, I [ __ ] around with AI a lot, too. But we're pretty close to, um, uh, I think getting there with like some apps where you have consistent characters because it's hard to do stuff because you can't make the character super consistent. But I think we're like a year or two away from being able to... probably not even a year or two away.\n\nYeah, maybe not.\n\nI think we're in this very bizarre stage right now where I... I don't think people realize what's coming, and I think it's going to hit us like a [ __ ] freight train. So, I know everyone has like a thousand sto... there's like a thousand stories about AI taking over and all of this stuff in my book. Sorry, this is okay.\n\nYeah.\n\nYeah. Okay, cool. Um, I just know it's long and sometimes I lose track of time. Okay, cool. Um, the AI, uh, in this story is the way that we get moved into the fourth density. And the way that we get moved into the fourth density is when we merge with the nanotechnology that merges with like the AI supercomputer called oblivion, which is pretty much just a hive mind. Once we all get merged with that, we either based off of our polarity or our like frequency or whatever that tells us if we're positive or negative. If we go negative, then we pretty much just extinguish each other because all we care about is love for self and we like kill each other. It doesn't say exactly how, but you can use your imagination. And in the positive way, we move together in this hive mind into being aliens essentially where we live millions and trillions of lifetimes as aliens until we can enter into the fifth, which then we become psychedelic creatures and all of that stuff, uh, or angels or whatever. And that's like a non-physical realm at that point. But, uh, but yeah, that's pretty much the idea behind the whole book.\n\nIt might be actually what really does happen.\n\nIt's... it's kind of like a positive spin-off of it.\n\nWell, best case scenario is we evolve and we merge with AI and we evolve and it's better for everybody and we... we become something superior to what we are now. Worst case scenario is we become irrelevant because they don't need us anymore. We're... we're outdated. I still think it will still have to be partly us because it was created by us. Like in like a parallel universe where we are not like, say we're [ __ ] lizard people in another universe, we see things differently. Our priorities and values are different. We would make a completely different set of AI. Like there's no way that AI is just this thing that isn't connected to humans in some way. So hopefully it's connected to the good parts of us as humans, which is like compassion, love, caring for each other, and not like a lizard reptilian, right? Like, hey, let's just we got to maximize and capitalism and all of that stuff. You know what I mean? So, um, that's a lot of what the book is about, too, is it's just about like, hey, maybe...\n\nIt won't be so bad. Like, maybe this thing will have more human traits than... or maybe we're more awesome than what we... what we actually think, you... I think the hive mind thing is promising because and I have a feeling that that's where we're headed. I have a feeling that if with either some wearable or some sort of technology with an implant where we no longer require language to communicate with each other and we essentially have instantaneous access to everyone all the time. And the thing that people are going to have to deal with is that there's going to be no more secrets. There'll be no more lies. There'll be... it's going to be impossible to deceive. Everyone's going to know exactly what's going on in your soul, like how you interface with the world itself.\n\nThat's cool.\n\nI think that's probably where we're headed.\n\nI think if we don't, we're gonna... we're going to become obsolete. I think it's one of two things. Either we become obsolete and AI becomes a new digital form of life that's far more intelligent, far more capable than we are, and then it makes better and better versions of itself until it makes God.\n\nMhm.\n\nOr we merge and we... we just transcend whatever this state of being, these primitive territorial apes with very sophisticated weapons.\n\nWe become something... something different. If I did have beliefs, I would like to believe that it is going towards a god or something or there is like some point to all of the like hard times that we have in life and we're actually progressing whether it be through many lifetimes or in other universes or dimensions or whatever. And something inside of us that isn't human but is maybe a watcher or something is progressing towards something great and loving and more beautiful than what we got going on here on Earth. Um, and, uh, if... if that is true, then AI will probably be pretty awesome.\n\nYeah.\n\nYou know, if that is true. Yeah.\n\nYeah. Well, that's best case scenario, right? I think we're... it's also very strange that we are in this position. It's very strange that we are living our lives at this unbelievable unique moment in history where things are going to change in this undeniably radical way. Unless something happens, unless we blow ourselves up or we get hit by an asteroid, it's going to happen. And it's going to happen probably within the next 10 years.\n\nLike 10 years from now, we're going to be looking back. Remember the old days of 2025 when you didn't know what was coming?\n\nI know.\n\nYou know, I... I want to be like, \"Hey, you're overexaggerating that.\" But dude, if you think about the world five years ago, it was completely different.\n\nCompletely... just the invention of AI. Just the last few years. Yeah. Just the last few years.\n\nWe're all like bunker down in our house and [ __ ] five years ago. Even the UFC five years ago was crazy. Like life... like I only get to view life through the lens of my like job and my love, which is through fighting, which is cool 'cause it like helps me understand the macro picture a little bit better. But yeah, man, I mean, like even just five years ago how different the UFC was, like life is going to be really weird in 10 years.\n\nYeah, it's the whole world is going to be really weird. And you know, one of the things that always freaks me out about Elon in Neurolink is one of the statements that he said, \"You're going to be able to talk without using words.\"\n\nMhm.\n\nI don't know how that would work.\n\nWell, the hive mind.\n\nYeah.\n\nWe're going to be able to interact with each other. But do... but do we just feel each other's feelings then?\n\nProbably.\n\nYeah.\n\nYeah. Or that would be good maybe.\n\nYeah, that would be good. If it's like if I don't have like a filter of feeling something, my brain making it into words and then spitting it out, and it was just I have this feeling and you feel that thing, that might be a really great thing.\n\nI've often thought about the parallels of religion with what's currently going on. And one of them being like Christ was born of a virgin mother, right? So Christ was born without sex and emerged. Like what else is born without a... without a mother?\n\nWow. AI. AI is born without a mother. AI Christ is going to come back. AI is coming. Another one is the Tower of Babel, right?\n\nWhoa. Did you come up with that?\n\nYeah.\n\nThat's [ __ ] awesome, right? It seems like it.\n\nThat's awesome, right? If you... if you think that God is going to return, well, wouldn't it be...\n\nYeah, it's that completely makes sense. That's awesome.\n\nThe other one is the Tower of Babel, right? So we... if we all have a universal language and we are working on this [ __ ] tower to get closer to God... stairway to God... and it's do it right and you... you make it there, do it wrong and it becomes completely chaotic and divided and you're scattered across the... the world with a... a thousand different [ __ ] languages and nobody can communicate with each other, so nobody understands each other and it's just chaos, which is what happened to the human race. If we develop a universal language and if this universal language is transmitted through whether it's this implant or wearable, some sort of an interface with technology, then we bypass... we bypass this primitive state of, you know, chaotic tribal monkeys and we become something superior.\n\nYep. That's awesome. Yeah. The Tower of Babel was initially in my story because I've loved that idea for a really long time. Which is essentially it's just like a symbol for like, hey, if we all work together, we can actually do this thing, which is kind of, uh, the main idea that I got from it.\n\nYeah, dude. That's a... that's a cool ass idea about AI. I'm going to put that in my book. I'm going to steal that idea.\n\nYeah. Because if you think about it, what... what... what is AI going to be? Well, if super intelligence gets achieved and then you're attaching that to quantum computing, right? Quantum computing right now is only able to just like do integers and you know, do... do equations. But what if quantum computing and AI merge? Then you've got some insane amount of computational power attached to an insane intelligence that is going to make better and better versions of itself. Well, if you scale that up exponentially, 10, 20, 30, 50, 100, a thousand years. If you keep going, you get a god.\n\nYeah. I mean, imagine... I mean, quantum... imagine, too. I mean, who knows? Like, if we want to go real sci-fi with the idea, like quantum...\n\n\nParticles communicate to each other, so maybe they'll be able to communicate with the ones that are in other dimensions.\nAnd that's how we're able to communicate with other dimensions or whatever.\nWell, that's the freakiest concept about quantum computing when they said that the way it works is so confusing and it's so powerful that they think it might be evidence of the multiverse.\nYeah.\nNow, I talked to Roman Yolski, who's a scientist who talks about the dangers of AI, and he thought that that was all nonsense.\nMhm.\nHe might be right, but there's a lot of scientists that believe that it's correct and that this is why quantum computing is so powerful.\nBecause Mark Andre said this, and it's the [ __ ] craziest quote ever that quantum computing, it can solve an equation that if you converted the entire universe, like every molecule, every atom of the universe into a supercomputer, it would take so long for the universe as a supercomputer to solve this problem that the universe would die of heat death before it solved it.\nAnd quantum computing can solve it in minutes.\nYeah, I've seen that Instagram reel.\nLike, what the [ __ ] does that mean?\nEssentially, what we would be doing, um, I bet you when they were trying to invent electricity, they didn't know that it would be this.\nAnd maybe that's what we're in the middle of, except like times a thousand billion, where it's like, oh, because I always think I'm like, we got we're only looking through the lens of the future through all of the inventions that we have now.\nWhat if we invented something that was like electricity or quantum computing or quantum communication or like if you can change things at a quantum level?\nLike maybe I can turn this thing into the hardest steel metal in the entire world.\nUm, and then that just completely changes the board game that we're even playing.\nLike we're not even playing the same board game anymore, right?\nSo it's like I don't know.\nBut anytime anyone says nothing's possible, I'm like, &quot;You sure?&quot;\nCuz if we just change the board game, [ __ ] can get pretty crazy.\nYou can't say nothing's possible because everything that we have today is impossible 200 years ago.\nYeah.\nYou're a sorcerer if you go back to the 1400s and show them an iPhone.\nYou know, like this none of none of it makes any sense.\nThe fact that you could FaceTime someone in New Zealand right now, that's bananas.\nAll that stuff is [ __ ] completely insane and it's real and it's happening right now.\nAnd the other thing about AI being, if artificial super intelligence creates something that we can't even imagine, like we're just dealing with this framework, this structure that's so antiquated because it's all been created by humans.\nIf you get something that's a thousand, 10,000 times more intelligent than us and it's going to have solutions to things that we can't even comprehend.\nYeah.\nYeah.\nYeah.\nIt's freaky [ __ ].\nCould get real weird.\nYou know, one of the things that always weirded me out about these stories about uh UFO encounters and in particular the Bob Lazar story is that when he was working on back engineering these crafts that were supposedly from somewhere else, one of the things that he said is there's no controls.\nMhm.\nThere's no controls in this thing.\nLike they they don't know what is happening between these beings and this craft that they power it, but they're probably completely connected to this thing.\nThey're pro like what you're seeing with those those little grays is probably us in the future.\nThat's probably what every primate eventually becomes once it integrates with technology.\nIt would be really cool if that's like you said what the religions were talking about, too.\nLike to me the science [ __ ] is all cool and stuff, but I also like the idea of like intertwining like science modern ideas with really traditional ideas.\nIt would be super cool if it was something where it's like, hey, like once we reach this certain of technological advancement, there is a spiritual religious side to the thing that we also make discoveries in too.\nMhm.\nThat would be cool.\nIt would be cool to have a belief.\nYeah.\nIf you got, well, you know, if if artificial super intelligence does become live, it all belief systems are going to get thrown into the wood chipper.\nWe're not going to know what the [ __ ] is what unless it tells us.\nYeah.\nI mean, yeah.\nBut I have a feeling that a lot of these stories, like these ancient religious stories, they're based on truth.\nIt's just truth that was a spoken word thing by people who really couldn't even read because they they were illiterate, and that they had these tales that were they're told for a thousand years before anybody wrote them down.\nThey're writing them down in these ancient languages that even when you take those ancient languages and you try to translate into like modern English, a lot is lost in the the translation.\nBut I think there's something to all of it.\nAnd there's something they're trying they they don't they're not telling stories for no reason.\nI think they're telling these stories because they're trying to document something.\nAnd I just don't think we get a full picture of it.\nBut there's so much truth in those stories and there's so many lessons in those stories that that are applicable and that resonate today.\nI think it'd be foolish to dismiss them.\nDefinitely.\nUm, I mean Carl Young harps on that a lot with the collective unconscious stuff.\nDo you know Joseph Campbell?\nDo you follow that guy?\nI love Joseph Campbell.\nOh, he's amazing.\nI got super into Joseph Campbell around that time when I was kind of um you know doing the whole figuring myself out part after losing.\nBut I mean the idea that there's pretty much a blueprint to all of the stories that are across civilization is crazy.\nIt's like the pyramids being everywhere.\nLike we it's just naturally ingrained to us for stories to be like superhero gets called to action, finds a guy, beats monster, beats mega big monster, returns back home.\nLike that's like the blueprint to a lot of stories.\nAnd I think it just goes underneath the rug because we're just so used to all of the stories being like that.\nUm I've messed around, like I said, like I spend a lot of time in my head.\nUm I don't really like talk a ton.\nAnd I kind of just but I've done the whole like hero's journey thing in my head during the Joseph Campbell time.\nI can share it with you.\nIt's kind of fun.\nSure.\nOkay.\nUm uh I just come up with stories and [ __ ] in my head.\nBut anyway, so I did my own hero's journey during that time when I was trying to eliminate all of the egos inside of me.\nAnd the easiest way to identify one of your egos is to ask yourself, what is it that you feel like you desire?\nYou know, that's why I think in Buddhist philosophy and all of that stuff, it's always like let go of attachments, let go of your desires, and that will lead like just good [ __ ] will happen if you do that.\nAnd I was like, okay, cool.\nI'll buy into that a little bit.\nSo, I tried to identify all of these egos that were inside of me.\nI even went as far as naming all of them and giving them characteristics and personalities.\nLike when I would notice an angry person inside of me, I would just name it Samson, give it a tiger's face, and like uh just treat it as a completely separate imagin imaginative piece of my psyche that I no longer wanted to be attached with anymore.\nUm which is uh an idea that I came up with myself at the time, but it's a old idea.\nThere's a really good book called Taming Your Gremlins if anyone wants to look into that idea more.\nUm that guy does a really good job of doing that.\nSo anyways, I started going through like my hero's journey and um I spend a lot of time like meditating a decent amount but not just like normal meditating like [ __ ] around in my own head type of meditating and just seeing what type of unconscious things are kind of below the surface of my everyday like Corey me.\nAnd so I'm walking myself through like okay what is this?\nWhat are all of these things inside me or what are these desires that are inside me?\nI would name him.\nI would turn him into a monster and I would kill the monster.\nAnd then at the at the very end of this story and I'm like crying during this process when I was doing it or whatever in the hero's journey a lot of the time you have a mentor like a Yoda.\nUm you have this thing that kind of guides you through how to defeat all these monsters, all of it.\nSo I get to the end of my story and one part that they never really bring up in heroic stories is the return back home.\nUm which is a really big deal like you've just eliminated all of this stuff and now you got to return back home.\nSo I'm getting ready to return back home and my mentor at the time because I did grow up really religious.\nUm it was Jesus at the time were like Jesus was my homie at the time, you know, he was like this guy and so we get done defeating all of these monsters and I'm we're sitting at the cliff and it's like okay time to go home and he's like hey man like you got one more monster to defeat and I was like well what is it?\nAnd he was like me.\nAnd I was like, &quot;What are you talking about?&quot;\nAnd he was like, &quot;Man, like I'm the last thing that you're attached to.\nLike, in order for you to continue on, I'm the thing that you got to defeat.&quot;\nAnd I was like, &quot;Well, what does that mean, dude?\nLike, I'm not about to stab you, bro.&quot;\nYou know?\nAnd he was like, &quot;You have to push me.&quot;\nAnd I was like, &quot;Push you off the cliff?&quot;\nHe was like, &quot;You have to let go of me the same way that you let go of all of your other desires and fears and things inside of you, too, if you really want to do it.&quot;\nAnd so I'm like balling crying because that's that was like a big like that was a big thing.\nSo I do it and Jesus falls but then he grows wings, flies away and says to me, um, now you can be like me and then just flies off into the the whatever and then I return back home.\nAnd I just remember that being a really big moment for me in my I don't like to use the word spiritual because it sounds stupid.\nUm, but that was like a big deal for me in my development as a person because it really like made me understand and they weren't things that I was planning out.\nThey were just unconscious things that were hitting me like over and over and over again.\nI found that through hypnosis and through like trying to see what's underneath things.\nYou can't talk to it.\nYou can't tell it what to do.\nYou can't control your unconscious.\nYou just have to watch what's underneath there.\nSo it was just like a thing where it's like now I get to be like you was like a really cool thing that just like popped into my head and I was like well [ __ ] that's cool.\nThat is cool.\nYeah.\nI do a lot of crazy [ __ ] inside of my own head.\nI guess probably makes me sound maybe a little bit weird, but that's kind of weird's good.\nThat's me.\nYeah.\nWeird is good.\nWhat was it like returning to fighting after this?\nLike trying to find yourself period.\nYeah.\nUm, I remember I was folding laundry and they asked me to fight this guy, uh, Tahinho Gaval on four weeks notice for LFA, and Tahinho Gaval is a [ __ ] savage at the time.\nUm, still still I think is doing pretty well, but literally every YouTube video I could find of him was just knocking people out.\nHe was like 6 and 0 or something and just murdering people.\nBrazilian guy.\nAnd I was like, I don't think that was a good idea.\nLike I just lost.\nI don't really want to lose again.\nAnd I remember going back and forth with myself big time.\nAnd as I was folding laundry, I kind of got hit with another bit of uh wisdom that came from wherever, not for myself, came from wherever.\nAnd in this bit of wisdom, it told me, man, I gave you this life for for you to make it up yourself.\nQuit asking me to make decisions for you.\nAnd so I was like, all right, [ __ ] it.\nI'll do it.\nYou know, um I'll do it.\nAnd a big piece of me going through that whole thing and what I learned a lot about it was uh love of fighting isn't really love of anything, I don't think, is like Disney [ __ ].\nIt's like a mega commitment to something that you want to achieve and it works like a marriage more like a marriage less than like a romantic like hey this is a fling, like it's like hey man I might not like you every day, you know, but I'm going to commit myself to you and I'm going to do this thing and it helped me really wrap my head around what kind of true love is because I feel like that's what true love is and if you want to love this sport and you want to say you love this sport, you got to love it on the months, days it might last years that you really don't like it and just trust that on the other end of it is like a good experience.\nThere's a payoff.\nYeah.\nIt's a process.\nYeah.\nSo, how was the fight?\nIt was good.\nI knocked him out in the first round.\n[ __ ] crushed it.\nWasn't scared at all going in.\nReally?\nOh, yeah.\nI don't get scared much like when I'm actually fighting in that mode of like fight or flight, but I've already chosen fight, like I'm good, you know?\nI don't really get too scared going into fights hardly ever.\nI I get scared leading up to things, but in the actual fight itself, like I'm I'm the goddamn Incredible Hulk, you know?\nYou can't convince me otherwise in those moments.\nWell, I remember one time we talked and you said that you'd made this adjustment in your head from trying to fight and win to really trying to hurt people.\nDo you are you still on that same No, no, not as much.\nUm I got a little bit older.\nUh one I think is a contributor to it.\nTwo is that wasn't a fuel that I could hold on to for super long.\nUm, it was like angry fuel doesn't really like work.\nIt's not super sustainable.\nUm, I also found too that being that way got distracting to me.\n\n\nBeing able to do what I was trying to do. Um, so any thought can be distracting when you're fighting, as you know it, like even like silly ones or whatever. But if I'm being too aggro and too, I got to hurt this guy, I got to hurt this guy. That was good for me to learn because I got to learn all of the different aspects of what it means to be a fighter. Before that, I was really zen, peaceful, like whatever happens, happens. I'm going to do my best, you know? And then I went way on the other side of the spectrum where it's like I'm [ __ ] killing people, and that's what I'm doing now. Um, to now kind of somewhere a little bit in between where, um, for me now, all of it is about focus and doing the correct thing at the correct time. I think that where I am today as a fighter is very focused on just exactly what I said, where what do I need to do right now in order to win, and I don't make it angry, I don't make it motivated by anything else. It's just, no, this is like a laser focused in doing the right thing, and uh, that's what I found recently has been the most helpful thing.\n\nJust this zen state of just existing in whatever, whatever comes, whatever you're supposed to be doing, you do that kind of, but I know where I'm supposed to be now a little bit too, like intensity-wise. Before, I feel like I, I got like some like superpower that I like didn't really know how to control very much. Now I feel like I, I have harnessed it and I know how to control it a lot better to where it's like, okay, a 10 is too much. Like, right now, we got to be a seven. We're in the locker room. We're about to walk out. Let's, let's maybe be at a eight or a nine right now, and and we'll be there for the fight instead of just 10, hurt the guy, or you know, Michael Jordan had a really good quote where it was either Michael or Kobe, but he was, they said they never play a game at more than 80%. And I think that that's kind of a cool way to look at it, and that doesn't mean your effort. I think it means your intensity level. You can't think at a 10. Sometimes it gets distracting to burn all of that like angry energy. It's just, it's just not sustainable, you know? So, so you're in a position right now where you're next in line. And when you look at Morab, he presents so many unique challenges, like this is a, he's a, there's a few guys that are very skillful, but they also have unique physicality, and that's Morab. So, like when when you see that fight, first of all, have they given you a date?\n\nUh, they haven't. There, I think it's, I mean, that stuff takes a little bit. They told me November, December is when I'm looking, Square Garden.\n\nYeah, maybe.\n\nWhich I was a little bit against too, because I hate the New York State tax thing, but uh, but also at the same time, I was in New York recently and I was like, ah [ __ ] it'd be cool to win it in one of the like iconic place to win. If you won the world title in Madison Square Garden, that means a lot.\n\nYeah, it would mean a lot.\n\nThere's something about Madison Square Garden. Like when you're in the building, you're like, man, a lot of [ __ ] has gone down in this building.\n\nIt's huge. It kind of feels like a gladiator. It's cuz it's just huge. Like the floor part is huge, you know?\n\nIt just feels different. I did stand up there and just being there and walking out to this enormous crowd in Mass Square Garden. I was like, whoa, cool. This is the [ __ ] garden. center of it.\n\nYeah. In the round.\n\nOh, you did it. Oh, so you were like looking in 360 degrees. Did you like that?\n\nThat's my favorite way because it's oddly intimate. So even though there's 16,000 people, the people on this side are seeing the people laugh on this side, and everyone's seeing everyone laugh, and you're just walking around in a circle.\n\nOh, cool.\n\nIt's, it's oddly intimate for 16,000 people. It's my favorite way to do arenas. I was always really curious because I've seen standups like that and I, I was like, I wonder if that's distracting for them to have to.\n\nYeah. It's the most fun. It's, I, I thought it would be distracting too, because I've done arenas where you're on stage facing the crowd, and it feels oddly impersonal. It's like you're just doing a show for this massive amount of people. It's fun, but that I kind of preferred clubs, but a giant arena in the round seems like a giant club. It really does. It's like, but there's some, there's a lot of like, doing it in Boston was huge because like, I did the TD Garden because that was like where I grew up, and that's where I started doing standup, but there's something about Madison Square Garden for fights where when you go there, it's like there's an extra tingle in the air, like, woo boys, we're at the garden.\n\nCool, you know, so you fighting Morab at the garden would be [ __ ] insane.\n\nYeah, it'd be crazy. Um, yeah. When you think about him, um, what do you think about this matchup? Like, how do you approach it?\n\nI think he has some, um, obviously really good physical traits that make him, like his conditioning is a superpower that other people don't get to have, and that's unique to him, and he's made a way to weaponize that in a really smart way. Um, every time I like kind of too technically break down things, I feel like I'm trying to be really convincing instead of uh, you know, just believing in it, which has always kind of been a big problem of mine in the past. Has always been, I need evidence in order to believe in something, which kind of just, and like with that in, in like fighting for a world champion. What am I going to just walk in and be like, well, I've been a world champion before, so I could do it now. Like I don't get that luxury of doing that to be a world champion. So recently I've had this realization of belief in self that Trevor and Carrington Banks have both helped instill in me big time. Um, where I feel like approaching Morab is going to be unique in its own, but I don't need to tailor what it is that I'm doing too much to Morab. I've really bought into this idea where if I can go out and be the best martial artist that there is in all areas, be able to wrestle with him, be able to strike with him, be able to grapple with him, if I can go out and trust and be that, I can do it. Um, against Umar, I did not as good of a job with that. I treated him like I had to change in order for me to be able to beat him. Against Morab, I'm not going to do that. I think Morab also has this narrative buzz around him where he's an unbeatable um, force of freak of nature who has conditioning out of whatever. And while that is true to an extent, that doesn't mean anything to the fact that the guy can't be beaten. Um, if I look at myself as a fighter and break myself down technically, I would say I'm, I'm somewhere between Umar and Shawn in the task that he'll have in front of him. I think I know that I wrestle a lot better than Shawn does. Um, although Shawn does have really good takedown defense, his process of getting up is just like uh, a little dated and pretty slow. Like you're going to lose some minutes doing it the way that Ali does it. Um, I think that I get up super good. Being tall and lanky, it's really hard to not let short little guys get underneath you. Like, that shit's going to happen. Especially if they're springy and fast in our weight class, like they're going to. You just have to be able to pop right back up immediately, which I know that I can do because I fought Umar, who's easily one of the best wrestlers in the UFC, and I was able to do that whenever I wanted. Um, so that brings me a lot of confidence about that. So, I get to fight Morab with a lot of confidence going into it about that. Um, on the striking end of things, I'm obviously, I think, a way better striker than Morab is, even though he does make his [ __ ] work the way that he makes his [ __ ] work. Um, but I'm honestly not going to read too much into it, man. I'm going to keep worrying about getting better every single day, um, all the way leading up to the fight, and I'm going to make Morab deal with me instead of me having to deal with Morab.\n\nDo you have to do anything different to deal with that endurance?\n\nI mean, man, I, I feel like I try to go in as every time I feel like there is a uh, there's like a unique thing that you need to big time prepare for. Um, I go in shape as best as I physically humanly am capable of in every single fight that I go into as long as I'm not hurt or on antibiotics and and [ __ ] like that. Um, so I already do that kind of, so I'm not going to kind of overthink that piece. Uh, I might run a little bit more. I hear Morab runs, so maybe I'll run a little bit more. Uh, um, but no, outside that, I'll, I'll make sure that my legs are really conditioned. Um, that was a big one going against Umar, I'll obviously make sure that I'm conditioned enough to be able to get my ass back up every single time, which is its own spe, like wrestling conditioning is a much different type of conditioning than striking. Um, so just make sure that I'm fully wrestling conditioned for that fight. And then one of the harder pieces for people in the sport is to wrestle, then be able to strike like how they normally do. Um, so just being uh, just being conditioned to do that too.\n\nWell, I'm pumped for it. I can't wait to watch. I think you're one of the more exciting guys in the sport and one of the more interesting guys in the sport. I love listening to your thought process. Very cool.\n\nCool. Thanks.\n\nSo, thanks for being here, man. Appreciate you very much. And uh, again, I can't wait.\n\nCool. I'm looking forward to it. Thanks, Joe. Thank you. Thanks for everything. Yeah, pleasure. All right. Bye, everybody.\n\n[Music]\n[Applause]\n[Music]\n"
}