{
  "episode": {
    "id": "EDBFFgs6Ifs",
    "title": "Joe Rogan Experience #2333 - Protect Our Parks 15",
    "publishedAt": "2025-06-05T17:00:30.000Z",
    "description": "Shane Gillis, Mark Normand, and Ari Shaffir are stand-up comics, writers, and podcasters.\nShane is the co-host of \"Matt and Shane's Secret Podcast\" with Matt McCusker and one half of the sketch comedy duo \"Gilly and Keeves\" with John McKeever. Season two of his Netflix series, \"Tires,\" premieres on June 5.\n⁠https://www.shanemgillis.com⁠\nMark is the host of the \"All Over the Road\" podcast, and co-host of \"Tuesdays with Stories\" with Joe List and \"We Might Be Drunk\" with Sam Morril. Watch his stand-up special, \"Soup to Nuts,\" on Netflix.\nhttps://⁠www.marknormandcomedy.com⁠\nAri is the host of the \"You Be Trippin'\" podcast. Watch his latest comedy special, \"Ari Shaffir: America's Sweetheart,\" on Netflix. \nhttps://⁠www.arishaffir.com⁠\n\n\nGo to ⁠https://ExpressVPN.com/ROGAN⁠YT\nto get 4 months free!\n\n\nTap into exclusive PPVs with an ESPN+ subscription"
  },
  "channel": {
    "id": "UCzQUP1qoWDoEbmsQxvdjxgQ",
    "name": "Joe Rogan",
    "slug": "@joerogan",
    "url": "https://www.youtube.com/@joerogan"
  },
  "transcript": "Joe Rogan podcast. Check it out. The Joe Rogan Experience. Train by day. Joe Rogan podcast by night. All day.\n\nAll right, we're rolling. Don't do anything. No. Come on. Everybody's on the Zim. I think it's probably bad for you. There's also that part of me I can't bring myself to actually not work out. You look ripped. No, no, no. You don't want to talk about it, but look at those shoulders. Those shoulders are coming in strong. You look noticeably thicker. That's what I said to my trainer. He's like, \"You want to lose weight?\" I said, \"No, bigger. You want to get huge, dude? You've been in this gym like super consistent.\" If I'm in Austin, I come here every day. It's very nice. It's awesome. Every time you open that door and I see you pop out, I'm like, \"Fuck yeah, he's getting after it.\" Do you worry about the buff comedy though? You don't need the buff comic. Actually, get into… Well, I very rarely wear a t-shirt on stage. Anything tight. Shirtless is my mood. I just want to look like a shirt off like Hulk Hogan.\n\nStart comedy. Yeah. Gryer when he started losing weight and he's getting jacked. I'm like that. You're taking away from your act there, fella. Exactly. No, you look like a football player now. Like Bert was getting some big thick ass. I don't do a lot of fat jokes. No, if any. No, you don't really. You might make fun of yourself if it helps something. Yeah, it doesn't matter. Well, you're not fat enough. You're just… You're more like squishy. You're just a fat cat. Yeah. You're not like a fat guy. So absurdly fat that we have to talk about it. Bert doesn't really do fat jokes either. No, no, no. Really? No, not really. Sometimes you just got to attack the elephant in the room just to get it out of the way. But then after that, [__] it. But if you're really good, you don't even need it. But if you have a joke that's funny, that's f like, who [__] cares? That's the weirdest thing is comics, like policing what should be talked about. If someone comes up with the most amazing fart joke of all time, I'm going to die laughing, you know? It's like I don't do any. I don't have any, but it's like on anything and everything. There's a take on anything and everything that's like, yeah, you know, it's just got to find where it is. That's kind of my goal is to come up with the best fart joke of all time. Do no, not yet. Jokes. Come on. What's that? You're bad at today, dude. What's up with you?\n\nYou've pulled out three drugs. I've been here eight minutes. They're all drugs. No drugs. Just nicotine. Just those epic. Don't get the feds on us. Lucy Breakers. What's the heckle fish? Oh, that's from um… you ever see that YouTube show, *The Y Files*? No. It's a great show. It's all about like aliens and why you can't go into the Grand Canyon and you know secret temples and stuff like that. And AJ Gentile is the host and then uh this is a fish that sits in the fish tank next to him and talk[__] to him. I will be a strict but fair lord of these lands and my will come to us. We went up to them right away.\n\nCan't say there's no drugs. They hold up stuffed animal. Guys, check this out. On his forehead, bite me. Well, the thing is like now everybody comes and they give me something for the table. That's like part of the fun. I got this little mech head from Luke Caverns. Pretty dope. I also got an Aztec death whistle. Do not blow it. I blew it. The last time it's Theos. We last time we had one of these and we blew it. Death whistle. Ken blew it on the podcast and the pandemic started a month later. I'm not kidding. [__] LA was locked down. Everything had… People were like connecting it to the death whistle. It was a conspiracy theory. Oh, poor Bob. Sorry. You got me. Ah, the death cuz I think that one drives me nuts. Yeah, Pop Saga does. Yeah, cuz it's the same thing that happened to Heather McDonald. Blacked out, fell, smashed your head, died. She lived because she was on stage and luckily they got medical help. Rug rug on the stage also. It was fake. No rug. Oh, no. She was… It was hardwood. I don't think there was a rug. Hardwood, bro. Her head video a lot. I don't think I've seen that video 30 times. It's hardwood. Her head bounces. It's very terrifying cuz that's how people die in street fight. Yeah. That's the big reason why people die in street fights. They get knocked out and they hit their head. It's not from getting punched to death most of the time, right? Most of the time it's from falling hitting your head. Remember the knockout game? Knockout game. Oh, that is so scary. Yeah. So scary. Filming crimes is a very… No, that's a hard stage. We're already watching it again. That stage is hard. Just get the Hitler speed. It kind of gets enveloped into the stage. Fractured her skull. That's crazy. Really fractured her skull. Yeah. Whoa. Yeah. Scary [__] Yes. You could bleed. You bleed in the brain and you could… Didn't eat the whole thing. That was perfect. Possibility\n\n\nYou'll never be the same again. Question is, did it kill? Did it get a laugh? It got the biggest laugh of the set. All right. Well, until people found out it was real. Yeah, they thought it was a funny joke. Hilarious. Oh, wow. Which is the way you would do it. You ever get an accidental joke where you say something and everyone laughs? You're like, what? Oh, I can see the double meaning on that. Okay. Alpha channel. I meant that. Yeah. Yeah. Oh, yeah. Definitely. Well, that's the difference between like writing it and saying it, right? You write it and you're like, I think I know how to go with this and then you get on stage and say it, you're like, oh, that's the funny part. Yeah. This is this is [__] ridiculous. The fact that this exists is I'm always embarrassed if I wrote something then say it and it's not even close.\n\nWhat the [__] was I thinking? How much that happens? I always think of it as like a scaffolding. I'm like, I don't know what's good until I get up there. Yeah. Well, it's funny how when you're in your apartment, you're killing. You're like, man, this is good stuff. And then when you get up there, you can like feel this won't work, right? Right when you're on stage. I don't know why I'm saying this. But when you have people in front of you, you're like, oh, this is not going to hit. Oh my god, it's the best. And then you went into it so prepared and then they're just looking at you like I don't get it. You go into it like I wrote a new bit today. This thing's going to [__] kill it. Yeah. Two words into it you go. But that's why comedy is great because you can never really crack it. You can get better at it, but you can never really go this is going to work. It's also like a truly collaborative thing. You have to have an audience. Yeah. It's like like Gary Clark Jr. to write a [__] amazing album by himself in his like private music studio and nobody has to hear it until you listen to it the first time. You're like, \"God damn.\" Like Oliver Anthony's new album. I haven't heard it, bro. Really, bro? There's a song. We're going to play the song. You can't play it on the air. So, we'll play it. Same one you already sent me. Oh, yeah. You should have it already. We'll play it and then we'll react to it. He okay, I'll tell you guys. Cut all this out.\n\nI'll tell you guys what happened. So Oliver Anthony has no money, right? He's poor. He's selling farm equipment. He puts his song on YouTube. He's a [__] superstar, right? He doesn't know what to do. He freaks out. Um, he asked me for advice. I call him on the phone. We have a conversation for like a [__] hour where I go, don't sign anything with anybody. And he's like, \"They're telling me I have to strike while the iron's hot.\" I go, \"Bullshit. They're trying to steal money from you.\" I go, \"You're independent. You're already there. You already made it. I know if you wrote that song.\" I'm like, \"If you wrote that song, you could write a dozen of those [__] songs. You don't need anybody. They're just...\" He's like, \"They're offering me $7 million.\" I go, \"No, no, no. They're they're offering to steal money from you for the rest of your life. That's what they're doing.\" I go, \"You don't need them. You have talent.\" So, cut to... He starts making millions of dollars doing arenas. The wife divorces him. She wants everything. She wants everything. She wants more than half. She wants all the money he's going to be making in the future cuz she was with him when he was broke. So she... it's [__] cra... he's just tortured a [__] idiot. Wants to die. Wants to die. And he writes this song. Wow. Wait, the song you're about to play? Yes, he writes this song. You got it, Jamie?\n\nBro, by the time this episode comes out, that song will be out. Okay. Okay. Really? Well, he just wrote the... Yo, he just ethered his wife. Oh my god. What a... What a diss track, bro. Well, that's the craziest diss track of all time. It's coming out tomorrow. The next day, it's coming out tomorrow. This the song is... Yeah. So, the day this comes out, that that album, the math don't seem right. It's so funny. Every divorced dude on earth is going to be just [__]... The judge says 50/50, but the math don't seem right to a scorned woman.\n\nThat's what he's saying. That doesn't seem right for her that she wants more than that. Yay. She's lucky he got out with a song cuz he would have killed her, bro. Yeah. If he didn't have a guitar, that's a string link. Like that that guy doesn't need a record deal. That guy don't need nobody. He don't need... He don't need nobody. He's Lisa Loeb. Remember Lisa Loeb? Did she do it? She had a top five hit on a subway. Whoa. And then and it just went and then every every m... every like label was like, \"We want you.\" And she's like, \"Well, hold on now. I think I got the upper hand.\" Oh, very clever. Yeah. There's a bunch of people that done that now that just completely bypass the system. Labotomy. Labotomy. What happened there? Lisa Loeb. How do you... That's a...\n\n\nStrange. That's true. You see them just trying to get going.  Earlo, some of those ladies, they kind of vanish, you know, like Lisa Loe was huge. She was. She was the chick with the glasses, right? She was cute. Cute little her on VH1 once. Forget. Yeah. Some talk show thing. She was very nice. Nice lady. Yeah. What time is this? Before 3, right? Yeah. Why you want coffee? Yeah. At 3 p.m. You cut it off. It should start to slow down. Mr. Regimented. I won't sleep. Anyway, let's talk more about a hard time sleeping if I have too much of this. Same. I'm on the pills. Hilarious. You're on what pills? Sleeping pills. Oh, no. You got to get on boner pills. They're way better. I've taken an anti-schizophrenia thing and it's it's the only Cerakquil. I've [__] sucks. It works for me. [__] Stanho game that makes you go to sleep. Anti-Yeah, it makes you sleep. Oh yeah. Have you tried deadlifts? Yeah. Just work out real hard so you're exhausted. You work out. Wait, isn't that what Brody was on? Serakquil. No. Isn't that when he got off? Ser is serious. I think that's when he got off. I think he got off on his own and that's when he went off the rails.\n\nYeah, that got real weird when I dead. When I got back from Oh, you son of a [__]. The friend. When I got back from uh Stan Hope's, when I I was out there, I had some Cerakquil in the wrapper in my pocket and I got back to my parents' house. So it was during co-my mom was doing laundry and was like what the [__] is Cerakquil and I was like, I don't know, some guy gave it to me and I took it. Yeah. Did it help you sleep? Yeah. [__] me up for like 3 days. Really? I take it every night. I don't think you're supposed to take somebody else's. Especially not Stanho dosage is not your dosage for anything. For anything. Yeah. I woke up on Wednesday. You could go beer to beer with them for sure. But anything else? Yeah. Anything else? Stay away. Has a tolerance. You need it. He does. He says, \"Just don't go to the Just don't go to the doctor.\" He said, \"You don't want to know.\" So funny when somebody gives you drugs and you're like, \"It's it's strong.\" Like to who who are we talking about? Dan Hope has various hernias all over his stomach. He just lay back and like pop his stomach open. Yeah. He's a mess. He's the best. He's riding it till the wheels fall off. He is. Hell yeah. He's a mess. He's the best. He's riding it till the wheels fall off. Give that to Oliver Anthony and say run with it. Run with it. Yeah. An ode to Stan Hope. Yeah. I checking on his Instagram somewhere. He's wearing [__] flea market clothes in some other country doing stand-up. Yeah, he did. He did. We're in Ukraine. Get the [__] out of there.\n\nWe're in the smoking room at a bar in Lana. I think I'll film a special here. Yeah, exactly. There's 30 people. Let's go. He's a maniac. He did my podcast recently and he, you know, it's like 100 p.m. He gets hammered and then he's like, \"What are we doing?\" And we're like, \"We got to do another one.\" And he was like, \"What? I thought we were hanging out all day.\" And he was pissed. I get it. Well, you got to set the terms for your agreement in advance. I guess you got to figure, hey, you do a bod, you'd leave after. You can't just assume we're going to get hammered and hang out all day unless we talk about it, right? I would say though, if I get day drunk with people, I I assume. Yeah. It's a good plan. Where you going after? Yeah. Yeah. If we get together and have barbecue at Terry Black's at 1:00 and like, \"Let's [__] get blasted.\" Yeah. It's over. The day is over. You're hanging out all day. Yeah. You're done for three days. I rarely get those days. I rarely get that. Those days were fun back in the when you had all the time in the world. You had nothing to do. No pod. My family went away for a week. Co was the best. Noon. You do. Rosa, you call Big Jay like it's 12:02. You want a drink? Like that was the good thing about CO, right? The people who are risk-takers, you get together with them. Oh yeah. You go outside too and just drink out there. How long did you guys go without being around anybody though? Oh man. As long as I could people the whole time. The whole time. You never like took a week off of I mean other than like family and like real close friends. Uh yeah, I did do that. It was That's for like three three four weeks actually. Bro, that's so bad for your brain. I went three months. How many guys never came back? A lot of people never came back. Some people are starting to come back. Yeah. I don't want to name them, but I know you're talking. You go. Oh [__] It's funny to see them the first week and you know that's where I was when I got back. I was like, \"Hey, too close, too close.\" Lewis immediately go. I'm like, \"Hey, I'm still trying to\" and just licks your face. Like, \"Come on, Louis.\" But like you see people like, \"Hi,\"\n\n\nOh, you just got back. It took a week. Get back now, though. Do elbow touches for a while. Mandel, meet outside and do elbow touches. Like, get the [ __ ] out of here. Everybody get I was hugging everybody. [ __ ] it. Those were dark days. I remember nothing was going to end. Yeah. I know, man. But there's a lot of good came out of it. It was my favorite. Forced me to move here. It was my favorite, too. What a fun time. You had time to think, time to hang out with your friends. Also, I had just gotten cancelled. It was perfect. She went to a beach house. Same. Actually, they were $20 on Airbnb cuz nobody was traveling. You went to North Carolina, right? Didn't you have time to like just sit in it though? Like you just think about it. Drinking at the beach. What advice did I give you when you went to North Carolina? It was something normal. Don't say goop. Put Make a fire in the beach. Stop saying it. Don't say it. That was my advice. Don't say it. Oh my god. Uh, no. And it was make a fire. We made fires every night. I remember you called me like Conor and Fire. Kyler. Wow. What a trash crew. It's the trashest. Yeah. That's fun. Crew of pigs. Crew of pigs. Anyway, cigar. Let's go. Oh yeah. You guys want a big one or a little one? I'll take a little. You want a little like a this one or like a this one? I'll do a little short story. These are all given to me by José André. Is that a short story? Uh, you know, maybe you know. I know. Cigari Shafir. A short story. That's what they're going. You want a short one? Let me see. I'm actually all right. I don't like any of them, but let me see all of them. You don't know what the [ __ ] that is. Oh, this is the one. It's open. Yeah, this is a high-end version of this brand. They're all very They're super legit. What do you want, Nor? The short stories are great, though. I'll take a nice light one. You won't appreciate. That's a That's might be too heavy for me. Do a short story. You'll like it. Yeah, we're Give me a little Ched. That's not a ch. That thing's fine. That's true. Well, if you only want like a little bit like Ron White has those little tiny ones, tiny cigars. Darius has those all the time. But he inhales those [ __ ] He inhales them like he does a cigarette. I'm like, that is so bad for you. That's really bad. Those are so bad for you. You're going you're you're taking straight cigar smoke into your lungs. You know how to do it the teeth, bro. How good is that song? That song freaking soulful song. Feels like a throwback. You can't fake that. You can't fake that. I've never heard a guy make a song about a divorce. It's pretty funny. He's going through it, dog. That's like it's like rocks like uh you'll you'll be mad if you make 30 grand if you have to give up half at 10 million's nothing. Half at 30 grand song. Great tune. Reminds me of Mike Lawrence's joke on Ralphie May during Rose Battle. He goes, \"Your wife's divorcing you, which is crazy to split up now and get half when you can just wait six months and get all of it.\" Oh, that bro killed him. Killed him. That's crazy. That's crazy. Hey, Jamie. Do we have any beers in here? Uh, there's a whole cooler of them right there. Oh, could you imagine? Oh, hello. Oh, hello. Actually giving her that advice. Imagine like if you were the lawyer. Hey, just wait a little bit. If you're the lawyer, like, you know, take him out to eat. Yeah. Just wait him out. Take him to [ __ ] do that. Oh, sorry. Same thing. Two in one. Keep them going. Yeah. Keep that party rolling. Did you ever work with Panetta? Yes, I did. Yeah. He's a funny fat guy. I saw Panetta when I was like an open micer. He was like a few years ahead of me. I saw him murder one night. He had this bit about going to a Chinese food all you can eat buffet and they're like, \"No, you get out.\" Oh yeah. I saw that on TV, bro. He did that at Nick's Comedy Stop one night. Packed House, brought the [ __ ] house down and he had that Boston old school rapid fire punchline style and he was a big guy. And he was he was [ __ ] huge at one point in time, but the physical stuff, the the body being that big just sabotage. When I moved to uh LA, it was one of the first times I realized how phony Hollywood is. He came into the improv at all the agents and managers and the suck. I was like, \"But John, you look amazing. You look so good.\" It's like a 480lb guy and I'm like what? We did it to Shane 20 minutes ago. No, no, no. And now everyone was very mean. A guy out there, one of the guys outside was like, \"You look good.\" Well, better like I believe in. He wasn't joking. He was totally genuine and I was being honest with you. Yeah. Pretty funny. Well, better. All right. With how much your privacy is being invaded online, VPNs are no longer just a nice thing to have. It's a necessity. Some people think, \"I don't need a VPN because I have nothing to hide.\" But that's exactly what data brokers want you to think because their profits depend on you having nothing to hide. What you do online is your business. And\n\n\nIf you want to keep your business, you need ExpressVPN. With ExpressVPN, 100% of your online activity travels through secure, encrypted servers. It hides your IP address so no one can use it to track and sell your online activity, and your privacy is restored. ExpressVPN is also a great tool to secure your sensitive information from hackers. If you're using public Wi-Fi, like at a hotel, airport, or coffee shop, anyone can hijack your connection and access your most sensitive information. With ExpressVPN, you know that your passwords and banking info are safe and secure. ExpressVPN is the number one ranked VPN by the experts at CNET and The Verge. And right now, you can get an amazing deal. They're offering four extra months free if you go to expressvpn.com/rogan or tap the banner. And if you're watching on YouTube, you can get your four free months by scanning the QR code on screen or clicking the link in the description.\n\nYeah, imagine telling a 455-lb guy he looks great. You're looking [___] dude. You look great. They'll tell that to you. That's like, okay, good first step. You've never looked better. You look 20 years younger. Oh, look how fat, man. Unfortunately, he's already funny. Just looks funny. Oh, he was so funny. He was so good. If Josephic was earlier, such a good comic. Oh, yeah. Yeah, but then you have a big head. I He'd be alive. The thing alive with a big head's pretty funny, too. That's true. Because when you have a big fat guy's body, your head grows. Your skull grows physically.\n\nWait, what? Yeah. Yeah. If you ever watch a big giant fat guy when they lose a lot of weight, their head looks way too big for their body because they were 500 lb. They had a head of a 500-lb man for 20 years, and then all of a sudden, you know, you get a belly band and now you weigh 150, you got a 500-lb dude's head. Go from a fighting style of this to also all that chewing, all these muscles.\n\nYour jaw is one of the weirdest things. That's what mewing is all about. When people change their jawline, your jaw moves. Your jaw can get larger. You can actually change your jawline from exercise. Isn't it crazy? You can't alter your dick. You gain weight, nothing happens. You work—you can't work out your dick. We work out our dick every day. Nothing to your dick. Nothing. Put a man on the moon. We can't. You can't fix the dick. Can't fix the dick. Yeah. If you got a micro penis. Oh, by the way, that that female boxer, that female boxer that everybody was—a woman, that's a man. Fact. Fact now proven. Wait, I thought you said they got a sex result. The Iranian one. The Iranian one that won the Olympic gold medal is a man. She—so she's funny. They released—they released a medical report. Who's that? The IOC. Well, the IOC is the one that allowed her to compete in the Olympics, but one of these amateur boxing organizations apparently did a test. I thought it was one of those like you guys are wrong by this one. It's not a trans. It's actually just some biological male. Yeah. That went through puberty, the whole deal. Crazy peeing off on [___] in Paris. [___] wap. That's so crazy. We should have that as an Olympic sport. Beating [___]. I think this person has like a line-up. I'll tell you I ran with—I ran that.\n\nNo, no, you got to uppercut. It's like a bunch of [___]. They have all the technique from like a crusher. First, you grab the arm, you bend. You say, \"Shut the [___] up.\" Shut the [___] up. I told you not to bring that up in front of my [___] friends. Did I see you driving? I told you not to bring that up in such a good—like, help me out here. Give me a good pitch.\n\nYou see Greta Thunberg's on her way there right now. She's going to fix it. What's this? Then on her way to Iran, fix Gaza. Oh, she's on a sailboat. Take a sailboat to [___] later. Who is—I can't wait for them to meet her. Bro, that that little—\"How you dare,\" \"How dare you\" girl? How dare you? You know the climate change girl. You know the little autistic girl. Well, now she's free Palestine. She's singing things off her phone. Now she's at the front of a boat like George Washington making its way to Gaza. Whatever the environment, it's like there she is, done. Leonardo DiCaprio. She's got a nice boat from the river to the rising sea level. She's going to fix that, dude. She's going to break the Israeli naval blockade. I should got more, bro. Those IDF guys are going to turn her into cat food.\n\nThey will—they will light her up from the [___] shore before she's even close. They don't play no games. Everyone's gonna—both sides are going to blow that boat. The second they see it, actually maybe come together on who gets to blow it up. Maybe that can bridge the gap here. She could be sacrificing herself for all of us. Well, she could be just the best person ever. Nothing greener than killing yourself. She could be someone that they take advantage of and use at the front of the line for every cause. It's one of those. She's a young kid, man. It's so crazy to take a young kid and like put them—alter their lives. This is going to be your life now forever. You're the face of X, Y, and Z. This is even if it's not up to her, and it is obvious, not obviously, but it could be out of her hands. She probably has handlers and political [___], but it's like for now, at least she's trying. Yeah. Gainfully important. This is when they got uh the South Park kids to fight against Harbuk. What's Har coming in? Give them tweaks. Yeah. It's overcoming tweaks and make the\n\n\nKids do a story about it and they're like, \"Ah, all right.\" And everyone's like, \"The children are upset.\" It's the easiest way to get your cause done. Let a kid be crying about war, though. Like Israel, Palestine, and Russia-Ukraine really ended the climate change. Oh, yeah. You know what I mean? It was like there's World War II is coming. It's like we don't have time. Yeah. None of the climate change people are like bombs are increasing the temperature. Yeah. I think Greta Thunberg actually—unless that was fake.\n\nUh, it ended a lot of things. Like the Palestine, it was like, \"Oh, we forgot about Ukraine. We forgot about BLM. We forgot about—\" It ended everybody saying dead babies are bad. They go, \"Well, let me see where they were from first.\" It's crazy how everyone's just not—this is all just terrible. It's really terrible. You can't tell them in Texas either. It's a weird time. I caught that one. Hey, thanks. I caught it, too. I just stared right through it, staring at the table going, \"I don't even think that's mine.\"\n\nIt is crazy. I can't watch porn here on my phone. That's a real problem. You just have to take a photo of your ID and send it to the company. What's the problem, Mark? What am I? We want to know how into feet you really are. Why are some of these states doing that? What is that? Tennessee. I don't mind feet.\n\nWe just want to track you completely. We want to see what your search history is on. These are a nice treat, though. You go on the road, you go, \"Oh, yeah.\" Yes, exactly. You guys are out in New York. You don't know. It's all the tax-free states, too. Florida, Tennessee, Florida. I don't know. Tennessee for sure. It is a bummer. And the only way you find out is when you're doing—don't you guys know about ExpressVPN? Yeah. Get ExpressVPN. Say you're phoning in from Thailand. You can see everything. Yeah. But then sometimes it goes like it's not registering right. It's not doing—come on. Come on. Really? VPNs. Sometimes grandpa—grandpa still the same VPN. I tell you the result is I go on Xvideos now because you could get there videos—more regular chicks. Now I'm turned on and just regular bars. Before it had to be at this level. Now I'm like you only got 10 lbs extra. I'm into it. Xvideos is rough, though. It's rough. You hit some bad lighting. Ladies need to know 10 lbs extra is way better than 10 lbs too thin. Right. Ozempic—10 lbs. That Ozempic 10 where your face gets sucked in. Depends if you're sitting up. I like soft. Yeah. You don't want the holocaust. Yeah. Like an extra few pounds is nice. Like when girls start thinking they need to lose weight, that's when they're like right there and they start messing with their face. Oh, cut out. When they—they should get to the point where they think they should lose a little weight and stay right there. That's where they're perfect. Have you—you about to call—make someone's face? Yeah. Yeah. Yeah. I'll talk about it afterwards. I got a sketch. Oh, Ozempic is sketchy, man. Because like you got to stay on that, bro. It's got to be. You don't get on it and lose a 100 pounds and then like, all right, now I get it. Big Jay's doing great on Ozempic. He's slowly going. I know. He's skinny. He was just on the road with me this weekend. He's like slowly going down. What's his head? What's his head look like? He's got a normal head. It's okay. He's turned into—you can see that he's an old Jew now. Yeah. Before that, he was fat enough that you didn't really see all the Jewish features. You know who said that? William Shatner. William Shatner says he stays fat because he keeps the wrinkles away. Shatner. Because he—a plump face.\n\nCaptain Kirk Shatner. Shatner. Whatever. Same dog. My favorite basketball player is Shatner. But he—uh, it's funny to watch Jay like whenever we get in a car now to go somewhere he's like, \"I'll get in the back,\" and it's like, \"Oh yeah, you're new, you're new, you're—\" As a big guy, I relate to that. It's—one day I dream to be like, \"Fellas, I'll sit in the way back.\" So what's he going to do with all those giant jean shorts? I'll sell them. He's got to buy new clothes. Make a sale for Greta. It's got a backyard. Saw them all together. We're hawking. Yeah. I hope she live vlogs that thing. I want to see her go down. Some of the rebels we're arming need tents.\n\nYeah. Fire them up. Greta Thunberg going to Palestine is like those people going to the uncharted islands and be like, \"Hi, I'm Christian.\" Yeah. Like North Sentinel Island. Jesus, you forsaken me. Crazy. Or the white social worker who goes into the Baltimore ghetto. He's like, \"Hey everybody, I'm here.\" And they just beat the crap out of him. Yeah. This isn't—this isn't—what's the—how about the dude who was a Rockefeller? The dude who was a Rockefeller who went to the Papua New Guinea tribe and they ate him. You know what? He messed up. Wait. Yeah. He messed up because he said, \"I'm actually very important where I am.\" They go, \"Oh, that's—that's more—\"\n\n\nNutrients.\" No. No. What happened was he [__] up and was trying to get a sacred item from them and trying to buy it from them, and they didn't want to give it. And he was very insistent, and he apparently offended them deeply. And then when he returned, they're like, \"Oh, he's back.\" And they stabbed him when he was in the boat. They were taking him in the boat over there, and they stuck him with a spear, and he screamed. And then the guy who told the story—there's a whole depiction of how he died. Pull it up. I read that because also, like, he was an important man in America, in another country. They're like, \"That's better to eat that. That's a good person to eat.\" I think the big thing was offense. I think it was the offense because they would have killed him the first time.\n\nCame back. Yeah. There's one, and I'm trying to remember who it is. It might have been a Rockefeller. What? Somebody's like, kid went to Africa and paid to watch them cannibalize a kid. Yikes. Whoa. I gotta—It's a Rockefeller, like a DuPont, or like one of those names. I wonder if he's telling this at a party. He goes, \"Guys, just so you know, they were going to kill him and eat him anyway.\" I'm just—He did. No, that's—I think that's exactly what he did. Came back and was like, \"They're going to eat him anyway.\" I just watched it. Oh my god. Can you imagine watching that? How about that dude, General Butt Naked? You remember that guy from Liberia?\n\nHe would—they would kidnap a child and cut the child's heart out and eat it raw before they would go into battle. And he would go into battle buck naked. So they called him Whiskey. What? James Whiskey—Air by a slave girl to watch her get cannibalized. What is that? True referenced 130-year-old what? That's a tough one. A 130-year-old scandal in a horrifying anecdote from a colonial expedition. J's been around for 130 years. Wow. He bought a slave girl to watch her get cannibalized.\n\nSee what's true. Go up to the top. Scroll it right there. By his own admission, Jameson witnessed the murder and mutilation of a girl in what is now the Democratic Republic of the Congo in 1888. The incident took place after Jameson paid handkerchiefs to a man who said, \"Give me a bill of cloth and see.\" Oh boy. What? Jam. So, Jameson insisted he did not set out with the intention of causing or witnessing any murder or act of cannibalism and described what he ultimately witnessed as the most horrifyingly sickening sight I am ever likely to see in my life. I mean, somebody's like, \"That's a fair statement. Give me a handkerchief.\" What do you guys do? You guys eat people? It's like, give me a handkerchief and you'll see. And that's all you have to give the guy—a handkerchief. And we all would have done it. We all would give a handkerchief not knowing what it's going to be. What does this mean? What do you mean? First of all, I'd be terrified to not give him the handkerchief. Yeah. Because he was already killing and eating people. You don't know what you're getting. Like the guy who got killed and eaten in Papua New Guinea. I bet he had no idea he offended them. He thought he was bargaining. Yeah. You know, like if you don't know their culture and you're deeply offending them by wanting some sacred item that they have, like pissing on the tree in Midsar. Yeah. In where? In Mids. Pissing on the tree. He's like, \"What are you doing?\" He's like, \"Well, I just want to piss.\" I don't know what that is. What is that reference to? Oh, it's a hell of a movie. It's Omar Ari.\n\nDo you know it, Jamie? I've never seen it. It's a horror film. Good wreck. Yeah. Oh, I've never seen this. Oh, you would hate it. Would I hate it? No, you would. You would think it was [__] up. It's a [__] up, but it's cool. It's an A20. Anyway, the reference, forget it. How many [__] AI movies are going to be made over the next year? They're coming. All of them. Let's get rid of the actors. I'm all for it. They're coming. Well, we don't have to hear from them. We don't have to hear from them. All the mediocre actors, all the like CBS, like uh, cop show actors who always played like the deputy. We've got the papers, but we don't know if he did it yet. You know, that guy—that guy's gone. That guy's gone. All the NPCs are gone. They're looking real good. They can make a Protect Our Parks AI 3 hours long. Do it. So easy to replicate that. We replicated every single play. Let's get these guys not at their best. Play freeboard 20 minutes in. Yeah, we'll do some Hitler stuff in there. Get a couple drinks and do some Hitler speeches going. Hey, everyone, play coming out of the closet. Oh, we know we probably will play that Kanye. Kanye won the Hallelujah one. Is that real? Hallelujah. Is that legit? Did you actually change it? Yeah. Yeah. Yeah. Yeah. He changed—he made a Hallelujah one. Another version of the same song. Yeah, but it's—but it's not. It's like all my brothers Christians. Hallelujah. They still have the N-word in it. Nay, I do not believe so. I don't know. Does it, Jamie? I didn't listen to the whole—I think it's brothers. He says brothers. Okay. That song was the craziest song anybody's ever—the c\n\n\nRaziest song I've ever heard. Have we talked about that on this? No. Which song? Brothers. Catchy and [__] insane. It's a little catchy. He said the three things you could never say all together.\n\nWell, that was it; it was tough, how tricky it was or how catchy it was. I'd be—I'd listen to it and I'd be like, that was crazy. Then the rest of my day'd be walking around.\n\nExactly. I was humming it. Shows you how important Twitter is. They're like—they kept it up. I know. It's up there. It was number two in Israel. What? Yeah. Hit the chart. Pull it up. Give it a go. Oh, it's still got the N-word in. All right. Good. Oh, it is. So, he just changed that part. Yeah. It's like the—it's how the melody goes. You got to leave it. Okay. I only heard one part where he's saying, \"All my brothers Christians.\"\n\nGoogle is number two in Israel. I swear I heard that on Spotify. Wait, they changed the Hitler song to the Hallelujah song? Yeah, it's wholesome. That's nice. Now that's like when they changed the Let's Get [__] to Let's Get It Started. So they can do NBA commercials as good anymore. Oh, everybody forgets. Let's get [__] in here. That's a clear shift of like when things change. You know, the first one um is uh Tutti Frutti. Tutti Tutti Frutti. The original was Tutti Frutti. Good booty. Whoa. It wasn't Oh, Rudy. Good booty. Little Richard was singing about booties. Your booty. Tutti Frutti. Tutti Frutti. Good booty. It's all about sex. If you listen to the song, it was an IHOP commercial. The original version of the song, like you could see the lyrics online. You could find them. That was the original song he was talking about.\n\nI mean, imagine that's how you're—he's thinking about good booty. Yeah, we all good for him.\n\nThis episode is brought to you by UFC on ESPN+. All right, guys. Mark your calendars because UFC 316 is going down Saturday, June 7th, live from Newark, New Jersey. And this card is stacked. In the main event, Merab Dvalishvili aka the machine, the bantamweight champion of the world, making his second title defense. And he's taking on none other than Sugar Sean O'Malley. You heard that right. It's a rematch from their wild clash at UFC 280. Then in the co-main, it's Kayla Harrison finally getting her shot at UFC gold. She's facing Juliana Peña, who is defending her title in her second reign. And listen, there is some serious heat between these two because whoever comes out on top might just end up facing Hall of Famer Amanda Nunes. Don't miss this one. Purchase UFC 316 at ESPNPlus.com/Rogan. Saturday, June 7th at 10:00 p.m. Eastern.\n\nYou can find the—the—the lyrics. He used to come to the store. Little Richard stayed next door beyond us. Yeah. He used to live there, right? Yeah. I lived at—it was a Hyatt back then. He lived there. Holy [__] Weird. Sometimes guys get to a certain point where they just want a maid to [__] clean the room. Who cares? An apartment anywhere else. Same thing. Kimmer lived in a hotel, too. Probably.\n\nSo, not a wild thing to do. So much money. Yeah, I know, right? That Chateau Marmont—a lot of people live there. Yeah. When you're cracked out. Yeah, that's a good place to go to be fully cracked out. It's the beginning of the end over there. You go there with a [__] plan. A velvet jacket and a plan.\n\n[__] die here. [__] die here.\n\nYeah, it's the right level of coke where I think I have powers. You got a cigarette holder with them long stems. That must be so nice. I know. Be that high on cocaine that you're like, I am the man. I'm the man. [__] die in this place. I wouldn't want the maid coming in though. Well, living in a hotel, you got secret [__] in there. That's the thrill of it. That's the thrill of it. It's like spies. Like spy versus spy. And you're so high.\n\nSpies. You're absolutely convinced the maid is CIA. Oh, 100%. That's the maid. It's like you're coming in, you're coming all the way in. There's no peeking your head in. There's something hot about the maid in the room. If it don't fit, you can grease it. Make it easy.\n\nThey replaced with Tutti Frutti. All Rudy. Tutti Frutti. All Rudy. Tutti Frutti. Good booty. If it don't fit, don't force it. You can grease it. Make it easy. What is the rest? This is [__] This is the original [__] Tutti Frutti. Good booty. If it's tight, it's all right. If it's greasy, it makes it makes it easy. Yeah, I think it said he was playing the song live and then when they recorded it, changed it. Wait, he was gay? Oh, yeah. Oh, what? Get out of here. Verses contain descriptions of anal sex. Oh my goodness. Oh, yeah. It hits different when you know it's a gay guy. My goodness. Gross.\n\nWhat does it say about? Hold on. Go back to the bottom. Stop right there. Um, Blackwell contacted local songwriter Dorothy. A lady wrote this. That's street to revise the lyrics. Oh, there we go. With Little Richard still playing in his characteristic style. Oh. After lively performance, Blackwell knew the song was going to be a hit, but recognized that the lyrics with their minstrel modes and sexual humor needed to be revised for lyrical purity. Little habits time. Someone should make that now with the original. Yeah. Little\n\n\nMake that hit. Yeah. Yeah. Little Naz put that out. Oh yeah. 1955. Oh yeah, it was 1955. He was talking about greasing up guys' dicks and asses. Fetty [__] could do it. Free Fetty [__]. Free Freddy. What did he do? I think he sold nothing. Allegedly, what was he accused of? Juicy J. I think it was selling drugs. I could—Juicy J could pull that song off. Yes. Yes. Yeah. He never came off his game. There's dudes out there that could pull that off. Can't get a mouth pregnant. It's a Juicy J. Is that right? Yeah. That's fun. They used to have to hide. Gay guys used to have to hide. Isn't that crazy? Just like, metaphorically, they used to have to hide the psycho Anthony Perkins. Oh, he was gay, too. Big homo. Big. You know where they—you know where they still have to hide though? Leading man roles. Yeah, Tom. Still hide. I don't know if that's true. Wow. He's got to fly off a mountain just to not blow a guy. He's grandfather anyway. He's got to do those stunts. But you know what I'm saying? Like if you know a guy's married, he has a husband, you don't want to see him in a leading role making out with a lady, for what you're like, ah, he's all there thinking about dicks. That's a good point. But it's acting, but it's the one thing where we don't—we're homophobic like openly, right? Like lesbians, it doesn't matter. Like if you know a lady's a lesbian, like Jodie Foster, she's allowed to play a wife of somebody. Nobody cares. Nobody blinks. But if you know, name one instance of a guy who's a young, handsome gay guy who gets to play straight in a big movie. So like, who would you like—if you found out that—who's Christian Bale? Like if you found out Christian Bale was—it would ruin his whole gig. Who are the gay? Now he's—he'd be—it'd be like he's like one of those actors like Daniel Day-Lewis, too good where you're like, he's such a [__] artist that you'd be like, up to a point, he's something that's—no one's pulled that off. Tom Hardy's—by Tom Hardy's had some butts. Is that true? Yeah. Is that confirmed? Weird statements. That's for sure. I'm so—weird statements are fun. He's explicitly stated that he's—while he's not explicitly stated he's gay or bisexual. He's acknowledged exploring his sexuality. All right. In the butt or not, he just wears masks. He's exploring. He wears goggles. He's great on *Mob Land*, bro. I've heard *Mob Land* rules. He's so good. He's great in everything. Have you seen it already? Uh-huh. Oh my god. Paramount+ *Mob Land*. Five stars. I give it all—all the stars. Guy Ritchie show. Oh, he's great. Crazy English mob show. You're like, Jesus Christ. Every show gives me anxiety. Every episode, like, what the [__]? They need a rating system back on TV because I am too deep into these shows where it's like, \"Oh, this is made for children,\" and like you don't know until—Paramount+ has stuff on regular TV and stuff like that and they just blend it all in together and you don't know what you're getting into. Watching [__] watching *Cocoon* and you're like, \"This is seven of you. This is for [__] kids.\" I'm watching *Miss Rachel*. Yeah. What is uh—don't they tell you like violence, nudity, all that stuff at the beginning of the—So you need that, otherwise you're like, I can't have it. I—I need one's made for half deer. All the kids are half like animals and half deer. What? Half animals. I know what that is. Yeah, I saw—I saw kids. Yeah. Yeah. You see a season in like it's a kid show where they're half animals. *Sweet Tooth*. *Sweet Tooth*. I've never heard of this. What is it about? It's a little juicy comic. Post-apocalyptic. *Sweet Tooth*. Post-apocalyptic like humans and animals started merging. What? Yeah, it's a cool idea, but it's a kid show. They don't tell you in the teaser. It's not really a kid show comics. I don't know what though. It's like not made for adults. What are you missing that you wish they had? More violence. More real violence. It's just too sweet. It's—it's made for like 15-year-old kids. It's called *Sweet*. That's cute. Kids with antlers. It's kind of weird. Fun. They got to sleep in the back. Is this a new uh—How do you sleep with antlers? It's [__]—You think it's cute? Give a kid a [__] headgear that he can't move around his house. That's—what if he tries to get through the trees and he gets stuck. He's going to cry. Yeah. Human kids with antlers. It's a terrible idea. Terrible idea. Terrible. Let's do it. They got Fallout Boy. And then your [__] neck hurts cuz you're carrying around all that extra weight. Then it falls off and then it pops back up again. And that means you only breed once a year if you have antlers. Joe's taking it. You got one month out of the year where you get better. Watch out for you, dude. Not only that, you're going to stab your friends to death with those antlers. Yeah, you're going to shoot them that [__] cross. I'll hunt those kids. This show's recommended for ages 10 and up. You're over 10. Oh, there you go. 10. Fair. Fair. I'll give him another go. Give another go. Yeah, the antlers sometimes they get stuck in a tree. 100%. Yeah, animals die that way sometimes. Damn. I like to see—you ever see those guys like a moose like when they shake their [__] antlers off? What's that called? Oh, yeah. Shedding. Shed. Yeah. Crazy. [__]\n\n\nGiant paddles. Hilarious. Yeah, giant paddles. It surprises them. And then they're free because of all that weight. You know how much those things weigh? Those are bone. But it's basically a weapon, right? These two deer are locked together. Yeah. You got to—this guy's going to shoot the antlers off. He's going to separate them. What the [ __ ]? So, he's got to do that with a shotgun. He's just got to get a good shot. Only he's going to shoot the antlers and not them. Not them. He's an expert. Oh, he's a really good shot. And he's real close. So all he has to do is like clip one of the antlers and it'll blow them all apart. No way. He got it. Boom. So he shot the antler. Boom. What a guy. They broke free. Because they get eaten by coyotes that way. And the coyote eats your friend while you're stuck to him. They found this one deer. A buddy of mine found one deer that was connected still to this uh, dead deer. Oh. Yeah. The coyotes had eaten his friend. They tore his guts out. Everything was gone. They just ate as much as they wanted in the morning. He's still stuck. Whoa. Yeah. And he lived. Imagine how horrifying that would be. You're handcuffed to your buddy and your buddy gets eaten by zombies, but they're full.\n\nGot to chill with them for a minute, but you're still handcuffed to him. It's like when those guys [ __ ] the Siamese twin and they're like, \"Well, it's only one asshole.\" Look at this. Here's another one of those. So, this is uh—so this happens more than you know. So, it's coyotes that are moving in on him. They've already killed his buddy and he's still attached to him. And the look—it's just gory and horrible. That's brutal. It's crazy. And he was stuck with them the whole time. Look how much they ate out of them. Oh, [ __ ]! Dangerous. Hung, by the way. Drunk. Coyotes are just little wolves. That's all they are. They're little wolves that are everywhere in every state. They're everywhere. Everywhere. They came to—they're at my parents' house now in Pennsylvania. Yeah. They spread across the whole country. You hear them at night. It's [ __ ]—it's pretty intense. Start screaming, you know, somebody's [ __ ] pet. I triangulate, right? Yeah, they would mostly eat pets. My cat was out there and I was watching TV one night and I heard them all screaming. I heard like screaming for a little and I was like, \"What the [ __ ] was that?\" And then I walked outside. My cat was like laying on the ground and there were just three coyotes circling him and I don't run out there. I was so scared. I was like, \"Hey, get the [ __ ] out of here.\" Right. Yeah. They don't listen. But I picked my cat up and he was purring. It was very weird. He's probably so happy that your daddy was—he was really sweet. Yeah, sweet. Yeah. Yeah. I love that cat. He's dead now.\n\nAll right, that's the problem with cats. He got [ __ ] molded by something. He was an outdoor cat. Outdoor cats are a little murderous, though. He had it coming. Kill birds and present it to you. Brought rabbits into the house alive. He's a [ __ ] demon. Can you imagine how fun it must be to be a cat and all you have to do—you have all your food so you're covered already. This is just for fun. This is funsies. You're not eating for survival. I—I like letting them out. I feed off—I didn't want him to be a house cat. Yeah. If a cat's got a yard, it's kind of brutal to not let them out, but it's brutal to let them out for every—I love those missing cat pictures in uh, on the—on the posts in LA. Guess what, buddy? They're gone. You don't have to—coyotes though. It wasn't—no.\n\nUnreal. Now it's like before a coyote, you—you found your cat dead on the side of the road like a—every now and then, like a month later, that thing will come back like a—like a stepdad. That's how—they've—both my cats were outdoor cats and they came back, see [ __ ] mauled. Really? Like one of them had its eyeball hanging out and like—Jesus—like crawled back to the house. It's like John Wick come back to up. They go out and fight to the death. Yeah. Cats fight. It's horrible watching cats fight. Oh yeah. Especially the outside ones where they'll really get after it because they're used to killing things. Yeah. Regular indoor cat their whole life they just like walk around with a boner. Never get the [ __ ]. You know that's what it's like. You're a little murderer and you're a little murderer that's contained in the house. That's true. And you show me your [ __ ]. If you let that little murderer out, it could be 11 years old. 11 years of the perfect life. Let him out. Let him out. Lock on a bird. Who do you—who do you think wins? City cats or outdoor rural cats? Rural, right? Just like humans. Just like humans. Just like humans. Appalachia wins. Appalachia wins over New York City every day. If Dallas had to like fight the ranchers, the—surround hat [ __ ]—blood bath. It'd be a blood bath. Tim Walls versus Rogan. Yeah. It's not—yeah.\n\nThe rurals got it all day long. I—it's funny. I—I had pride in that. Like I would win in Queens when I was walking around, I'd see like an outdoor cat and I'd just be like—Tibble would [ __ ] you up. My guy would [ __ ] you up. My cat—I got a main [ __ ]\n\n\nThat's awesome. Huge. Big paws, big ears, but I can't let it out. No. It's staying in my apartment. Werewolf. Yeah, it's like a honey. That's so crazy. People say a lynx is loose. I mean, that thing's jumping up the stairs. It's When I was in high school, we lived across the street from like this park area. And I had this black cat. This cat was evil. He killed everything. And one day he killed a squirrel and he was dragging it across the street. The squirrel is as big as him. Yeah, he's got his mouth on the squirrel's neck and the squirrel's body is between his legs and he's walking with him like this, dragging it cuz he wants to show me that he killed the squirrel. I was like, yo, I was watching him do it from the window in the kitchen. I was like, what the [__]? I have to have told this story on here before and stop me if I have. I watched Tibble kill a rabbit in the yard and I heard it screaming. So, I like went out to be like I pulled him off the rabbit. Oh. And when I lifted, it was funny. He was all muscle. I was holding him under his chest and he was just wow. Like he could feel him breathing. Then I put him back in the house and as soon as I put him down he [__] scratched me and walked away. He was mad at you. It was crazy. He was mad at you. He ruined his fun. Piece of [__]. This is what I live for. For real, bro. Do that revenge thing. I got called gay by my cat. Did I tell you when my dog got honey [__] by a coyote and tricked into breaking into the chicken coop? Wait, honey [__]? Huh? Yeah. This coyote became his friend. He was this big mastiff and the coyotes knew they couldn't eat him cuz he was huge so they became friends with him so he thought they were dogs and so the coyote hopped the fence he's like hey you know there's a chicken in there and we can get in there and he's like I can get in there so he [__] tears open the chicken coop cuz he could at any time he wanted to. The coyote grabs it and the coyote hopped over the fence. I watched the coyote hop over a six-foot rot iron fence like it was nothing. He leaped up in the air, touched the top of the fence with his feet, and then put his back feet on and hopped over with a chicken in his mouth like a Mexican. I was like, I am undertaking the chicken. No, I just saw the chick. We were playing a board game with my family in the living room and one of my kids yelled out, \"It's a coyote.\" And then you see this [__] coyote run across the backyard with a chicken in his mouth. Just get to that [__] fence and leap. It like it flew. Like it was like gravity wasn't real. Were you like impressed or were you mad? Super impressed. Well, it's like that you can't be mad. I was mad. I wanted to kill it, but it's like that's what they do and that was impressive. That's all you That chicken's cost is worth you saying that. Oh, 100%. Yeah, 100%. But then Johnny realized that there's this whole that was like one chicken was brooding. And when a chicken's brooding, you have to separate them from the other chickens because they won't lay eggs and they pick all their feathers out. They think they're going to make a baby with this unfertilized egg. So, they would just want to sit on top of the egg. They don't want to go around. It's a weird psychological thing. The way to break them of it, you take them and you put them in a little tiny pen by themselves where they have to stand on a post. So, then they they can't nest, right? And then they do it for a few days and like I'm over it. And then they go back to being a regular chicken. They're not the smartest things in the world, but this so this one was in this little tiny one. But then Johnny Cash realized I could just go through this wall because he was a 140-pound mastiff. He was huge. So he just tore the chicken wire open himself and killed nine chickens before I got to him. Holy [__]. Yeah, that was a couple days later. But the coyotes had talked to him and convinced him like chicken eating is fun. October you're not eating these chickens. Look how big you are. You can eat the chickens. Good point. It tricked him into doing it, man. I He had never done that before. And then he's hanging out with this coyote and the coyote is like his homie. Damn. Honey [__] him. Honey dicked him. What's that? What's that term? They probably sent a female coyote and just like, \"Oh, the Mormons do. Smells like [__] does it?\" The Mormons out in Salt Lake. They sent other cute ones to try to convert you, try to get you in. I heard it works. That would work on me in a second. Except if you're 21. No, but the problem is it's a Utah hot. So, it's like a five. Utah's pretty odd. The ones out, the ones still in are chubby and [__] not tattooed. You see Japan tattooed for I like them. That's hilarious. Anyone in Utah that's out of the Mormons that are just like [__] sle once they get out. Once they get out far out, they go hard. Fake tits. They go in. Well, the thing is they feel like they have to make up for lost time. Been wearing magic underwear since you're 24. They can't even drink coffee. That's so crazy. But you can drink energy drinks. Did you know that? Really? Yeah. My friend was a Mormon. He was down in\n\n\nThese giant monsters. I was like, \"Bro, that is way more caffeine than a cup of coffee.\" He's like, \"Yeah, but it says coffee. It doesn't say energy drinks.\" Okay. Yeah, but a guy wrote it. We know the guy. Stop telling a Mormon. They believe a guy wrote it. What are you talking about? A 14-year-old wrote that down. Just some dude. He had a gold tablet and he was the only one that could read it. He would deprive you of energy drinks, too. He would keep you from... Oh, yeah. He just didn't know about it. No loopholes. No porn, no caffeine, no booze. Magic underwear. And they got a soak. They can't thrust. That's fine. I don't mind a little soak, dude. I love the soak; it's actually pretty good. I couldn't do it. A girl gets off on a soak. Just leave it in. No movement. She's like, \"That's what I like.\" Like, whoa. Where the hell do you find her? That'd be Mormon country, New York.\n\nYou got to get an address.\nShe's asleep.\nCome on down right now.\n\nCovers. Yeah. Uh, yeah. No, when I found out about soaking, I was like, \"Oh, that's so crazy that they allow them to do that.\" Also, you know, you're going to blow if you're so... that I blow just being next to a girl.\n\nMeat glove in there. It's designed for that. Trick you into making people.\nYeah. It's designed to trick you into it. You see, uh, Japan's birth rate is so low, they're flying people in. You get a birth rate, pull it up. Yeah. It is crazy. Yeah, they make it real economical, real safe to live there, too. A lot of appeal, but you got to learn Japanese. I think they would learn it there. Easy language to learn? Is it? No. It's all symbols and upside-down brushes and stuff. It's so nuts that people developed these crazy languages that are just so different than anywhere else. Like when you look at like Russian writing, you're like, \"What are you doing with the letters?\" I was in New York yesterday, and there was a white family speaking a language... I'm usually pretty good at picking out what the language is. No idea. You call Ari Icelandic or some crap? It was something like crazy. Yeah. Viking talk. They looked like Vikings. Boom. Man, I just played Reykjavik. That is a great town. Is it unreal? It's like otherworldly. It's glaciers. It's volcanoes. It's saunas and hot springs. And they all speak English. Oh yeah. In town. Wow. For sure. It was great. No. Out of town, they do in the... whatever. They don't. But like... Yeah. Reykjavik rules. That's a cool drink in town.\n\nArtist. Interesting. The chicks are like smart. Yeah. That's where all the strong men come from, too. Oh yeah. Big dudes. All those Magnus von Magnus type dudes. Blonde men. Big Viking leftovers. Cousin.  I was hoping I had some Viking in me. You don't? No. Just strictly Irish. You got big. I was hoping I was one of those Irish people that got raped by Vikings.\n\nLike I'm probably a Viking. No. Just a mud person. How far back can they tell like... like what happened to you? Yeah. What percentage? Yeah. How do they always update it, too? Like 23andMe. Thank god they didn't get bought by the Chinese. Some other company bought 23andMe. Now our data is safe again. Boys, I don't know what they're going to do with my... I know a crazy disease that only kills you. They got your DNA now. I got that. I got that already. It's called... calledism. Yeah. Yeah, me and my whole island that I came from.\n\nI did Belfast. It's wild. You can't bring up the whole, you know, Troubles. Yeah, the Troubles, which is a cute name. These days... weird back. Let's go. Decap's back. I put the wrong flag on Instagram, and I got like 20 messages like, \"Take that crap down. We'll kill you.\" You can't put up any flag. Don't put up a flag. If you put up a flag, you're going to get messages from somebody. That's true. Spain has like three flags. The pride flag got me in trouble, too. Pride flag. It's the whole month, boys. Oh, that's right. Yeah, it's time. Yeah. A few days out. Less uh... talk about it. Yeah. It's not everywhere anymore. Every corporation... It's funny. The corporation's like, \"Oh, we don't have to anymore.\" Turns out we were always... didn't give a crap. We never once actually gave a crap. They gave a crap for one month. Is it still Pride Month, or did Trump say no Pride Month? They're still going to do Pride Month. Regardless, say no Pride Month. I hope he doesn't say no Pride Month because then they're going to really... But the thing is you can't like... if we decide it's Protect Our Parks month, who the hell is going to tell us it's not? It's not an official thing. Well, who's... who are the officials at this point? Point the gay... open Pride Month no more. Trump administration says June is Title IX month. What is that? That is the thing that allows women to compete with only women in sports. Isn't Title IX where they have to get women's sports money? Yeah, equal representation for women's sports. And now Title IX is anti-trans. It was pro-women. It's pro-women, and then there's trans women who think they're women, and they want to compete with women and Title...\n\n\nN should be there, protecting it. Some dude with a problem with his mom.\n\nYeah. Some guy who hates women with a problem with his mom. Some guy who had a rough time shows up. If you just were allowed to like, beat up women, if you like, made a league where men are allowed to fight women, how [__] this is a sitcom. Every morning I wake up, I go, \"Oh, you're lucky that my [__] league hasn't taken off yet.\"\n\nYou and me [__] heavyweight title. Matt has a joke about it. I think he did it in a special. Yeah. Where it's like he went to like Iran or something with his chick and she was like, \"We're supposed to come here.\" Like you talk to you let her talk to you. Yeah. Yeah. She's like, \"Oh, you're about to party. Like, I'm going to take my baby on a nice vacation.\" Yeah. Some guy in the neighborhood might smack her in the head for you. Yeah. Some guy might walk by and just smack her if she's yelling at you. Hey, you know, Iran is the place that has the one of the places that has the most uh, gender transition surgeries.\n\nNo way. Yeah. You know why? Why? Cuz you can't be gay. Oh, yeah. So, so they become trans. A lot of religious loopholes. Interesting. Yeah. See if that's true. I'm pretty sure that's true. I love that moment. You say something out loud like, \"That's true.\" That might not be I I'm pretty sure we've actually looked it up before. And so you're not gay. You're trans. So it's interesting. But they don't allow trans. They do. They do. They do. You just got to wrap it up. Ah, you got to be convinced. Wrap it up. Cover the head. Cover the face. Oh yeah. It's so easy to be trans there. Yeah. You could be a furry. That's what furries are all about. You're a hatch. You're just a hatch. True. You pop the hatch. You're [__] a squirrel. That's what's going on. Don't get me started. You're just a happy chipmunk. Banging a squirrel. Don't get me started on these good ideas. They're great ideas. Everybody just looks like a cute cartoon character. You never go eye to eye with anybody cuz they're soulless. There's no eye there. Uh, there is sex reassignment surgery is not only legal in Iran but Iran is considered to be an international hub for obtaining it. The procedure has been allowed since Ayatollah Khomeini. But the first the men part was Ruhollah. I've never heard that. Khomeini learned of the hardships of trans women and issued a religious decree to legalize it in the mid-1980s. Wow. During the entire Oh, that's crazy. So, it's illegal to be gay, but you can switch genders cuz that's what's really going on. You're just you're not really a gay man. That's impossible. Every time I read these like uh, Muslim Sharia things, god damn, they're the bros. It's just bro law. They're like, \"Dude, come on, man. You can't be gay, but you can be a chick. You can be a chick. Okay. Are you sure? All right, let's go. Surgery. Our guys are good at it. We've been doing it since the 80s. What? Wow. The 80s. Yeah. We use a curvy sword. We slice your penis. Size hydro.\n\nYeah.\n\nYikes. By the way, everybody's cat's trans. Nice. Wait, what? Earlier. You have a male cat, you castrate them. Everybody does because you leave them in the house. If your cat goes in the house, they'll pee all over your [__] house. That's true. They They will mark every spot in your house. You have to cut their balls off. I'm just trying to get the Kelly. It's f It's amazing how many cats there are out there cuz every male cat gets his balls chopped off. That's true. But cat the straight cats do all the [__] Oh yeah, they do a lot of [__] ding. Pick up the slack. They do a lot of [__] I think cat dicks have Oh, really? Cat dicks have little spikes where they go in, they can't come out. Did you ever see that video where the crow talks these two cats into fighting each other? He's pushing at them. He [__] with them. He [__] with one cat and then he flies over to the other roof and [__] with the other cat. You see what that guy's [__] saying? He gets him fully worked up. Fully worked up and then they [__] start duking out and the flies down. He goes down while they're screaming like this. He loved it. He instigated it, got it to happen and and was a [__] willing participant. We should be using crows. They're so smart. They're crazy smart. Crazy smart. We got to harness that. Let's befriend them. Harness that. I mean, Edgar Allan Poe figured that out way back in the day. Ravens and crows. They're so [__] intelligent, man. He had it. Edgar Allan Poe bro. Crowning machine. Edgar Allan Poe bro. Here's See, he starts [__] with this one cat. Just get real close to him. Just kind of pecking at him. [__] out. The [__] is wrong with you, [__] [__] just [__] with him. Just completely riling up. Pecking at him. Look at this. and just jumping just out of the way. He knows how fast he is. He knows how fast the cat is. Like, not quick enough, [__] Go get that one. Dang. And so he gets over that cat. Fight. Fight. Wow. Before that though, he went over to the other side and was [__] with that. Look at\n\n\nThey fall off the roof. Still go at it. Still getting after it. They don't stop when they fall 30 ft. Yeah. They're still duking it out, man. Just duking it out. And then they go down those stairs. Look at that little hole. Look, they're going to fall down the hole. Boom. Still duking it out. Look at this. They're going after it, son. That's a fight to the death. They do love jiu-jitsu, too. They're good for a lot of lay on their back and they scratch the [__] out of each other. My outdoor cat would come home and just deep scratches all over his ears. His ears are all tattered. Yikes.\n\nThat's funny. It's a funny idea. And if they get locked when they're having sex, they get stuck. Barb dick. I've seen dogs do that. Wait, dogs? What? Dogs have the same thing. Dicks. They're just stuck with a hard dick. Sounds like every one I stand most like I want to get out of here. We're the only mammals I think that don't have a bone for the dick, cuz otherwise we just use it constantly. Speak for yourself.\n\nYeah, these poor dogs. Yeah, that's it. Eagles. All right, we've reached this is exactly where this podcast goes. I don't even know how you get them unstuck. Do you throw cold water on them? What do you? It's like antlers. You got. Yeah. How do they get unstuck? They got to go back to the right position. Now, you got to wait. Oh my god. Wait till the dick goes soft. You got to give them the jizz. But it's just a bone. That's what's crazy. Is that right? Yeah. But you see dogs [__] on the side of the road. It looks pleasant. Yeah. No one's ever said that before. We've all seen like a good time. But no one's ever said that's pleasant. That's dogs actually [__]. Oh, I've seen it. I see a dog park all the time. And it's so funny cuz the owners get like, \"Hey, I'm so sorry.\" And the dog's like, \"Leave us alone.\" Right. We don't care. But you never see the owner's like, \"I'm so sorry. I'm so sorry. Just kind of calm. They just do it real quick and get out of there.\" Yeah. Like a Mormon. The girl dogs aren't upset. I saw a video of this these bulldogs [__]. It made me actually kind of sad. Jamie, find a sad bulldog [__]. What was sad about it? Just. You'll see. It's a It's a tale as old as time. [__] twisted. Just makes you feel a type of way. Really?\n\nI don't want to give you. Yeah, there's some there's a twist on this. There's a twist on this video. What happens? No, nothing that bad. It's just, you know, Oh. Oh, baby.\n\nWhat went wrong with this bulldog? Nothing. It's just a guy. It's a guy dog trying to talk to a girl and then another guy comes in. He's like, \"Hey, what's up?\" And they run off. Oh. And then the camera pans over and they're [__] again. And then goes back to the bulldog that's sitting there. He's like, \"Oh, I've been there. Damn it.\" Yeah, we've all been there. That's the worst. Let's hoping Jammo was quicker. Bulldog's [__] sad. J Mo's losing. He's going to nail that. Jammo's losing. He's all. He has a different algorithm than you. You started describing a different thing. Oh, we were talking about dogs stuck together. So, I'm looking for two dogs stuck together. And now you said it was a third dog. Guy gets one velvet suit three-way. Yeah. Talking back. You ever see a lady [__] a dog on the internet? I did. I saw one VHS tape when I was 18. Me, too. Really does something to you. Best day of my life. It was a German Shepherd. This lady was [__] a German Shepherd. Goddamn German Shepherd is always. I saw two guys getting in a fight, Jim Painter and Carboni and um they were watching a dog. We were all watching a dog [__] a chick and Jim was like she has nice tits and and Pete Carbon was like what the she's getting [__] by a dog and he's like that has nothing to do with the tits. The tits are nice. What does it have to do with it? Argument that's everybody's argument about whether tits were nice or not being a dog. He needs to leave the room. No, I had that fight in my head when I saw it. Really? Yeah. Two sides of me were going, \"What the [__] are you watching? This is disgusting. That lady should be put down.\" And then the other side of me is going, \"It's [__] nice.\"\n\nThe same with chick with dick. You're like, \"The good tit. The balls are a problem.\" But some guys get to a point where that's the only thing that turns them on. Big tits and a hard on. [__] go. Yeah. Best of both worlds. Get crazy. It's a tough thing to be. Plus, you want someone who never says no. You want someone who wants it all the time. Oh, you want. Oh, you want a [__]. Okay. The Ayatollah was into it apparently. Yeah. I have a religious decree, dude. Trans is [__] sick. Let me be the first to try them by.\n\nNot bad. Not bad. Not bad. All right. The bulldog video is not good enough for us to take this time, I guess. So, it's falling out of favor. I think Jamie's not looking up cuz he's still worried about that money you owe him. Oh.\n\n\nOh, what are you talking about? Not the old guy. I thought you guys were better than chef camera. He owes me more money. He owes me money for I saved you. It's back. Leave it to the Jew to bring up the debt. That debt is owed. I definitely paid him the debt back. I flew him back from the game. He brought confetti onto the flight.\n\nI was uh, telling someone the other day about how when you were a struggling comic, you would make a living going to those poker tournaments. It definitely wasn't comedy; comedy wasn't paying. He was making a living playing poker. What was this, a year ago?\n\nYeah. The drunk Mexicans on Fridays just steal money off them on payday. Mexicans. They would just go all in with the jack dudes. Yeah. You didn't have to get so descriptive. You got to know when—\n\nOh, it was great. Yeah. Yeah. Remember you like that was how you were making a living. It was crazy. I was like, I don't think I've ever met anybody who like reasonably approached gambling like, \"This is how I'm going to use this as a job.\" You're the first guy that I ever met that like used poker as—like you played it professionally, like you were intelligent about it. It's the mathematicians. My math wasn't great. Like these other guys are crazy. They know the exact note, but mine compared to just a regular—I was pretty good. And you took all the money from the poor drunk Mexicans. 100%. You really are a Jew. Yeah. Yeah. Taxes. That wasn't even funny enough for that. But uh, I was going to get you in trouble.\n\nIt's an equalizer. You play with the owner of the Lakers. Didn't know what was going to become. And then like uh, Jose Conco was there. But you're all equal in the tournament. You're all buying in for the same. And then I just started smoking weed like at the time. We really have. So I could like see through people when I was high.\n\nOo. Really? Oh yeah. Yeah. Yeah. You see something, right? You're just like, got it. That's nice.\n\nYeah, it was nice. What happens if you never won? You got to pay the rent. Uh, well, I play with the bank. Oh jeez. So like whatever I had, I already won a little bit. It's like you're just playing out of there. And so when you when you like win big, you see all these like guys kind of looking at you as you're going to cash in and you're just like, uh, \"Can you keep this money here for me for next time?\" You're like, yeah. I'm like, okay, I need to walk my car. They trail you all the time. They trail you, pull you over six blocks out and rob you 100%. You leave with $12,000 on a second-place victory at—Yeah.\n\nHustler Casino or Hollywood Park, man. That's a really—That's a better idea than being good at poker. Yeah, just get a gun. Just follow some guy. All right. Right. It's easy. So glad I don't gamble. Shady times. It's a scary addiction, man. I don't have it. And it's uh—I don't either. I—It's fun to gamble on sports a little. Yeah. But I don't have the—I don't chase it ever.\n\nFor some people, it's like a thrill and there's nothing else in their life that gives them a thrill. Yeah. They got a job. The job sucks. They got a family they don't like and they—they go out and they risk it all. Yeah. Risk it all. They're shaking and they can't wait to do it again.\n\nWe'd go after spots and then we go like midnight, 1:00, go down there and then if you played for like 5 hours, you're all right. Leave. If you—if it's seven, you're like, \"Hey, it's rush hour. That means you got to play for 10. You got to miss rush hour to get back.\n\nYou just be there forever. Damn. Yeah. And it's a 24-hour a day deal. Oh, yeah. There's no windows. No windows. It's just like—it's like this different world of people, too. Real degenerates sitting around drinking. Yeah. Same as the pool hall people. Probably those are worse. Probably. Same humans. Yeah. Same. At least the pool hall people have some skill. You get to know each other. Yeah. Like, oh, you're regulars. You talk all the time. It was just like, \"Well, we're all trying to steal money from each other.\" Yeah. So, we're like enemies, but like we're being friendly. That was pool hall banter. It was all guys who were like trying to rob other guys.\n\nLike, \"I can't play you even. I need the eight ball.\" And they'd be sitting around talking forever. Everyone's got a gambling addiction. It's like, who could hold out the longest? Mhm. You know, it's like two guys with a boner like, \"Ah, we can't—you. Come on. Let's—No, no, no, not yet.\" And like, hold off to try to get a better deal.\n\nAnd you were in there. You're—That was—That was funny when we were in the car and we were talking about you playing pool all the time and you were—He was just like, \"I'm a psycho.\" Yeah, he's a psycho. We'd go out to shows and be like, \"Let's go play pool.\" It's like something to do, you know, after a show. Something, okay, cool. An hour or two, seven, at some point you're just like, \"Joe, can we please get out of here?\" I have a problem. Really? It's a good problem. It's good problems. Yeah. It's not a problem like I smoke crack. It's like I—I—My problem is when I lock on something like time goes away. Yeah. You can catch heroin or you can catch fishing. Yeah, that's—that's a better one. Fishing pool.\n\n\nIs a better one. Pools a good one, cuz you can only do it physically for so long. Whereas video games, you can play video games 12 hours in a row. No problem. All you're doing is sitting. It keeps you up. Yeah. Drink Mountain Dew. It keeps you totally dialed in. You got explosions going off in your ear. You're gunning folks down. You're running down hallways. All right, one more level. One more level. Four hours. Why am I going to bed? Got the headset on. Call a guy Mumbai a [___]. Yeah, you need a job in the morning that you have to get up for, otherwise you're call mad at you that walks out. Are you [___] serious? It's 4 in the morning. Come to bed. I had a Call of Duty problem. I'd oversleep spots. You go to sleep at like 4:00 p.m. You know, just like up up and then you're like, \"Oh, [___], I missed my spot cuz I was sleeping.\" A lot of lives, dude. They're going to put a [___] helmet on you one day. And are you prepared to engage? Oh, that's coming. Yes. You're going to be in the world, like fully in the world. Bombs going off. You're running down a dirty street hoping that this is not real life. That if you die, you're going to respawn. Yeah. Westworld. Bullets are flying by, breaking the bricks behind your head. All that shit's yeah, Westworld. But Westworld, you could die. You could die. But people didn't know that they were robots. They thought they were in the game, but they were like, \"Whoa, who am I?\" That's gonna happen, man. We're all ones and zeros. We've been in the AI for a long time. Do you hear that there? Yeah. We're in the simulation. We're in the yeah. Come on. I'm kind of willing. Humanity ended hundreds of years ago, but they mined us for our info. This is just what reality is. I think we have a version of reality that's not real. The real reality is we're in a gigantic computer simulation. Damn. I couldn't have gotten a bigger dick. Nope. Yeah, that's what you get if you want that sense of humor. Yeah. What happens? Want that sense of humor? Make the average eight. It is kind of crazy that they've come up with so many medications, not one to grow a dick. Yeah, that's true. There's probably a bunch of guys that don't want it. But we can't give them big dicks cuz if you give them big dicks, if it's like only like a couple hundred bucks, yeah, society will shut down. Eventually, they got [___] still big. Slop down to freedom. I like yeah. Flying squirrel [___] people. Remember that bit? The name of the Old school, right? That was old school. Yeah. It's a weird stick around in a shopping cart. If you have that's what a lot of people thought like the war on steroids was like you're trying to stop people from getting just massive. That's why it's why China's so angry. Little dicks are pissing them off. Yeah, dude. They're using CRISPR now. I bet they've got giant dicks. We just haven't seen it. What's CRISPR? What's CRISPR? Genetic engineering. They're editing people's genes. That's the number one thing. You go like, \"Give my son a big dick. Let's see what give big dick superb brain.\" They supposedly inoculated these kids from HIV. They kept them from getting HIV, but in the process made them more intelligent. Like, dude, I know what you're doing. You're making them more intelligent. Oopsie. We also made them way more intelligent. They're like, \"You're not supposed to do that.\" So, they put the guy in jail for a couple years. Now, he's back kicking ass again. He was like their top dude, their top genetic guy. Like, yeah, you're going to be in jail. And in jail, you get millions of dollars in hookers. In jail, hookers. Hookers. You get your dick sucked every day and you're eating roast beef. [___] jail. In jail. Just you're a bad boy. You did a good job. Good job. Hear me out here. Maybe this is the shrooms talking. But uh I think the dick size you have makes you who you are. Who? Because you got to overcome. Yeah. Tell that to that lady who was beating up on chicks in the Olympics. All right. How big was it? How big was her dick? I don't know. That was a tiny dick. That's a tiny dick move is to become great. Exactly. To beat up women. Kevin Hart syndrome. Tiny dick. Oh, how dare you. I can't beat that man because they'll go a small dick. Like, damn it. Good point. And they leave. Find a woman to beat up. Boy, I'm telling you, you got to work with what you got. You got to if you have the choice through CRISPR how big your son's dick's going to be, you got to give him a medium. Medium. Don't go crazy. You can't go crazy. They'll dominate your house. Yeah. 12 in. What did you say to me? 15-year-old with 12 inches of [___]. You said clean your room. I paid for that dick, son. I gave you that dicky [___]. Yeah, you created a monster. Well, having a son is probably a lot like having a wild dog where you have to like train him, get him exercising every day, like wear them out, get him calm. Yeah. Realize like, \"Hey fella, I know you're ready to go all the time. This what we got to do. We got to burn that out of you every day so you be a good citizen.\" Okay. But if you're just [___] not paying\n\n\nAttention, you got a wild teenager to school. It must be crazy. Yeah. If you have a son, you just have to get them to not shoot up or rape until they understand why both of those were wrong. Has there been a jacked school shooter? Never. Of course not. Not one. They don't need it. Has there ever been one that's not on medication? Not one. Although, every school shooter looks like Michael Moore. Thomas Matthew Crooks had a huge hog. Who's that? Who's that? The guy who shot Trump? Did he? How do you know he had a huge hog? Huge hog. He actually, every one of those guys, the 20-year-old kid. Yeah. How do you know he had a huge heart? Oh, it's all over 4chan. I talked him off the roof. That's why he couldn't get away.\n\nHey, hold on. Don't you want to go in my mouth? I will say I didn't miss my mouth. Locked on.\n\nThe school shooters do have giant dick builds though. Yeah. Skinny. You know what I mean? They're all tall, skinny, weird guys. Alien bodies. This guy who was a professor of mathematics at MIT, and I did taekwondo with him. I don't want to say his name, but if I tell you his name, it's even more hilarious. This guy had a donkey dick, and everybody would like change in the locker room, and we would change. We were like, \"What the [ __ ]?\" He was like this really kind of uncoordinated, like crazy hair. He had the Jewfro, the whole deal. He had a dick that was like a solid limp 9 in. What? It was a giant dick with giant balls, and everybody would see it and be like, \"What the fuck?\" And his wife never left his side. She just like, she was protecting that diamond. She had that diamond dick everywhere she went. It was really like a dog with a bone. She was always there at every training session. She traveled with him to tournaments. She wasn't going nowhere.\n\nDid the dick ever hit you on the mat? You're like, \"Jesus.\" No, it was type. You got to wear a cup. You're wearing a cup. It's all tucked away. Would you call it out at the locker room? Could you go, \"Jesus Harry?\" No. It's the one thing you didn't talk about. You wear cuffs with jiu-jitsu. Yes, I do. I get a knee too easily. Some guys don't, some guys don't, but you get, I got a need in the balls too many times. That's great. Thanks, man. A pitcher.\n\nIt is funny. It's very funny when you see one of your buddies has a huge dick. It's weird. Changes the dynamic. And people with huge dicks don't like talking about it. Yeah. You ever make fun of a guy for having a big dick? They're big dick embarrassment. They're weird. Crazy. Like you with your shoulders, you get a jack. Not a big deal. Shut the [ __ ] up. You get jacked. Yeah, the huge dong is a game changer. It's like when you see your friend playing the piano, you're like, \"Well, where'd this guy go?\" Holy [ __ ] That's a weird thing. You know, it's a weird skill to have. Piano. Yeah. When someone sits down all of a sudden they can play and you're like, \"You never told me.\" Any friend who has skill Hinchcliffe can play piano. Come on. And [ __ ] checks out. And drums. He just sits down. Checks out. Plays drums. But he sits down and just starts playing piano. You're like, \"Where'd this come from?\" Plays a skin flute.\n\nHe's getting there. It's a trombone. The old rusty trombone. Oh yeah. Yeah. The extracurricular skills off stand-up is interesting. But Bob Bobby Lee can dance well and skate. No. Mhm. Wow. I bet he plays the [ __ ] out of some video games. Yeah. But I mean like, yeah. And some math. Yeah. Certain guys sports. Andy Haynes can shred on skis, right? Yeah. There's certain guys just like what's this other thing, right? Okconor was D1 lacrosse. Wow. Really? Yeah. Oh wow. Oh man. Penn State. Uh, Drexel. Nice. You were thinking Duke.\n\nI got my uh, mixed up. Michael Costa. Michael Costa. Professional tennis player. Wow. He was like a really good tennis player. 1200th in the world, which doesn't sound good. How about pretty good being like a karate guy. You see those pictures? What? No. He has like a, it was like right when he started doing crack. Oh, Jeff Ross. No, Voss. Oh, Jeff Ross is a black belt in Taekwondo. Do you with pool?\n\nIt's like these people that can like do something like what has a photo of him throwing a kick with, he's got a Jerry K. Oh, that's right. He just got addicted to [ __ ] crack. He was doing karate. Let me see where he kicked that guy. No, it's [ __ ] It's good. Let me see his form. See if you can find the photo about kicking that guy. Some guy, some young comic is trying to like get in with him and make be cool, and he was making fun of his kid. Just too familiar. Jason Caner, I was going to say it doesn't matter. He doesn't care. He just kicked him. Just kicked them. Broke his ribs. Boss [ __ ] rules. Broke his ribs. He was like, \"Actually, no. Jason, no. I just broke a rib.\" Oh, yeah. Jesus Christ. His drugs. Horse kicked him like that. Really? Yeah. At the Caroline's Christmas party. Front kicked him at a Christmas party. Front kick. What the [ __ ] I think I heard Jason was like, \"No, I was out of line.\" He was, what year was this? What year was this? 2009. Wow.\n\n\nThat's a risky time. Risky time to be front-kicking people. The internet existed. True. Yeah. Yeah. You could front-kick people in the 80s. You have no recourse. No one's going to believe you. You got any DNA? You got nothing. You got a story. Barkley threw a guy through a window. It was wild. Nobody knew anything. What's that? Barkley threw a guy through a window at a bar. What? Charles. And but there's no video. He could just do it. Whoa. He's skeptical. He threw a guy through a window. That's dangerous, bro. That's how people die. I love your neck. Class. Oh, I mean, the way you die, he's talking [__] to [__]. Charles. Giant super, but I rebound like six times. So, he's a funny guy. So, if that guy [__] punches you, oh my god, you get punched by an NBA player. If you're going to bother me, I'm gonna whip your ass. Charles Barkley threw a man through a glass window. Wow. Wow. That. Imagine like you're just some dummy who just thinks you could just talk [__] to a guy forever, and then this 300-lb giant man just grabs you and throws you like you're a cushion on a couch. He just chucks you. It's like the guy on the flight who tried to [__] with Mike Tyson. Yeah. Well, that's wonderful. Yeah. Yeah. There's some dudes out there just sitting back and watching Chuck or Charles Barkley become like the coolest guy of all time. So funny. That guy's sitting there like, I bothered him once at a bar and he threw me through a window. I hated him my whole life, and then you watch him on TV like [__], he's the coolest guy. He's so cool. He's literally the coolest guy. Yeah. I love when he—he was going to do the play-by-play or color, whatever, for LIV Golf. Yeah. Had a colored comment for LIV Golf, and they were like, \"Well, that's evil.\" He goes, \"Where do you get your money from? Don't you all do like iPhone ads?\" Like, let's ease on the judgment. That's an interesting Charles Barkley. Where's your money, bro? Carl Malone. Wasn't the best impression. Jimmy Kimmel has the best. This is a pretty crazy story. He said, the guy says, \"You're not going to do [__]. You're nothing but a big ass pussy.\" The taunt set Barkley off. William reached for his radio to call for backup. Oh, the cop. According to the police report, oh my god. As he released his grip, he felt Lugo escape, except the 20-year-old hadn't gotten away. I felt the victim being pulled. I felt the victim being pulled from my grasp. Williams wrote in the account of the incident. I looked up and I saw Barkley holding the victim up in the air by his arms. Wow. Oh god. What did he say to proceed that? Him like he was a—He says, \"Do you know who the [__] I am? Do you know who the [__] I am?\" In a matter of seconds, Charles chucked Lugo through the plate glass window. Oh my god. Even if you don't know who he is, flung him like he was a toy. Flung him like he was a toy. Right before this too, he had the cops told him not to go up to him. He's like, I'm just going to talk to him. I don't want to—I won't hurt him. I just want—I won't hurt him. Charles assured the officer, I just want to talk to him. Oh my god. I just want to say, and the—the officer like, okay, you can just talk to him within arms reach. And the guy says, you're not going to do [__]. You're nothing but a big ass [__].\n\n[Laughter]\n\nBro, there's people like that out there in the world, you know? So funny. You're like, you're rich, but like I wasn't raised rich, so that's who I am. You guys have seen the video of Joe Schilling knocking that guy out in the bar? No. You know that. Oh my god. So, there's this [__] at a bar. He's being rude, and apparently he was being rude all night. And Joe Schilling, who's a multiple-time world champion kickboxer, walks by this guy, and the guy like tries to like make him flinch. And Joe just goes, \"Watch this.\" So there's this guy, you know, drinking, having a good time, being an [__] talking about beating somebody in arm wrestling or whatever. And Joe just is behind him and he just touches him, you know, nothing. And he says something to him, he turns around. Oh, that was quick. Yeah. Well, he's a world champion kickboxer. You can't flinch on that guy. He was out of his—He was walking. He delayed himself 4 seconds. I don't even think it was four. I don't think it was four. I mean, he knew the guy was out. Like, look. Okay, here. One. He just—He just passes by and he calls him back. Oh, that step forward. The step forward with the chin up in the air was like, you can't do that to a guy like that. He comes at him with like, you want them. Okay. Yeah. Like, what? That's scary cuz that could happen to anybody. Have a couple. Hey, what's up? He had to go to court for that and he won. It was Florida. It's like stand your ground. Florida does rule. They have some good rules. I love Florida. What was that medicine they give you during co—I forgot the name of it. I make—No, no, no, no. The treatment monoclonal antibodies, that's what I was trying to remember. Yeah, they—they ban that a lot of places. They stop people from getting that. I had a whole podcast about it. Yeah, you got it. I\n\n\nGot it to a lot of people. When I was down there, you were like, \"Oh, thank God you're in Florida.\" Okay, cool. Do this. There are places they wouldn't give it to you. They restricted it. Florida was pretty good during the pandemic. They were a good place to go. Did a lot of comedy there. That's where I call CO. That's where I got it, too. AIDS. Thank God you got rid of that. Yeah. A lot of your people down there, Jews. Olds. Oh, yeah. They don't come to shows. They like to relax. Go to Miami and relax. That's true. Place built on cocaine. Imagine cocaine Jews and Hulk Hogan, Carol Baskin, Scientology, rented Lamborghinis. Oh yeah. Oh yeah. Lot of rented Lamborghinis. Lot of people. Before I got to the store, somebody pulled up in a limousine. It was a door guy and I was like, \"Oh, who's this?\" And the manager's already been jaded. He goes, \"Somebody with $50.\" And already jaded. The jaded guy. When I got there, Harris Pete was the most jaded guy of all time. Maybe of all time. Of all time. He had been through all the eras and he was like, \"You got to impress the hell out of Harris Pete.\" Made a deal with the rumor was Leno and Letterman said, \"Hey, all three of us, whoever makes it, we'll take care of the other ones.\" Really? Does that sound like a deal you would make? Sounds like a deal you'd make one night while you're drinking. Not a real deal. We're all going to—we're all in this together. Yeah, exactly. The guy who kind of sucks. The guy who kind of—one of us is going to make it, right? Someone else. You—you bring us with you. Oh yeah, it's Shane Gillis, Dave Chappelle, all talking. So, we're all in this together, boys. We said we were in this together. Like, hey, hey, hey. We—you promised. You said get away. I said, \"Get me a beer.\" Yeah. It's not like we found it. Relax. Relax. We did the—I did the Boston Comedy Fest and we were all in the finals and we were like, \"All right, whoever wins, cuz the pot was 10 grand, which was enormous at that level.\" Yeah. And we were like, \"Whoever wins, we'll split it up this way, that way. You get first, second.\" One guy was off in the shadows. We're like, \"He's not going to make it. This guy sucks. He's no good.\" That guy's definitely going to win. He won. Gave the whole thing to Boston Strong. We all hated him. What's Boston Strong? Oh, after the guy got—it was that year. What a piece of shit. What a piece of shit. Did he ever make it as a comic? Yeah, he's hilarious. He's a really funny guy. But at the time, we're like, \"This guy's going nowhere.\" And then he won. Yeah. Anytime I've done a comedy competition, the guy who's sitting by himself and quiet, you go, \"Fuck.\" He's doing the math over here having fun. Yeah, exactly. Yeah. We're all hungover and drinking this little Indian kid. They used to have this thing called the Boston Comedy Riot. It was like the biggest comedy compet. Yeah. The WBCN radio would host it. It's the Boston Comedy Riot. It was like in the 1980s. WBC. The Boston and the Seattle competitions were the big ones. I never did either one of them, but it was like—it was like weeks long. So you had to either keep going up there or be there. Yeah, that's—Seattle was like—that was hell. So you have to be a guy with no life. Yes. Or a Seattle resident. Yeah. Or a Seattle resident willing to hang in there for the long haul for the golden prize of being the winner of the Seattle. You do any competition? I think I lost one to Sam. Yeah, I did a bunch at the beginning. Which Sam? Sam Morril. I think he ended up winning. I think we're both in the final, but—oh, the Laughing Skull. Yeah, he did win that. Did they just kick them out? Huh? The Laughing Skull. Did the Vortex just kick out the Laughing Skull? What happened? I don't know. I think the Vortex said like, \"You guys got to go or the owner's got to go.\" Pull up. What happened? I don't know. You got to pee. What is that about? Do you know why? That was a great little room. It's just a headline. 85 seats. Great little room. Fun room. Someone's got to have filmed a special. There's no space for cameras, but someone still had to. I think someone filmed something there. I think I've seen stuff from there. Yeah. Atlanta's a great comedy. Yeah. What happened to that? What happened? There was this headline. I kind of pass by for a second. You ever do those and then go and you're like, \"Wish I actually read that one.\" Yeah. Yeah. The headlines. You just—you think you're just getting overwhelmed by headlines. That's the problem. That's true. Like there's so much—oh, that's important, but maybe not as important as the next one. Maybe scroll down a little bit. But it all goes into your brain. Mhm. And you know the headlines are all lies. They're all lies made by some other—not the writer. So you're like, \"Oh, okay. I guess it's that.\" And you're like, \"Isn't that weird that the—if you write a really good article, someone could like—\n\n\n\"It up with like some misleading [__] in the headline?\"\n\nLaughing Skull Lounge founder will leave the vortex after 16 years. Sad. Wow. That was a great room. After two decades, they're splitting up. What does that mean? There'll be no there'll be no Laughing Skull, or just the guys out. I think I don't know. Laughing Skull will still be open in the vortex, but not as we know it today. Uh oh. The founder and team will be exploring other comedy avenues in the city. So, they'll do another Laughing Skull somewhere else. No, no, no. Nobody cares about the name. Wow. That room. Well, they they know how to do it though. They'll probably find one that's like it. No, the rooms are important. Size of room. It's not a You can't just reproduce it somewhere. But you might be able to find a similar size room. I mean, yeah, but it's not starting a new room. They have a giant email list. Why are you so pessimistic? No, because like the the actual the actual room, the old stand versus the new stand, they're different. The the La Jolla Comedy Store versus the regular Comedy Store, the Comedy Store versus the main room. Those are different rooms. Elliot, you know. Yeah. Elliot versus Elliot. Yeah. It's like So it's like you can't reproduce that, right? But you can make Look, look, we ran it. Well, that part will be reproduced. The little boy in the mothership, those are different. Yeah, but we made that. That's a new room and it's a tiny little room just like that. It's the same kind of thing. It's like you can you can you just know how to do it right. It can be and the location is big like what kind of people are in that area already versus like Sure. Yep. Yep. It's funny how a room has a feel like like the O in the Comedy Store has such a weird feel and smoke is built into the walls. Evil's built into the walls. It's also like there's something good about the I used to think it was bad, but there's something good about the commotion in the hallway in the back. The good about it is it's chaos. The show's chaos chaos. That room is a chaos room. Diaz used to have the most chaos in that room. Like Diaz would crush in the main room, but there's something about Diaz when he would go on stage in the [__] O like late at night when no one cared. Just doesn't matter. It just doesn't matter. And then he would go and crush it. Yeah. He would go crush it. He would go crush it. Really? I'd love to see him in that little of a room. Only a few people know what that means. Oh yes. And then he shake his hand till his dick came out. Sick. When I did a you sick [__]. Oh, he came back with the bong. It's just plastic. It's just plastic made in America. Hold on. I got to piss. Don't start it before I get I won't. Thank god you're leaving to piss. Our bottles over here. Yeah, we're trying to keep them from you. We got We had to triple wash this [__] pitcher cuz Normand pissed in it once. Oh, [__] I forgot about that. Wow. I don't remember that either. We've had some really rough ones. Like to the point where when it's like Protect Our Parks day, I'm like, \"Oh yeah, fuck.\" It's like a marathon. But America needs it. Yeah. The boys need it. They do. They tell me all the time. I see them out in the streets. Said, \"When when when's Protect Our Parks coming back?\" They say it all the time. All the time. That's the first when I do those Q&As after show sometimes. Like number one question. When's the next one? When's the next Protect Our Parks? But they take a year off your life, so you got to spread them out a little bit, you know? It's like um Bar What's that? What's that? The Tough Crowd, right? Right. You can't do them every weekend. That one uh the photo from the one we weren't had like 25 or 26 beers. Every once in a while I see the photo and I'm like, \"Oh my god, what a nightmare.\" But that is what people genuinely need. They need bros like having having a good time as bros like with no restrictions. They want to. If they can't, they wish they could. They want to. Everybody wants to. I grew up doing this [__]. You know, every man wants to have fun. I was really hoping to stop doing this at some point.\n\nSince my first party in the woods in high school, I was just like, \"Well, I'm going to do this for the rest of my life.\" At least now you're monetizing it kind of. Like you're making you made it a living. Yeah. Listen, this is the best life. This is the best life for guys. 100%. We We are the luckiest [__] people that have ever lived. Like you had Jimmy Carr on and he was talking like he's like I'm doing this today, then I'm going to Chappelle's thing, then I'm doing Kill Tony, then I'm doing the Mothership, then I'm doing an arena in [__] Scandinavia. Best life. What a life. The best life. Jimmy Carr was [__] hilarious. He came by the club with this new [__] he's working on. He just had a bunch of notes. Oh my god, he was so good. He's a beast. He was so It was so fun to watch. Just like when you watch a guy who's like h like just just [__] dialed in. Just dialed. I saw him tell the story about what's his name [__] with him too about me. Oh yeah. Yeah. It's so funny because I remember Greg Geraldo. So funny. Yeah. Greg Geraldo told him that Ari Shaffir had cancer and then and then Greg\n\n\nGeraldo goes and dies, and Jimmy Carr's living with this. Then he sees Ari. He's like, \"You look good. You look good.\" He's like, \"What the [ __ ] is going on? Was half your face shaved?\" \"Oh, no. This was like 10 years.\" He was only on one side.  [ __ ] crazy type of cancer. I was like, \"Thanks, man. Appreciate it.\" And then a year later, I'd be like, \"So, you all right?\" I'm like, \"What the [ __ ] is going on?\" But you're just weird-looking enough where you're like, \"Yeah, he does look…\" He also said like when he told me that they said you had cancer, I'm like, \"What?\" He goes, \"Yeah, they said you're cancer and that's why you're like that cuz you don't care anymore.\" I'm like, \"What?\" Kobe, he had cancer. The guy… This is 15 years ago. It was so crazy. Let him spike your drink. He died. So funny. That's so funny. That's so funny. That's a nice [ __ ] backup to have. I wish people thought that. Yeah. Like, yeah, he took a [ __ ] on stage. You go, he's got cancer. It's funny. That's why he's bloody, right? Bloody [ __ ]. Geraldo said that to him and never told him any different. He must have just been passing through the room, saw him watching any standup and goes, \"Oh, that guy's got cancer.\" And then got in a beer. That's amazing. I just [ __ ] with that. Love a comic. That guy went to Harvard Law, too. Love a comic. Like a long burn of a joke, just waiting one day, years later, this joke will pay off. That's amazing. And I won't even be there.\n\nI won't even be there. Genius. Geraldo and I, we shared a parking lot in uh, when we were both on TV together. The very first times we were both on TV, when I was on NewsRadio and he was on his own show. He had his own show that was on the same lot. I'd hang out with him at the lot all day. He had like a, like a show about him being a lawyer. Yes. Yes, like a sitcom because he was a lawyer, so he could, you could build this off your life. That's what they always do. What was your job right before this? Was it make a show? Yep. Yeah. Garage. Knew him from New York, so we… That's why you got Tires.\n\nThat's why it works though, right? Oh, by the way, when's the new season? Uh, June 5th. Right now. Today. Go check it out on Netflix. If you're listening to this, it's available right now. Check it out on Netflix.com. It drop-ship you a [ __ ] CD. Watch it. Mail it. Check your mailbox. Check your mailbox. DVD with Tires. Hopefully they didn't send your first season. It's going to skip a little, and while you're there, you can watch Ari Shaffir's special. We all got [ __ ] on there. That's right. But yeah, Tires. Yeah. You've managed to rein in trash Kyler in a way. It's unrainable. Well, everybody in the show plays literally themselves. Kylo was… Kylo was pretty easy. What was the… Hold on. What was the line? Hold on. I mean, I mean, she was my employee for a long time. Ron White's in this season, right? Ron White is. Yeah. Oh, fun. What was the line you had before? It was… It was \"How to Talk Trash.\" It was like, \"I spilled a coffee colada on my scratcher.\" What? Yeah. Yeah.\n\nYeah. Ron [ __ ] kills it. Oh, he brought his own outfit in. You're not going to believe it. Ron plays himself. Labowski there. That's all you'd want him to play. Yeah. Why? He plays a washed-up NASCAR driver. And he's there for like a signing, like a meet and greet that no one shows up to. Oh, that's great. It's pretty great. Yeah, we had Woody Harrelson at the club last night. Oh, was he there last night? He's there a lot, man. He's been there a lot. I missed him… every dude to hang out with. He's the [ __ ] man. He doesn't have a phone, though. He doesn't do email. So, if like you want to get a hold of him, you got to go through his wife. You got to run into him. Like, he's smart. He's protecting himself from [ __ ] the [ __ ] in the world. It's like, \"I don't want to be a part of this. I don't want to have a phone. I got no social media. I got no nothing. I'm just a human like I always was. I was a human before this. I'm staying a human.\" It's really nice when you don't have a phone. He's ear to ear. Like he's… le… on walking on thin air. Is that it? You don't want all that [ __ ] input, man. You don't. It's not good for you. Also, nothing ever happens. Nothing ever. It's just like [ __ ] India. Yeah, right for us. We got the… the not changing. Why am I got to be aware of this? Yeah. Yeah. I do. I mean, I guess all of us remember before it, right? You're the youngest. Yeah. But still, it's like those were good times. Great times. And so, it's like I get we have better stuff now, but like parts of before were okay. And not only were they great times, pull those in. I'm so glad they weren't filmed. Can you imagine if he had all that [ __ ] on film from taking a dump in… thrown up in the street and you got to worry about somebody filming you… the just the pure…\n\n\nAnxiety today. But yeah, people are living with like pure anxiety, like on a level of just anxiety on your phone all day long, just giving you anxiety, and you can't live. That's terrible. Suicide. Then you wake up to twenty texts that are like, \"What's up?\" from all these different people. You got a microphone, right? Even that part's, but it's like, and it's like I just woke up, so I look at my phone right away. I'm sending the dumbest replies. Yeah. I don't know. You know how like when you wake up and you… Yeah. I don't know how to explain what I'm trying to say. No, I get it. I get it. Yeah. It's eighty people coming at you to do… it's fun, a show or something like that, and it's like, I… it's too much now. I was supposed to run into you and say, \"Yes, I can do that.\" Yeah. I need an answer now. It's just constant. It's good. I got all my buddies are in town. All the Philly… all the Philly trash is here for… for the… Yeah, tonight's gonna get nuts. Tonight is going to get nuts, and I was really hoping to avoid that. What is the plan? Have some fun, dog. We'll do the show. We're doing a show. I guess we won't tell. No, I mean… I mean this tonight when this airs tonight, but we'll tell. Well, at least we'll be safe in that green room. Yeah, we'll be safe. We're going to be safe at the bar. It's going to be a nightmare. It's going to be a disaster. We were talking about it yesterday where it's like, \"What's the plan?\" Usually I'm like, \"Okay.\" So, we get way too messed up. Then we go shove meat in our mouth, and then immediately you're on in five. Like, okay. I go run to… run to the store, get up or the mothership, and then get up and then be like drunk. Puke in the hallway. It'll get it all out. You'll be good to go. It's funny cuz I call it the store all the time. Oh, by right. I even call it the main room. That means you did it right. Yeah. I don't even… the main room and the… and the… Yeah. And the O or the… Yeah. It's kind of like either O… belly. It's kind of a hybrid between the O and because the main room is also the O… the O is the main room, but the O… the main room at the club at the mothership is like if the main room and the O had a baby. Yeah. And then the other one is like if the O and the belly room had a baby. Yeah. I'm always like, \"You're going to the store tonight.\" Yeah. I mean, you built it with that in mind. And Adam gets there. Literally named the bar after Mity Shore. Gayest. He's the best. He's the best. He should be my favorite homosexual of all time. He… he's not gay anymore. Holocaust denier. He's not gay no more. He cured it. He delivered women. I wait. How long after that video did that guy suck a dick? Did he wait a week at night? Ten minutes. That… ten. Why are you gay? The first dick he saw. He's like, \"I'm not gay no more.\" Good. This ain't even a dick. Oh, it's not. No, no, no, no. If you say so. The devil's tricking you into believing my delicious penises. But for a moment, he believed it. The way we're all like, \"I'm not going to do this one evil thing anymore.\" Imagine if the whole world didn't want… most brutal thing about homophobia. You want some though? Fine, I'll do a little. That's the most… How many times you quit drinking for a week or quit weed for a week and then not made it that night? All right. So, last week… last week… last week I was like, \"All right, I got to take a week off.\" Giant storm comes through Texas. My power is out for three days. Wow. Wow. Day three, I'm sitting in a hot house going, \"The only place I can go right now is a bar.\" Actually, I went… right. Yeah, they gave me this shirt. This… they gave me this on Thursday. There you go. Watch. I got hammered. Yeah. Where's Kelly's? Where is that? Uh, I have no idea. Kelly's Irish Pub here. It's in Austin. Yeah. Rules. Oh, no… I've… I've heard of that place. The place was actually really great. That's nice. The owners, they're all Irish. Everyone… Irish people have exported the bar, the proper bar… the best way. The Irish bar is the same in every country in the world. Yeah. And it's the best. They figure out… Irish pub. Yeah. Is there an Irish pub in town? People always ask that. And it is the same. Well, they're not blaring techno and all this… Yeah. It's dark and you drink, right? Yes. Couple… couple old Guinness signs. It's like Ireland. Do they play music at the Irish pub? Uh, yeah. I think they actually have Irish music, like a live band coming. Oh, I think it's actually pretty sick. The owner was… the owner was the man. He gave me a bunch of… uh… yeah, whatever. That's one of the good things about… no, not drugs. Not drug. He gave me some… like IRA stuff. I don't want to… I don't want to… I don't know if he gets in trouble for that. Somebody gave me some Nazi money. I have a wall for my *You Be Trippin'* podcast, and I put like money up there from different countries. Somebody's like, \"Want some Nazi money?\" I'm like, \"Yeah, I want it for sure.\"\n\n\n\"Wow. I was thinking about buying an Adolf Hitler autograph. You might as well. And I don't know what's from Kanye. He'll sell you. Yeah, but you can buy them. They're really expensive, but you can buy an Adolf Hitler autograph. A signature. I mean, it's got to be worth a ton of money. Yeah, I know. And then I figure maybe when I'm if I have grandkids, I go, 'This is going to be worth a billion dollars.' Maybe someday it'll be like Khan's autograph. Won't be won't be forbidden anymore. Of course, after like a thousand years. Yeah. Revering him. You're just like, 'He was the most famous guy ever.' There's somebody who's like, 'I was reading mine comp just to read it,' but she was reading on the bus, so she had to go so people didn't think she was a grand. Yeah, but you can get in trouble just having that. You got to get a book cover on that thing. Few outstanding very original document letters signed, autographed by Adolf. $7,800. $7,700. That's not bad for a not just on a piece of paper. This is like is a Nazi military officer charged by Hitler. He's not Adolf Hitler. No. Ikeman was. That's right. It's not Adolf. Oh, this goes here. I can't believe you can just buy Nazi stuff. Oh, yeah. Dude, it's in thrift stores, too. It's not I've seen them. Look at that original. Look at that. The arm sleeve officer sleeve eagle. Hell yeah. from a guy's uniform. Damn. See what I mean? That guy killed your grandpa. You see how you start going,  500 bucks. It's only 480 bucks. That's crazy. I have a new version of that. Oh, no. The Chinese want that. The Chinese made new money to give it up for the workers during COVID and it's all these scientists on their on their bills. They made a whole new bill. Really interesting. Interesting. I swear to God. These are the people that caused the pandemic. I don't see every every time I brought this up. Yeah, people get upset. He's a He's a polarizing figure, but I don't Of course he's polarizing. It's not like But I'm not a lot of bad things. I know, but I'm not like, 'Hitler's the man.' Yeah, you're someone just edited that part. 'Hitler's the man.' No, but it's like he's the worst. He's the of course edit this part. He's the biggest  that's ever lived. Sure. Actually, Mao is worse. Wait, wait, that's so funny. I mean, it's a it's a whatever bit, but like calling Hitler a  will get you in trouble for the wrong reason. That's true. But he's like top five all time. Top five. Yeah. Biggest  turds on earth. He's the Michael Jordan of  Cranked out of his mind the entire time. Yeah. Like a a poster boy for don't do drugs. It was actually Ikeman was drove it more because Hitler was like whatever you need to go. Ikeman was the one that's what I think I remember is him going, 'Let's find we need an other.' He was a smarter one about it. Goes, 'We need some other.' And he goes, 'Let's do the Jews. They stay to themselves.' But he was like, 'Well, anyone will do really.' He was the he was the like the the writer of all of it. And and Adolf was like, 'Yeah, that'll help us get like the Dick Cheney to George W. Behind the scenes. Let me tell.' Yeah. We We found out Dick Cheney is still alive the other day. Yeah. Really interesting. I thought he was I It's like a Baronstein Bears Mandela effect thing. I thought he was dead. No, he endorsed Kamala Harris and they bragged about it. Oh, that's right. Oh, that's right. Dave Smith pointed out. Yeah. Yeah. Someone with visual war. It might be real. It says, 'Bro, 240 grand. You got this, Shane.' What is that? His flask. George Washington's powder flask. Pawn stars. Jen Washington. That might be real. See what I mean? You could have that at your house. That's pretty dope. But that's the founding father. Same. Same but different. Slaves drinking beers. Don't tell anybody. Don't tell anybody. They won't Google it. He had  slaves. He did. You could any of his The Napoleon hat. Was that you who sent me that, Jamie? I don't think so. No. Wow. Napoleon's hat is up for auction. Yo, hell yeah. How do you know if it's really his hat, though? Like, you know, I have a thousand baseball hats. I literally have a thousand baseball hats. If someone sold my hat, you can sell my hat. But you wouldn't know. But you wouldn't know if it's his or just created like that. I wouldn't even know if you sold one of my hats. I remember an old old pod we were doing at your place at your house. That's how old it was. And it was like we're talking about art from like the whatever era and you're like, 'Well, this one's hella old.' You're like, 'How do you know?' And it was like, 'Oh, yeah. I guess you have no idea. Just painting.' Somebody told me it's old, right? Yeah. Yeah. There's a lot of lies out there, a lot of fake paints, a lot of  lot of dudes. I mean, it looks good. Legit. I think it's pretty expensive. How much is that? The last one million it sold one auction uh one auction went for what? 2 million 2.1 I think it said. What? How much is judges 63rd? 62. Jesus Christ. Who wants that? 20\"\n\n\nImagine you got so much money, you spent $2 million on a hat. You don't want to jack off wearing a Napoleon. I do want you. I didn't, until you brought it up. You got to wear that one. A full-length mirror, flexing. Yeah. Did we talk about what Hitler did to Napoleon? Did we talk about this already? When Napoleon's tomb was built, everyone had to bow their head to get to it. In 1800, he built a series of mirrors so he wouldn't have to bow. So he could look at it without bowing down. That's wild. It was before I go in. Yeah. Change all the mirrors so he can just go, \"He didn't get me, Napoleon.\" But he loved him. Yeah. Interesting. Yeah. Interesting. Every once in a while you hear a Hitler story where you go, \"God damn, that was pretty sick.\"  A good heart. I feel that way about a lot of them. I don't know. They told us, and I could see them; that's being propaganda for Jud. He was pretty stupid, right? That's very methy. Yeah, it might have been accidental. He did some meth. As soon as you hear about a guy doing meth, you're like, \"Oh, everything goes from that.\" Yeah, meth. Oh, he's doing meth. The book I read about him, he was, by the end, just sitting by his fire and you just had to listen to him tell stories, and he would be on meth and he'd be screaming for hours. I've had that with Stanley.\n\nAnd what he was screaming about was like, \"I'm the greatest architect that's ever lived. I shouldn't even be doing this war.\" Oh my god. I didn't even want to do it, but Churchill made the greatest architect. I'm the best architect that's ever—He thought he was the—Everybody thinks he thought he was a great artist. He thought he was the greatest architect. This is Elvis with karate. Yeah. Yeah. Look out, man. No one could tell him. That's right. Elvis karate shirt. Oh my god. Oh my god. Shout out the roots of fight. Yeah. Elvis got pled up, and they pretend that he was good at karate, and dudes would just be like, \"I can't believe you're doing this to me.\" They would try to move him and like put his neck out there and stop them from moving. That's kind of nice. That's kind of nice. Cranked down pills. His liver was redlining all day long. Just be like, \"I'm the best fighter ever.\" We went to Graceland. That's right. We were there the same time. Went to the Graceland tour. The racquetball court. He had multiple TVs so he could watch every channel in existence all at once. So we had four TVs. Come on, man. That was big back then.\n\nI thought it was on a toilet outside his racquetball court playing racquetball. He said, \"I fell. I'm going to take a shit.\" He had a separate house for racquetball. He's like one of those kids that got the vaccine. You just immediately have a heart attack. He's the McDonald's. Yeah. He uh, he was playing—he couldn't sleep, so he started playing racquetball and he called a guy like at 3:00 a.m. like, \"Got to come play with me. Get down here. Come on, man. Going to beat your ass and the king right now,\" like, and he he was like, \"I got to take a dump,\" and there it was. He was the first super famous guy. You think? What about Hitler? Yeah. A different kind of famous, like the first beloved star. 60s. 50s. When was he? Well, started in the 60s. 50s. Started in the Yeah. Started in the 50s, went into the 70s. Yeah. There was nobody. He died in like 1976. I want to say 78 maybe. He was already past the huge then. He was just Yeah. But like not—he was still huge though. He could still—But he got big in the—He got real fat and crazy and just was just drugged out of his mind. You ever see the video of him singing from Vegas? Yeah. \"Unchained Melody.\" You see—amazing—still amazing. Bloated, dying. Still his entry. I got something good. He got his his entrance in some place where he's like and he just like walks with just—he just just walks here. The mic's there, walks this and he's like this, you know, and he's just going back and forth like and he's take it and then immediately goes and starts singing it and I'm like, what a entrance. What a entrance. My whole life I hated Elvis. I thought he sucked, and then I watched him. Young Elvis is so—I don't know. I guess whoever liked Elvis—I thought too popular. It's too obvious. Watched it. It's too obvious, but it's really good. It's like AC/DC, like Goosebumps DC—listen to the long way to the top. Listen to that song. It's a long way. If you don't like that song, you don't like America, okay? You don't like freedom, you don't like hard work, shut the up. It's just—it's too easy. Elvis was too easy. Fat \"Unchained Melody,\" bro. He was so good. He was so good. Look at him. Look how big he was. Come on, man. Damn, Panette. And he wasn't that old. Yeah. What is he there? 40. Funny we call that. He looks better than me.\n\nAnd look at this. Well, compared to how hot he was. He was like a hot guy. Oh, he was so hot when he was young. He was like the the the first black white guy. Is that the general? Yeah. You know, he was like the first wigger. Is that the general right there? Show me the right keys. No, it's a different guy. Different handler. No, I think that\n\n\nIt's one of his musicians. So, I heard Dolly talking about him. Oh, he's cranked out of his [__] mind. Dolly Lama. Oh, this is nice. I just recorded and it I don't know. I don't know. Uh, is it out?\n\nTwo weeks. Two weeks to be out. He's I mean, no different than Amy Winehouse. Wow. How's this guy going to do this? You're thinking he's out of his mind. Okay. He's in another dimension right now. Is he on up or down? You can hear how quiet the room is. They're going, \"God damn, this is like This is like O'Connor before he goes on drunk. It's like he'll be fine. He'll figure it out.\" It's funny. This is the I'll tell you in a second.\n\nYeah, I was I was nervous about that. Cranked out of his mind. Listen how good this is. Wow. Wow.\n\nI can't get a mic stand.\n\n[Music]\n\nYour touch. Time goes by so slowly and time can do so much.\n\nGod damn. So good. Oh, it's so good. It was uh man, you [__] before my special. Damn, that's good. We made that exact joke about O'Connor. Like he was like, \"The only way you can [__] this special up is if you like black out before the show and then even then it'd be like fat Elvis on Jane Mountain. Go in the green room.\" I'm like, \"And get on stage, crash it, do it.\"\n\nGod damn. God damn. That was good. I mean, you if you heard that guy talking before that you if you were in the audience like, \"Oh no, we came the wrong night.\" Sitting there going, \"Is this song out yet?\" They go, \"Two weeks.\" It's just pure talent that'll overcome the the look. Give me some more of this, Jamie. He's launching this song right now. Like, he's showing it to them. He's like, \"I know you're about to hear it all time.\" They haven't even heard it yet. Whoa. Be coming home.\n\nWait on me. That's a god damn\n\n[Music]\n\nI hunger for your glory. Time goes by dress and time can do so much. All you\n\n[Music]\n\nStill\n\n[Applause]\n\nhits you guys. And you guys are allegedly on mushrooms. That must have been [__] nice.\n\nOh my god, that's so good. That is one fat. That's what we live for. We live for those. Like, if you could belt out one of them moments in your life, you did it. Yeah. One of those moments. I mean, this guy had a ton of them. But one of those moments. And nobody had ever gotten that famous before. Nobody had ever like Nobody gets that famous ever and doesn't go crazy. But nobody had ever gotten that famous before Elvis. He was the first. Yeah. It's also You go to his house, it's not that big, right? Like your house is probably the same size as Elvis's. No, it's pretty much his house is bigger. Come on, man. Who? Come on. Oh, really? I live a big ass house, man. Oh, okay.\n\nWatch me do a little. First of all, which house?\n\nI just say you see like little Bow Wow on a suburban house. It's just a house in the BBS. That's all I've always You don't need a big house. If I was by myself, I'd have a regular house. Yeah, you would. I don't you don't need it's all nonsense. It's just where you live. That's the first thing I figured out when I came to Hollywood. I was 27 years old. That was the first time I ever had a nice apartment in my life. I had a loft. I had a [__] pool table. I was like, this is sick. And then I got And then I'm like, oh, this is just where I live. I felt like, oh, like that's another trick you got to be aware of. Like this idea of always getting a bigger, better, you never appreciate it. It's always just where you live. This is all you need. A place that's safe that has a TV. You have a kitchen. No, no playground next to you to wake you up. Yeah. You don't want anything crazy and loud. You don't want to hear a train station. Buying a house. And I'm like, I'm literally just going to hang out in two rooms. I'm going to walk from my bed to the [__] couch. The only time it changes if you have a family. You have a family, then you want a yard, then you want a pool, then you want a lot of You want a lot of things. You want you want a dog. Yeah. You want to have a room to be like, \"I don't know where to put this. I'll just shove it in.\" I always had My garage is [__] Oh, well. I've always had dogs, so I always have a big yard. I'm like, that's the thing. Can't have a dog. That's why the only reason why I never bought Crest Hill, the the house above the store, the the missing house. Yes. I went to look at it because it was like Sam Kinison used to live there. I'm like, this would be crazy to own this [__] house. But I had a crazy dog and that yard was too little. I was like, he'll find a way out. Sam Kinison pissed on Marc Maron's bed up there. Nice. Whoa. What the [__] Imagine if that was on YouTube. 100 million views all over his bed. Just standing up. Wow. Oh, that's a credit. That's Mark's territory. That's what your cat does. That's why you got to get him spayed.\n\nEasy. Spaying new to your pets. I'm Bob Barker. Wow. What a weird thing he had. That was his big thing.\n\n[Music]\n\n\nCrazy. Every turn trans. Everyone turn your dogs trans. It's important to have a trans dog. How about just don't let your dog [__] random dogs, especially in your name's Bob Barker. Oh [__] I never. What a killer. What a freak. What a freak. What a freak. What was his real name?\n\nStevens.\n\nThat's not a good joke.\nThat's a good joke. [__] up. Trust me. Come on. That made me laugh in this room. That's a solid joke right now. It's good. Three people laughing. That's a solid. You have an audience of three. Jamie, were you laughing at that? No.\n\nJamie's world pissed about that. See that uh Stan Hope had uploaded a pilot they found of the Mitch Hedberg project like they made back in 2001. No way. YouTube channel they put up like yesterday. This looks like it's about to be some Sam Hyde stuff. It's like a TV show they made. Oh, cool.\n\nSam thing where he sits down just with the [__] the chair and is like breaking down things that are going on in the world. Oh, no. I don't know that. You ever seen that video? It went viral. You've seen it, right? Yeah, I'm friends with him. I was. He's doing his premiere for Million-Dollar Extreme 2 in Austin on Sunday. What does that mean? They had a sketch show called Million-Dollar Extreme. Funny and it got cancelled off Adult Swim. Oh, that's right. Yeah. And now they made it again. And I was. He's a little too wild. He's a wild boy. He is a little wild. But that you see moms or mothers. What is this? That's a brilliant one. It's he writes a script, realizes he can get some just local I'll try to be an actress to read the lines. So they're like, \"Oh, well, let's write crazy lines.\" And they're reading these lines, not knowing what it is. And he goes, it's something like, \"Yes, I am the curlyhaired one. I think we should try to [__] the curlyhaired one.\" It's crazy. It's just like. And they're just like trying not to laugh. So him and Nick Roach before it's one of the funniest dudes I've ever met. Char those guys, they're doing some wild stuff. locking a bunch of homeless people in a [__] Well, I don't agree with all and just let's watch them. Hold on. I don't agree with all this. I think this one's wild. I love it. Fights. You mean? No. You're talking fish tank bum live. It's just like it's real world. You're saying fish tank? Yeah, it's real world. You get the craziest people. Is it funny? Like real world's okay cuz they're only mildly mentally ill, but they always got a racist and a black on Real World and like let's put them in. Producers, they know how to make drama. That's what he's doing. Yeah. Fish tank. I mean, if you're going to make a show, you can't just have a bunch of people hanging out, having a good time. Yeah. You need a bunch of cat fights. That's [__] friends. Even the Kardashians went after each other.\n\nRemember that? [__] swinging each other, slapping at each other. They're in the hallway. One of them threw a leg kick. Leg kick. Joe Rogan was watching, commentating. I was watching. People know how to throw leg kicks now. That's like a new thing with street fights. People throw leg kick. Leg kicks. I saw it after uh who was with me? It was it was uh Patriots versus um Broncos. So there's some [__] drunk Boston fans who were leaving and somebody some old man talked some [__] to him. All right, better luck next time. He's like, \"Shut your mouth.\" He goes, \"Easy, bro.\" And then just leg kick to the face. Knocked him out. Guys, we're talking a leg kick to the not to the face. To the leg. A leg kick using the leg arm arm punch with a head kick. He opened up with a head kick. He just spun and kicked him. It was like this guy was like a just a nice Denver resident. Oh jeez. Didn't know what he's getting into. You never know who knows that jiu-jitsu [__] now. He's hit him with a wheel kick or he spun around. Spun around back heel kick in front of his wife. Oh god. They were like he was like 60. Oh no. Yeah. You can't do that. 60. Yeah. It was people die and then you go to jail for the rest of your life for looking cool. I think it was me and Simone who were like use my karate skills. Yeah. So dangerous. Yeah. I mean I the kar karate guys and MMA guys should not be allowed to drink. Yeah. True.\n\nDrunk with Sean. Well, he doesn't do anything. He's sober. Sean Strickland. If I could if I could do a cool kick. You're doing it. I'm [__] kicking everybody. The second I start drinking, I go, \"What' you [__] say, Jamie, about Ohio State, you motherfucker?\" With that ass. Oh, Jamie, can you bring up uh Michigan walking into Ohio State Stadium? Nice change of the subject. The thing is though, I don't think you would do it if you could do it. True. Yeah. I guess it humbles you a little. Yeah. You don't care. I could do it. I don't do it to anybody. That's what I noticed about going to UFC's, the backstage stuff, is they're so quiet and just very chill, meek people. Just how are you? I don't know. I've hung out with Nate a lot. He's a different animal, but that's also why he\n\n\nHe's such a superstar. Everybody loves him because he's the same guy. It's also why he's great.\n\nFighting. Absolutely. He genuinely doesn't give a [ __ ] Leon Edwards is my favorite fight.  Yeah. When he cracked him with the left hand, then pointed at him. My favorite moment. Got you for four straight rounds. Leon's doing moves.\n\nMhm. Like trying [ __ ] Yeah. Spinning elbow to the forehead and he just goes, \"Oh, we're doing Yeah. [ __ ] gay ass spin. [ __ ] gay [ __ ] Come here.\"\n\nHe's trying to come back to the UFC. I hope so. Yeah. I was reading articles. I don't know if it's substantiated, but you're looking for it. [ __ ] Yeah. That guy's a superstar. That guy shows up. He'll fight anyone, bro. I was always said that he was the most underappreciated superstar during the Conor McGregor times. I was like, \"You guys are missing out. Like, you got Conor McGregor, but Nate Diaz just beat him and said, 'I'm not surprised, motherfucker.'\"\n\nNot just like, \"I can't believe it. It wasn't Storm the Field, guys. I'm not surprised, motherfucker.\"\n\nThat was what got me into the sport. What about this? I was at that one with Epstein. Yeah. Oh my god. Amazing. Yeah. What? Epstein. This jiu-jitsu guy. He caught a dude in a triangle. Caught a dude in a triangle and then did a double flex to the cameras while he had him in the triangle like fully locked up and had a tap. Einstein. Einstein. Damn. Amazing. His name was Einstein. Yeah, his name is Einstein. Nice going, Einstein.\n\nWhat does he do in the offseason? How does he make money? Well, he had something happen. He had a boxing match with Jorge Masvidal and he won, but they didn't give him the money. I think he's got a big Yeah. thing. See if that got resolved. There's a crazy thing. You know, you have these fly-by-night promotions and sometimes they're not funded correctly. Like any black room, like, \"We'll send you the check\" and like, \"Give it to me now. Give it to me now.\"\n\nThe wrong show. I don't know what you're talking about. Jamie, delete all the stuff I said about Hillary. Bro, I had that with a Bob club I used to work for in Connecticut. You get paid if you're lucky. Yeah, if you're lucky. I saw you almost [ __ ] beat a guy in Vancouver Island. Oh, yeah. He's like, \"I'll send it to you later.\" I've never seen it before. Because I would always—The checks were always from him. They're coming. And he was like, \"Give me my money.\" Goes, \"No, we got to send it.\" He goes, \"Bro,\" he like went into the back. Yeah. I was like, \"No, no, no, no, no, no. Write the check now. Pay me now.\" Yeah. Yeah, that guy was super sketchy talking about his balance and his—What are you talking about? These have to clear. Reported $9 million. So they robbed him out of $9 million bucks. Pre-fight deal in place, promoter blah blah blah. Yeah. So he beat him, but he's owed $9 million. I hope he gets his money. Me too. Damn. Yeah. Also, it's hard to get money on a person who doesn't have any money though. That's the problem. You get an old Ferrari. He could have his stuff, but Nate—Nate does uh—they do like uh jiu-jitsu [ __ ] They'll do like uh seminars. Yeah. Yeah, he does a lot of—makes plenty of money doing seminars. Nate's a legit jiu-jitsu black belt.\n\nThey always say purple, right? He'd always like as he was doing this, he'd be like, \"I'm just a purple belt.\" Like, \"Shut up, dude.\" Yeah. He was—They were—And his brother was one of the best of all time. That was always cool with him because anytime I've hung out with Nate, I've never hung out with Nick, but they always—he talks about Nick with this reverence. There was a time—I've never seen anything like it. People missed it because most of it happened in the Strike Force days and you know it was a small Yeah. Nick's prime. Nick's prime, he was a bad [ __ ] dude. He was a terrifying guy cuz he had the most insane cardio that's ever existed. He—This guy swam from Alcatraz to the shore. He swam five times. What? Five? I said he twice and he corrected me online. He said five times. Since then, he's probably swam a bunch more. So, he's probably like 10 times now. 11. Yeah. Swim from Alcatraz in the ocean with the sharks. The thing that was supposed to keep people from ever escaping that island. People voluntarily do it. He's done it a ton of times. Train by his [ __ ] cardio was off the charts and you just couldn't keep his pace. He'd put a pace on you and hit you with like 50% punches. Yeah. 50% punches. But constantly have him in your face while he's talking [ __ ] \"What you going to do, [ __ ] What? What? What? What? What? What? What? What? What? What you going to do, [ __ ] Pop pop pop.\" And then every now and then, rip one to the body. Rip one to the body. Pop pop pop. And you're exhausted and you can't breathe because when someone's punching you, you can't take a breath. So even if he's only punching you like this, you're all tense. He's relaxed. Wow. He's a better boxer than you. He's better at jiu-jitsu.\n\n\nWhat are you gonna do? You gonna take him down? Like, what are you gonna do? That's how Averi lost when he lost. It got to a point where later in his career, though, everybody slows down. But in Strikeforce, he was in his prime. Like Frank Shamrock, Nick Diaz versus Frank Shamrock in Strikeforce, a great example. Whoa, that's a fight. He beat his ass. Well, when he lost in his prime, why, how did he lose? Well, he didn't really lose in his prime. Well, he might have lost a couple of decisions in his prime in like three-rounders. I'd have to like go back and look at it, but like he submitted Goi, which was like this huge thing in Pride with a go-go plata like off of his back while he was high. He tested positive. So there was he was tested positive after the fight that like he had to be fighting high. Damn. Yeah. And he'd be like, \"Yeah, [__] yeah. Fight high. Let's go, bitch.\" That new Rock movie looks fun. Oh, yeah. Oh, the Smashing Machine. I haven't seen it. Okay. But uh, yeah, the trailer is amazing.\n\nJamie. Jamie, bring up Michigan walking on the field versus Ohio State. Oh [__] He won't do it. He has the laptop. We won. We're living high right now. We don't need to win. You beat Michigan. No, we won the national championship. This is we [__] There's a lot of we [__] A lot of we [__] going on. We did it. We [__] did it. Yeah, me and Nate almost beat Leon, man. When I slapped him, it was crazy. We got the belt. Uh, the [__] slaps. That was the other thing. He'd hit you with [__] slaps.\n\nIt's crazy. I didn't I never thought about the cuz his punches were like I didn't know they were 50% like that where it's like you just can't breathe because he went full he'd tire himself out. Exactly. For sure. So, he's putting a pace on you that you can't keep up with and he's not hitting you at full blast. Like Nick would throw kicks like for fun. They were silly kicks like they didn't they were never going to hit you. He would throw like he would pretend to throw like a wheel kick or throw a high kick. He wasn't even trying to hit you. He was just trying to put something in your face. Put some in your face and then let it you know that he's so relaxed in there with you. He'll throw silly kicks at you. Yeah. And just beat you up. I might go to that New Orleans fight. I think uh Poirier is fighting again. Yes. Poirier is going to fight Max Holloway, right? That's a hot one. That's nice. That's the last fight of his career, right? Uh-oh. That's in New Orleans. Maybe exactly.\n\nWell, Poirier's got he wanted one more and he wanted a legend so they got Max. Max Holloway might be the number one guy for fights in the stands. Oh, really? Really? All the He's Hawaiian. Yeah. They they go they love [__] fighting. And you're always in the 300s. Think of the jeans. They give them a couple [__] Coronas up there. Here's some whatever they like smuggled in little airplane bottles and then like, \"Oh, you [__] [__] about talking about\n\nHavland is terrifying. The ancestors of people that had the balls to get out in the ocean, get out in a [__] homemade boat and make it across the ocean. That's what I was hoping I had Viking, dude. I thought just a farmer.\n\nJust a farmer. Billion years going [__] coming in.\n\nFarmers only.\n\nWhat a crazy dating app that is. Farmers only. I know. It basically means whites only. Yeah, they should have just gone. That's all that is. How do you say it without saying it? Not all black farmers unless you're talking weed. I got good news and bad news, daddy.\n\nI found a farmer. His name is Tyrone. He grows weed. It's only watermelon. I don't know what the hell\n\nof a crazy drinking. Is it crazy that delicious food is racist? Chicken, watermelon, they're both great. I love them both. It doesn't work with any other race. You can you make fun of Italians for pizza and no one Irish potatoes. No one cares. That one's super sensitive. Fish and but the thing is it's also foods that everybody loves. They're both delicious. They're the like how how did that happen? Well, like if you bring up fried chicken and black people, you're a piece of [__]. But like, doesn't everybody love fried chicken? Chappelle has a bit about it. It's the best. He does. It's a great bit. No, I was talking about fried chicken. I didn't know. You ever go to Gus's in town? Gus's fried chicken. Oh, it's so good. I try to genuinely actually avoid fried chicken fried chicken. I grew up on Popeyes and it'll weigh you down. We used to get Rosco's when when I was in LA. Rosco's chicken and waffles. Oh my god. So good. What? Butter and the syrup and then you got the hot sauce with the chicken and Oh doggy. Oh, that's good stuff. It's so good. Diabetes. It's coming. But not today. Not today. Today it's mouth pleasure. I was, bro. I thought that diabetes was coming. Yeah, but you're not. I got that [__] way to Well, I was like, I got to at least be pre-diabetic. No, you got those [__] Irish genes, son. You got the full ride. Do diabetes will do [__] nothing. Nothing. You know what'll get shut off? I'm in your wife's DMs. You know what'll get us is the gout. The gout's coming for us. When I heard the\n\n\nCause of fatties, isn't it? No, no. Kyle Canane has the gout. No. I think it's a boozing thing. It's a boozen thing. What causes gout? Meat. It's the king's disease. Meat. But what is the real meat? This sounds like No, it's like literally all I eat. Uh-oh. I eat 90% red meat. Wait, wait, wait. Are you sober? Yeah, dog. For 3 months. Sober from alcohol. Yeah. Be clear. And according to the law, everything else and nothing else today. Gout, known as a disease of kings, is a type of arthritis characterized by painful swelling and inflammation of the joints, often the big toe. Ow. Caused by a buildup of uric acid in the body, leading to the formation of urate crystals in the joints. Linked to lavish diets and alcohol consumption of wealthy individuals, including royalty. I would guarantee you it's the alcohol and not moving. Yeah, it's not—it has nothing to do with meat. Tell you what, the first time I saw that description, I went right to crystallize my joints. Wait, are you going to church, too, or is that [___]? I have been to church. Uh, [___]? Why? Have you ever been to church before? I've been. It's actually very nice. They're all just trying to be better people. It's a good vibe. Why don't you go to a Catholic church? I tried that. I did that. I went to St. Pat's in New York. Got married. Nice. Some guy gave me a rosary. I keep it. If it's not Catholic, what? Which one is it? It's just a Christian church. A non-denominational Christian church. Yeah. All this [___] Joel Osteen [___] Yeah. I'm just giving all my money to religion. Animal protein such as pork, red meat, shellfish, and oily fish are high in purines, making an individual susceptible to gout. There you go. Huh. No shellfish. Additionally, alcohol reduces the metabolism of uric acid, enhancing the disease condition. Oh, right. I guarantee it's the alcohol. And we're getting a steak tonight. Drink all day. The alcohol [___] lobby probably said, \"Yeah, it's the meat. The meat, bro.\" It's just like they did with sugar. You know, the sugar lobby's like, \"Actually, it's not us. It's uh saturated fat that's causing all these heart attacks to happen.\" All yeah. It's a long con. It has nothing to do with us. It has nothing to do with a vacuum. It's a long con. You're getting cancer because of CO. It's all the CO. Gotcha. Now's a new strain. You see that? Yeah. Of what? CO. Come on. You're lying. It's a new China. There's always a new release mixtape. Yeah. Beastie Boys lost mixtape. Rick Rubin. The CO hasn't been good since 2019, dude. They fell off. They got a new producer. Oh, really? They got a new producer. Better beats. This one gets the kids. This one only gets kids. It's catchy. With the kids. They're calling it the Fauci. Kids was a big one. They always threw kids at you to make you like, \"Oh, I guess we have to take care.\" Yeah. Got to take care of the old people. What about grandma? What about grandma? I saw someone on Twitter saying, \"You literally killed my mother\" to people who were out there doing shows. Less than 20. Oh, less than 20. All right. We're back, dude. 20 cases of the new variant in the US. That's how it happened in Seattle. Remember you heard about the guys or at Portland? Where was it? The first cases in the United States of what? Somewhere in the Northwest. Someone had come over from China. They gave the Wuhan. They they gave it over there and that's the first cases. And and those people don't got no sunlight. So they they got zero vitamin D. They're susceptible. I hope that monkeypox joke worked in your storytelling show. Look at this. Look how they describe this. Look how they describe this. It was really—it was actually really funny. We were all like talking about it afterwards. Yeah. Like it's so silly. Described this as a slightly upgraded version about it. That was really funny. See? Upgraded. A slightly upgraded version of the variant that's prominent right now. Oh god. Subhash Verma. Somebody at the mothership. Person is bred to be a scientist. Ron got the COVID recently. He got the COVID and was wack for like a week. Really? A week? Wack smokes 20 cigars a day. Easy. Inhales cigars. He got the vax too. He got the jab. Thank god. It would have been way worse for him. Isn't that a funny thing? The thing—it could have been worse—is so my sister flipped her car once when she was in high school and she was totally fine and um totaled the car. The cigarette lighter was the only thing salvageable. She was fine. Wasn't wearing a seat belt so she was on the roof of the car and we're all like, \"Thank God you weren't wearing a seat belt or it could have been worse.\" Like they always say, \"Well, you ever see guys get flown out of the car and they live and the car flips 30 [___] times and they live cuz they got thrown.\" Never heard of that. Isn't that a saying too? Like an urban myth at least that uh if you if you're like hammered you get in an accident you're like relaxed so I've heard that yeah he's fine. I've heard that yeah it's the same thing as people falling. Oh, there was somebody on my—on this—not happening this [___] Irish Chicago guy I forgot his name—Sullivan something—but he was listening to Hugh Lewis. Walked off a building and the nurse was like—the nurse was like—the only thing that saved you is did you not know you were falling the entire time? I was just walking.\n\n\nWow. Oh my god. Damn. All right, Ari. Let's bong a [__] bong. There you go. It's about [__] time. Feeling these envies though. I would be getting the yawns. The only reason I stopped the booze is because I wanted to see what it would be like to have no booze for a long period of time. Yeah. And it's a lot better. I mean, you feel a lot better. Don't you get bored though at night? No, I thought I would. That's the thing. Like I have fun doing stand-up. I have fun hanging out in the green room. Yeah, but you're also not like acting. Well, when it comes to no booze. Yeah. Dance at the improv. Jamie, you're so cold, dude. He goes, \"I stopped smoking weed.\" Everyone booed. He goes, \"Oh, I mean, I'm still doing vapes and stuff, like, it hurts my throat.\" What flipped you? What was the final switch? Well, I wanted to talk, fall down. Well, I just got tired of [__] feeling like [__] when I would work out the next day. The hangovers are real later. It's real. It's all [__]. It just—you're just tired all the time. It's like it beats you down. And if I was doing three nights a week at the club and then—let me bong this beer. Yeah, exactly. Bye bodega. Got his 29-year-old metabolism.\n\n[Music]\n\nSo cold, man. You'll be back. You think so? Yeah, that's a supportive friend. Yeah, I mean, I'm not a [__] problem. We don't judge you for your current situation, but we would love to have you back. It's just one of those things where you stop doing it. You're like, \"Oh, I feel so much better. Why was I doing that?\" It's also like, at this point, like who gives a damn? So don't drink. See, I have a different thing. I go—I'll go like four or five days. Yeah. Typically, I try to get four or five days off. By day five, I'm going, \"Let's go.\" I know. I'm getting [__] wrecked. Same thing. It's not even like—Yeah. You can't just have one beer and then another beer. You regret it the next day, but you're like, \"Well, the next day you go, [__] it. I already threw away those five days. [__] ride it until the wheels fall off.\" Like, I had a good time drinking. Don't get me wrong. I like it. Yeah. Oh, it's just I don't like what it does to your body. Yeah. I mean, it's always done that. What did someone say? Someone had a great statement that it's like you're paying for tomorrow at a high today. I think I was listening to your podcast when I heard you pay for today what tomorrow costs—for one hamburger today. That guy, the Popeye guy. The guy was addicted to hamburgers. He had no money. Wimpy. Yeah. Who the [__] is this? Wimpy's burgers. Oh, Wimpy's big. It's just a guy addicted to burgers. He was a comic. He died. He died for burgers. Yeah, five guys killed him. [__] [__] I know, bro. Those old cartoons were crazy. Oh, don't get me started on the racist ones. Oh, they're all racist. \"I will gladly pay you Tuesday for a hamburger today.\" He just wanted burgers.  Also, you ever see the stories of blow on the set of Popeye? Huh? The blow on the set of Popeye. The movie *Popeye* in Malta. They were shooting in Malta so they could be away from the studios, and they would send film cans back and they'd send the empty film cans back full of cocaine for the set because they wouldn't check through the film cans. Oh my god, that's so crazy. When *Popeye* came to Malta, the film was full of cocaine. They had to be like, \"We're going to do something wild.\" Of course, he's not even in character. He's coked up. He's got one eye closed. That's funny. I've made that face. Every single time I've ever done cocaine, I go—You couldn't escape it. They were actually shipping film cans at the time. Film cans were sent back to LA for daily processing. This was shot in Malta. And we found out the film cans were actually being used to ship cocaine back and forth to this set. Everyone was stoned. I don't know why they're saying. What a lame way to talk about blow. And what a bunch of dorks. It makes sense because Shelley Duvall, she went through that and *The Shining*. How did that lady survive? Well, have you seen her now? Oh, she did. Yeah. But she died before. Wait, she died. And then Mark, you were saying, what were you saying? She was ugly before she died. Is that beautiful? Is that what you were saying? Son of a [__]. I love—How many memes are there of [__] Jack Nicholson with the axe coming through the wall? You know, \"Here's Johnny,\" like inclusivity and then trans women on dating apps. I don't think I said this, that was on the thread. There's so many of those. Like that one scene with Shelley Duvall in the bathroom and the axe is coming through. \"Here's Johnny.\" That [__] rocks. That [__] movie was crazy. Slow build if you rewatch it. Slow build. It's really nice. It's a really good movie to watch. You know what's crazy? Aesthetically pleasing. Stephen King didn't like it. Kubrick—King didn't like that. Stephen King doesn't like anything cool. He likes—He likes Salem's Lot a lot.\n\n\nTough follow on Twitter. He is mean. He hates the coolest dude. It's fun. He's zigging everybody. Well, he got a guy hit by a bus. Did he? He got hit by a guy driving a truck not paying attention, and he was walking on the side of the road and he got clipped and broke like every bone in his body. I'm not laughing at that. It's just a funny way. Oh, he was hospitalized for a long time. He got clipped. He got really broken apart as an older man, you know, not like as a young guy where he maybe could recover. How hot is it in here? Not hot at all. It's so hot. It's Jamie's fault. It's America. Is it? Is it not hot? 72. Let's go. 72 is a little high. You know, 72 is a little crazy. You all right, Ari? 69. 69. The devil. Oh, you had it set at 72, Jamie. That's unforgivable.\n\nJamie, girls like it warm. They like it warm. Yes. Oh, yeah. They love it warm. Interesting. If it's up to a girl, she'll go 75. Easy. Hey, Bush is going to sue you. You're legitimately hot. Bird Crush is going to sue you. I wish you weren't doing that. That is a bad look. Awitz 2025.\n\nHe did that for the thing. It was good for the survivors. Exactly. It was not. I'm legitimately. Oh, schmvitzing in here. That's going to be better now. That'll be you shirtless doing that. I am hot. Well, Jamie, I mean, it's obviously the stuff. Jamie, can you bring up uh Michigan taking the field against Ohio State? I think Joe's actually going to like him, and I think he's going to respect football when he sees it. Let's go. Joe does not respect football. Let's go. I do respect football; I have recently come around. I don't approve of the CTE. Yeah, it's not good.\n\nHorrible CTE. It's like myself. It's like us. You're both awful. I got to touch a CTE myself for sure. It's. You don't escape it. They tested high school kids. They have CTE. Yeah, I'm a little worried. Yeah, you should be worried. But you got the touch. The touch is good. Little touch makes you a little reckless, a little funny, a little crazy. I got touched. I got touched. J Mo, I know what you're gonna do because I know you're a nasty little. I know what you're gonna do. Oh, you knew.\n\nOh, he got a tackle. Damn it. He got you there. I knew he was going to do it, dude. Does that hurt you? You know where to throw that? That actually did hurt. What a catch, though. Look at that catch right there. Right. Beautiful because that was a third down. I don't know. Airplane.\n\nHe was ready. He had that geared up in it. Looks like a movie. It looks like a movie. What I sent Jamie yesterday. You want to get mad? Yeah. Let's get mad. The LA Fire Fund, you know, they had this big show, big fundraiser. They raised $100 million. Wait till you find out where the money went. It is. It's James Lee did a thing about it on Instagram. Yeah. And there's been articles written about it where people like, \"Where's the money?\" Uh-oh. This the way they distribute the money is so crazy. You're going to read this and you're never going to want to donate to charity again cuz you find out what charities are really what a lot of these like nonprofits are really about. The lady running the charity that got the money makes almost a million dollars a year. BLM. Me too. This a bunch of. It's all but it's all everyone's like, \"Well, let me get let me get a taste.\" Lady, listen. I watch this. I looked into it a little bit. We'll watch it. But I what what they say though is that within the first month they distributed half of that money. Hold on before you press play on that guy with a fishing hat is not a reliable. My number one source of news getting, and then he's trying to he's trying to blame the Annenberg Foundation. That is one of the richest families in California. They have they're worth so much money in this. Wonder how they got money. I mean, it. Doesn't matter if liberal ass Jamie. Ohio State paying liberal ass. How about just play the video? How about play the video and let everybody figure it out for themselves. Let's platform this guy. Yeah, play it liberal. Jesus might be one of the biggest scams in disaster fundraising history. And as usual, I'm bringing the receipts. First off, according to reports, the fire aid benefit concerts raised over $100 million supposedly for LA fire victims. But since then, residents have been asking where did all the money go? $100 million raised for uh residents community things and funds that are supposed to help with. And there's no accounting. He played football. Let's figure this out. So according to the fire aid website, it says that all direct donations will be distributed under the advisement of the Annenberg Foundation. According to the IRS 990 form, the Annenberg Foundation is a 501c3 based in Kakan, Pennsylvania. I live there office building. One massive red flag is that only 33% of their annual expenses goes towards actual charity programs. The rest goes to administrative costs like executive compensation. Look at the numbers. They treat you pretty good over there. Starting with Top Dog Cynthia Canard, who's making 3/4 of a million dollars plus another six figures in bonuses, which basically almost seven figures just for one person there. Here is Cynthia aka Ciney hanging out with Gavin Newsom discussing or strategizing about like\n\n\nHow to solve wood. Both of them. Uh, anyway, just to give you a point of comparison with another nonprofit, Doctors Without Borders, they spend almost 90% of their money on actual programs versus less than 1% on administrative costs. Local journalists have also been asking, \"Where's the money?\" They found, quote, \"The fire aid website names only three Palisades organizations that receive grants among almost 120 organizations listed as receiving.\" Couple Jewish ones. You see who got the money? Couple Jewish ones. Hold on, let me read it. Why'd you stop? Because he focused on the Palisades. We'll talk later specific to Pacific Palisades. Those three are Cahel Israel, Chabad of Pacific Palisades, and Palisades Charter High School. Scorpions tried to directly reach out to the Annenberg Foundation. They were kind of given the runaround, various extension numbers. Somebody saying they would call them back. No one called back. Also referring to some mysterious man named Phillip. No last name. He was never found. This is just crazy. So essentially what they're doing is taking the $100 million, then paying themselves roughly 70% of it. Wow. And the rest of the money they're dishing out to various other nonprofits with their own administrative expenses. And that's how $100 million just ends up disappearing. Wow. Benefit. Maybe he's telling the truth. Maybe he's exaggerating. But at the very least, this does what the NFL does with the cancer research stuff. 70% goes to administration, 30% goes to the actual cause. These nonprofits, that's crazy. Yeah. They're for their own profit. Well, it's just a loophole. It's a loophole. They found a loophole to make a great living by being virtuous, and then they see a fire and they're like, \"Sick, we're all getting raises.\" Well, all we're saying, Jamie, is that this guy is saying that 70% traditionally goes to administrative costs, 30% goes to the actual problem. That's for allies. But if right, that is for all charities, for a lot of charities, but not Doctors Without Borders, which is one of the things that he brought up. He just picked one though, pairing you this stuff to he's like, \"I'll pick a charity,\" and this he picked probably one of the worst ones. You know we've gone over the charity stuff many times. There's good and bad charities. There's good and bad charities, but the point is that this $100 million you're saying was distributed to a bunch of different places, not just specific Palisades. Looking into it, $100 million was a number that got used in advertising to make everything look big and look good. Probably, I was, my part, I was trying to say, too, assuming that it is a hundred million. There's a bunch of companies and a bunch of like artists that said, \"I'm going to pledge a million. I'm going to pledge a million.\" And you have to go collect it all. You don't know if they all will send it in. Oh, you know how many times I pledged stuff? I pledged a million dollars to Notre Dame's NIL. I haven't done one single by yourself when you in your apartment. No, I was at the [___] championship game watching Ohio State win, and I was going, \"Notre Dame needs a d-tackle. I'm going to give him a million bucks.\" For real? Yeah. And then uh, they were like, \"Hey, you want to give us that million bucks?\" I was like, \"No, a pledge.\" Is that legally binding? It was a pledge, JMO. Well, that's isn't that the weirdest thing about colleges? Like how much money colleges get in donations from people that are like really wealthy that used to go there? Yeah. Yeah. I didn't even go there. Didn't go there. Like a big thing with college to win before my dad does. That's why these college kids are getting money now. It's kind of crazy. I talked to one at Bartow in Chicago. He's played Indiana center, and it's like, \"How much per year?\" He goes, \"300 grand to transfer to Indiana.\" Oh, that's for a year. Notre Dame. Pat Kugler. What? He transferred to Indiana. He he was from Notre Dame. And it's just like that's a good living. I don't have to go into this for my life. I'm going to take my degree and like actually doing that for those kids forever. 100%. They're making money off of them forever. They're sold out. The only negative is you can't have a player for four straight years. Yeah. There just needs to be regulation on it cuz this now that now they're letting them pay players. So now it's just the [___] Wild West. They got to they got to make they need to do that [___] for the Olympics. They got to let them make a four-year pledge. Even then, it's the big schools are all going to get all the best players. Olympics, they don't get nothing. Olympics, they get zero. Everybody else gets rich. Get beat up by a man that can happen. Enrolled in that woman's boxing. Some broad getting teed off. You you said that they were wrong about that one, and now new info came out. What's your I thought you were like, \"No, that's actually not a trans,\" that's a different they were thinking there was a lot of people that were saying that it wasn't really a man and that it was just some woman with an issue, like some sort of medical issue. The medical issue is testicles and an XY chromosome issue. XY chromosome and testes. Apparently, internal testes that don't drop. It's like a condition that some males have. So micropenis, internal testes, whatever. Big call it big. Dude, it happens to guys. It's fine. Come up with the pills, you scientists. Fix it. They ain't fixing [___]. Except in China, they're CRISPRing the [___] out of those dicks. Making a big juicy dick. Good math guy with a big dick, dude. They're all going to be issue, man. Long dividing and then [___] banging your lady. You go, dude. The [___] was that guy? Oh, yeah. With\n\n\nCCP hat on, show your work. Man, I got to look into this crisper. I never heard of it. I got to do it. Is it too late for us? I think it's too late for now, but in the future, yeah, we're fine. Damn. But not in the future. In the future, they're going to be able to gene edit people that are alive. Right now, they're doing it to like fetuses. We got to go back in time and then shoot my dad up with the stuff to get me the real Viking jeans. Yeah. Come back. I wish I had. We do a Protect Our Parks event 4 months from now. R's 150 lbs heavier. Hi guys. He's just gigantic. Giant hog.\n\nHe pulled the balls out last night. They don't look like a human. Huge balls. They dick. A big horn sheep. You ever seen a big horn sheep's balls? No. They're ridiculous. Pull them up. The first time I saw a big horn sheep, my friend Steve Rennell is like, \"Look at his balls. You need to look at their balls. It's like they're extraordinary. They're like church bells.\" Like giant balls each other in the head. Oh my god. Elephant Titus. Giant sacks. Wow. They all have giant balls. Wow. Can't be running with that. Looks like a big puss. Looking them up. There was no one's got a problem. The black one. You can't tell what's AI anymore, man. You really cannot. It's all over. There's no way to tell. You got to go straight to the comments and hopefully people pointed it out. I got tricked by one. I was embarrassed and you it and it's like I'm a guy. Some hot ass sheep came to the bar. Oh yeah.\n\nUh, no. It was a video of Trump giving a speech, but they altered what he was saying. Yeah. Yeah. Yeah. And I watched it and I was like, \"No way, God. Damn it.\" It was not actually really funny. It was like uh something about gay people. I forget. It was like really funny and it seemed like something he might say.\n\nThey're like nice. It was close. But it took me like 3 minutes to be like 3 minutes is long. He wouldn't say that. Yeah. Finished coming. But it's over now. There is no truth. There's no video. Let me hear this. I saw this yesterday. Well, I'm going to be embarrassed, but I tricked you, too. Good. Careful note of the work of Colossal Labs, the biotech company, the absolute worst group of people we've got in our country, and it's not even close. I think we'd all be better off with them gone. But, as I was saying, my administration and I have been taking careful note of the work of Colossal Labs, the biotech company that resurrected the dire wolf. If they can bring back wolves, they can bring back dinosaurs. Terrible lizard. That's what dinosaur means if you break it down. But picture this, folks.\n\nVelociraptor mounted border patrol agents. They'll rip your head clear off. Pterodactyls patrolling the skies. Velociraptors on the ground to prevent the immigration apocalypse. We may have to counter with a dino apocalypse. Folks, it's true.\n\nBut I mean, you watch something like that. While you're watching, you go, he might have said that. Also, Trump's so wild, you just never know. You never know. Oh, didn't he post something the other day that Biden was assassinated and they used a clone? Whoa. God, I hope he did. Didn't that like Truth Social, didn't he post something like that? Some wild thing that somebody posted? Biden, this isn't even Biden cuz he had a bunch of plastic surgery. He got his face pulled back like a lizard. Do you know what they're actually doing with the Forest Department? Every email they sent that mentions biodiversity gets bounced back. What does that mean? They are so against the word diversity that biodiversity those emails are not allowed to be sent from company emails. Wow. Yeah. Did you see his Edward thing? Protect the Parks. Go Trump. Look at this. This is You might Trump shares unfounded conspiracy theory claiming Biden was executed in 2020. Holy hell. Oh, who is he debating then? Who did it? Stairs. That is so ridiculous. But who is he debating? He thinks he was What do you mean? He debated him in 2020. Oh, he debated a different guy. He's like a clone. Yeah. Not really Biden anymore. Yeah. The one he kind of lost. I bet he was like clone showed up. It doesn't seem like that. Well, there was that time that the tall Biden was at the White House. That was crazy. That was crazy. There was a Biden that was like six inches taller than Biden. And they have makeup. They can do things to people. They can make you look like Biden. They can make you maybe not you, but like some people would not not so long a face. Yeah, Baron was he 6'8\"? Baron would stand out. He'd be too tall with a long face.\n\nDon't be depressed. Don't be sour. I know we're pulling you out. I'll never forget. But you were a great president. You were like Lincoln. This is way off topic and you guys aren't going to think it's as funny as I do, but one time my family and I, we were out to dinner at Horses in Mechanicsburg and the waiter came over and goes, \"I got a joke for you.\" We're like, \"What? What is it?\" He's like, \"A horse walks into the bar and the bartender goes, 'Why the long face?'\" and my family and I erupted laughing for like 20 minutes.\n\n\nWe became like, we can't stop laughing about how good that waiter was.\n\nOh, yeah. And uh, yeah, it stuck with me my whole life, and I knew when I started telling that story, it wasn't going to be good.\n\nThat's literally the joke that I said to him. I know. I know. That's what it reminded me of. Yeah. But just that, that's just that whole like, you know, when you can't stop laughing. Yeah. Pull up the video; that's all Biden. Jamie's been there. What is Horses? It's a tough one for me. Do you restaurant? You like horses? It's like a lower-level, um, Sizzler-some reference. I can't remember. Yeah, the wheels are off. The wheels are off, bro. Chili's. The wheels are off. Sure. Cracker Barrel. Whatever. I'll go to a Chili's any day. There's a salad bar at Horses. Oh, you know. No one touches it, but they do have nachos and melted cheese. You go. There you go. I'm going to go to the salad bar. That's a central melted cheese. Salad bar's got that diced ham. You know those little cubes? Yes. How you talking my language? The Pittsburgh salad. You know what the Pittsburgh salad is? Is that where you [___] on a guy's chest? It's just fries with some lettuce on top.\n\nOh, wow. That's fun. Pittsburgh people are fat. Fat. Pittsburgh [___] rules. That's a great city. Underrated city. Every fat city is the best city. They know how to party. I love him. What's another fat one? Cleveland, Buffalo, Cleveland. Great Lakes. Look at this. Look at tall Biden. Look at the size of him.\n\nBro, look at the size of him. He doesn't look anything like Biden. Shane, we were there. Look how tall he is. We were right there. Towering inside windows. Towering over his wife. Like, what is that? Wow. Biden's dirty. Like, what is that? But damn, that's weird. Shane went to the West. I think there were times when we had—he had some complications and brought in another guy. Yeah, I think so. Yeah, I think they've probably done that before with people. Roosevelt, apparently. Yeah. Who was I—should I kind of—who was telling the story? Was it here that they were telling the story of uh, Obama was sitting there talking to one of the people that he worked with, and then they removed the mask and he realized that the person who he was talking to was not the person he worked with, and they were showing him how good the CIA masks are. Oh, it was green room conversation. Someone was explaining in the green room that they have the CI—might have been me. It might—You don't know. You don't know. You don't know about that. You're a reference of a name you've never heard of. Like, so why do you think he went to uh, Seattle in 2016? I'm like, I—Who is Ed, bro? And then he'll hit you with five more in a row before you recovered from the first one. Oh, the picture you took of me. He's a big—Why are you getting trapped? Because I love Mezer for two decades. And she's like, I'm in it. You need a break after the best. He cornered me at Terry Black's the other day. I was in the corner. I was sitting next to Terry Black's. He was like looming over me, and everybody else was having their own conversation like, hey, help me. Hey, molesta with headlines, the massage safe word, Epstein. Oh yeah, bro, he just hits you with like five, six conspiracies in a row that you don't know about. You don't know what that Cleveland—\n\n36—What happened? What happened? You know citizenship was just an experiment gone wrong. What? I think it was a part of that program. Yeah. Yeah. It was the South Africans. Yeah. Programs. All part of programs. That's what happens when you grow up in a cult and you think everything's a cult when you get out. Like, everything's a cult. And then he starts working for Jimmy Dore. So he like finds out about real conspiracies. Yeah. Matt's got his first birthday like four years ago.\n\nLife eyeballs. Enough's enough. When he looms over you with the conspiracies, it's like he's not even a real person. He's like a cartoon. Oh yeah. He's like a guy in a movie. There's no guy really like that that just traps you and hits you with 50 conspiracies in Kurt Med. He'll get you. When I have him on a podcast, it's hilarious. Is just like wind them up and then hold on—hold on—the first thing you said—the first thing you said—let's go back—let's go back to that like, what are you talking about? Like, what did they do in the Pacific? Then what—who did it? They sunk a ship. What happened? Jesus Christ, dude. Oh, you don't know. You don't know.\n\nI don't know. How can you know? How do you know all these [___] things? Oh yeah, that's it. When they put up the Epstein files, he's the guy who reads the 60,000 pages. Yeah, instantaneous jerking. Yeah, he's doing other things on the side. He's playing chess, jerking off, reading the stuff. So weird, too. He started in black rooms.\n\nHim and Big Jay. Yeah. Wow. Black rooms will have you when you're like a shitty young comic. They're like, we don't care. Come on. Yeah, they love having a white guy. There's—there's dudes that are just joke machines. Mezer is a joke machine. Like if you got him in a writer's room, he's a machine. That's—Dude, Miss Pat got me a spot in Atlanta once. Was down there for something and she was like, \"All right, go.\" And the show started at 8:00. I got there at 7:30. Doors are locked till 8—till 8:45. Like, and then I go in. I'm like, \"Hey, Miss Pat, Samuel, like we got you.\" The MC does almost an hour. The MC did an hour. Yeah. And then he goes, \"Ah, y'all. Billy from Iowa. From Iowa. You're Billy from Iowa?\" Oh, is that me?\n\n\nWhat? A pure death. It sounds like it. Ari Shaffir. Billy from Iowa or something. Close. Close enough. After an hour. Yeah. Eight dicks in front of my manager at the time. Oh my god. You invited your manager to the black room down there? Oh yes. Fired up, dude. This [__] makes me laugh. What is it? Cameron. What were they talking about? I I posted this on my story. It's the It was a little hungover, laying in bed, and this was killing me. How funny this is.\n\nStart. Can you start from the beginning? Yeah. Diddy trials named the Punisher came in there yesterday. I was watching the Diddy trial. Some guy came to name the Punisher. Boy, back in the days, murder. The Punisher. Who was the Punisher? Was it security back? Who's the Yeah. Oh man. Did you ever see Meek Mill talking about how Suge Knight used to put handlebars on guys? No. That's horrific. Meek Mill said some crazy [__] about Suge Knight. Suge Knight put handlebars on dudes. That'd be funny if he put a helmet on, too. [__] the guy. Why are they Why are they all [__] each other? What's going on? They're homosexuals. Power move. It's about I think it's about Yeah, I think I tell you what, I never thought of it like that.\n\nI think Ari's got it. Ray J. Oh, it's Ray J. Oh, huge D. Okay. Why do I think it was Meek Mill accuses Suge Knight of sexually assaulting behind bars? I mean, maybe it wasn't Meek Mill. Maybe it was. That's a different video. I've seen that. Yeah. No, no, no. It is. It's Ray J. 25 sticks of butter. Oh, Jesus. Use the butter as anal lubricant. Not margarine. Margarine's bad for you. Not crazy though, bro. That's so crazy.\n\nBut Cameron and Mace are they get together, have fun. They have fun and they forget that they're on. Mike and times have changed. They don't give a [__] They might get off, but times didn't really change. It's just like people have to hide it. And that's why people like Protect Our Parks. Times are the same. And times definitely don't change if you're [__] black dudes from Harlem that or rappers Cameron and Mace. Yeah. Yeah. They're [__] They can say whatever they want. They say whatever they want.\n\nBut are we going to get the dirt out of all the Diddy people? We got you. It's all the [__] are you doing with your chin? I want something concrete, bro. It's Listen to any story, dude. [__] But like JLo, DiCaprio, are they gonna talk? Kid Cudi said Bieber Kid Cudi said Puff Daddy burned his car. Broke into his house before Christmas and opened all the gifts for his kids. Really? Like the Grinch when he was in his house. Hey buddy, I'm in your house. Just wanted to let you open all the presents under the tree. Holy [__] That's insane. That's the funniest thing I've ever heard.\n\nThat's hilarious. Yeah, that's like Ari. Ari might be [__] white D. That's dart the [__] Ari. You hate Christmas. Why he [Laughter] Damn, dude. I can't believe you guys killed him. Oh jeez. Santa. Oh, Santa too. You would if you could. You would if if the Jews got their You're going to burn your beak. [Laughter] Jamie, delete the anti-semitism. No. 55 minutes out of this episode and everyone in the past. Jamie, I'm not trying to add work. I swear, brother. Sorry, J Mo.\n\nVery sensitive on these shows. He needs to be respected, I guess. So, I respect him. J Mo, bong a beer, brother. We'd love to have you. Are you sober, too? Like, gay rogue. You have been losing weight. You look good. You look [__] fit. Velvet. Jamie. Bong one. One beer. Bong one. Yeah, he's actually secretly he's the best guy at bong and beers. I know, right? He does it quietly and then he comes up here and does it and he's like, \"That was nothing.\" Luke Combs. Luke Combs. No one can play. No one can [__] with that. Yeah, that's great. He does it so quick. It's like it doesn't even make sense. How are you doing that? Is that a magic trick though? He just punches the bottom of them straight from the can and two seconds it's gone. You're like, \"How?\" Skill. You can't help yourself. That's a problem.\n\nThere's so many country guys. I can't keep up now. Yeah, it's a big blew up. Brian, Zach really did blow up. Country blew up. Country. Well, it used to be a thing that you would have to hide. People like What kind of music? Like anything except country. That was like the standard thing. They wouldn't mention poker, right? Have you listened to poker? No. I guess I got it. [__] rocks. Go to Western PA. I remember I was dating this girl in the 90s and I had to turn her on to Dwight Yoakam. Like you don't stop all this country [__] Just listen from nowhere. You tell me that's not a good song. You're crazy. Old country is the best. Old country. Old country is great. But Dwight Yoakam almost. That's why a lot of the new guys are good. Exactly. There's a lot of guys doing Old Country. Old Country guitars, Cadillacs, Hillbilly music. That song beer swig.\n\nI mean shit's great. What did Oliver Anthony do? That's that I mean what is that? Yeah. Feels very old. Oh my god. Oh my god. I mean that is like some [__] that's going to that's going to\n\n\nStand the test of time. That song. Oh, yeah. That song's going to be around a long time.  Beyoncé's doing country. That's how popular. Texas Holden. Yeah. Blowing my mind here. She's winning awards. She's kind of turning white. Well, I think what happens is once Jay-Z stopped her, she's like, \"Let me go full wife.\" She's like, \"Man, now she's watching her kids.\" Jesus. Oh, Jesus. I think what happens is the country just swings one way. They want simpler times. Terrified of nuclear war. Terrified of what's going on? What are we doing with Russia? You know, it's a big one. The military enrollment went up. Oh, during Trump, they put out a white commercial. A who? They put out a white guy commercial. They're trying to get the whites. Oh, well, the whites are out there. The Army's back. They're going, \"Hey, come on, white.\" Yeah.  Left trying to get the men. You got to fight Iran. Stop the whole \"Why are we fighting Iran?\" Trans thing in the military. They stopped all that. What? Let them fight. They're scary. I love Dave Smith's point on that. He's like the left is like the left is going, \"No, trans people should also kill innocent people in Yemen.\" It's like you guys are taking the wrong stance on this. Dave Smith. Yeah. Yeah, for it should be don't kill random people at a wedding party. Yeah, bro. How about when Trump tweeted out that Houthi thing? They got those guys in a circle and they blow them all up and Trump's like, \"There will never bomb our ships again.\" Like, I don't have much advice for the Houthis other than stop hanging out together. They literally in a circle they all walk to a truck. Oh, stop one at a time. One at a time. Avoid it anymore. They keep doing it. Every time I see a drone strike, it's 20 dudes walking together. Well, the what the anti-war people are saying is that that's a tribal ceremony that they do; these they get together in these groups. Has nothing to do with the war. Also possible. Yeah. Like I didn't know this guy. Well, you can't ask questions when you're in a drone. It's a terrorist group. Yeah. You just label the green light. Do I get a green light or no? Green light. Green light. Green light. Yeah. And that's been Bush, Obama, Biden, Trump; they just kill anybody, label them later. Well, the amount of people that get killed by drones that are innocents is off the charts. Oh, yeah. Any other any other type of warfare, like it's it's like 90%. Yeah. We got to go back to swords. It'd be nice. Looking at the guy like that's the bad guy. Catch a bystander with a sword. Yeah. Well, back then everybody was a bystander. You know, when they the sword times, they didn't spare anybody. You see, they sent drones into Russia, Ukraine. They hit them on that roof. I've heard about this. Everything I've heard from Russia Ukraine, I've never believed any of it. Who knows? So much on any side, both sides. But the one thing that the Ukraine attack is legit where they bombed all the bombers with the drones. They caused 7 billion dollars in damage in one day. They blew up all these bombers. Oh. And they sent suicide drones to blow up all these bombers that were on these airfields. Suicide drones is such a great term. It's just a bomb. Yeah. It's a remote control, but it doesn't shoot things. It flies into things and detonates. Wow. That's why they call them suicide drones. Yeah. They fly the drone. The drone is the weapon itself. And it's, you know, it's intelligently controlled. And they just fly them into these jets and blow. Japan was all over that. Japan was Oh, yeah. Also drones. That's how they got those guys to do it. Meth. Really? What? Yeah, it was all meth. Yeah, the kamikazes. That was all meth. Oh, really? Get those guys meth up and fly them right into the you know you're meth out of your mind. Same thing with the Nazis at the in the tanks. The tank guys were the guys had the most meth. And the ones who dance at clubs. It's the methiest Molly. Gets you going. Remember the Techno Viking? Remember that guy? Yeah, that guy ruled. Yeah, that guy ruled. There was some guy was being shitty to some girl and he grabs it by the arm. You get out of here. Steals guy gives him a bottle of water and drinks a little water and then he starts looking. Viking dance ruled. Yeah, dance rules. I saw that on Ebomb's world. Can we see that guy's name? Great. I was like, \"Here we go.\" Loved. So he takes this guy. Hey, get out of here. Get out of here. I'm with that guy. I'm going home. Yeah, you're going home. You see this dude? That dude has cardio. For hours and then he has to point at him one more time. Go. You don't want to mess with that guy. That guy's That's the bad guy that hangs in a group. Let it go. And look at this dork. The beta comes over, offers the water. The beta upside down water trying to like, you know, really important. Yeah, but if that's your boy. Yeah. If one of your boys is the Viking guy, chill, bro. I know I got you close to you. And then the dance starts. Give me some music, Jamie. Is that a gun on the left?\n\n\nOf him? Techno Viking in the house.\nHoly moly. He can move. Black socks all the way up. That guy [__] all the dirty hippies that night. No one else is dancing. Yeah, I haven't seen it since I was a boy. Now that I'm looking back on it, this guy's kind of [__] gay as [__]. No one else is dancing. I remember being a kid thinking he was the man. This guy blows. People are walking through. No one else is dancing like him. You don't want to hang out with this guy. Now they're dancing. [__] No. I don't want to hang out with them. Although, oh, there's a cut to the dude who got sent away. Poor dude. Where are we? Detroit. Poland. Poland. Okay. Techno parade.\nThat could be the new name of Protect Our Parks. The fuckade.\nThere really is a [__] parade. 2000 [__] parade Berlin. This is what pride is.\nBoy, I hope they don't all gang up together and fight Russia. Got a crazy weird abs. Oh my god. Uneven. Yeah. Mismatched. A lot of abs are like that. This almost says that could have been. This whole thing could have been staged. They're not sure, cuz it was made by an artist, the whole video. It's totally staged. That totally makes sense, cuz the way he pointed was so performatory. Back to the guy, too. Why would they have followed up on the guy that his twisted sister Jamie always gets into the bond with things? Jamie, you're great. We all love you. Jamie, you know we all love you. Yeah, I know you got fired up earlier. Sorry about. Well, you you start bringing up Ohio. You get his [__]. You get his hackles up, man. [__] [__] ass. He brought up [__] No. Yeah, but you got to let him slide. It's like when you have, by the way, this is classic Ohio State. They won the title and they're still babies. Oh boy, they're still babies. You can get this, you can go, you know, you guys lost to Michigan, they all go [__] you. You guys won't even play him anymore. Oh boy. They won't play us, dude. Whatever. Be careful. Look into that history. You know, Texas, though, Texas plays Ohio State first game of the season, and they won't play them on Sunday night. I did see that. That pissed me off. Yeah, why not? They don't. They don't want it to be a night game. Why? Cuz fans, it's it's a much more rowdy environment. They want a [__] noon. They want a noon kickoff. It's Sunday. It's Lord's Day. It's coward's work. Yeah. They want they want ham over people. That's funny when you have to schedule your games based on how [__] up people will be. Like let's be careful. Let's not let them 10 p.m. game. Oh my god. Joe, you would love watching Michigan walk into Ohio State. Can I see it?\n[Music]\nJ's got the controls. Not today. Only because you asked. I'll show it. So Michigan, who I hate more than Ohio State, did suck this year. They're playing at Ohio State. Michigan has owned them for no [__] three straight years going into this. No, I. Yeah, three straight. Yeah. And uh, it's just nice to watch a team walk into an entire environment that hates you. Let me see it. And that they're just together just walking. I mean, it's. And I hate Michigan. And Michigan's not even good here, but it's nice to watch. But they haven't lost to Ohio State. So, it's like a jit, it's like a great MMA. Okay, here we go.\nOoh. So, wait. They're not wanted. It's only going to play 20 seconds, though. That's all right. When it shows the stadium. Damn, that's quite a stadium. Wow. Imagine being one of those guys. Imagine being one of those guys about to play this game. [__] CTE. Let's go. Yeah. [__] CT. Let's go. What do I want to be smart when I'm [__] 70? Who gives a [__]?\nIs this it? Is this it? That is Ohio State of. Watch this. Let's play this too big for. I want to hear this. I want to hear this when they get onto the field. They need four wins to restrict a crushing end of the season. This is step one tonight. Oh, this is not the Michigan game. That's Tennessee December game in this place that's been fired up years. Here's how I felt coming in. First ever December game. That's when Ohio State turn it around. What is first ever December gaming? They just added the playoffs this year. So there's never been games this late. That's exciting. Oh, we're doing this. God, this is amazing. Enter Sandman. Virginia Tech. Miami. We did last time. We did it. We did that already. We got some good entrances. Hold on. We got some good entrances. Sandman's the greatest [__] the greatest beginning of a game song of all time. [__] I'm trying to think of some good entrances. It's. Metallica just played. Metallica just played Blacksburg. They played Virginia Tech Stadium, bro. How about when they played Berlin after the fall? Is that right? Oh my god. There's like no Moscow. That's right. They played Moscow. Like a million people. We watched that. We watched that. It's the most insane concert you'll ever see in your life. You need to see it, right? Ari needs to see it right now. Ari's definitely seen it in seat, but he needs to see it right now because right now after that, you got to show Billy Joel in USSR.\nWe saw that as well. It was a punk. Have we ever played Led Zeppelin Jump Around Wisconsin? That's a good one. The sound isn't as good as you need it to be. What\n\n\nAbout there's an Ariana Grande concert in London, Manchester. You imagine being in that audience.\n\n[Applause]\n\nWoo! Look at that crowd.\n\nDamn. Is this Berlin?\n\nIt's Blacksburg, Virginia. They're about to watch some mediocre football. The Yokis.\n\nHey, White Bam members. Woo. I'd love to tell you I didn't watch this earlier today. Oh man, this is the coliseum.\n\n[Applause]\n\nOh, you got to run there.\n\n[Applause]\n\nDamn. What a song. America rules.\n\nWhat are we talking about? Of course, people walk here from Guatemala. Dude, if I saw Wisconsin going this crazy and I lived in Guatemala, I would go walk. I'm going across that t-shirt. Extra bottles of water and I'm making it across that desert. Yeah, that video. So, that video we just showed has 65,000 people in the crowd. The first one we watched for the high stadium and this place here is double.\n\nHoly [__] This is the Big House. 70,000 now. Holy [__]. You know, I was supposed to perform there this year.\n\nYeah.\n\nReally? Me and Zack Ryan were in Michigan Stadium and uh they said no to me, but then they cut you back on. Well, Notre Dame got me.\n\nOh, that's\n\nYeah. What the [__] What did you do? I have [__] some stuff.\n\nSaid a couple digs. Come on, man. Guys are joking around back in the day. I didn't mean it. Um, let's play uh let's leave with uh Russia. Do enter Sam in Russia. Oh [__] Don't. That's the [__] Don't do it. Do we want the size of the crowd? No, it's just the No, this is America giving it to Russia. This is America going, bro. You want to see what's good? Look at the size of the crowd. This is Moscow 1991. Look at that crowd. Holy [__] How many people is that? Helicopter right over it, bro. It has to be millions. Said it's over a million for sure. Why is that helicopter right there? That's the end of your empire. Yeah, for real. You go look at this. We're all poor. This is Putin saw this and goes, \"I'll be back.\" Yeah, kind of sick. He came back. Kind of sick, right? He's in the KGB at the time.\n\nNah, Moscow.\n\nFuel.\n\nOh [__] Look at that crowd. Jesus Christ. Can you imagine being on that stage with that energy feels like?\n\nNo.\n\n1.6 million. Oh my god. In the crowd. Oh man. And it's like Sunset Club. Some suggest up to 2 million. 1.6 million in the crowd. That's so crazy. You do one show, you retire.\n\nYeah, they didn't. How was the paycheck, I wonder? Oh, it must have been in rubles. Yeah, it must have been nothing. You get five potatoes and your life. You get to live. We are not going to kill you. So, congratulations. Long-haired gaze.\n\nAll right. Wait. I know. We're trying to play it out. This is crazy. Keep it coming. Keep I don't want to go home.\n\nNo. J Mo. Woodstock 99. Corn. All right. We really hit the bottom here. Hold on. Corn. Trust me, daddy. Trust me, daddy. I hate corn.\n\nThat's nuts.\n\nOh, they need this. Protect Our Parks.\n\nDamn.\n\nI mean, this must be no experience on earth like being Hatfield on that stage. There's no experience in on Earth. Also, there's no coming back.\n\nYeah. What do you mean? Have you seen that? You go.\n\nYeah.\n\nWhat's the Asian guy who does the biggest song in the world? Sorry. That guy when he comes up from the stage. Just trust me on Woodstock 99 corn. Look, you're allowed to not like corn. I didn't really like corn until I saw this video intro. I trust you. You wouldn't never throw us a bad one. I wouldn't do this other than that bulldog video that never got brought up. Trust me, [__] up with the Ohio video never got brought up. Here it is. Just All right. All right, I saw some tips. You're allowed to not like all the skanks fans. Look at the jugs on Jig Jigle.\n\nBan flags, not Israel. This pre-911. This was on pay-per-view. Oh, [__] That guy's full hood.\n\nI remember this song from my youth. I think the idea here, keep an eye on the crowd, right? Yeah. When the And also, you know what got me was break yourself. The lead singer's face when he walks out and sees the crowd, he gets it. Like you just watch a guy like take that energy in.\n\nThis is a weird time in music. Like rock rap.\n\nYeah.\n\nDMX played earlier in the day. Okay. Kid Rock, Limp Bizkit.\n\nOh jeez.\n\n[Music]\n\nOh my god. Oh my god, look at that crowd. That crowd, bro. That crowd's alive. Yeah, that's crazy. That's a living organism.\n\nImagine being an alien and you come down, you watch this, you're like, \"What the [__] are they doing?\" The pinnacle of their existence seems to be giving yourself CTE in front of a million people. Yeah. Headbanging.\n\nAnyway, that one got me going. That's fun. That was the '90s, baby. What was the last one that we wanted to do? Was Gangsta's Paradise. Style that jump out of style jump out for the win. Did he have any other big hits other than that? No, he faded away. No, he had one other big one right right off that one.\n\nReally? Yeah. I kind of remember it too. Norman ready to shut him down. Wow. I thought he got the giving the\n\n\nMan, his flowers, as the kids like to say. Oh, my bad. I thought it was like him. He went to a psychologist.\n\nScop. Here we go. Oh, the festival. It's just for him. This isn't it, is it? That's not it. No, the one when he pops out of the floor. I thought that was like the Asian one when he comes. He comes flying out of the floor. This is it. The Malena. Watch this.\n\n[Applause]\n\nOh my god. Oh my god. That rules. And he goes right into it. Holy. Look at the size of that place. God. They're going to all kill us eventually.\n\nHoly chanting. It's Squid Game.\n\nLook at the size of that crowd. It's literally drone footage, dude. We're going to rock them.\n\nHoly holy. That's insane. Wow. Wow. How many people was that, I wonder? Holy. It shook the whole place.\n\nYeah. No. That's millions of people. Can you imagine being his wife? Be like, \"Hey, could you clean up a little?\"\n\nSee what I did? You. I just flew out of the floor. Shut up and cook me a sandwich.\n\nAll right, we're done. Should we eat? God bless America. Yeah. Yeah. Hell yeah. Let's go get some gout. Yeah. Gout of order. Goodbye, everybody.\n\n[Music]\n[Applause]\n[Music]\n"
}