{
  "episode": {
    "id": "FmlhA3dpxnc",
    "title": "Joe Rogan Experience #2336 - Ken Burns",
    "publishedAt": "2025-06-11T17:00:19.000Z",
    "description": "Ken Burns is an award-winning documentary filmmaker known for “The Civil War,” “The Vietnam War,” \"Jazz,” \"Country Music,\" among many others. His next project, “The American Revolution,” a six-part series, will premiere November 16, 2025 on PBS.\n⁠https://www.kenburns.com⁠\nhttps://www.pbs.org/kenburns/the-american-revolution\n\nTry ZipRecruiter for FREE at ⁠https://ziprecruiter.com/rogan⁠"
  },
  "channel": {
    "id": "UCzQUP1qoWDoEbmsQxvdjxgQ",
    "name": "Joe Rogan",
    "slug": "@joerogan",
    "url": "https://www.youtube.com/@joerogan"
  },
  "transcript": "Joe Rogan podcast. Check it out. The Joe Rogan Experience. Train by day. Joe Rogan podcast by night. All day.\n\nAll right, we're up. Mr. Burns. Pleasure to meet you. It's my pleasure. Thank you. I'm a huge fan, dude. I've been watching your work for so long and I've always had so many questions about how a person like you becomes a person like you. How you become the preeminent documentarian of our time. I mean, you have so much work out there. It's really extraordinary. And all of it on PBS, right? Right. All of it. Which is also extraordinary. You know, it's the public broadcasting service. It's the Declaration of Independence applied to communications, just as the national parks, you could say, was the Declaration of Independence applied to the landscape. Like manifestations of really American things. It may not seem obvious to us, but it seemed obvious to me that that's where I should go. So, I had lots of, you know, I I headed for the hills out of New York, you know, 46 years ago because I thought I was taking a vow of anonymity and poverty to do this stuff. And I've lived in the same house that I've lived in since there in the same bedroom for 46 years in this tiny little village in New Hampshire. And when the first film was nominated for an Academy Award, that was a film called Brooklyn Bridge, everybody said, \"Oh, you're coming back to New York. You're going to LA.\" And I said, \"You know, I'm staying here. is so labor intensive and I I can sit here in front of you and tell you that every single one of my films is a director's cut. I'm not going to sit here and give you an excuse. Well, that one they they wouldn't let me do this or they didn't give me this amount of time. And so I I could with the reputation I have go into a streaming service or a premium cable and say I need $30 million to do a history of The Vietnam War. And they'd give it to me, but they wouldn't they wouldn't give me the 10 and a half years it took me to take. You see what I mean? It's the time. It's the time and the ability to marinate the ideas, to do the deep dive into the scholarship, to triangulate the various scholarships. because you know better than anybody. There's lots of different viewpoints and perspectives and you want to find a way in which you can kind of if if not average them out, you can find a way in which you can understand them and you can have a conversation, a sort of a campfire around which you can discuss the complexity and the undertoe of any subject you pick it. The Brooklyn Bridge, The American Revolution most recently. You know, how early on did you realize that the only way to get this like full autonomy was to do with PBS?\n\nI I'd like to attribute some consciousness to it and I honestly can't do it. I I realized that I was striking out trying to raise funds from folks and the people who were interested in helping me like the National Endowment for the humanities or this all required me to give it for free as I still do to PBS and we had foundations and and that and so suddenly that dream of being a filmmaker which I'd had since 12. I wanted to be a filmmaker at 12 of the communion of strangers in dark rooms, the cinematic experience that suddenly I had to go, you know what, it's okay. I'm trading hundreds or maybe thousands of viewers for millions of viewers on a smaller screen and they're not watching it together, but they're they're having an experience and I can I can do something over time. I can do a The Civil War series and it can be 11 and a half hours and get deep into that experience. or The Vietnam War, which is 18 hours, 10 episodes, or Country Music, the national parks, Jazz, baseball. I mean, there like 40 different different things. And American Buffalo, most recently and Leonardo da Vinci, the first non-American topic. We're just finishing The American Revolution. It's just it was right for me. It's it was right for me. And I like the fact that they have BBS has one foot in the marketplace and the and and the other out. You know, that foot is tentatively there. And so it's also reaches all parts of the country. It's the largest network in the country. It's 330 stations and they really serve rural stations mostly. It's not this upper westside knobill snobby kind of thing. It's homeland security and crop reports and weather and continuing education and classroom of the air as well as children's programming and what I think is a pretty damn good prime time schedule, you know. So it it works in the context of all of America, not just some of America. So this is sort of a fortuitous sort of a thing that you came to be I think so. I mean cooperative with them. The film making thing was born in tragedy. My mom got cancer when I was 2 years old. There was never a moment when she wasn't dying that I was aware. She died when I was 11, a few months short of my my 12th birthday. And um my dad had a pretty tough curfew for my younger brother and me, but he forgave it if there was a movie on TV that might go till 1:00 a.m. on a school night. A school night. Or he'd take me out to, you know, the cinnamon see like Old Silence or French New Wave that was happening in in the mid-60s. And I saw my dad cry for the first time. He didn't cry when she was dying. Didn't cry when she died. Didn't cry at this impossibly sad funeral. But we were watching this movie called Odd Man Out by Sir Carol Reid um about the Irish troubles of the 19s and 20s. James Mason, you know, very tragic. And I saw him cry and I got it immediately. I just that provided him with this safe haven to express himself in a way nothing in his life for whatever reasons for his own psychology, his own history, his own traumas, his own whatever it is it didn't. And I said that's what I want to do. And it and it wasn't about sentimentality or nostalgia. It was about authentic emotional stuff, higher emotional stuff. The way our founders would talk about we'd be able to create a republic where you'd have higher emotions. Nothing sentimental about it. It's it's that you would just get closer, be more virtuous. And so I I said, and that meant, you know, I was going to be Albert Hitchcock or John Ford or Howard Hawks, you know, big Hollywood directors. And I went to Hampshire College in Ammerst, Massachusetts, which was a brand new experimental school. Came in its second year in 1971. And all of the teachers there were social documentary, still photographers and filmmakers. And they reminded me correctly that there is as much drama in what is and what was as anything the human imagination makes up, right? And so fiction's fine, but all of a sudden my molecules are rearranged again. I'm no longer just a filmmaker going to hopefully go to Hollywood. I'm now a documentary filmmaker. And all of that merged with this latent Joe, I I don't know how to describe it. Love of my country and its history. I mean, where everybody else growing up was reading novels and and stuff like that. I was reading encyclopedias and reading histories and trying to get at some aspect of who we are. And I think every single film that I've made has asked the same question. Who are we? Who are those strange and complicated people who like to call themselves Americans? And what does an investigation of the past tell us about not only where we've been but where we are and where we may be going which is the great gift of history. It's the best teacher we have as you know. One of the more fascinating things about documentary work and particularly your work is it provides this entertainment pathway to education where it's engrossing and gripping and fascinating and it's really well edited and there's music and there's recreations of these scenes and it makes becoming educated fascinating. Yes. It it makes it exciting where instead of the stale, boring classrooms a lot of children face, if they could be exposed to something like your piece on Vietnam, right? Was it 18 hours? 18 hours. 10 episodes. Yeah. I mean, that that piece on Vietnam is so fascinating. It's it's so incredible. And to see those the people that survived it express some like there's this one moment where one of the guys is realizing that they're about and it's just it's a very simple statement. He goes, \"Okay, here we go. We're going to war and you could see it in his face him recalling that.\" And you're like, you don't get that from the written word, seeing that man's face, him recounting it. And you don't get it from churning it out either. So, I spent five and a half years working on The Civil War and I really was like daunted by it. But the first all of the first five or six films that I've made, the Brooklyn Bridge, wouldn't have been built without this new medal called Steel, which the the Civil War helped to promote the use of the second film on the celibate religious sect, the Shakers, wouldn't have declined so precipitously, not because they were celibate. Cel celibacy exists in lots of religious traditions, but because a country that had just murdered 650,000 of its own people was not interested after the civil war in the questions of the sole survival in the in the uh intensity that it had before the civil war. Next film I made was on the Statue of Liberty and it was originally a gift from the French to Mrs. Lincoln to commemorate the survival of the Union despite her husband's ultimate sacrifice. The next film was on Huie Long, the turbulent southern demagogue. He came from a north Louisiana parish that refused to secede from the Confederacy. I mean, refused to secede from the Union. They saw the Confederacy, the ownership of slaves as as a as a rich man's cause. And so, they became a hotbed of kind of radicalism and populism and later would spawn this swamp thing called Huey Long. Uh, you know, we made a film in the history of the Congress. Obviously, the most important time in the Congress was when, you know, there were two congresses, one in in in uh Washington, obviously, one in Montgomery and then later Richmond. And so, I began to see the centrality and after the Civil War was done and it was really just brought to life by those voices of the people that what you're talking about. Well, well, here we go. Like, yeah, we didn't want to do another film on war. The guys both north and south who'd been in it who said here we go were they said they'd seen the elephant. That's how they described it. They said they'd seen the elephant. I assume it was the most exotic thing they could think of. That's what combat was. Something that no one else experiences seeing the elephant. And we just even removed from it. We're just looking at still photographs still got us to our core. And we just sort of said we're not going to do any more war films. And then at the end of the 90s, The Civil War came out in 1990. The end of the 90s, they were working on lots of things, baseball and Jazz and biographies on Franklidd Wright and Louiswis and Clark and and Mark Twain and all sorts of stuff. Jack Johnson. Later on, I heard that lots of graduating seniors, high school students, walking off the podium with the diploma, think we fought with the Germans against the Russians in the Second World War. And that a thousand veterans, American veterans of the Second World War, were dying each day in America. And I was like, [ __ ] You know, the we're losing them. And and by the way, that figure today is so small. It's just actuarially true that it's not a thousand anymore. It's maybe five or six today. And pretty soon it will be nobody and there will be no memory. And so I wanted to make a film about that. Before the ink was d dry on the World War II film, I said we're doing Vietnam. And before the ink was dry, meaning we locking it and we're mixing it and doing all the stuff we have to do 10 and a half years on Vietnam. Uh, it came out in in September of 17. In in December of 15, Barack Obama still has 13 months left in his presidency. I said, \"We're doing the revolution.\" And I am now speaking to you where we are almost done with it. We're still mixing. We're still mastering. We're still onlineing some stuff. But what it allowed us to do in all of the cases of all the war is get exactly at that thing that you're talking about. What is what actually takes place in war? What is this thing like?\n\nLife is vivified to a to an extent that we can't describe. Like our imminent death right now as we speak is not a possibility. But if we're on the front lines, it is at any moment. And life is vivified. We understand why people come home and can't compartmentalize it. We understand why people have problems. We're amazed at the people who who don't. It obviously brings out the worst. We're the most dangerous species on this planet clearly. Um but it brings out the best, right? And it and it's it's worth pursuing. And I think particularly when you take most recently, we've spent so many years studying The American Revolution, we we kind of accept the violence of the Civil War. We accept the violence of the 20th century wars, but this American Revolution, you know, they're in breaches and they're in and and and in stockings and they have wigs and the ideas are too important. We don't want to admit that this was as bloody per capita as our civil war. That it was in fact a civil war in ways that even our civil war wasn't. Our civil war was a sectional war, north, south. And that we were forged in violence. And it's okay. those ideas, those big ideas that we seemingly want to protect by like putting it a bug and amber, you know, guys in Philadelphia thinking great thoughts, it doesn't in any way get diminished. In fact, it it enlarges it makes them more inspiring and more exhilarating the understanding that what happened when our country was formed is one of the most important events in the entire history of humankind. I mean, you and I were talking about some of the punctuated equilibriums of comets or meteors or striking this, you know, ice ages. I mean, the Ecclesiastes, the Old Testament\n\n\n, says there's nothing new under the sun. There will, and I agree with that. Human nature doesn't change, but for a few minutes right here, we started something that was brand new. Thomas Payne said, \"We're like, not since the time of Noah do we have a chance to do this.\" And so we've just plowed ourselves into hearing not just those top-down voices, the bold-faced names that we all know, the Washingtons and the Thomas Baines and the Jeffersons and the John Adams, but also the people you've never heard of, right? 01% of people have a painting made of them or a drawing. Everybody else is visually anonymous, but somewhere they wrote their name down. Somewhere they're in a church record. Somewhere they're here. Somewhere they wrote a memoir and there got handed down and so we could bring to life a 14-year-old kid who joins the militia surrounding the British in Cambridge after Lexington, conquered a 15-year-old who's from Connecticut who fights during the war. A 10-year-old girl who's, you know, from 10 to 16 from Yorktown who's a refugee for most of the time as her family's well-to-do circumstances are diminished as she has to be on the road because Yorktown is so vulnerable to attack from British in addition to all of this and who are the native players, who are the black players, who are the Germans, the hired soldiers, you know, they're real people. Who are the Irish and Scottish and Welsh grunts of the British Army? Who are the generals, who are the diplomats, who are the French? And then if you charge yourself with that, you can't turn that out in a year and a half. You have to spend a decade marinating that stuff, finding out what's too much. You know, you don't want to make an encyclopedia. We, I mean, you started off by talking about entertainment that you could make something that is, you know, technically educational, entertaining. This is a good story. I mean, the word history is mostly made up of the word story plus high, which is a really good way to begin a story, right? Yeah. Hi. And then we begin the thing. And so I've tried to treat it as that way. I understand. And PBS is really good. And one of the reasons to stay with them is that they can reach every classroom in the country. So today is a school day in America. And hundreds of classrooms are showing a little bit of The Civil War, a little bit of baseball, a little bit of Jazz, Louis and Clark, the Roosevelts, Country Music, you name it. Yeah. And I love that idea that it isn't like broadcast television or even just the release of anything like skywriting, the first breeze and then all of a sudden you can't see the words anymore. I like the fact that a film I made 35 years ago in The Civil War is as durable now as it was then. That's all PBS. That's amazing. It really is. And it is so cool that they do show these in classrooms 'cause I think that same moment where you had where you saw your father cry where it gave him some sort of a vehicle to express emotions that he couldn't show in real life. This will give children a way to be educated but also entertained and it will spark this sort of it gives them a pathway to maybe children that are like very bored with school and just can't wait to get out. All of a sudden you have this spark of excitement and a pathway to like maybe education is cool. Like maybe there's something about this that's actually fun. Exactly. This episode is brought to you by ZipRecruiter. Speed dating is an interesting concept, isn't it? Setting an allotted amount of time to get to know as many people as you can. It increases your chances of finding a good match, and there's not a whole lot of room for [ __ ] You have to cut to the chase to find what you're looking for. Wouldn't it be nice if you had something like that when it comes to hiring for your business? Well, good news. There's ZipRecruiter. ZipRecruiter has a new Zip Intro feature that helps speed up the hiring process, connecting you with qualified candidates faster. You can try it for free at ziprecruiter.com/rogan.\nAs soon as you post your job, Zip Intro will get to work. You could even be talking to candidates in back-to-back calls the very next day. All you have to do is pick a time and it'll start scheduling top talent for you to meet. Enjoy the benefits of speed hiring with the new Zip Intro feature only from ZipRecruiter. Rated the number one hiring site based on G2. Try Zip Intro for free at ziprecruiter.com/roganogen.\n[Music]\nAgain, that's ziprecruiter.com/rogan. zipintro. Post job today. Talk to qualified candidates tomorrow. Exactly. And we have let a lot of what is fun about it. We've we've sort of taken history out. We've taken civics out. We don't know about ethics. We don't know about values. We've we've placed everything over into one sort of set of educational prerogatives, forgetting that you want to build, as our founders said, these well-rounded citizens. Remember, we invented that. Everybody up until the point of our revolution were subjects, right? Mhm. And Jefferson says a few phrases beyond the famous second sentence. He goes, \"All experience has shown that mankind are more disposed to suffer while evils are sufferable.\" Meaning the whole history of human beings is like, \"Okay, I'm going to be under the boot of an authoritarian. I just, you know, that's my lot. I'm just going to accept it.\" Yeah.\nAnd to be educated and to do of that your lifelong. In fact, he could have said, Jefferson could have said life, liberty, and property. He didn't. He said the pursuit of happiness. That was not the chasing of objects things in a marketplace of objects but it was lifelong learning in a marketplace of ideas. It was making the story of how we acquire virtue and they use that word all the time. They imported it from the classical. They went over the dark ages over the middle ages over the medieval period and pulled back from classical times this idea of virtue of temperance of tolerance and all of that. There's a wonderful moment when John Adams, who's the big worrier of the revolution, he's always worrying. He's saying, \"I just don't know if there's if if there's enough virtue to have a republic. Everybody is so ambitious and and so greedy and so out to do this.\" And so for him, if you were going to create this new thing, something new under the sun, you know, the world started over again. Um, as Thomas Payne is suggesting, an asylum for mankind, he called it. um then maybe you had to figure out how to educate yourself. And so when you go back and say, \"What have we lost?\" Whether we're just we're now just repeating, we are we trying to get to the test or are we trying to make a well-rounded human being? So if I tell you in 1838 there is this lawyer in Springfield, Illinois who is just a few days short of his 29th birthday who is addressing the young man's lysum on an afternoon and the topic is foreign policy and he says whence shall we expect the approach of danger? Shall some transatlantic giant step the earth and crush us with a blow? Then he answered his own question never. All the armies of Europe, Asia, and Africa could not by force take a drink from the Ohio River or make a track in the Blue Ridge in the trial of a thousand years. If destruction be our lot, we must ourselves be its author and finisher. As a nation of free men, we shall live through all time or die by suicide.\nWhoa. You know who said that? That's Abraham Lincoln. He would come the closest to overseeing our near national suicide in The Civil War. But he understood here you got these two magnificent oceans, big relatively benign neighbors, north and south. And so what we've been able to do is incubate so many extraordinary things, but we've also been able to incubate lots of less than extraordinary things. And he was saying it's those less than extraordinary things are going to trip us up or we'll live forever. Because if you think about it, the greatest naval invasion in history, you know, June 6, 1944, D-Day, Normandy, nobody can do that for us. Nobody's going to land at Montalk. Nobody's going to land at, you know, St. Augustine. Nobody's gonna land in Galveastston and and help us, right? We'll sink or swim by the extent to which we are knowledgeable of and adhere to the blessings that we've received from that founding generation. The sacrifice made not by those bold-faced names, but by the people that you've never heard of that we are trying to tell you about. The John Greenwood, the 14-year-old Feifer, Joseph Plum Martin, the 15-year-old kid from Connecticut, Betsy Amler, you know, loyalists, too. I mean, we're we're umpires. Joe, we we call balls and strikes. You know what? Being a loyalist in the revolution is is what what it'd be like saying, \"Well, you're conservative, right?\" Well, you you think I I live under the greatest political system, the British constitutional monarchy. Why would I want to change this great life, this great prosperity I have for this idea that a sounds foolhearted and radical, but also b has zero chance of working out. Zero chance of working out. Right at Lexington 250 years ago on April 19th.\nThe chances of the Patriots prevailing are zero. And to tell the story of how it went from zero to 100% is scary, violent, complicated, lots of undertoe, and as exhilarating as you could possibly imagine. There's a great line in the trailer for this piece on The American Revolution. We say it's the first war that was fought in history for the unalienable rights, proclaiming the unalienable rights of all people. Now, let's be honest. Thomas Jefferson meant all white men of property free of debt. But the words are beautiful. The words are vague. And the door got opened to crack and everybody else put their foot in it. Women put their foot in it. The poor, the not landed people, the folks, the craftsmen who just had a regular job, black people, native, you know. So, and it it has sponsored revolutions all around the world, democratic revolutions, that the greatest thing that we invented was the idea that we could govern ourselves, that we would no longer be under the boot of a an authoritarian master who had just set himself up like King George, you know, because of hereditary privilege, you know, his his grandfather and his grandfather and his father and his uncle and going back and and and and on what basis is it talent? Is it is it um showing the things? And so all of these people that we consider the bold-faced names of our of our revolution, the Washingtons and the Jeffersons and the Patrick Henry's and the John Adams and they didn't know they were those people, right? They didn't they didn't know there they were a planter and they were a businessman and they were a lawyer and they were this guy and a planter or a scientist and they were just risking their lives, their fortunes and their sacred honor for something much bigger than anything else. It's also the incredibly complex system of checks and balances they divide to prevent tyranny. Oh, it's so unbelievably beautiful. I can't believe you brought that up. So you we have a technical problem which I'll share with you or I thought it was a technical problem which is the climax if you're making a film called The American Revolution the climax is the battle of Yorktown happens in October of 1781. The British don't leave New York in for two more years until 1783. They're occupying New York which they took over in the summer of '76. And our articles of convention are doing nothing. Articles of Confederation are doing nothing. They're toothless. It can't be a government. And so in 1787, we have this constitutional convention that happens in Philadelphia. Four months, they hammer together the shortest constitution in the world. And it is exactly that. Jefferson's writing in to Paris who representing our interests going, \"But what about this? What about they're trying to check the possibility of somebody being um somebody who would try to take advantage of the system and and rig it to their own benefit. And so all of those elaborately beautiful checks and balances. Article one is the legislative. Article two is the executive. It delineates article three the judicial. Delineates what the responsibilities are and the way in which the system has worked and fits and starts with lots of problems and and and you know there's something encouraging about seeing how divided Americans were back then because we're always ringing our hands oh we're so divided okay human beings are divided and and my my feeling is that if you succumb to argument right which is what we do the novelist Richard P said the best arguments ments in the world and that's all we do is argue. The best arguments in the world won't change a single person's point of view. The only thing that can do that that is to say change somebody's point of view is a good story because a good story allows contradiction and undertoe. You can have a George Washington who is complex, flawed, rash, makes terrible tactical decisions on the battlefield and yet without him historian after historian after historian says without him we don't have a country. And you can take that and put that in the bank and at the same time understand the dimensions of we all have feet of clay. We're all flawed in in some way. And to to try to design a narrative that isn't, you know, filled with that kind of morning and again sanitized Madison Avenue kind of view of American history. Nor is it that unforgiving revisionism that wants to throw out anybody who did something bad back then. You you then permit a world to exist in which they suddenly seem familiar to you. Like you can argue with other people and see that you get nowhere. But you also know if you're married or you have kids or you have friends or you're in business that you actually are more engaged in story and tolerance and understanding and listening. And so part of our job as filmmakers, strangely enough, is not to impose ourselves on the material. As I said before, we're umpires.\n\n\nCalling balls and strikes. It's to listen to the material. What is it telling us? What is it saying about the circumstances of, say, the resistance in Boston in the early days leading up to The American Revolution to try to understand nuance. Every school kid knows that when the 60 or 70 people, white, uh, all white males, both rich and poor, in Boston dumped the 40 tons of tea, 40 tons of tea in the harbor, they were dressed crudely as Native Americans. And if you ask a kid why were they dressed that way, that well, you know, just to disguise, to put the blame on somebody else. It was to say, \"We're not part of the mother country anymore. Really, we're here. We're Aboriginal. We are Americans. We are distinct. We've been having complaints about British and citizenship. We're arguing British law.\" But all of a sudden, those laws have been broken out into natural laws. And we're telling you that we're not trying to blame it on anyone else. Nobody would for a second have thought that the Native Americans would have dumped the tea. They weren't burdened by the tea tax. What they were doing was saying, \"We are,\" and it's so ironic given the history of our relationship to the dispossession of native lands. They are saying, \"We are Aboriginal.\" This is what the scholar Delorea says. So yeah. Wow. And then you adopted Aboriginal, right? We're saying, \"We're not of the mother country. We're, we're in essence kind of filing divorce papers by dressing as the people who originally inhabited this country dressed.\" Nobody's fooled. Nobody's trying to blame that out. It's listening to scholarship. It's thinking, of course, that you're not going to have, um, no one in their right mind is going to say, \"Oh, the Native Americans did it because they're protesting the tax. They're not paying the tax.\" Right. Right. So, it's like, it's you then go and then you talk to a scholar, in this case, Phil Delorey, who's been studying native stuff, and he goes, \"Just think about it. You're dressed crudely as this. You're making a statement to Britain that we are no longer, we're severing ties.\" Now, this is well before this is, um, December of 1773.\n\nThe guns are going to fire in about 18 months at Lexington, a little bit less than 18 months at Lexington and Concord on April 19th. But it's, it is all of these little moments that lead up to boycott of British goods. Women take a huge part of the role of the resistance. You got people like Samuel Adams, who is a failure as a brewer and a tax collector. It's sort of interesting. You can't make this [ __ ] up. Um, who is his whole job is to keep his fellow colonists alive to their grievances. When things come down, the Brits sort of retreat. He goes, \"Oh, no, no, no. It's just going to get worse. It's going to get worse.\" And so, you meet these characters that sound an awful lot like characters that occupy our large media space. And it was occupying the large media space of the colonists from New Hampshire. Uh, I live in a tiny village. The Walpole Gazette was read all the way in Georgia. People exchanged ideas and thought about things and were trying to figure out even as late as the, even after, even after Lexington and Concord, even after the battle of Bunker Hill, which is June of '75, even after the other things that were happening, by early '76, nobody's, absolutely not nobody, but there's not a majority will for independence, independency, as they called it. And then Thomas Payne comes in and writes this pamphlet, Common Sense.\n\nAnd all of a sudden, people going, \"Oh, yeah.\" And by June, there's a committee of the Second Continental Congress, and Franklin's in charge of it, and there's John Adams is on the committee, and there a 32-year-old lawyer from Virginia named Thomas Jefferson, who's given the first crack at at at doing this thing. And what does he write? He writes, \"We hold these truths to be sacred and undeniable.\" And Franklin, who's the old man, the chairman, if you will, of this little committee, goes, \"Uh-uh. We hold these truths to be self-evident, Joe. There is nothing in the world less self-evident than the idea that all men are created equal, that they are endowed by their creator with certain unalienable rights, that among these are life, liberty, and the pursuit of happiness.\" But as someone pointed out, it's the old lawyers dodge. You know, you just, you just tell them that it's self-evident. Not just sacred and undeniable, lovely phrasing on Jefferson's part, but if you say self-evident, then we're not arguing about this thing. We're saying that everything that you're about to hear is without argument, which is a like really in-your-face bold move. And the intimacy, the human intimacy that gets communicated when you spend even a little amount of time trying to parse this, trying to get at the heart of the dynamics of dumping tea and dressed as Indians or writing these words. Um, you know that mankind are disposed to suffer while evils are suffer, sufferable. Meaning, yeah, we've taken it all this through human history, and guess what? We're not going to take it anymore. When they first devised this system of government, what, what were they basing it on? I know part of it was on the Greeks, but like what was the, how did they make it to the point where even today we marvel at it. Yeah, we, 250 years later, people go back and like, look what they did. This is extraordinary. It's extraordinary. So, lots of factors. First of all, it was true what I said. They, they have experienced at a, at a, at a reserve and at sort of, as somebody said, salutary neglect, the people didn't pay attention to the colonists, and they had learned, suddenly they were more literate than their British compatriots. They paid less taxes, and they paid it to local stuff, and they were, um, had land, and, um, most folks in England and Wales and Scotland and Ireland were living dependent lives. They'd worked the land of somebody else for a thousand years. So, they've got this British constitutional monarchy, which is a really strong thing. And King George is not a bad guy. He really does believe that Parliament has this role to play, and the House of Lords and the House of Commons, they're, they're, they're kind of the checks and balances that we'd think of. But they're also in the middle of the Enlightenment, where they're beginning to say that there are certain rights that are natural. That's the word that I think Jefferson would use. That is to say, they are not bestowed by a monarch. They're natural. That all men are created equal. This is big stuff. And this is distilling in Jefferson's words in the Declaration, a century of Enlightenment thinking. And the Enlightenment has been a kind of philosophical and human and kind of governmental dynamic that's coming out of the Renaissance, right? We know what the Renaissance is in art. Leonardo da Vinci, Bernini, you know, all of this stuff, some music, but, but what it's doing on a social scene is it's and a philosophical scene is it's doing that, and they're reaching back to antiquity, as you say, and they're pulling back some of the best ideas of, of self-discipline, of, of temperance, of virtue, all of these sorts of things. But then because they've experienced all these years of this misuse and distrust from the mother country, 3,000 mi away, takes, you know, at least a month for information to get there. Um, the, the Britain wins with our help what we call The French and Indian War, which was a global war called the Seven Years War. And they've got now the far, the biggest, most far-flung empire on Earth. But they can't protect its own colonists who are trying to pour over the Appalachians to take Native American land, and it's causing uprisings, and so they say, \"You can't go over 1763, you can't go over that,\" and, \"Oh, by the way, we're broke, so we need you to help us pay for this stuff, but we don't have any representation there.\" So, native lands, taxation, representation become this thing, and it goes on for so long. They've watched the ineffectiveness of their government while they're prosecuting the revolution and the ineffectiveness of the Articles of Confederation that emerges from fighting the war and is trying to figure out how to make it work that they go into that constitutional convention and they are determined to figure out every possible angle to forall authoritarianism, to balance their relationships between the states, to have the checks and balances between the three forms of, of government, the judicial, the legislative, and the executive. It, it is a beautiful thing. And what was so incredible is that it fostered one of the greatest public debates ever in human history because they had emerged from this bloody, bloody, costly civil war. Civil war means lots of deaths of civilians. That didn't happen in our civil war except in Missouri and, and a little bit of Kansas. You know, six people died at the siege of Vicksburg, less than 20 at Atlanta, two in Gettysburg, the greatest battle ever fought in in North America. But The American Revolution, lots of, they're battles in the South in which you might have one British officer leading loyalist troops. Every person on each side is an American, and they're killing each other. And they're doing it not just in set battles, but in little guerilla actions, almost like the Vietcong attacking patrols in in South Vietnam. I mean, it is really bad stuff. And so they say, \"We're going to ratify this, but we want a bill of rights, too. We want to enshrine these things that we fought for.\" And so you have no establishment of religion, freedom of speech, freedom of press, freedom to assemble and and and redress grievances, right to bear arms, you know, free and fair trial, uh, end of cruel and unusual punishment. All these things become the set pieces of I made a film a couple years ago on um, the US and the Holocaust. What we knew, when we knew it, what we did, what we didn't do, what we perhaps what we should have done. And I was at some event and somebody raised their hand and said, \"Is the Holocaust the most important event since the birth of Jesus Christ in world history?\" And I just immediately said, \"No, it's The American Revolution. It's The American Revolution.\" I mean, this is a sea change in the course of human events. And man, we don't know enough about it. We don't know enough of the interiors of it that are complicated. I have in my editing room a neon sign. I've had it for a decade and a half in cursive, lowercase cursive that says, \"It's complicated.\" You know, because there's not a filmmaker on earth that if you know, if the scene's working, you don't touch it. But we have, we have spent the last 50 years touching those scenes, right? You know what I mean? Going in. Maybe it's lesser, but it's truer, and it's got more dynamism. It's got more contours. It feels like it's accurate to what actually happened, which is more complicated than our sort of simple binary discussions of what history is. What? It's just, it's so hard for people to recognize that that was a civil war because I don't, I think most people think it was the United States colonists against the British, but the separatists and the loyalists battling it out together. I, I think most people are completely unaware. Completely unaware. We, we wrote a, for lack of a better word, a topic sentence early in the film is that, and I might get this slightly wrong, but the, the American Revolution was not just a dispute between Englishmen, over Indian land, taxation, and representation, but a bloody struggle that involved more than two dozen nations, European as well as Native American, that somehow came still to represent some of the highest aspirations of humankind. mind. So, so our, ours is like the fourth global war over the prize of North America, and they're n, and we're treating native nations not as them, but as distinct entities. The, the Shaunee, for example, in the middle of the 18th century, 1750, are as important an entity on the world trading stage with French or British or others as, say, the state of Virginia or the colony of Virginia is at that time, really, and that they're different from the Delawares, they're allies, and they're different from the Huda nachos, the Iroquois Confederacy, the six, five, and then it was six tribes, the Seneca, the Kauga, the Anandaga, the Tuscarora, the Onida, and the Mohawk. And I've just walked from west, western New York State all the way into New England, right, and up into Canada. And they had formed a union of their own that had operated, a democracy that had operated for centuries that had allowed the independence of each of these separate nations, states, and yet yielded to the larger thing when their interests were threatened. So essentially with regard to foreign policy, and Franklin looks at this and goes, \"1754,\" he goes, \"Wow, this is a great idea, we should be doing this.\" He's been to postmaster, he's tra, he's, he's the only person who's been to New Hampshire and he's been to to Georgia and all the places in between. He said, \"We should do this,\" and he calls a conference in Albany, and he's got a picture of a cutup snake above the dire warning, \"Join or die,\" and they pass seven of the 13 colonies attend, and they pass this thing called the Albany Plan of Union in 1754, and then they go home to try to sell it, and none of the states take it, cuz no one wants to, none of the colonies take it because no one wants to give up their autonomy. So the plan dies, but 20 years later, \"Join or die\" is the war cry in the most consequential revolution in in in history. Wow. Isn't that great? So you're, you're taking the Native American, riffing on that, and then as you're form forming this, you're bringing in what you've had and inherited for decent British constitutional monarchy, and you're borrowing from the new enlightenment things, and you've got biblical references and classical references having to do with the conduct of individuals and personal responsibility. All of these just utterly American, but, but also been out there forever, and we end up with what we have, which is this, you know, glorious, wonderful, but also dysfunctional republic. Yeah, it's terrible, but it's the best one out there. It's the best one out there. Yeah, it's exactly right. When you, when you started this project, so you have this idea to start this project. What was your understanding of\n\n\nThe Revolutionary War versus what is it like when you really delve into the material and you start to formulate a plan for this documentary series? Like, how much did you know about it when you first started? I'm pretty well versed in American history, but nothing. I mean, like I, I've worked on two films where I made the mistake of thinking, \"Ah, I know about this subject,\" uh, baseball and The Vietnam War, because I was, I was grow, grew up in the '60s and I went through it. I lived on a college campus. I knew all the stuff I thought was at college as the war was winding down, and I loved baseball. Every day of both those productions were daily humiliations of what I didn't know. And so what happens is you come in with a humility that I wish to know and rather than tell you what I know, the last time I checked, that's called homework. We would rather share with you our process of discovery.\n\nJoe, you cannot believe what we just found out. Can I just say, can I use these, these, these mugs to tell you how Daniel Morgan won the battle of Calpens against Banister Tarlton in in in South Carolina just below the North Carolina border, and he trusts to his militia who are unreliable? Please just fire twice, the first line of militia, and then you can retreat, then you can run, but please promise me you'll fire all twice, and the second line of militia, my more inex, inexperienced, please just fire twice and then run behind the third line, which are these scraggly kids, felons, near dwells, second and third sons without the chance of, of, of a um, of an inheritance, um, recent immigrants from Ireland and and Germany, and they stopped the British. Tarlton goes, \"Oh, they're, they're doing what all the militias do. They're retreating. They're retreating. They're retreating.\" And then the third line comes up and and they go after them and they, the Americans actually attack, which is very rare, an attacking uh thing to drive into the British line. Tartland gets away, but a huge part of Cornwallis's army has been diminished. And they uttering this war cry that they have um adapted from the Cherokee, from Native American tribes, which is a yell that will reverberate in southern battlefields for decades. Wow. Wow is right.\n\nAnd like I can take, I mean, look, there's Lexington and Concord, and then maybe somebody says Bunker Hill, which is really Breeds Hill, Bunker Hill, too. And then maybe Trenton, he takes over. He surprises them on Christmas night. And then maybe some people know that Saratoga is the surrender of an entire British army that gives the French the confidence to come in on our side and give us the equivalent of $30 billion plus navy and and soldiers. Um, and then New York Town, but there are dozens of battles that we'll tell you about. Like German Town is a wonderful thing. The battle of Brandy Wine. What's the largest battle in the entire, the largest battle is the Battle of Long Island. George Washington makes a terrible blunder, a tactical blunder. He leaves his left flank exposed and the British see it and they completely surround him. And then a year later at Brandy Wine, he leaves his right flank exposed and they go around. He's not the greatest tactician, but he is the man of the time. This leadership, this ability to understand subordinate talent, this, this reserve, this kind of confidence. I mean, you cannot come away from this without extraordinary admiration for this person without whom we don't have a country. We just literally don't have a country, which is so crazy when you think of like pivotal figures in human history. This one person, were they not born, were they not in that position at that time? Extraordinary circumstances, unusual character.\n\nWe have a historian. The only time really in the film that any of our talking heads break the fourth wall, you know, we don't have, we don't have first-person voices. I mean, we don't have witnesses. We have hundreds of first-person voices, but we have some scholars and writers who are on the thing. And there's one Christopher Brown who just shakes his head and he goes like, \"I'm not a, you know, big fan of the great man theory of history or interpretation of history, but let's put it this way. I don't see how the United States survives without Washington's leadership.\" And it's this wonderful moment in which you go, right, we don't have to throw out the heroes in order to do that. More often than not, we've sort of elevated these people to a supernatural position that they don't really necessarily deserve. He deserves it. And yet, he's also deeply flawed. Feats of clay, as I said. And that's to me what makes a good story. Like how is it that he can be tactically so wrong in two extraordinary places? He's also very rash, Joe. He runs out at Kips Bay, which is halfway up Manhattan after he's lost the Battle of Long Island. He's now abandoning uh New York, or he's taking a good number of, of his men up to Harlem, and at Kips Bay, which is sort of midtown on the East River. There's a battle and and we're just being rolled up, and he comes charging onto the battlefield and his aids are going crazy and they're grabbing the reins of his horse. He's going to be killed. If he's killed, that's it. Right? And then later on at the Battle of Princeton, he does the same thing, and and one aid puts his hands over his face thinking, \"I cannot watch my commander-in-chief be killed.\" And in the Battle of Monmouth Courthouse in New Jersey, he rises out and just is very present, turns what is a retreat of, of Continental soldiers and militia men into steadying their lines and and basically holding their own against the prime, the elite of the British army. And it's where does that come from? Where, who, who does that? How did we do?\n\nAnd from the very beginning, everybody knew you needed a Virginia. The New Englanders where the war start, the war is a, is a symphony in three movements, right? The New England is the first movement, central states, and then the southern states. And there is a sense early on when after Lexington and Concord, where we've driven the British back into Boston and they've got ways to get in, but they can't get out, um, besides by ship, um, that we need a real army, and the army is formed, and it is very obvious from the very start that there can be no other person than George Washington. The New Englanders want a Virginia. It's the most populous. It's the richest state. Um, and they know this person has been around since he's a 22-year-old militia officer who probably fires the first shot in the French and Indian War. That starts the global conflict that everyone else on Earth calls the Seven Years War that will set the stage for The American Revolution. And then he acts bravely in many other situations, and he is denied a commission in the British Army, and he's like, \"F you,\" you know, and then you go, and then if, and he's a speculator in Native American land that he doesn't own. He wants to sell to new colonists. And when the British put the line of demarcation in 1763 that separates, says, \"You can't go over because we can't afford to protect you,\" he's now pissed again. And then he's still this voice of reason that arrives in Philadelphia just poised, and people look to him for leadership. He's very good at picking out, you know, that guy has got great, he's got great executive uh function and great ability to pick subordinates without fear of being overshadowed. One of his great generals, Nathaniel Green, another great general, Benedict Arnold, and we introduced Benedict Arnold in the opening seconds of our first uh uh our second episode. And it isn't until you're a third of the way through the sixth and last episode that you go, \"Uhoh,\" you know, but he's a hero at Quebec City. He's a hero at the battle of Saratoga. He's been painted out of most of the paintings because he became Benedict Arnold. But isn't it nice to know that he's that great a general before he becomes Benedict Arnold? That term, when I was a child, when I was in school, a Benedict Arnold was a traitor. A traitor. I think that's gone now. I think if I brought that up to my children, I said, \"Do you know what a Benedict Arnold is?\" Oh god. They, they say it was a mixture of uh, it's like an Arnold Palmer. It's like an Arnold Palmer. It's a mixture of iced tea and lemonade. Yeah. You know what? That's so terrifying to me. And I'm, no, it's, it's what happens when you atrophy this interest in American history or you think that it can be so simplified that you don't have to do anything. I'm, that's my job. I mean, I, I love it, and I love the fact that we can bring back these things for people and they can, they can experience, and there isn't a person in the country that's listening to me now or that we're going, you know, 35 different cities all around the country talking about this. We made it for everybody. This is not made for the eighth grader taking American history, the 11th grader making this. It's for you. Right. It's for anybody who cares about where their country came from and is willing to say, \"I probably don't know the full dimensions of this. It's probably impossible to teach it in the way that you can in a documentary. I think it's the most effective form of expressing these things. I mean, obviously there's some things that can be documented in books, numbers, dates, history that that would be kind of cumbersome to certain documentaries because it would interfere with the flow of the entertainment aspect of it. But in terms of absorption, in terms of stimulation and absorption, human beings are much more inclined to take it through one of your long pieces like the Vietnam one, the 18-hour piece. That's exactly right.\n\nI think what happens is that it's so interesting because we understand as, as you're referencing the power of a book, still the greatest mechanical uh invention there is, that it, it, it can go into some depths that documentaries do, but a documentary can hold lots of different opposing points of view, not make them arguments, but allow people to have different points of view and sort of collect almost like spokes in the wheel. You want to get to the hub. That's the, that's what, whatever it is that you're after. But the wheel is much stronger by all those spokes. And unfortunately, that too often in history or in teaching, we subscribe to one particular theory of history, right? That it's got to be this or it's got to be that. Um, and what we've done is we, we found the documentary and the storytelling aspects of it hugely, hugely valuable in communicating the complexity of the subject without putting your thumb on the scale and making a political point. We're just, you know, look, I, I will be totally honest. Uh, history doesn't repeat itself. No event has ever happened twice, but Mark Twain is supposed to have said, uh, history doesn't repeat itself, but it rhymes. If he did say that, he's exactly right because human nature doesn't change. And so, you watch these events, and when we finish working on it, I told you we began this when Barack Obama had a year and a half to go in his presidency or a year, year and a month to go in his presidency. It's a totally different world, but and we know that it rhymes, but we never once have concentrated saying, \"Oh, we're going to put our thumb on the scale here.\" We want everybody to watch. We have no axe to grind. We're just, as I'm saying, calling balls and strikes. And when I mean that, it would be like saying, \"Let me tell you about Babe Ruth and Reggie Jackson. They struck out a lot. Thanks. Thanks so much.\" Right. Right. I mean, and I'm true. I have not told you anything that is not true. Correct. Right. Sure. They also hit a hell of a lot of home runs. And so calling balls and strikes is saying that what happens is the way we teach history is the way ESPN does sports highlights. It's always the home run. Yes. It's never the guy turned the double play or he doubled some guy off or there was some other thing. It's always the home run. And so nobody takes a strike in the in these highlights. And what we're trying to say is, isn't it better to watch the game and see that even Babe Ruth can only come up to bat every nine times? And even Babe Ruth fails seven times out of 10. He's a 300 hitter, a little bit more than 300 hitter. That's the great beauty of it. And so I think that we don't ever now think that he is a failure. We understand that the dynamics of life, the dynamics of this particular game mean that the people who fail seven times out of 10 and do it significantly are in the Hall of Fame. I mean, and that's that's the beauty of, of these storytellings. See, I'm not taking anything away from George Washington by by making it complex. We're making him human. He's not, he's not a statue out in the park collecting birdshed. He's a real breathing human being. He's one of the richest people in America. He marries one of the richest people in the America, a widow. Um, he's and and like he's away. He makes one visit home, I think, to Monticello during the whole, I mean, to to Mount Vernon during the whole war. He's dedicated to this thing. I mean, he doesn't have to do this, right? He's, he's committed to this project of us. And that's the ultimate point I want to make about not just this film or The Vietnam War or the all the things we've been talking about is that I've had the great privilege of making films about the US for nearly 50 years, Joe. But I've also made films about us. That is to say, the lowercase two-letter plural pronoun, all of the intimacy of us and we and our and all of the majesty and the complexity and the contradiction and even the controversy of the US, and that is a privileged space to be operating in, to be having been given the permission to do this for nearly 50 years is, is just great. I think I have the best job in the country, and I'm always happy to meet somebody who's willing to contradict me. But it's only because you have a chance to work hard at telling the story. I mean, we locked the picture back in January. That means you're not going to do any more work on it. We've unlocked it hundreds of times just to make it better. Some historians said, \"I'm not sure if, if you can be that categorical.\"\n\n\nAnd then we put in a perhaps, right? Or you find out that image isn't as stunning as we thought it could be. Can we swap that out? Oh yeah, that works better than before. Even after we were done. And I like the ability that by the time we're letting it go, it's like your kids, you're still, you know, licking the smudge off their face and, you know, making sure that their hair is tied up in a nice bow and, you know, have a good day, sweetie, you know.\n\nYeah. Well, I think that gratitude that you have towards your work and this dedication to truth because there's one of the problems with problematic historical figures is we tend to use modern ideological perspectives when we describe these people and you know, we try to show that we have a disdain for the way they live their lives and the choices they made in perspective with how we do today, you know, and the problem with that is it comes off political or ideological or exactly. And you lose the real understanding of the complexities of history. That's right. And of these human beings that lived in a very different time. 1776, even though it's only three people ago, is a very, you know, people live to be hundreds three people ago. It's all, it's a very different time. It's a very different time. And you make a really, really good point. When you take the judgments of what we know now, you can apply them and then you end up with what I called that unforgiving revisionism where you throw out some significant people with the bathwater of revisionism. But let me just tell you, they all knew slavery was wrong. They all knew it was wrong and they still did it. And there's a historian, Nette Gordon Reid, who just says, you know, found slavery is foundational to Thomas Jefferson and he knew all his life it was wrong and said it and wrote about it and tried to put in something to end the slave trade and in the Declaration of Independence, which no one would have. And she goes, \"Well, how could somebody do something they knew was wrong?\" She goes, \"Well, that's a question for all of us.\" And so Jefferson's neighbor freed all his slaves and urged him to do it, and he didn't. And his cousin freed all his slaves. So there's already that. The question is if you are just taking the judgments of today to cancel somebody, you've just missed the possibility of getting to know George Washington or getting to know Thomas Jefferson. And if you only do people who are um perfect, you're either lying about them or you've got very few characters, you know? I mean, cuz I don't know about you. I'm not I presume you're not. I don't think you know anybody who's perfect. I don't know anybody who's perfect. And so then it's like history becomes, \"Honey, how was your day?\" You It doesn't begin. I back slowly down the driveway avoiding the garbage can at the curb. You know, unless you get t-boned in case that's exactly do it. You edit human experience and you tolerate the vast experiences that human beings are are so complex and it's the it's the interest. It was very interesting.\n\nWe did an update of our baseball series called the 10th inning and and being a from New England and being a Red Sox fan, the whole thing was just a disguise to be able to do the Red Sox come back in 2004. But we were dealing with the great Atlanta team in the 90s and the great Joe Chori led Yankees and and then Sosa and Maguire and then Bonds and then steroids and whatever. At the end of it, we're really trying to come to some thing about steroids and try to figure out how to deal with it. And Thomas Boswell, now retired as a great sports writer for the Washington Post, said um I think it's Keats, writing about William Shakespeare, who's a pretty good playwright, um said that Shakespeare had negative capability. That means he could hold in tension the positive and negative aspects of a character for as long as you possibly could without making that quick and filament that we make all the time in our lives. When the guy cuts us off, we give him the finger, you know, we yell, \"F you.\" Whatever that is, we make judgments about it. And Shakespeare had that ability even with the darkest characters, you know, the IO and and the Richard the third, you know, people who are deep and dark, he had negative capability. He said, \"That's what we need to grow in order to understand the steroid era, in order to understand how to to deal with all of that.\" And I I think that that in a way all of us have to kind of grow that negative capability, that ability to distinguish that nobody's perfect and that if you if you superimpose this kind of abstract sense of judgment, nobody passes the test, right? No one passes the test. That sort of performative purity test too. I I think it's a real problem with our current culture where I I think this is a sort of a natural progression of an improvement of society cuz we could all agree that society is far more just today than it was in 1776. And we know we're on this path, but it's a very bumbling, stumbling certainly fail, figure out why you failed, kind of succeed, but then also do take a few steps back. Yeah, it's consistent. And I think in this process of this, unfortunately, you have performative virtue. That's correct. And this is a lot of people that want to tear down statues and throw paint on, you know, paintings and and do things where they're trying to show that I am better than the people who came before me. And the problem with doing that in regards to history is we don't learn anything if you're not truthful. If we don't give this sort of like a really objective analysis of all the factors that were taking place with these extraordinary human beings who were experiencing this thing that was wholly unique on this new continent and with this new idea of forming this experiment in self-government that hadn't existed before and that you're going to you you have to say you have to do it the way you do it. It's really the only way. I think it's the only way and it takes time and I am very I have to acknowledge that there's no other place on the dial that dates me, you know, than PBS where I where I have the time to do it. It's it's sort of like an NIH grant like here we'd like you to explore the possible cure to this disease. Can you have it next Thursday? Well, no, you can have it next Thursday. That's what Hollywood says. I need it out because the other Marvel thing is coming out at the same time. What you need is we want to set you up with a certain set of circumstances that are going to permit you to have the best possibility of of of doing this. And so we've always hit our marks. We've always come I if if we haven't been in budget, it's because we've expanded the film and then I've gone out and raised the money. So no one else was responsible for the fact that we decided The Vietnam War is not going to be seven episodes. It's going to be eight and oh you know what it's going to be 10 and that's 18 hours and that's you know the way the Vietnam and it had to do with listening to the material understanding how it spoke to us. You know committing ourselves to recording Vietnamese voices not just South Vietnamese soldiers and South Vietnamese civilians but Vietcong gerillas, North Vietnamese soldiers, North Vietnamese civilians as well as the range of Americans. And so one of my favorite scenes is is a North Vietnamese soldier and a Vietcong soldier and an American all saying exactly the same thing about the same moment in in a battle early battle before there were technically boots on the ground. This was an adviser, an American adviser. But they're they're all talking about a helicopter flying over this one hedge. And the Viet and the Vietcong guy is behind the hedge. The South Vietnamese officer is is, you know, next to the American guy. And they all have an experience of war that is exactly the same. And I love that. I love that.\n\nWhat was your first piece? Brooklyn Bridge. I had um I started What year was this? So it came out, it was first broadcast in uh 81 or '82. I had been working on it since 77. I looked 12 years old and I was trying to sell people the Brooklyn Bridge. And people were, you know, telling me, \"Oh, this child is trying to sell me the Brooklyn Bridge.\" No. And I used to keep these two big thick three-wing binders on my desk, all filled with rejections for that one film. I mean, literally hundreds of rejections. But I had read David McCulla's um The Great Bridge, the epic story of the building of the Brooklyn Bridge. And I went out to my partners, we just founded our uh company where called Florentine Films. We were starving. We'd like maybe get a day's work or two days work a month as cinematographers and soundmen and grips and we were paying the rent and that was it. I said we're going to do this and I'll raise all the money and and I did and it got I moved up to New Hampshire so I could live on nothing in 79 and and 80 and I I both those years I made less than 2500 bucks and um chopped all the wood for my stove, split it, carried it, kept the stoves going. You wake up in the middle of of the night and you know 4:00 a.m. in February and and you go I just heard the heater kick on. I got to go down and feed the stove. But it came out I got nominated for an Academy Award and that that was the sign to me that like I needed to um I'd hit a fork in the road and like Yogi Bar said you take it was to not go back to New York to not go back to LA but to say I'm going to be staying here because this is labor intensive. We're going to have to raise grants to do this stuff. I'm not looking for investors. We're looking for underwriting so that we are liberated from the suits that would come in and give the notes and say, \"Oh, you need to be less sexy or more sexy or longer or shorter or more violent or less violent.\" I can sit here and tell you with a great deal of pride and not just for me but on behalf of the extraordinary people that work with me and some of them have been for 50 years and some of them for 30 years and some of them for 40 and you know a lot of people that these are director's cuts that we haven't let it go and they're the way the country has responded to them like The Civil War series still 35 years old it's still the highest rated program in the history of public television. That's incredible. How did you have that clarity of vision as a young man to recognize that working in isolation in a small town was the best option? Because I would imagine if you had aspirations to be a filmmaker when you were younger, the the the call of Hollywood, just the the the call of being a part of an enormous organization like being respected by your peers in this enormous like that had to be at least somewhat attractive, but how did you have the clarity to realize that that was not the correct path for you? I can't take credit for it. You know, I went to Hampshire College. My teachers were social documentary still photographers. I had a mentor named Jerome Leebing and he was so firmly rooted in a kind of you know another word we've been talking about virtue another word is honor or honorable that is not engaged and people don't really use it in ordinary conversation. He just instilled in all of us I believe all of his students a sense of of honor. So there was this responsibility to follow it through, to work really hard. I mean, I don't know anybody that works harder than us. You know, we really work seven days a week. We love it. I put my head on the pillow. I want to know that my girls are okay, my daughters, and I want to know that I've made a film better, you know, in some way, shape, or seven days a week. Seven days a week. And it's not that you can't take a day off and you can't do something, but you're always thinking about this stuff and you want to make them better. And it was it's very funny. We were out in the road and we're showing the clips and you know we've seen these clips a gazillion times and and I'm talking to Sarah Baststein the co-director and and we just look at each other simultaneously and say got to get rid of that. We have to change that shot. And so suddenly we're working with an editor who happens to be in Paris this semester and the editor that's in New York and we're changing things. And I love the fact that we did that. You know, I'm actually embarrassed that I'm telling you about it because I feel like in some ways I'm advertising the fact that that's what we do. I'm just trying to say that somewhere along the line I've made the opposite of decision of what was sort of careerwise supposed to be what I was supposed to do. In fact, Robert Pen Warren, the poet and novelist told me that he looked at me once and he just said careerism is death. And I've never used the worry word career. I've always said my professional life because careerism suggests that you're that you're following some sort of rut and that's not what I wanted to do. And so by not mean by rut by by just you a p a carved path that's already well worn. I mean look if you want to be a doctor or a lawyer you you got to follow some wellworn paths just by virtue of that. Everybody that I know that's working in documentary that has been working at it for a long time and makes their living from it have come from completely unique paths. It's been their own way. And I like the fact that I made this, no, I'm not going to go back to New York. No, why would I move to LA? I'm going to be here in this little town in New Hampshire where any number of Oscar nominations and Grammys and Emmys means zero to the people that I live with. It's like, did you shovel the lawn the the the walk of the of the lady next door who's not doing so well? Did you do this? Are you a good neighbor? That's that's the stuff that matters. And it's a good place to raise kids as well. And then the splendid isolation.\n\nUm there's a great tradition as you know in American history of the way in which wildness nature becomes part of the American catechism that it's possible Walt Whitman\n\n\nis saying that you can worship God more closely in nature than in cathedrals made by man. This is the American catechism of being out in nature, and it manifests itself in different people who are aware of the power of nature. It reminds you of your insignificance. Yes. And that is inspiriting. This is paradoxical, right? That's inspiriting. Even though you're feeling insignificant, it's inspiring. Just as the egotist in our midst is diminished by his or her self-regard. Right. Right. So anybody who says, \"Oh, I'm this.\" It's actually diminished. The person who is humble is humiliated by their atomic insignificance. As one person said about Mount Denali in Alaska in the 19s, a reporter um is actually inspirited by that. And I wish to be inspirited because I think that's the only condition in which we're then able to make the kinds of decisions, the creative decisions, the personnel decisions, the sort of the thoughtfulness or to have that regard for not necessarily following the well-worn path. It's just amazing. Does that make sense? It does. It does make sense. It resonates. It resonates completely. The natural art of nature, the true majesty of experiencing the vastness of the mountains and of the woods, and it humbles you in a way that nothing else does. And it grounds you in a way of recognizing, I don't want to say your insignificance, your relative insignificance, but it puts like it's not just you. This whole thing is massive. My best friend, you're so fortunate to experience it. Oh, you know, for I feel so grateful, Joe. You know, my best friend once said to me, um, when we were much, much younger, we'd been friends for more than 50 years. He said, um, there's only one center of the universe, and you're not it.\nIt was a great gift. It was a really great gift. And I don't know what I was doing or whether I was even doing anything that was inviting it, but he just wanted me to remember that there's no center of the universe. Well, you also get to see the stars, too. Yeah. Out there. And that's another thing I was thinking, you know, there is that the beauty Emily Dickinson called sunsets and sunrises the far theatricals of day. It's like a perfect description of it. But when you go out and it's 10 below zero in my town, and I'm up an um a mile and a half out of town, which has five or six street lights, so there's no glare, and you see the Milky Way, and you just, you are just, what can you do but just be humbled by the vastness of the universe and how relatively insignificant our lives are. But that in itself compels you, drives you to try to do something that would have not significance, but just would add something. So I live in a state, um, politics comes through all the time. Everybody's got a lawn sign, right, left, right, center. My lawn sign says love multiplies.\nIt's the only functioning theory of the entire universe. It is what it's all about, right? It doesn't matter what religion, what philosophy you might subscribe to or not. Thomas Jefferson says in our film, \"If my neighbor believes in 20 gods or no god at all, it neither picks my pocket nor breaks my leg.\" Right? Like, we are so religiously intolerant today. Oh, well, I know that if I had been born in Riyad, Saudi Arabia, I'd still be a born again Christian. No, you wouldn't. You'd be a Shiite, you know? I mean, a Sunni, and you'd be at war with the Shiites across the border in Iran. You know, I'm sorry to break the news to you, and that all of them, all the great religions have the same thing in mind. And there's also that problem that people have with this rigid perspective that they would be so arrogant as to believe that they would be unique in that environment, right? That no, I would get it. I would understand it. Like, no, you wouldn't. That's crazy. And who's to say? I mean, what was essential about the founders, particularly Jefferson, is that they were deists, and while they all had their own particular mostly Protestant denominations that they were had come out of, and I think still to some extent in some cases practice, less so Jefferson, is that they believed that there was a supreme being who was disinterested in the affairs of man and did not distinguish between faiths.\nSo that, you know, you see the baseball player who hits a home run and crosses home bait and looks up and thanks. They never do that when they hit into a g-ending double play in the ninth inning, right? They don't say, \"Oh, thank you God for giving me that.\" I've only seen that once. Pedro Marcina had given up a fairly significant lead, not the entire lead, to the Yankees in one of those great playoffs. And as he walked off and was pulled by the manager, he walked off and looked up, and I, I spoke to him about it. I have never seen anything like that. But this idea that all of our affairs are governed in that way is not what many of the founders believed in. That it is our obligation to lead that virtuous life. Don't mean to keep bringing you back there. Yes. Moves you closer up the stairway to heaven, up the ray of creation. Yeah. To God. And that that your it's it's your movement, not that supreme being's movement towards you.\nOh, let's make sure that's a ground root double. Oh, let's you that's not happening, right? It is the ongoing chaos of the sequence of events and human nature. And we've got to be aware of the sort of incredible current, the force of the current of that human nature, but also the way in which my individuality, my will, the discipline, the virtue that I might be able to have could in some ways be singular and do something significant. Not because of that, but in order to be closer to that higher thing. And that's where they're all talking about it, that they want the founders' higher emotions, as I said, not sentimentality, not nostalgia, those are the enemies of anything, but the higher emotions. Sometimes we say that the whole is greater than the sum of the parts. What is the difference between that if you've added up all the sum of the parts and it comes here, what's that? And what it means is that as much as to build a table, to build a bridge or a highway, one and one always has to equal two. The things that matter in our lives are where one and one equals three. Where we are able to see something that's bigger, that there's something is produced by the collision of two musical notes, by two images in a documentary, by the conversation between two human beings, whatever, in which something is possible. I'm interested in whatever energy that creates and with whom? I mean, you, you just don't know that that person at the convenience store that you just kind of like don't even look and don't even think about has a life as important as yours. You're driving on the highway. We're coming down from Dallas this morning on 35, you know, and thousands, thousands of cars going out of the direction. The person in that car is looking, and their life is as full as what I'm seeing out of my eyes. And I know sitting here that you're seeing something totally different than what I'm seeing. And that that life is as full. And I think good history, good friendship, good storytelling, good conversation all have at its base the respect for the other point of view. The ability to listen and that kind of desire to be better. And in our country, we've actually got lots of blueprints for it. We got lots of plans. They're out there. It's in the Declaration. It's in the Constitution. It's in the Bill of Rights. It's here. It's in that speech. It's in the, you know, the Lincoln speech. You know, we're going to live forever or die by suicide. All right. Or then he's got two speeches. Lincoln does. One's a message to Congress in '62, um, what we'd call the State of the Union address. And he says, \"Fellow citizens, we cannot escape history. The fiery trial through which we pass will light us down in honor or dishonor to the latest generation.\" And then a few seconds later he goes, \"The dogmas of the quiet past are inadequate to the stormy present. As our case is new, let us think a new.\" He's both those things, right? Yeah. We cannot escape history. And guess what? The dogmas of the past. He's in his second inaugural, one of the most famous addresses of all time. He's got Old Testament righteousness. You know, if if if we have to spend another 500 years drawing with the sword the blood that is drawn with the lash, meaning fighting to end slavery, we'll do it. And then he stops very old testament. He stops on a dime and turns to this new testament ending the paration which says with malice towards none with charity for all. you know, and then it it has that kind of unbelievable generosity in it and this ability to say a second ago, I'm willing to keep this going for however long it takes to end this scourge of slavery that whatever drawn by the lash uh drawn by the sword, we will do. It's just an amazing ability to understand us. And he took he's the one who reached back over the Constitution and plucked Jefferson back into significance. And so when he gives the Gettysburg address for score and seven years after the the uh 87 years after the signing of the declaration, he's creating the 2.0 operating system that we have now of saying we we really do mean it that all men are created equal. And that now because of the sacrifice, there's not a proper word in that entire address. You know, the guy before him, Edward Everett, noted order, spoke for more than two hours and he spoke for two minutes. And Everett wrote him and he said, \"Mr. President, I should flatter myself if I thought I came to the heart of the matter in two hours as you did in two minutes.\" Wow.\nIt is there's so many wows in the work that we have. And people say, \"Well, what' you what what what did you learn differently?\" And you go, \"Oh my god, are you kidding?\" Every day is this revelation, this sort of tsunami that breaks over you of new information. And then it's just what is it that I can save? You you'd assume you'd presume completely understandably that making a documentary film on The American Revolution is additive, right? You're building this thing. It's not. I live in New Hampshire. We make maple syrup. We It takes 40 gallons of sap to make one gallon of maple syrup. And so it's all reductive. We will We have 12 hours in this six-part series. And we've got more than 500 hours of material filming reenactors for years. Some of them dressed in French uniforms, some of them dressed in in militia, some of them in British, some of them in in um you know uh continental, some of them German hessen, some of them native. What all of that stuff and then we're using it to help the building blocks of doing that. At the same time, we've collected more than 12,000 uh paintings and drawings. We've we've taken maps. We got more maps in this than in all the other films we've made combined. Sometimes we're just taking an old archival map and leaving it alone. Sometimes we're taking an old archival map and just putting red and blue line showing the movement of of British and continental soldiers. Sometimes we're taking maps and sort of making our own hybrid map that gives us a little bit more control. But all of these things we're just practicing. I mean I I looked at something earlier today which was just a minute change on a map that we highlight where a British admiral wanted to attack all these seapport towns in Massachusetts and New Hampshire and Maine and the last one is Machias which is up near the Canadian border and we weren't seeing it. So we were trying to figure out how to light up Marblehead and Cape Anne and Gloucester and Portsouth New Hampshire and Sacko Maine was then the main department of Massachusetts and then Falmouth which is now Portland Maine and Machias and so we we'll spend months trying to just get that one thing right. No one if we hadn't done it, no one would care except for us, right? Except for us, right? Yeah. It's that little thing, you know, I have friends who are woodworkers and they'd never hide a mistake, right? Right. They'd never hide a mistake. It always there's a there's a kind of craftsmanship to all of that, you know, out in the woods by yourself, just how you relate to nature, a kind of purity, a a kind of um intention that you have in relationship to it. I know you you know all of that. Yeah. I I think one of the things that's fascinating is that the isolation in which you work and the environment in which you live which does highlight the majesty of nature and and the the humility of it all. it you're in in the expression of your work, you're giving this vision to people that a lot of them are living in this world that creates uniquely anxious and disconnected people because we're living in these urban environments without nature because we're of light pollution. We see no stars. It's I I think it's one of the reasons why we're one of the most confused societies ever. And art and I think documentary film work is clearly art and especially art in an un in and providing an understanding of like the true events of history. Yes. It gives people a sense of what it really means to be a human being in in a different way. It illuminates these aspects of humanity in a different way that allows people just this kind of glimpse into like what are we made out of? Like what what is it about us that makes us who we are and why do we do what we do? I I I can't imagine any human being could say it better than that. Joe, I think that's exactly right. This disconnection that we feel has come from the fact that we have become transactional beings. Yes. Nothing is transformational. and that we yearn nonetheless for that kind of transformation that takes place in our lives. And as Americans, those of us fortunate enough to be Americans with all the problems that are attendant to that statement, um we have this glorious past that has the ability to take us out of that stuper that take us out of that rut to be able to say, and with the exception of a film\n\n\nOn Leonardo, the 40 or so films that I've done, some of them are hour long, some of them are 20 hours long, um, are all about us, right? All about us. And the thing that I was describing about the US and us is that I realize there's only us. There's no them. All of our world is about them, of creating a them. The artificiality that that um, despots or autocrats always have to make of them. There's got to be an enemy out there in order to do that. There's only us, right? And the important obligation that we have is to tell our stories to everybody. That is to say, I do not wish to preach to the congregation, whatever my congregation is. I do not wish to preach to the choir. I wish to say we have an extraordinary country. I mean, I'm interested in its voices. I realize I'm interested in its complicated voices, the true, honest, complicated voices of American history that's unafraid of controversy and tragedy, but equally drawn to those stories and moments that suggest an abiding faith in the human spirit and particularly the remarkable role this republic plays in the positive progress of mankind. That's my play. That's my sandbox. You know, it's a great sandbox. It's a great sandbox. You know, it's really great and, and you know, there's implied discipline in that, you know, work with people. I mean, for decades and decades and we work really hard and we want to do a good job and it's sincere in that regard and because as I said, it's PBS with one foot tentatively in the marketplace and the other proudly out, you can make decisions that don't have to do whether with, you know, whether it's going to enrich your bank account. I mean, there are so many ways to measure richness that don't have to do with the bottom line. And you know, one of the things that Americans have done, we've incubated lots of great ideas because of those two oceans and those two relatively benign name. One of the things, and Dtopville noticed this when he came through in the 1830s, were so into money and the almighty dollar, he called it, that was the religion of America, and that has its cost. It obviously has some nice attributes, um, but it has a spiritual cost. It has a spiritual cost that is profound. You know, the Old Testament again said it is easier for a camel to pass through the eye of a needle than a rich man to reach the kingdom of heaven. Yeah. And that's, um, that's tough for Americans to hear. It is so tough for Americans to hear, particularly since we have so many preachers who are certain that it's okay to be both, you know, and at some point you have to realize, you know, something is lost and there is richness in relationships, there's richness in children, there's richness in art, in associations, in knowledge, uh, in I mean, your curiosity is so palpable, uh, you know, I was listening to you speaking to my friend Elliot West, who's written about the about the buffalo and native peoples and the sort of prehistory of the American West, and you can just hear there is this prednatural sort of interest in curiosity and like, how does it work? We're all given a really short period of time and the bad news is, maybe it's the bad news, maybe it's also the good news, is none of us are getting out of here alive. None of us. And it then it comes back to us. What are we going to do? Yeah. What are we going to do? And it doesn't matter. You don't have to make documentary films. You don't have to have radio shows. You just, you can raise a child. You can tend a garden. You can build a bridge. You know, all of these things are legitimate. It just requires your full attention. Yes. And willingness to engage in that, whatever it might be. Whatever it is. I've got a friend in my little town. I've known him for 40 years. I think we probably have opposite political views. I don't know. But I adore this man. He builds stone walls. He's like, if you come to my house and you see the walls that he's built, it's like, you know, you don't need to go to Chartra or Notredam and just say, whoa, Douggee did this really great job here. Yeah. You know, and and and you just love him for that dedication to saying, \"I could just do this in this moment to the best of my ability.\" People always say, \"Do you ever go back to your earlier films and want to change it?\" And I go, \"No.\" Right? It's like it's like a photo album where you go back and you're wearing a paisley shirt with a big collar and you go, \"Who the hell thought that was a good look?\" But you don't tear that picture out of the album. You say, \"That's who I was.\" That's the time. That's the time. That's who I was. What a extraordinary hypocrisy to have a rich preacher. I was thinking that while you were saying that, you know, based upon that biblical quote, what a bizarre, like, blatant in your face hypocrisy to have a rich preacher. Um, Jesus Christ did not intend to start a religion.\n\nOther people who liked what he said started a religion long after he was crucified. So religions themselves, it's so interesting that all of them that have at the root of their um, their philosophy the exact same thing, exact same thing, all of them, you know, about do unto others. It's it's essentially about love and um, and yet religions seem to be sometimes the cause of most of the pain in there. It means that somewhere along the line from the original message to the expression, stuff gets corrupted and you can convince yourself that having as a guru in Oregon 52 Rolls-Royces or a giant arena you have your congregation meet you at every Sunday. It's just such a uniquely American thing, the megaurch pastor and uniquely sort of adapted to this bizarre society where the bottom line is numbers. It's ones and zeros on a ledger. It's important, you know, let's not downplay it. Oh yeah, it's better than not having any money for sure. It's better than not having any money. Shelby Foot, who was our talking head in The Civil War, said that money, the only thing it could buy you is privacy and service, meaning, you know, you can get somebody to mow your lawn if you need that to happen. And you can be a little bit private, but if you think it's going to be doing a lot more than that, you've already begun to atrophy those um, that awareness of of being alive that I think everybody wants to feel that sense of vivifying oneness. It's also a foolish pursuit to try to be better than people by just having more numbers. It's a really crazy thing. The poor in the United States, the studies have shown, give away well more of their disposable income. You know, if you got a hundred bucks and your friend comes up and says, \"Hey man, I need a hundred bucks.\" You give 100 bucks. If you got a thousand bucks and somebody goes up and says, \"Hey, I want a 100 bucks.\" You go, \"Well, then I will not have a thousand. I will have only 900.\" And and this works all the way up to a hundred billion. You're right. I know, I know that is it, it's it's it's so interesting that that somehow this is what we think is or or even the folks who are dedicated to spending prolonging their lives with these these other things. It really is the quality of life is the much more important thing. You know how generous you are. You know, I always tell my girls when they're in trouble, I say the three things and and and one is this won't last. Get help from others and be kind to yourself. You know, just there's no yes butts to those. I mean, which is where when you're a teenager, anxious, there's always or an adult, there's always a kind of a yes, but you know, just things will change. It always does. There's always change. Maybe it gets worse, maybe gets better, probably gets better. Um, and it it's no harm in reaching out to other people. And and the hardest thing of all is to be kind to yourself. Yes. I say the same things and I also say find something that you love, not that people love you for. That's right. Find the thing that you, whatever it is, like that you're uniquely drawn to and let that change over time. If you don't want, if you don't love that anymore and there's a new thing that you love, pursue that. But find the thing that really calls to you. This is what Robert Pen Warren meant when he said to me, careerism is death. He just was saying you got to find that thing and people when I talk to students, they want to know how you know what the secret is. I go, there's only two secrets. One is to know yourself and that may be understanding that I thought I wanted to be a filmmaker, but I don't have anything to say and and it's perfectly legitimate to do something else to change that thing if if you do it and the other is to persevere because there's in every single situation much more pe, many more people wanting to be in front of a mic every day than there are the possibility of being in front of the mic every day. So you have to work at it really hard. You can't make assumptions about it. Sometimes you have to do, you know, I sort of felt like moving to New Hampshire was in The Godfather, going to the mattresses. You know, it's like, okay, I got handed a job. I needed a job. And I was just so worried Joe that I was going to put the film that I had shot for this first film in the Brooklyn Bridge on top of my refrigerator and I would just wake up and I'd be 45 years old and I would have, you know, not not finished it. And so I got offered a job which was like, you know, being offered $800,000 a year today. And I I said no. And I moved to New Hampshire where I could live for nothing and finish the film. And how did you choose New Hampshire? I had a lot of I had gone to school in western Massachusetts and I had a lot of friends, sort of hippies and others that sort of after sort of alternative stuff that after they had not, some had gone to New York and pursued sort of traditional um, professional lives, but others had become book salesmen or opened a natural food store, were a weaver or whatever it might be. And so a lot of them gravitated uh, in southern Vermont and southern New Hampshire, a little kind of nice little nook. And so I ended up going to this town um, and have literally, I mean, I walked in, I rented the house for the first two years, uh, first few years and um, bought it after my daughters were born, um, and I've lived, I've been in the same bedroom for 46 years. Wow. And it's and I don't feel cut off or starved. I I know every part of the country. My films have covered every part of the country and part of the shoe leather that we have to do with PBS, you know, because they don't have the big budgets to smather The American Revolution coming November 16, over every bus and subway and billboard is you go out, you talk to people and and that puts you in touch and at the same time you you have this place to retreat and restore. And every morning I take a three-mile walk with my dog into the into the, you know, what looks like 18th century America. Wow. You know, I mean, how talk about rich. That's pretty rich, right? Right. You can't buy that. You cannot buy it. Yeah. That's really so important, really, because it's like it's the greatest perspective enhancer ever. It is. I I always say that about going to the mountains. There's there's nothing different. There's nothing, there's nothing about it that you can recreate artificially, like you, you have to go to the actual source of nature, the true source of nature to really appreciate that. I think it's like a vitamin. I think just like you get vitamin D from the sun, I think you get something from actual pure nature. I agree. Capital Nature. I agree completely. I think I think, you know, Americans, you know, manifest destiny basically says, see that, you know, that river, let's damn it, see that forest, let's calculate the board feet, see that canyon, what minerals can be extracted. That's okay and we've done that with 98% of the of the of the continental United States, but we also in the midst of all of that set aside these places that were so spectacularly beautiful, like Yosemite or Yellowstone or the Grand Canyon or Zion or Bryce or Canyon or the Everglades or Acadia or Smokies and just said, I want my children and my children's children's children to be able to see these. That's one of the most extraordinary things about this country is what Teddy Roosevelt did with national lands. We for the That's why I said it's the it's the declaration applied to the no other countries. We invented national parks. Every other country has every other country has followed suit because we were saying land does not belong to a monarch or to the noblemen or to the very rich. And just just reverse engineer that for a second and say, okay, we don't have national parks. So Yosemite and Zion are gated communities. You can't, you maybe have one little observational place along the Grand Canyon uh, to look. The Everglades were as long ago drained in as golf courses and strip malls and and apartments. It's one of the most diverse ecological environments on Earth. As flat as it is, it's just spectacularly diverse. It's kind of a mess now. And and and the uh, and uh, Yellowstone would be a down on its luck heyday in the 1950s amusement place called Geyser World, you know, and so, but it's not that we, you and I, and everyone within the sound of my voice own the most beautiful spots on the continent and I would argue in many cases the most beautiful spots on the earth. Yeah, it's pretty great. And it gives us that unfettered ability to go into nature, to get off the trail, which 90% we can admit it, there's nothing wrong with that. 90% of the people stay within 100 yards of any trail. But to get off the trail and go out and see the magnificence of this planet, you know, the Colorado River. Yeah. You stand and you know, the thing I like about the parks is that it isn't just what you see, it's who you see it with. Like you stand on the rim of the Grand Canyon and the Colorado River exposes pre-Cambrian Vishnu shist that\n\n\nIt is 1.7 billion years old. That's almost half the age of the planet itself.\n\nBut the Grand Canyon works if you also are holding somebody's hand, right? It's like who you see it with becomes central to the experience of it. Mira called it a grand geological library. All of the strata, it was like a library of telling stories of what was going on.\n\nIt's why I love American sports. I really love them. But I focus on baseball because in football the description is, \"Oh, you know, Joe Montana threw to Jerry Rice with a few seconds left and we scored a touchdown and we won.\" Or Michael Jordan hit the three-pointer at the buzzer, tongue wagging and we won. But the baseball story always begins, \"My mom or my dad took me to this game and I remember walking out and seeing the green of the thing and then Babe hit a home run or Hank Garren hit a home run or somebody, you know, pitched a perfect game.\" It's all gauged with who you see it with as well as what the thing is.\n\nWow. Yeah. Baseball is a unique American pastime because it's boring because you know it's exciting. It's not for those moments. It's not for those of us who love it. And it was always the national pastime. It's just it's had competition. I think one of the reasons why we sort of relegate it to this thing is that most of the other forms of entertainment, particularly in sports, are a little bit more fast-moving.\n\nGeorge Will said to me though, who's a big football fan, he says, \"Football has two of the worst features of American life: Violence punctuated by frequent committee meetings.\"\n\nRight. Right. What a great quote. Is that a fantastic quote? Yeah. No, but baseball has this thing. It's the only sport in which the defense has the ball. Right. The person scores, not the ball. Right. And where do you go? Home. Home. Yeah. And statistics matter. Like maybe you know how many yards Tom Brady has, the greatest of all time. Probably you don't, but you know how many home runs Babe Ruth hit and how many home runs Hank Aaron hit. And you know these are things that matter. And if you look up the 1919 World Series, it says that the Cincinnati Red Stockings won the 1919 World Series. There's no asterisk.\n\nBut then those numbers require you to tell a story about the Chicago White Sox, known to us forever as the Black Sox, who took money from Arnold Roststein and other gamblers to throw the 1919 World Series and give it to the much lesser team, the Cincinnati Redskins. It is great that the statistics matter. A .300 hitter means the same thing to my dad as it does to my grandfather and my great-great-grandfather and my great-great-great-grandfather.\n\nUm, but you still have to tell stories. Yeah, it's I mean the stories are so important to people too. I mean it does it just it's something that is a part of their life that they tune into to give their life more meaning.\n\nAnd that's the something that I never understood about team sports when I was younger because I never liked them because I was always in I always felt like I don't like team sports because I don't want to lose because Billy drops the ball in the back in the outfield. Like I don't want to be a loser because somebody else [ __ ] up. I wanted to be entirely dependent upon me. Then after a while I started realizing like no this there's a richness to being a fan. There's a there's a quality of life that comes there's an experience that comes from you everyone being united in this thing like wanting the team to win that doesn't exist in individual sports. It doesn't. I agree with you completely.\n\nThere's something wonderful. I was just talking to my best friend about this the other day that that that I my daughter was at school and she was the co-captain, my oldest daughter of the of her softball game.\n\n25, 30 years ago, we went to some misty Saturday morning game and it was like they were winning three to two in the bottom of whatever the last inning was and the other team had the bases loaded and no outs and we got three force outs and it was like the girls just immediately burst into tears. It was just an amazing thing. Or just you're driving in a in a, you know, a suburban or or city area and there's a ball game going on and you're kind of slow. You lift your foot off the accelerator as the pitch goes, you know, as it goes. There's something suspended as the pitch is heading from the pitcher to the bat or something. Everything stops and possibility is suddenly there in front of you. So why I love the game so much. It's just a game that if you try to introduce it today, it would be very difficult to sell.\n\nYou know, I It's so funny. I get to Fenway Park more often than not and haven't been in a while because I'm such a dull boy and working so much and it's always just filled with people and it's always got lots of kids and they're always there because they want to be. My screen saver of my phone are my two daughters at a Red Sox game. Uh you know, 10 or 15 years ago. I haven't been taking it off the thing. You know, this one's now a sophomore at Georgetown University and this one is going into ninth grade and but they were like eight and and and uh and 13 then. Wow. And it's look at the expressions on their face. It's just pure joy. Pure joy. Yeah. Yeah. It's um I mean it really is uniquely American. And it's accompanied nearly every decade of our national narrative. I mean, even into the 17th century, there are bits of pieces in which there seems to be some stick and ball game. And then after before The Civil War, in the decades before The Civil War, they begin to combine rounders, sort of a British schoolyard game with cricket and and do something that's a lot better than both called baseball. And and you know what? There was a guy in 1858 named Pete O'Brien. and he said, you know, they don't play baseball the way they used to when I was a kid. This is 1858. I don't mean they don't play it with the same with the same rules or the same. They just lost the spirit of it. So, we've always been saying something's wrong. Something's gone out of the game. It's not it's not quite right. And there's always not true and just it it continues on.\n\nThe steroid era to me was really fascinating because one of the things about baseball being so uniquely American is that the idea of someone cheating at this uniquely American thing was particularly offensive. Whereas at the same time people were 100% taking steroids for football. Oh yeah. Bill Romanowski was, you know, there was bottom of the fold of the New York Times, but soon as a baseball player was implicated, it was the top of the fold and that told you even though the NFL had long overtaken baseball as kind of the national pastime or football had had done that and I think it has to do with the sense that it I mean it does allow stealing of bases, but you're absolutely right there is that's a strategy. There is that wonderful thing about baseball that it seems kind of pure and seems American and to cheat at that is offensive and as cheat as that. And that's why, you know, I I used to say out of some I I'm I'm embarrassed by the kind of arrogance of it, I used to say, well, they should not they should let Pete Rose in after the Hall of Fame after he dies. Now he's died and I'm I'm still I I sort of feel like who am I to say that that certainly the Hall of Fame isn't like a list of angels, right? Um but I also still am not sure he should go in or Shoeless Joe Jackson as much as you want to resurrect the great story of the of the most uh promising of of the Chicago White Stockings in 1919 that threw the the World Series, the Black Stockings. Um I don't know. I mean it's very complicated. Will Roger Clemens, will some of these other people that we know we're juicing, Barry Bonds where you know we he was Barry Bonds doing interviews is clearly or arguably the greatest player that's ever played baseball up and you could even say to the moment he decid he looks at Magguire and says so he knows he's got tons more talent than them and they're getting all the attention and he says I can do this. Um he's still got he's he's right then he's a first ballot hall of famer and would arguably if he just stopped right then and just quit and said whatever but decisions are made and then it becomes back to Shakespeare negative negative capability and can you hold in tention the great prodigious gifts and the in this case the sort of shortcut of the way in which these gifts were corrupted.\n\nWell, it was so uniquely American that there was congressional hearings on steroid use in a sport. Yeah. Which was very strange. And again, while simultaneously, it's ubiquitously used in football. And you also live in a society in which you take a pill to uh uh deal with erections. You take a pill for this, you take you use a pill to sleep, to wake up, to all we are all drugged. and and and one person made in our 10th inning, the update to the series on baseball that came out in '94. 10th inning came out in 2010. Um they said, \"Look, you know what? If you're a scrap scraping, you know, middle infielder, second baseman shorts stop, and the everybody's taking steroids in the clubhouse. Everybody knows about it. The baseball has no rules against it right now. U and and it's the difference between you getting that four-year $28 million contract that in which your family is set for life. if you're from the Dominican Republic, you're from, you know, wherever you're from. Um, and maybe ending up in AAA and that's it. Yeah. Uh, and then you you realize and and you're being told by every signal of society, take something to be better.\n\nYes. This complicates the entire dynamic of our of our judgments, of the facility of saying, oh, I'm really absolutist. I I know this, you know, I I and I realize the more I go, the more disappointed I am in the arrogance of my certainty before. You know, I think one of the big things is, you know, we think that the opposite of faith is doubt. Doubt is central to faith. The opposite of faith is certainty, which destroys the mystery of the unknown. And so I I I'm always taken aback sometimes more often in retrospect than in the moment when I could possibly do something about it that I have been more certain about something and and less trying to see it from another person's point of view or from the other side of the coin or whatever it might be. Or maybe there's many different facets to to these things as we were talking about with regard to The American Revolution and slavery and and how what responsibility of imposing the morality of this moment on the previous moment how much did that previous moment already understand the morality of it which they did uh what's the right answer and I think I think staying open to the questions I know in film making has made us better filmmakers and it's not a royal we I I don't do this alone there are a lot of people that that I work with, they're handmaidads. It's a small little nucleus of people, but it it they they deserve credit as writers and co-directors and co-producers and and and people who are digging in the archive cinematographer I've worked with for 52 years.\n\nI think this is so important for people to hear because I think this very unique and noble perspective that you have is why your work resonates so much with people. I agree. I think what it is is that whatever I don't want to say sacrifices but whatever discipline has been imposed on the process of whatever it is we do people recognize that. Yes. And they know that they can see something. They may not like all the aspects of it because it is complicated and and and you do see not just the intimacy of the US but you also see the complexity and the contradiction and the controversy along with the majesty of the US. It's all there but I do think that they know that we have earned their attention. That's the biggest thing we have. like you know this you you're asking an extraordinary amount of people right this second you're asking them to devote their attention I mean my the longest episode I've ever done is like an two hours and 20 minutes 2 hours and 30 minutes that's that required every skill I had to be able to make that over 10 years an episode the fourth episode of of World War II a film called The War but mostly it's two hours and it is a supreme compliment of somebody will give me their attention for that amount of time and then maybe for 10 episodes or nine episodes or in the case of The American Revolution just six for a total of 12 hours. That is a huge huge responsibility of trying to keep to trying to earn someone's attention and that that's our job is really just making sure that that person who does not know who's ignorant but curious which is of course perfectly fine if you're willfully ignorant. I'm really can't help you. But if you're curious and ignorant, then we want to make sure that if you've given us your attention for this two hours of the first episode of the revolution and then stay for all 12 hours that you know we want to make sure that we've earned it in in in the simplest way that the equation is not at all above. There's no communication in this world. You already know this except among equals like if I look up or down already I've dislocated the possibility and the only communication is among equals and that's you treat your audience like they know something not not that they're familiar with the subject but they're not stupid and they don't they don't have to be added some sort of pabum you don't have to simplify it can be complex because if it is it'll they'll recognize either themselves or they'll recognize somebody that they know that's very close to them and That's the essence of good story is it's human beings telling stories about other human beings and what they do that has a resonance that that acrruuse like the layers of a pearl imperceptibly you can't identify but you know and of course a pearl is based on an irritant a grain of sand that's bothering the hell out of that you know oyster right you've you've you've created this gem out of the friction and irritation and resistance uh and perseverance of having to do something. I think one of the most uniquely American stories that you've told is the story of Jack Johnson.\n\nYeah. It's, you know, it's\n\n\nInteresting, because one of the great themes in American history is race. I mean, it's obvious because we were founded on the ideal that all men are created equal, and the guy who wrote that sentence owned hundreds of human beings and didn't see fit in his lifetime to free them. But you also have individuality. And what is with Jack Johnson? Like a good boxing match, you have a black man who also just wants to be a man, wants to be fully himself. Now, the society doesn't really want him to do that, and they're going to put lots of constraints, and he's going to overcome those constraints, and then when he does, they're going to find another way to box him in. But James Earl Jones was really great on this. He was almost saying, do not just be constantly distracted by the question of race. This is somebody who wanted to be a man, his own person, and that a great deal of Jack Johnson and all the travails and all the things that he went through, uh, and all the great, great, great, great skill. I mean, Muhammad Ali, we made a film on Ali too, which I'm really, really proud of, but um, he's clearly studied Jack Johnson. He knew they would watch those films. Robope is Jack Johnson. A lot of that making, wearing your opponent out is Jack Johnson from, you know, an earlier century. And this is a time, I mean, his heyday is between 1905 and 1915, when more African-Americans were lynched for looking sideways at somebody. And he's openly defeating every great white hope that came at him and dating, dating white women and marrying white women. And so, you know, we called the film, it's, you know, mostly we like to have um kind of boring things like The American Revolution, Brooklyn Bridge, The Vietnam War, but we call that film, uh, *Unforgivable Blackness: The Rise and Fall of Jack Johnson*. And I did that because the great black scholar W.E.B. Du Bois at the turn of the 20th century said, \"Boxing is in great disfavor. Um, Jack Johnson seems to be the cause. But Jack Johnson did nothing that no other boxer or sportsman or even senator has done. Why then has it come has it come to him? It all comes down then to his unforgivable blackness that by taking the crown, by defeating all comers, it was an unacceptable situation when in those days being the heavyweight champion was there was a sense of this was the supreme masculinity of the world, and that everyone went out of their way from John Sullivan to others to avoid fighting a black man. And finally, somebody paid Tommy Burns, guaranteed $30,000 to fight Jack Johnson on Boxing Day, the day after. What was that worth today? Oh my god. Oh my god. Millions and millions of dollars. Jack only got $5,000, but he's happy to do it. He's been going after Tommy Burns. No relation. And Tommy Burns was a pseudonym, a guy, can't remember his name, a Canadian. Anyway, in in in Australia, they fight on the day after Christmas, 1908, and and Jack Johnson just toyed with him. He could probably have taken care of him in the first inning, and he just keeps it going. They finally cut the news reels off. They actually stop the fight because they do not want the public to see this. And when after having digested, I think is a good word, all of the white hopes that were thrown at him in the interfering intervening year and a half, they finally convinced Jim Jeffries, the guy who'd retired undefeated, the previous champion before Tommy Burns, to come out. And in Reno on July 4th, 1910, the fight of the century, um, Jack Johnson defeated at, you know, no one thought it would happen, uh, Jim Jeffries, and there were riots all across the country. All across the country, white-on-black riots. The Los Angeles Times wrote their their lead uh editorial was a word to the black man. Do not lift your chest up too high. Do not put your face up to the sun. Do not, you are still the same lowly person you were yesterday just because Jack Johnson. And I mean the idea that that you know it goes back to this issue. Washington knew it was wrong. Jefferson knew it was wrong. They made so much money. It was really hard to do this. I mean, Jefferson himself said, slavery is like holding a wolf by the ears. You don't like it, but you don't dare let it go, right? And so what happens is that somebody like an Abraham Lincoln is born anti-slavery, right? But they're also a developing abolitionist movement. So now they want to abolish slavery. They're not just against it and understand that it's a moral God, nowhere does God say that that black people are inferior to white people. But what happens is even though most of the slavers know that it's wrong, but there's so many good profits to make, what happens when the abolitionists come along that they begin to make arguments that slavery is actually good and that black people are in fact inferior. And so one of the reasons why The Civil War happens is this sense of threat to their economic power, which are the four million people in the nine million populated south that are owned by other human beings. And it's a it's an extraordinary dynamic. We face it today. The reverberations and Jack Johnson, I think, is one of those magnificent cases where he it just he defies your ability to put it in a neat cubby hole. It defies your ability to make it binary. Like we live in this media culture, right? We live in a computer world. Everything's a one or a zero. Everything's a red state or blue state. Everything's young or old, gay or straight. What? It's not that way, right? And so to tell a complex story of history, particularly like of Jack Johnson, is is just to have your molecules rearranged. Yes. You know, it really is exhilarating. I I probably said that word too many times. It's it's exhilarating. Yeah. I think he's also one of the rare cultural figures that um where a sports figure defines a time, much like Muhammad Ali defined the The Vietnam War era. Like Muhammad Ali, when when I was a child, uh, my parents were hippies, and they never cared about sports at all, except when Muhammad Ali lost to Leon Spinks and then had the rematch. We all watched. I I remember this being a child thinking how strange it was that my parents were so invested in Muhammad Ali. But what they were invested in is this man that risked his entire career and livelihood. They took his livelihood for three years for protesting The Vietnam War and refusing to go fight. And it was a big thing because he was a cultural hero. That's right. It wasn't just that he was the best boxer ever. He was also this guy that said, \"I'm not doing this.\" The Vietnamese people didn't do anything to me. I'm not participating in this. I'm not going to go kill anybody. I'm not doing this. And we were all like, \"Yes.\" And then they took his livelihood away, and he became a martyr. He became a hero and, you know, spoke out against the war, and then it was three solid years in his prime before he came back. Yeah. It's it's an amazing story, and we told it just a few years ago in a four-part, eight-hour series. I I I uh I agree with you 100%. I'm a little bit older. I remember when Sonny Liston and and uh then Cassius Clay fought in Miami, and he was such a new commodity. He was rocking the boat with a with this verbal onslaught that we were for a nanosecond, sorry, that Sonny Liston lost because he was the person that we were familiar with. We knew this kind of black man, and we did not know this other scarier verbal person, and almost instantly, and my dad was an anthropologist. I mean, this was boxing. He was not doing the thing. But from then on, we became just loyal. We watched all the stuff through the '60s and then saw his opposition into the war, and then he said, you know, you could come and mow me down with the machine gun. I'm not going to go. And and and the ABC did some interviews with black soldiers in Vietnam, and they all to a person said, \"This is why I'm fighting. This is why I'm here. I'm fighting for him to say, 'I don't want to be here.'\" Wow. And I just I I just thought it was great. And I also wanted to do this because nobody People had done certain fights. People had done his fight with the government. I wanted to do Soup to Nuts. We wanted to do Soup to Nuts. My daughter, oldest daughter Sarah, and my son-in-law David McMahon. We made the film from birth to the death. This guy is in the late '60s, the most hated man in America for that stance that you were describing about the drug, and he dies the most beloved person on the planet. And I really loved the idea. I love the opportunity of being able to show how that happened in the midst of, you know, they call it the sweet science, but there are some fights. Those the the three fights with Frazier are like as brutal as anything you could ever possibly imagine. And and what they went through and what he ultimately clearly in retrospect lost as a result of winning two of the three of the fights, um, is is one of those miraculous stories. And I agree, like Jack Johnson is is defining an age, and so interesting that it's in a marginalized um activity, like even back then, like heavyweight boxing. Well, marginalized, but still elevated. The heavyweight champion of the world was still the baddest man on the planet, and people still wanted to watch it, but it was thought to be a a backroom sort of darkly lit, dingy pursuit. You learned it in the dangerous gyms. It's not something that you learn on a college campus with educated professors and analysts that have reviewed proper technique, which is how they teach in Russia. You know, Russia has a very um like technical version of and what they do in America as well too now, but not back then. Now, back then it was dark, dingy gyms, mob runs, sporting the sporting world, and you were there. There were gamblers, there were women of the night, it was, you know, money was being mob, lots of lots of uh throne fights, and and uh was in the interest. It was so interesting that that emerged this person who was so resolutely himself, just as Muhammad Ali would be decades later. It's why I'm drawn to it. I'm not a big fan of boxing, but you're it's irresistible. You can't take your eyes away from these two men when they're fighting. They're first of all, spectacular specimens, and they are amazing fighters. They changed the whole dynamic. And as you said, there's no greater boxer than Muhammad Ali. Well, the really terrible thing is Muhammad Ali's best years were taken from him. Yeah. Because if you go to 1967, I I've talked about this numerous times on the Joe Rogan Experience podcast when he fought Cleveland \"Big Cat\" Williams. Yeah. That fight was one of the most extraordinary performances of any heavyweight ever. It was Cleveland was a dangerous guy. Like vicious knockout puncher. He was a real specimen himself. Yes, he was. And Ali toyed with him. I mean, toyed with him. Just boxed his face off, knocked him out moving backwards. Just just picked him apart, popped him and showed movement and speed and agility and technique that we had never seen from a heavyweight ever. He was the greatest. The greatest, the greatest. And then three solid years. Here's my Yeah, I think this is what makes him so great. This is like Ted Williams only much bigger because Ted Williams loses a lot of time to World War II and to Korea and comes back and, you know, still hits, you know, 350 or whatever is he hits for the the Red Sox, having lost what you'd consider the prime of his career in in his early days in World War II. And then and as a fighter, this is not like the Goodwill ambassador. He's flying fighter bombing runs, you I mean he's like really it's every time he can not come back and he's he's a magnificent stuff, but it's not denying it as they did in both Jack Johnson. They took away his title and he and he was from 1912 to 1915, and then finally they put him in the ring in Havana with Jess Willard, who's a younger guy. He's 105 degrees, 110 degrees on the canvas. They're going to go 40 rounds after the 26. This guy who's got 10 years on Jess Willard. He's 37. Willard's 27, you know, Willard finally gets in a thing and and it's like, oh, thank God. And they would not let another black man fight for a heavyweight champion until he was not Jack Johnson. That is to say, until he was Joe Louis, light-skinned, couldn't be seen with a white woman, couldn't smile at his victories, and and and Louis agreed to all of this. It was the unspoken, unwritten rule that you couldn't be an in-your-face black man. And that sort of obtained for a couple of decades. And then Ali came and he said, broke the mold. Broke the mold. And and essentially basic, they used to say when he was training, um, Ali was training, there'd be ghost in the house. Ghost in the house. And that meant that Jack Johnson was there. Oh, wow. And that Ali had to be that much better. Wow. Ghost in the house. Wow. The Ali of three years later was a completely different fighter. Unfortunately, physically, he didn't look the same 'cause he didn't train for three years. He didn't do anything, and he lost everything. I mean, he still was one of the greatest. I mean, still was able to beat Joe Louis. Still was able to beat George Foreman, but he is a different fighter. He didn't move the same way. He didn't have the same physical build. He didn't look as good. He lost three solid years in his prime of training. And it makes those post uh Vietnam years even more spectacular. The fact that he could prevail over Frazier and over I mean that the the rumble in the jungle is just crazy, crazy what he did. Yeah. What he did. Well, nobody thought he was going to win. No one thought he was, including Hunter S. Thompson, who famously sabotaged his career by not covering the fight. He was sent over there to cover the fight and instead decided to just swim in the pool and drink. Yeah, because he didn't want to watch Ali get destroyed. Meanwhile, he missed one of the greatest fights of all. I remember I was in college still, and we got um soundless black and white footage of the fight, some of it in slow motion, and my film teacher showed it to us, and none of us were interested. I was like, whoa, this is stuff I did with my dad 10 years before. And it was him delivering a blow to Foreman and seeing in slow motion\n\n\nThis halo of sweat coming off the afro of George Foreman.\nI mean, I will never forget just the specta, almost the beauty of this incredibly brutal sport.\nYeah, incredibly brutal.\nBut in those moments, it elevated everybody who watched it.\nThat's the crazy irony of it all.\nIt's like in this brutality, this beatdown of another man, everybody who watched it was elevated.\nIt's, it's, um, cuz someone did something that we thought was impossible.\nExactly.\nAnd it was that person who did it, this guy who stood up against The Vietnam War.\nAnd you know, at the time we didn't realize how bad The Vietnam War would look retrospectively.\nYeah.\nNo, he did not enjoy any benefit of the doubt in this.\nIt was really another time of division and people exploiting division and making them.\nHe was the worst them that there possibly could be.\nAnd I think the fact that he was able to stick to his guns.\nI mean, he could have said, \"Okay, I will go and do goodwill stuff.\"\nAnd it would have been all over.\nAnd he said, \"No, I'm not going to.\"\nRight.\nFamously, \"No Vietnamese ever called me the N-word.\"\nYeah.\nAnd just the fact that at the time we didn't understand, we were still locked into this perception of military conflict being like World War II where it was imperative to save the world from communism and that there was a real problem.\nThere's a real threat to the American way of life and America as a whole that was going on in Vietnam, which now seems absurd.\nIt seems absurd.\nThere's a wonderful parallel.\nI mean, when I, when, when I said that Twain said that history doesn't repeat itself, but it rhymes, like we have a failed invasion of Canada in The American Revolution, there's a big debate over inoculation.\nThere's an eclipse that takes place, you know, all of this sort of stuff.\nAnd there's always an interesting thing is that particularly in New Jersey and South Carolina, the British are always talking about we have now pacified New Jersey, the province of New Jersey.\nWe have now pacified the province of South Carolina.\nAnd then all of a sudden they have to admit that it's unpacified because the patriots have taken over and done all this guerrilla warfare that has made it unpacified.\nAnd at one point George III and many others within the British government are worried about what we would call the domino theory.\nIf we lose them then we're going to lose Ireland.\nIf we lose Ireland we're going to lose Jialter and we're going to lose the the subcontinent of India and we're going to lose and so you go there's nothing new under the sun.\nRight.\nNothing new under the sun.\nIt's, yeah, The Vietnam War and your 18-hour piece on The Vietnam War is one of the more confusing aspects of the United States history because it like looking at it today it doesn't make any sense how we sold this.\nNo.\nAnd and every president from Truman, Eisenhower, Kennedy, Johnson, Nixon, even Ford never told us the complete truth about it, right?\nAnd and and did stuff that got Americans killed and lots of other people killed over what would have been where there's a Geneva Convention in '54 that basically said we could separate into two places and in two years we had an election which everyone knew Ho Chi Minh would win.\nIf he left it at that, we'd be talking about three million people still walking the earth at least.\nCrazy.\nCrazy.\nAnd the communist Chinese and the Soviets were very suspicious of Ho Chi Minh.\nThey thought he's not a communist.\nHe's just a nationalist.\nAnd he knew,\nI'll tell you, the day that the the Japanese surrendered in Tokyo Bay officially was September 2nd, 1945.\nThat same day in Badin Square in Hanoi, um, Ho Chi Minh declared Vietnamese independence and he quoted Thomas Jefferson.\nWhoa.\nAnd standing next to him were OSS guys.\nBy the end of September, the State Department having realized, oh, this World War II is over, but we're going to be in a new, they didn't call it Cold War yet, but we're going to be in an epic struggle all around the world with communism, and this guy has been to Moscow and whatever, so he must be a communist.\nAnd so, all of a sudden, the State Department, the OSS, had saved his life.\nThey parachuted into northern Vietnam looking for people that could mobilize in their help against the Japanese and found a sick and dying Ho Chi Minh.\nWe don't know about his malaria or whatever, treated him and brought him back and he was, he didn't see us as the enemy and yet we in those two years in '56 when they should have held an election we had already decided to place our our our our bets with Ning ZM who was a corrupt South Vietnamese politician who would eventually be assassinated by, you know, a general who would be one in a series of generals until we got you and key and those were the people who took us out of it or or were on their watch when when the North Vietnamese, you know, finally united their country.\nIt, it's, it's just and the lying, you know, that we have the tapes of Johnson and of Nixon and and it it just, you know, there's an arrogance to record yourself for posterity, you know, and you be careful what you say that some of the things that not all of them have been listened to.\nThey haven't all been transcribed.\nAnd we were fortunate to spend a lot of time just listening and listening and finding just some stuff that, you know, if if Nixon and Kissinger had walked into the peace talks that were already started in January of '69 and taken the terms that the North Vietnamese were offering, they would have had better terms than what they had in '73.\nAnd there would be fewer Americans, a lot more Americans alive, 25,000 more Americans alive, something like that.\nAnd hundreds of thousands of Vietnamese, Laotians, and Cambodians.\nThat they didn't want to be the first president to lose a war.\nIn fact, they'd already soured the South Vietnamese.\nThey said as Humphrey was coming up in the polls, he only lost by .7 points of a percentage, um, in the election.\nUh, he'd been way behind and was making a lot of speed.\nA lot of it had to do with what people perceived as progress in Paris.\nAnd the Nixon administration or not administration, the the Republican party of the Nixon's election camp reached out through an intermediary to the South Vietnamese government and said boycott the talks in Paris and and if you'd had another week or two to the election you would have had Hubert Humphrey as president or or if they hadn't reached out to the South Vietnamese and and Johnson got it on tape, they were taping the the South Vietnamese embassy in Washington and in the palace in Saigon and he knew it and he called up Nixon.\nThere's a tape and he goes and he goes, \"Oh, I would never do anything like that,\" and Johnson either pissed off at Humphrey because he's not as much as a hawk as Johnson had become or more than likely unwilling to admit to your allies that you had been taping them in their own embassy in Washington and their own palace in Saigon did not tell the truth of what he knew that Richard Nixon had essentially reached out to a foreign power at the time of a national election to try to influence that election.\nWow.\nYeah.\nI mean, it's just endless and the reverberations like the the one thing that it did that I think is like so pivotal is it destroyed the faith that the United States citizens had in its government telling them the truth and in engaging in military activities cuz we had always thought we were a just government.\nWe were a just society and that if we got into World War II was to save the world.\nIf we got into Vietnam it was to save the world.\nOh no, it wasn't.\nNot only that, we got in on a lie.\nWe got literally got into the war on a false flag.\nThat's exact.\nSo, it was entirely engineered.\nAnd then there was also the heroin production, which was a big part of the whole thing.\nThis the the heroin trade.\nThere was money that was being allocated to various individuals through the heroin trade that was facilitating a lot of it.\nIt's very confusing stuff.\nWhen you look at it over time and you look back at it, you're like, what?\nWhat would a United States look like had clear heads prevailed?\nOh, absolutely.\nWhat would we look like today?\nThe counterfact, well, I think we'd be less divided.\nI think a good deal of the divisions now we're sort of born in there.\nThe trenched uh positions that people take now.\nI think there's also a sense, you know, the Pentagon papers were McNamera going to a gentleman that we uh uh interviewed, Robert Gard, and and saying, \"I need to find out all the decisions.\"\nAnd he learned, not only was he lying at at times, you know, going and getting battlefield reports and then coming back and saying it's all rosy, but everybody had been lying back to the Truman administration about what was going on.\nAnd it was just a series of lies.\nAnd that's what when they asked the Rand Corporation to sort of analyze some of the data.\nThat's when Daniel Ellsberg who worked for the Rand Corporation surreptitiously illegally copied them and then released them um uh to various newspapers and they became you know what we call the Pentagon papers but they were always the Pentagon papers and they detail exactly what you just described just a complete pres, you know, presence of both parties, a military-industrial, I mean, you know, when when when Eisenhower leaves just before he leaves, he warns of the military-industrial complex.\nYeah.\nHe's not saying this is something that happened last Thursday, right?\nHe's saying this happened the second World War II was over.\nWell, even before that, Butler talked about it in '33.\nPeople, there was so much money to be made that nobody wanted to to ramp down the armaments.\nAnd so you end up having these proxy wars.\nYou end up having, you know, these places where you're going to not have a hot war because that means the end of the world in in a world of nuclear weapons, but you're going to fight these proxy wars in different places.\nAnd and Kennedy, it's a doctrine that Eisenhower and Kennedy and they all sort of embrace and figure out that they that they can do it.\nAnd then of course Johnson, who you know, Kennedy inherits 700 advisers from Eisenhower.\nJohnson inherits 17,000 advisers now in quotes um when he comes in and he still has to wait until he wins re-election overwhelmingly a year later and it's only into the following March of '65 that he commits ground forces, first army and and first Marines and then then army uh to Vietnam and then we have the boots on the ground even though we'd had boots on the ground for a long time and engaged in combat.\nThese advisers were very much engaged in in that sort of stuff and then it just get escalates.\nYou know, at the peak it's well over 550,000 soldiers in American soldiers in country.\nInsane.\nInsane.\nIt's also, you know, the coming to fruition of Eisenhower's warnings.\nAnd then this inspires this counterculture of the 1960s that sort of reshapes art, reshapes culture, reshapes rock and roll, politics, politics, everything, everything changes.\nAnd then, you know, Nixon comes along and to stop the anti-war movement, to stop the civil rights movement, puts these sweeping schedule one drug acts on all these different, you know, psilocybin, all these LSD, all these different things that they believe these people were involved in so that they could start arresting people and sort of throw water on the entire movement.\nAnd it's effective.\nIt is so interesting to look and I've got a in my office this wonderful two-framed maps if you will and there are the inter twwining of the various two parties, the Democrats and the Republicans over time.\nSo the Republicans are the party of Abraham Lincoln, the party of emancipation of whatever and the party that invented progressivism in the first part of the 20th century.\nUh, Democrats had been not that place.\nBut in the '60s, it began to change thanks to Lynden Johnson of Austin, Texas, uh, who who understood that it was the right thing to do to to put in those civil rights and voting rights acts and other things that we call part of his Great Society by a film, by the way, that we're working on now will be out in a few years.\nBut um, he knew that the bargain would be to give up uh The Solid South.\nI mean, you woke up on election day if you're a Democrat and you had every one of the states of the former Confederacy, all of them, all of them in your in your tally and that's flipped.\nAnd now you wake up on on election day and you more or less have had have all the states of the former Confederacy on the Republican side who abandoned what they were about.\nAnd it's interesting to see in which for self-interest, for whatever.\nI mean, Nixon begins it.\nHe, Jackie Robinson is a Lincoln Republican.\nDidn't go over as many black people did to FDR during the New Deal.\nHe was supporting Nixon for president, but Nixon wouldn't come to Harlem campaign.\nWow.\nSo, he ended up voting for Kennedy.\nAnd and he and Goldwater fully understood that we're just going to now switch the Republican party and go after just white voters who are disaffected with changes in civil rights.\nAnd so it's it's an interesting story of the way in which parties can change places and be the the very opposite of the thing they were.\nYeah.\nJust a few years before.\nYeah.\nBecause they're all gross.\nWell, I just find the thing is, you know, the bad word is is progressive today.\nAnd this is this is the, you know, the Republican party uh invented progressivism and and they joined forces with some more liberal Democrats in the big cities, right?\nBut the opposition to the civil rights bill uh is coming from southern Democrats and it's it's it's Lynden Johnson knowing that he will have to use every bit of his powers of persuasion to get it over and he will require lots of Republican votes and he does.\nSo you you do have something positive happening in American history where the two parties are coming together and not just lock step where every single Republican votes for something and every single Democrat votes against it and you you just feel like somebody's they're from two different planets.\nYeah.\nAnother thing about The Vietnam War that's so crazy is like we've kind of accepted the fact that the United States military does things overseas that we don't want them to do because after that war it sort of set the stage for Afghanistan, Iraq, all all those, especially Afghanistan, like this prolonged 20-year completely complete failure, especially in how we withdrew from it.\nIt's like we've we've lost a lot of faith in the decisions.\n\n\nThat are made. I actually think that you have young officers like Coen Pal who are learning the lessons of The Vietnam War. And so what you find is extraordinary reticence in the late 70s and the 80s and the early 90s. So the first Gulf War is very much a uh a reflection of Vietnam, chastened by the excesses of Vietnam. We're going to do it with a coalition, you know, we're going to do it with one arm tied behind our back. We're going to stop a little bit sooner. We're not going to have the full destruction of this. All these sorts of things are inherited from Vietnam. But then real politique comes in and then all of a sudden you realize we're in Afghanistan because of 9/11. We're pursuing this person. It's not We had a chance to get him. We missed him. It was not our fault. And we then switched the focus to Iraq and then ended up in both places in a kind of, you know, terrific stalemate that, as you say, just was I think back to being Vietnam. I mean, I always say this that if we, you know, we made our film on Vietnam that came out in 2017. If I had done the film 10 years, and this is why history requires perspective. If I had done it 10 years after the fall of Saigon in 1985, there's a recession going on in the United States. Not big, but we talk about the Pacific Rim. Japan is ascendant. We think Japan is going to be the best thing. Um, Vietnam would be this ball and chain that we'd be dragging around us forever. If I waited 20 years to 1995, we're the sole superpower. We're in the middle of the largest, to that point, largest peacetime economic expansion in the history of our country. And Vietnam would always be important, but it wouldn't be this symbol of our decline, right? If I'd waited 30 years to 2005, when we are bogged down in Afghanistan and Iraq and people are beginning to use the language of the Vietnam and getting stuck in these unwanted perpetual never-ending wars, you'd have another view. And so to do good history is to actually get some distance and perspective. So you can look at the Vietnam War from the mountaintop of 85 and 95 and 2005 and then realize I've still got other experiences. New scholarship has come. Classified material has been released. More of those tapes have been listened to. There's been a mellowing among the veterans and a willingness to speak. Gold star mothers realize they can't hide their grief. We have one in the film. She can't. She knows that by telling her story, she will help thousands of other people who have lost their children. We can interview soldiers from other sides of the conflict that seem to speak exactly like our soldiers and that you've begin to develop a way to see it more holistically than in just a kind of journalistic and almost political response. So that was bad. We did that badly. That we did this poorly. You can see it for this hugely, hugely complex machine that it was. It just ate up human beings and ate up credibility as you're saying, uh, that the United States had built up as the greatest power on earth and and certainly the good guy in in what we euphemistically call the good war. That good war is the worst war ever. More than 60 million people's lives were extinguished in World War II. But as we said it in our film about World War II, Colder War, uh, one of our pilots said it was a necessary war. And that's what we should be thinking about fighting, necessary ones, not the ones that are going to, you know, have all these ulterior things that you described. And it's also like unwinding all that bad and sort of reshaping America's perspective and the way the world perceives us takes so much time. And I think we lost so much of that post 9/11. I think 9/11 had the entire world in our sympathies. I agree. We were we had been attacked. The whole world thought of us as being like this shining light, like, wow, we have to stand against this. Then we go and invade Iraq and everyone's like, what are you doing? Like, what is this? There's really no weapons of mass destruction. It's all a lie. The thing that the depression did is it got used to Americans doing without and it made it very easy for Americans to segue into the Second World War because it was about shared sacrifice. Something they'd learned on a domestic level, they could now learn it on an international level. And they did that. We had an opportunity at 9/11, it seems to me. And I haven't made a film about it and I imagine once we get enough years out, it might be interesting to sort of look at that we had an opportunity to collectively turn the energy that we had, the grief and the and the sense of purpose, even anger of that moment as well as the world's unabashed sympathy for what we've done and turn it into something productive. And yet we didn't. We then, as you were saying, we moved into sort of ration and justifications for Iraq that were, as we know in retrospect, completely fraudulent. Yeah. From the outside, like me looking at your work, I get anxiety just thinking about the daunting task of taking on these subjects. And I know you have 10 years for some of them to like really ruminate and really figure it out, but what is your process like? How do you begin? Like you said, you're going to do something on Lynden Johnson or if you're going to do something on Vietnam, like how do you, what is day one look like? Day one is making sure that you're looking yourself in the mirror and you're going to commit to that because I'm now off like a congressman trying to raise money from foundations and corporations and individuals of wealth and the Corporation for Public Broadcasting and things like that. But you're immediately reading, you're immediately talking to scholars who spent their life maybe on this aspect or that aspect of Vietnam. We had, I think it was 23 scholars, all who knew one aspect. And I knew we were on to something when we'd have these screenings and a scholar would comment and all the other 22 would like whip over like they hadn't heard that and so that the film would do that. It's daunting. I asked Shelby Foot about U.S. Grant and he said Grant had what they call 4:00 in the morning courage. That meant you could tell wake him at 4:00 in the morning and tell him the enemy had turned his left flank and he'd be as cool as a cucumber. And so what you develop is 4:00 in the morning courage. You wake up and go and we're still doing it. I'm still waking up. I didn't like the way that sounded. Why didn't we trail that a step? So, you just put one foot in the other. You trust a process. Process is a really important thing. We're all impatient and impatience kills process. Just like comparison is the thief of joy. If you're impatient, then process is squandered. And process teaches you really important things of how to relate to a subject, how to collect the material, and then how to figure out how to digest that material into something that's a cohesive story that I can give to you who may be ignorant of that story, but it's daunting. It's terrifying and I wouldn't have it any other way, you know, and I think I'm speaking for the people who work with me because there's something everybody responds at 3 in the morning, you know, everybody says, \"Yeah, what what what do we do that? We can we can fix this. We'll find an alternative to that to make it better.\" And sometimes it's the niggling tiny things. Sometimes it's really big to have the courage to take out an entire scene that really is working really well but destabilizes the film a half an hour later. And I I did that in our Mark Twain film. I took out this beautiful pros thing from Life on the Mississippi called White Town Drowsing about Hannibal, this disguised Hannibal sort of waking up from its slumbers as it sees the puff of smoke north as the steamboat's coming down and the whole town is industry and activity and loading and unloading and whatever. And then by the time the puff of smoke is around the bend south, everybody's back asleep again. It was called what? It was just fantastic and written. It was so beautifully. Mark Twain is like never wrote a bad word. And um and I I just realized we weren't getting out of the early biographical stuff soon enough. And I I said to my partner on the film, the co-producer and the writer who'd found that quote from Life on the Mississippi, I said, \"We're taking it out.\" And he looked so hurt and so pained. I said, \"Look, I'll put it back in if you want it.\" So, we left it out and I thought it worked. Brian, he came to me, looked sad. I said, \"I'll put it back in.\" And for about six months, we went back and forth. And then finally, he came to me and he said, \"You were right.\" And I said, \"You can put it in the book. We'll put it in the DVD extras. We'll do all the things that you need to do.\" But that's the kind of 4:00 in the morning courage you need to do is take out something that like it, it worked so well and yet you remember the movie Amadeus, too many notes, too many notes, you know, and you just go, you got to, you got to do that. I'd rather the reason why we have the it's complicated is because there's not a filmmaker on earth that doesn't want to change a scene that's working, but we have spent our entire professional lives changing scenes that were working when we found out new compromising sort of contradictory information and maybe it made the scene less, maybe the scene disappeared, but it actually serves the honor and the virtue of whatever that story requires. And this is true. So many things in The American Revolution that that that are close to me because we're just coming off the months and months of these unbelievable sacrifices of having to take out one phrase of a sentence or changing one little thing just to help fine-tune it. Nobody would notice. If I left it in and you looked at it twice and then I took it out the second time, I don't think you'd notice it, but I'd notice it. So, I'd wanted to to be and and that's the the beauty of public broadcasting, too, is that it gives you that chance to do that. There's not the only platform that would allow you to do it that way. I I I don't think there is another platform. I assume that A-list directors in Hollywood who have um, you know, the final say, enjoy that as Steven Spielberg, who is, you know, one of the great directors of all times, I'm sure. But there's still suits that are coming in. There's still people who are giving him notes. Right. We get notes from scholars. We get notes that are sort of like this. You've got lots of voices of loyalists in there and that's really good because people tend to ignore the loyalists. They're just de facto bad people and you don't make them bad people. But you don't have a loyalist who goes through several episodes that you follow throughout the film. So, we had this loyalist quote in our fourth episode in the Battle of Bennington where this guy named John Peters who's been in Vermont, been driven out by the patriots. He's gone to Canada. He's formed a revolution. The family, his wife, and small infant kids are driven out. They find a British patrol boat somehow on Lake Champlain. They reunite. He starts a regiment, a loyalist regiment, his 15-year-old son. They find themselves with Burggoyne's army around Bennington where they've been told there's great loyalist sympathies and not that many patriots. It's the opposite. There's no loyalist sympathies or none that anybody is speaking up for and there are lots of patriots and they're defeated. But at one moment, this man John Peters is on a parapet of a quickly made redout of a fort that you they've put up to try to repel the attacking Americans. And he hears the voice of a man named Jeremiah Post who is saying Peter's you damn Tory, which is the other insult that you would give to a loyalist and um he recognizes the voice of his best friend growing up and cousin of his sister and at that moment Jeremiah Post, the the um rebel, the patriot stabs him with the bayonet into his into his bone but it's deflected by the bone of the rib cage. At that moment, as Peter said, I was obliged to destroy him and he kills him with his pistol. Wow. That's The American Revolution. So, we had that quote and it was like, but why don't we go and put John Peters in episode 1 and episode two and episode 3 and episode 4 and then episode 6 when he's leaving and moving to Nova Scotia permanently and not going to be a part of this new deal. But you want to know what The American Revolution about it? Killing your best friend on a hill west of Bennington, Vermont, right? You know what I mean? I mean, we say kind of without thinking about The Civil War, brother against brother, you know, and it's I guess it's true a few times, but the revolution is like that. Henry Knox, who's this sort of big amiable book seller who Washington somehow figures out picks out of a crowd and he said, \"Oh, go to Tyonderoga and get those cannon we captured earlier in the year and bring them back here. I I I got to drive the British out of Boston.\" And Knox does. Sleds, impossible. Hundreds of miles overland and over Lake George and, you know, terrible weather. And he gets it there. But he's married to this young woman named Lucy whose parents are loyalists. And so she loses in the revolution her father, her mother, her brother, and her sisters. That's the choice she made by marrying Henry Knox, this sweetheart of a book seller who learned most of his stuff about artillery and gun imp placements from the books in his bookstore and from serving as, you know, in the local militia. And he puts the guns, he gets the guns up top and the British wake up and go, \"Uhoh, we're out of And they go to they go up to Nova Scotia to regroup. Massachusetts thinks the war is over. They thank General Washington for his service and enjoy his retirement. He goes, \"Are you kidding me? I'm going to New York.\" Which is exactly right because that's where the British will attack next. And the largest battle of The American Revolution is the Battle of Long Island.\n\n\nAnd I won't spoil it for you what happens.\nPlease don't.\nKen Burns, your national treasure.\nThank you so much.\nThank you, Joe.\nThis really appreciate you being here.\nI really enjoyed it and like I said, I've been a giant fan of your work for a long time, so this is a huge treat for me.\nThank you.\nThank you.\nThank you.\nBye everybody.\n[Music]\n[Applause]\n[Music]\n"
}