{
  "episode": {
    "id": "LiZC7ztBC-U",
    "title": "Joe Rogan Experience #2348 - Lukas Nelson",
    "publishedAt": "2025-07-10T17:00:35.000Z",
    "description": "Lukas Nelson is a country music singer/songwriter and Grammy Award-winning producer. His new album, “American Romance,” is available now.\n⁠https://www.lukasnelson.com⁠\n\nThe ultimate wireless hack. Make the switch at ⁠https://visible.com/rogan⁠"
  },
  "channel": {
    "id": "UCzQUP1qoWDoEbmsQxvdjxgQ",
    "name": "Joe Rogan",
    "slug": "@joerogan",
    "url": "https://www.youtube.com/@joerogan"
  },
  "transcript": "Joe Rogan podcast. Check it out.\nThe *Joe Rogan Experience*.\nTrain by day. Joe Rogan podcast by night. All day.\nWe're up. Lukas, what's up?\nHey, man.\nGood to talk to you, man. Thanks for being here.\nHere. Yeah. I appreciate you having me.\nI got to tell you, you know, when I heard Willie Nelson's kid plays music, there's a thing that you always do, and I I have to admit it. You do it like when the son of a great man, you always assume, well, yeah, he's probably mediocre, you know what I mean? And then you performed at McConna's that charity function thing and you [ __ ] killed it, man. You blew me away.\nIt was incredible. And I was like, \"Wow.\" It was really cool to see, man. It was really exciting.\nIt was really fun.\nYou know, you were the highlight of the night, man. You really were. It's moments like those where I started to gain confidence. You know, I'd have over the years I'd go out and play, and I'd play my songs that I've written, and you know, I get crowds that would do that, you know, and so that gave me the confidence to keep going, and it and and I first started playing music in order to get closer to my father.\nOh wow.\nYou know what I mean? So I I I he would be gone all the time, right? And I'd be missing him. And uh and so in order to get close to him, I figured I I need to speak the same musical language. And uh and so I learned Young. And I wrote a song Young uh that's on the new album actually I got. It's called *You Were It*. It's the first song I ever wrote when I was 11. And and my dad loved it so much that he covered it at the time, and he put it out on his album back in 2004 called *It Always Will Be*. That the album was called *It Always Will Be*. And that gave me the confidence at a young age.\nChris Kristofferson came up to me and he's like, \"Man, you don't have a choice but to be a songwriter.\" And so I had all this inspiration at a young age.\nKind of like an athlete at a certain point. You kind of have to look at like, oh well, if I have a talent at this, I have oper like I have connections in the industry.\nI need to work like I was going to go to the Olympics on this because it's something that I can do that will make it so that I never have to rely on my family or my father for anything, right?\nYou know, I my whole goal in life is to discover who I am as an individual. You know, is that a part of the difficulty of growing up with an incredibly famous father?\nI think the, you know, Victor Frankle has a um a book, a very famous book called *Man's Search for Meaning*.\nUhhuh.\nAnd it's about Awitz, and he was an Awitz survivor, and he wrote about what was the common denominator in terms of people who persevered and survived in these camps.\nAnd dignity and meaning were the common denominators generally. And so finding who you what you mean in this life to yourself, it doesn't have to mean anything to anyone else. And I think that's where for me I've lived my whole life trying to discover who I meant to myself so that at the moment of my death I can look back and say I did something that I enjoyed that was meaningful that gave me a sense of purpose.\nH yeah, the the there's a both a blessing and a burden to uh being the child of someone who's incredibly famous at a thing that you're trying to do.\nSure.\nYou know, like there's there's a lot of sons of athletes, for instance, right, that live in their father's shadow, and very few of them ever rise to the level that their father was at.\nSure. I think for me, I was never trying to be as great as him. I was only trying to be close to him because more than anything, my father's a great human being. He's a well-rounded, kind, empathetic human. And I am I I'm truly grateful to be his and my mother's son.\nUh, you know, because I have a good family. I'm lucky, you know, I you know, I have a good good parent. So what I was trying to do was just be closer to him. And you know, as a little kid, you know, the best thing my mom ever did was when I was like earlier, I was probably five or six years old, and my brother had just passed away not too uh long before this actually. And I would cry every time my dad would leave, you know, and my mom sat me down one time and he said, \"It tears him apart when you cry like this because he doesn't want to leave. He's going out there. He's making people happy. He's giving people joy. And he's doing what he came here on this earth to do. And he's supporting this family. And so the support that my mother had for him at that moment, I never cried again. I was able to let go of that idea and then just from that point on work towards creating what would make me happy in my life and give me the same joy and then give and be able to take care of a family hopefully. You know, my one of my greatest sources of pride is that I haven't had to ask my parents for anything. I bought my own house. I bought my, you know, I I went and did *Stars Born* and I got, you know, I mean, I I've been able to make myself a living, and I think that makes my parents proud. It makes my dad proud, and that's what I've always wanted to do. That's been my whole my whole life is want to make them proud, you know.\nThat's awesome. Well, it's a great motivation, you know, for sure when especially when you have great parents that that try to\nI'm lucky in that way, you know, I know a lot of people have broken homes and grew up and even\nI caught dad at a good time. I mean, my dad was 55 or so when he had me, you know, and so he had already been through a lot of his demons and gotten through them and faced them, you know, and was still going through them at the time that I was born. But he had come out of, you know, a life of habit and sort of formed the ones that would take him at that point to where he is now at 92 years old. Wow. And so I got a good version of dad um you know who had grown since you know and so man you know I'm the luckiest guy in the world. I feel like I, you know, I was able to be exposed to a lot of great music, a lot of great mentors, you know, in my life. And\nuh and I'm also lucky uh that I at at a young age, I'm grateful to my younger child to the myself as a young child for having the wisdom to say, \"All right, work hard now. Forget about parties. Forget about hanging out. Work hard eight hours, 10 hours a day. Practice your guitar. Write all the time. Sing all the time. So that when you get to a certain point in life, you'll have something to show for it, you know, something that you can leave behind that's yours, you know.\nYeah. That's awesome, man. That, you know, that's what most people in this life want. They want a purpose.\nYeah.\nYou know, they want something that means something both to them and to other people.\nExactly.\nYeah. It's hard to find.\nIt's hard to find a purpose. You know, I I that is something that I've always had growing up. And I think it's because I was, you know, again, I'm grateful to that younger kid. Sometimes I I feel like he's wiser than I am now. You know, that younger self is like almost\nI'm, you know, I now and now that I'm sober. I mean, I quit smoking weed. I quit drinking. And you know,\nwhen did you do all that?\nReally around the pandemic.\nYeah.\nBut that's usually when a lot of people started.\nYeah. I went the opposite way. I started meditating twice a day. You know, the only thing I'll do now is mushrooms every once in a while to check in with myself and, you know, just kind of make sure that I'm, you know, I feel like mushrooms is like taking a nice goodole hose to your soul and just kind of like, you know,\nYeah. clean out all the [ __ ]\nClean out all the [ __ ] Like I feel like, you know, they should be legal.\nYeah. 100%.\nReally? If I could talk Trump into one thing, that might be the one thing I, you know, I had this conversation with Paul Stamuts the other day. I love Paul Stamuts.\nHe's amazing.\nYeah, he's great. I just saw him at the uh Dead Show. Uh the Sphere show.\nOh, yeah.\nOh, that's cool. That's cool. Yeah.\nHave you been to his place? He invited me to his place up there. It's supposed to be amazing.\nI was just reading an email from him today. Invited me to his place.\nThat's awesome.\nYeah, he's uh he's a prepper. He's ready for the apocalypse.\nYeah. Well,\nmight be a good idea.\nI mean, maybe. I don't know. I think we're going to be okay. I do too.\nI do. I mean, I think the feeling that we might not be okay though is a great motivator.\nWe should always be checking in with ourselves and asking ourselves, are we going too far to certain extremes?\nYeah. Well, that was the part of the conversation that we had, you know, we're like, is there a thing that could really help the world? And it sounds so cliche and hippie and and especially as someone who's never done mushrooms, but I think that might be the thing, you know, even if it's just like small doses, just a little something to alleviate anxiety, bring people closer together, make them understand that there's more to life than conflict and [ __ ] And most of your conflict is [ __ ] Most of nonsense and most of it's unnecessary.\nYeah. My dad always says 99% of the things you worry about never come true, you know, and it's just a matter of\nYeah. I mean, it is sort of a cliche. I I read the uh the power of now, which is echartole when I was like 13.\nI used I went to school next to a Buddhist temple.\nAnd so I grew up with my dad teaching me the Lord's prayer that I'd say every night. And then I'd go to this Buddhist temple and hang with these monks, you know.\nReally?\nYeah. Yeah. In Maui. I grew up part-time in Austin. I was born in Austin. I was in Maui. And so I\nThere's a Buddhist temple in Maui.\nA Buddhist temple right near where I was going to school at the time. So after school every day, I'd sit with these monks. And just the vibe of that is is powerful. The chanting, the energy around that, you know, the presence though that they have. They're just, you know, their whole goal obviously is to just, you know, be purely present.\nYeah. And u and so while that sounds like a cliche, I I truly believe that that's an important thing, you know, to to let go of the the the the battle of positive and negative that in the mental space that's all that exists is duality, you know.\nWell, to find a true path, you have to avoid being pushed and pulled in a bunch of directions that are totally unnecessary. Yeah.\nAnd sometimes you get sort of preoccupied or captivated by the push and the pull of [ __ ]\nWell, and we're we're we there is a manipulation that happens um on purpose. I have a song called *Turn Off the News and Build a Garden*.\nDo you ever hear that song?\nNo, I haven't heard that one.\nYou want me to play it for you?\n[ __ ] yeah. Yeah, play it.\nAll right. This is a song called *Turn Off the News and Build a Garden*. And I wrote it because because it's great advice.\nYeah. And I just I was just the new cycle. I mean, there's there's a difference between being informed and being constantly captured by the overwhelmed.\nYes.\nLet's see.\n[Music]\nGot a tune for all your listeners.\n[Music]\nI believe that every heart is kind.\nSome are just a little underused.\n[Music]\nHatred is a symptom of the times.\nLost in these uneducated blues.\nI just want to love you while I can.\nAll these other thoughts have me confused.\nI don't need to try to understand.\n[Music]\nMaybe I'll turn off the [ __ ] news.\nTurn off the news and build a garden.\nJust my neighborhood and me. We might feel a bit less hardened. We might feel a bit more free. Turn off the news and raise the kids. Give them something to believe in. Teach them how to be good people. Give them hope that they can see.\nHope that they can see.\n[Music]\nturn off the news and build a garden with me.\nThat's awesome.\nYeah. So, I I you know, I I've always felt that way. And I think that there's action is so important. Being a part of your community, being a part of decisions that are made, I think that's huge. I think local communities are really important. I think local town meetings, understanding where you're going in these, you know, and and and understanding where your neighborhood is going and getting to know your neighbors because it's really hard to it's hard to have any hatred when you understand and know your neighbor.\nYou know what I mean? And you know the people that are around you and know, you know, and so I think that yeah, that's kind of where I come from. I just think like, you know, it's important to to get out there and and I put my I usually try not to stand on soap boxes, though, you know, man. I put if I have something to say, I'll put it in my music, you know, and I'll and I'll put it out there, you know.\nWell, that's the best way to get it to people anyway.\nYeah. Look at Bob Dylan, *Masters of War*. I mean, that's the military-industrial complex right there. That's an incredible song. pawn, only a pawn in their game. Yeah.\nIs the history of of racism and how that, you know, started as a pretty much a controlled political ploy to get the poor blacks and the poor whites to blame each other for everything happening.\nYou know, you ever hear Bill\n\n\nHicks bit about the news?\n\nI was just listening to Bill Hicks. That's so funny. He's got that great bit about the news, like war, famine, disease, AIDS. You go outside, chirp, chirp, chirp, chirp. Where the [ __ ] is all this [ __ ] happening? I think Ted Turner's making this [ __ ] up cuz his wife won't [ __ ] him.\n\nWell, I, you know, look, I think it's out there. I think it's always been out there. But I think the way to combat it is to build strong local community.\n\nYeah, you know, and and build, uh, you know, that's why I think regenerative, regenerative farming is really important and trying to, and then, you know, voting for people that will support local agriculture and proper, properly grown food and prop, you know, like sourced food, and the these things are very important, you know.\n\nYeah, that's certainly important for a community if you know exactly where your food's coming from.\n\nI think we're just so, it's not, you know, in the Bill Hicks, it was just the news. But now I think the the real problem that people have today is social media. And, uh, you know, I never, I very r, if I post things, I just post them and then get out of there. I don't read anything. And I very rarely read social media anymore. And since making that decision to kind of stay away from it, I think occasionally I have to dip in just to see what, what's, because I'm a comedian. That's part of the problem.\n\nSure. You got to know. I need to know what people are doing. Why, why everyone's so mad? What's happening?\n\nMhm.\n\nBut, um, there's too many people that are on it all day long, and I think it's poison. I really do. I think it's bad for your mind. I think it, it, uh, generally attracts negativity. I think most of the stuff that people post is negative, and they're complaining all the time, and and then that gets into your mind, and that gets into your whatever, you know, your, your headset is, your headsp space, and then you start thinking the way these people are thinking, and.\n\nI, I like to be informed on what I'm talking about. You know, I really do. And that takes a lot of time.\n\nYeah.\n\nIt's not something that I can look at something online that comes up and just have an immediate opinion on.\n\nSure.\n\nAnd I think that really, I'm just like, I, I don't know where I stand on half the issues that are out there because I'm s, I'm, I, you know, I see a lot of, I have to sift through most of the [ __ ] to find it, like, so really where it ends up happening is, is that by the time I get to the voting booth, I'm hoping that I'm properly informed, you know.\n\nYeah, it's hard to be properly informed because it's hard to know who's telling the truth.\n\nIt is.\n\nLike, if you pay attention to this big, beautiful bill that just got passed, um, I've been trying to sort out what's real and what's not, you know, and the real fear that people have is Medicaid, right? The real fear is that people are going to lose access to healthcare, and, um, it's so, but then there was this just giant arrest where, uh, they found billions of dollars of fraud, and, uh, hundreds of people were arrested, doctors, healthcare providers, you know about all that, right, Jamie? You saw that big arrest.\n\nIt's, you know,\n\nI saw something, but you know, I just, I just don't know enough.\n\nYeah, I don't know enough, enough either. So, they're trying to eliminate fraud as a part of this, right? But the consequences of that is like, well, okay, but is this going to affect poor people? Is this going to affect legitimate poor people that just need help? And that's to me, that's the most important thing. National healthcare fraud takedown results in 324 defendants charged in connection with over 14 billion, 14.6, six billion in fraud.\n\nWow.\n\nLargest Justice Department healthcare fraud takedown in history. More than doubles prior record of six billion.\n\nWow.\n\nThat's a government website, right?\n\nI don't know. You know, I just, you know, I just don't know. And I don't know enough. And I know that there's probably more to the story than we're seeing.\n\nOh, yeah. For sure. Right. So, you know, that's kind of how, like, controlled opposition works to, you know, you just sort of, you know, says Medicare Medicaid services also announced successfully prevented over 4 billion from being paid in response to false and fraudulent claims and that it suspended or revoked the billing privilege of 205 providers in the month leading up to the takedown, civil charges against 20 defendants for 14.2, 2 million in alleged fraud as well as civil settlements with over 106 defendants totaling in 34.3 million.\n\nMhm.\n\nYeah.\n\nWell, I'll have to do some research. Uh, or not.\n\nWell, that's the thing. I'm, I'm a musician, man. You know,\n\nThis episode is brought to you by Visible. I want to let you in on something. Your current wireless carrier does not want you to know about Visible because Visible is the ultimate wireless hack. No confusing plans with surprise fees. No nonsense. Just fast speeds, great coverage without the premium cost. With Visible, you get oneline wireless with unlimited data powered by Verizon's network for $25 a month. Taxes and fees included. Seriously, $25 a month flat. What you see is what you pay. No hidden fees on top of that. Ready to see? Join now and unlock unlimited data for just $25 a month on the Visible plan. Don't think wireless can be so transparent, so visible. Well, now you know. Switch today at visible.com/rogan.\n\nTerms apply. See visible.com for plan features and network management details.\n\nI know this is the thing, like, I don't want, I don't want to waste my day going through all that freaking out about. I do think it's important to know, but at the same time, what I, what I do know is that there's a lot of marginalized communities, whether it's, yeah, a class issue or it's a, you know, it, it just, I just see that there's a lot of people who don't have a lot of money who are suffering, and.\n\nFor sure.\n\nAnd there's a pe, a lot of people getting caught in crossfire all over the world, and it's a humanitarian issue, you know.\n\nYeah. And and I think, you know, and so, you know, I, as a musician, I have a responsibility to observe. I think as an artist, I have a responsibility to observe as a human, as a human.\n\nYeah. I think we all have a responsibility to observe. And I also don't like to keep my opinion resolute. I don't like to identify with my opinion. Meaning, like, I'm not joining any teams here, you know.\n\nGreat.\n\nI don't have any teams. I want to know what, what, based on if I get conflicting information, I have to make a decision on which one's going to sway the decisions I make going forward.\n\nYou know, it's tough. It's not easy in this world. It's really not easy. But back in the day, in interestingly, I think they had more of an ability to manipulate us back in the day because we only had one or two sources of information.\n\nOh, no doubt. No doubt. Well, listen, as confusing and as frustrating as social media is and as dangerous as it is for your psyche, it's better. It's better to have it than to not have it because you don't have to listen to it. You don't have to go on it. And that's what I always tell people. Stay off it. But it's there for you if you need, like, when [ __ ] pops off in the world, it's the best source of information. I Google things all the time and they're not there, and then I'll go to X and they're there immediately. When something happens in the world, it's on X before it's on anywhere else.\n\nWell, there's a lot of platforms, I'm sure that, Yeah, that, that Google is, Yeah, own. But the thing is, X is immediate, right? It's people that are on the ground and people that are exper and independent journalists use it more often than anything else.\n\nThat's interesting.\n\nAnd Substack.\n\nYeah. I think that, you know, I think the only thing that that I think I worry about with, with that is that the pendulum swings so far in either direction in response to certain things.\n\nSure.\n\nIn response to perceived censorship in one way, then it becomes the, the, instead of it being completely a platform of opinions, it, you know, then censorship happens on that side with dissenting opinions, you know, and so I think that the censorship just continues to be like, okay, well, it, it just goes back and forth, and so I, I, I have a hard time, I have a hard time understanding, and that's why I don't really feel like I have an ability to form proper opinion on a lot of this [ __ ].\n\nWell, that's an intelligent perspective because the reality is so many people that have really strong opinions aren't informed.\n\nWell, that's the thing. And I see people that die on certain hills and then, you know, but with no ability to formulate, like, that's why I'm a musician, you know, that's why I do what I do here cuz I, you know, all I do is, you know, I, I heir on the side of compassion, and I think, you know, I'm compassionate for people who are suffering. I, you know, I have compassion for suffering. I, I believe that, I believe that empathy can be manipulated, but I don't believe that it's, I think it's a necessary emotion.\n\nYes.\n\nFor cooperation and human condition.\n\nThat's a great way to put it, you know, because empathy can be manipulated. It can be manipulated through psychological warfare. But I also believe that it's an, it's never a good idea to then shut it off.\n\nShut it off.\n\n100%. Well said.\n\nYeah.\n\nYeah. That's a really good, and I also, I will say this, like, I think throughout history, there have been examples where people have put their faith in policy over character.\n\nYeah.\n\nAnd I think that's a mistake. I think the character of the person implementing the policy is just as important as the policy they represent.\n\nYeah. Well, you know, and today nothing gets implemented. No, there's no policy that gets drafted or implemented without a lot of weird influence, influence from money. It's always money, and I have no idea the depth of that. So, so where my, where my, you know, where my, uh, where my, my truth lies in compassion.\n\nYeah.\n\nAnd in trying to reach the hearts of people, and through music. Daryl Dave, do you know Daryl Davis?\n\nSure. I've had him on a couple times. Oh my god.\n\nYeah. He's great. He's amazing.\n\nHe's a hero of mine.\n\nYeah. He's an amazing person. What a fearless person to be able to go and sit down with these people and change their hearts.\n\nYeah. Hundreds of them.\n\nHundreds of them collecting one. Let's tell people what he does. So Daryl is a musician, and Daryl, uh, through the course of his travels, met, it start, he told me the whole story. The first guy he met, he didn't really believe him that the guy was actually in the KKK. Daryl's a black man. And so this guy pulls out his KKK membership card or whatever the [ __ ] it is, right? And, uh, he couldn't believe it, and he's like, \"Well, you're not like the other ones.\" And he's like, \"Well, what do you mean? Do you know everyone that's black? Like, what is this?\" And so he becomes friends with this guy, has dinner at his house, and then the guy gives him, over the course of their friendship, gives him his robe, and he says, \"I quit, man. I'm, I obviously what I'm doing is wrong because you're my best friend, you know, like, I, I love you, and so it can't be true that the black man is my enemy if you are such a cool person.\"\n\nYes. And humans must be allowed to grow.\n\nYes.\n\nYou know, we, we have to be, we have to allow people who have made mistakes in their past to, we have to suspend judgment enough to allow that person to, to grow.\n\nNo question. Yeah.\n\nBecause you have to understand, like, what influences this was this guy subject to that led him to join the KKK in the first place.\n\nYes.\n\nLike, what was the community that he was in? What, what had be he been exposed to? Obviously, he had never been exposed to anybody like Daryl before he met him. So, he meets Daryl and then changes his ways. Well, who knows if that guy grew up with cool parents in a different community, he would have been a different person.\n\n100%. We're products of how we, we, we are brought up.\n\nYes. For the most part, our life experiences and what we've learned and the paths we've taken. Yeah.\n\nAnd you know, and you know, there's a lot of, there's a lot of that going on. I mean, I'm from Texas, and I've toured the South, and I know how that is. And there's a lot of people that grow up being indoctrinated.\n\nUhhuh.\n\nAnd and and in with really not, not good ideas, right? But they don't know until they're able to. That's what I was saying earlier about, you know, that's what music does. I love a great example. Paul Simon played a show in South Africa just after apartheid. He, when he did the Graceand album, right, he went down there and he worked with local African musicians and created, in my opinion, one of the greatest albums of all time. I mean, with Lady Smith Black Mambazo doing the vocals on that, incred Vincent and Guini, the the most incredible musicians. And at the time that was a culturally powerful thing because there's a show online, you can watch it. There's, there's a, you should probably pull it up. There's, it's amazing. There's like Paul Simon playing for tens of thousands of black and white people in right after a part tide ends or he may even be during apartheid. And they're all dancing and bobbing up and down. It's the most joyful thing ever. Music is powerful. It can bring people together. But because what it does is it reaches everybody's heart, and it cuts through all the [ __ ] the mind stuff, you know, and it, and everyone can relate to having their heart broken, you know. Maybe it happened for some at a young age. Maybe it happened, maybe, maybe some people had their heart broken at age four to the point where they closed their hearts off nearly completely. But even Darth Vader had a little bit. him. You know what I mean? Darth Vader, no, everyone forgets that Darth Vader at the end of Star Wars.\n\nYeah.\n\nRedeemed himself. It's, it's the Carl Young, the archetype, right? The the dark knight of the soul.\n\n\nAnd being able to come through that.\nYeah, and like, and really like, you know, and you can judge, you can not want to be around. Like, I think Carl Jung actually talks about, like, there are certain people and things that you can't allow to exist because they're dangers to everyone else, but at the same time, you don't have to judge their humanity, right? You just, like, it's like a wasp. You have to swat the wasp because it's going to sting you, but you know, or, you know, however you feel about that, you could put it outside, but you get it way, right? You know, but you don't, you don't call the wasp evil, right?\nThere are people that have just been corrupted for whatever reasons to the point where you just need to remove them from the situation. But I don't, I try not to have hatred towards that. I just, I just sort of understand that they are where they are in their lives, and they, they got there for some reason.\nWell, it's a cautionary tale for everyone.\nYeah. That, that's the thing about today's access to information is you could see so many different cautionary tales. You could see so many different people that went down the absolute wrong road.\nMhm.\nAnd you get to see them, and you get to shine a light on them in this very strange time. You get to see, like, this, this is, you could have been that person. Anybody could have been that person.\nWe're all, we're, we're, we have so many similarities.\nAll of us do. And we have to recognize that your unique situation in life, your unique community, family, life experiences, all the things you've gone through that made you who you are today,\nMhm, didn't have to be that way. You, you could have been in the worst circumstances, and there's people that are in the worst circumstances, and that, and they're a product of that. And that's the, the weirdness of life.\nThere's not necessarily good and evil. There's good and evil results.\nMhm.\nBut humans inherently must\nWe're both inside.\nYeah, we are both inside.\nWe're the yin and the yang.\nYeah.\nYou know, I think you need that, unfortunately, too. We need to know that exists.\nYeah.\nIn order to grow.\nWhen people, you know, ask, you know, and I'm a very lucky human. So, like, I say all these things with a hopefully the right perspective that I am, um, as far as I'm in, like, the top 1% of the luckiest people, or probably even higher than that.\nYou know, with access to clean water, I don't have to worry about when I'm pulled over being shot. I don't, you know, there's, there's not, I, there are a lot of things that I can be very grateful for. And so when I make comments about these things, you know, I can only come from my own perspective, you know, of course, but I do believe that we all have the light and the dark inside us.\nUh, like the, the story of the, the wolf, you know, the story of the two wolves inside of us, and the, and you know, which one survives is the one you feed, right? You have the light wolf and the dark wolf, and they, and you just constantly make decisions in order to feed the right wolf over time. And some people get lost, and they start feeding the wrong wolf. And I, I feel like I've been there before, too. You know, I've gone through darkness and come out the other side, you know, in my own way, in my own, you know, uh, in my own experience, you know, in my own pain, in my own heart, you know. Uh, you know, I think the, that's why I believe it's so important to reach people's hearts, and why music is so powerful, because we all have a heart, you know, disregarding certain sociopathic people, you know, we, we all, for the most part, for the most part, we all have a heart and a, and, and so that's where you reach, you know, and I think sociopaths, you know, that's on a spectrum, too, is what we're hearing, you know what I mean? So you have people who can learn sociopathic behavior, but aren't necessarily devoid of feeling.\nRight. There's people that become sociopaths or survive. I bet.\nExactly. Yeah. Absolutely. 100%.\nYeah. It's, um, it's not that clear-cut.\nAnd you know, to, to demonize people is, that's a, the instinct, right? That's, that's how wars get started. We other an entire group of humans. They're the other, you know? And I think this is tribal society behavior that developed because at one point in time, when you saw someone from another tribe that was invading, they were coming to steal your resources and kill people.\nYes.\nAnd that's what people did. And, and, and again, that also, there's an exception to that in the sense that, like, for example, in Germany, you know, there were, there were clear-cut decisions that people had to make about survival and about, you know, like, I'm sorry, but the Nazis had to go, right? You know, we can't, we can't just say that, you know, they're good people, everyone's the same, you know, you know, they're, they're so far gone, right? That they just have to, Oh, yeah. And that's, there are certain ex, you know, examples of that. So it's not like you're, you don't, you don't have to forgive people. You just have to understand them, I think.\nYeah. That's what, that's why people call that the last great war or the real war, right? You know, because it's like, there was like such a clear-cut case of good and evil.\nYeah. And that's, I mean, look, the, I think the military industrial complex has been around since even before then, but\nOh, for sure. Well, Smedley Butler wrote about it in 1933. Yeah.\nYeah.\nSo, anyways, that's where, that's where Lukas Nelson comes in, you know, Masters of War, you know. You know, look, man, I'm again, that's also why mushrooms are illegal.\nIs it really?\nOh, yeah. Yeah. Mushrooms were made illegal during the Nixon administration because they wanted to figure out a way to stop the anti-war protests. They wanted to figure out a way, they, they turned everything schedule one. They took all the psychedelics and lumped them into a schedule one because they wanted to go after civil rights activists and anti-war activists, right? That was the main reason, like, this is the best way to lock these people up.\nWell, and interestingly,\nyeah, I mean, I think that, that, you know, right, because the thing is, is that there, there are a lot of studies, like, about marijuana now that say, oh, it could be harmful, right? They come out. But then at the same time, the, the way that those, that that's harmful, and then the, the, you know, comparatively to the other things that are legal and allowed to just propagate.\nYeah. Like whiskey or cigarettes, you know, like, I mean, like, you know, you have, it, there's obviously a bias against that, you can see clearly, and, um, and obviously it came from this. Well, it's also deep, who's funding these studies, and what, what did they look for when they're funding these studies, and did they have, was there bias attached to these studies? Like, what, what does this mean?\nYou know, like, I know a lot of people who use marijuana, it's not harmful to them at all. So, like, did you include those people in that study? Like, and then I know people that use marijuana and it really does, over, it consumes their life. It, they overindulge.\nYeah. I had to stop.\nWhat was, what was happening with you with it? Well,\nI had to stop for many reasons. I wanted to be clear-headed. I started exercising a lot. You know, I got my Whoop, you know, I got my Whoop right here. You know, I started tracking my sleep. And I, funny enough, the sleep is really what got, what got me the most because every time I'd take a hit or take one drink, my sleep would go to [ __ ].\nIt's amazing when you look at the results. Oh my god, it was intense. And so, and you know, I started working out heavy, and I really, I had a lot of great, like, you know, I, I, I have a, you know, a high good engine, you know, V2, and like, I was like, you know, really started to feel like an athlete again, and started feel, I started to feel great. I started to get addicted to the high that I would get, saying no, of being proud of myself, having discipline, and having the discipline. I love the high that I get from exercising discipline.\nI'm addicted to that.\nThat's a good thing to be addicted to.\nTotally. Right. You get addicted to that feeling that you get that, like, self-improvement.\nYou know, like, Goggins, he talks about, you know, all carrot, no stick, right? Or all stick, no carrot. Can't remember which one it is, right? But the thing is, is that for me, the reward is the high that I get from having discipline. Yeah, and I get a, it's a dopamine hit, you know, and it's, it's just vastly more rewarding than, than whatever temporary thing I'll get from having a drink. I don't really like, like, drinking that much, but smoking weed was cool because it put me into a very, like, creative spot and kind of gave me this surge of inspiration, if you will, but it's bad for my lungs. And there were a lot of ups and downs emotionally. I'd get high and I get low, and I get high and I get low, and, and, and, and now this clarity, you know, that I have, it's just, it's incredible, you know. I just, it's just this steady, you know, um, it's this steady sort of joy, you know, that I, I mean, because I had to face myself, too. When you get clear, you have to, things come up, and then you look at them, and you're like, and things that maybe you didn't want to look at before, you know.\nYeah, habits that you had, or, or things in your past that you have to forgive yourself for, that you didn't really, they're like floating in the back of your mind as unfinished thoughts. And so, with, without it all of that masking, I was able to sit, and I mean, look, I was able to sit and write this record, which is the clear, most clear album I've ever, you know, it, I wanted to know who I was throughout, throughout the, without all the, you know, I didn't, I didn't want to chase a six-minute guitar solo. I didn't want to chase, I, I wanted to just figure out who I was stripped away from all that. It's funny. There's this guy, Marcus Dowling. He's a, um, work, writes for the Tennesseean, and I was sitting talking to him in Nashville, and he was, he said that when I put, he, he had a, he was ready to s listen to my record, and he was about to have a whiskey, and he first, the first song comes up, and he puts his whiskey down. He's like, \"Oh, I, I don't want to drink for this.\" And I think that music puts you in the state of mind that the artist is in when they recorded it or when they wrote it.\nM, so this, this, it's, it's kind of almost like interesting that he decided to put his drink down when he heard this, like, the first song, because, like, that's where I'm at, you know, and so I, I wonder if there's that feeling of, like, this kind of, like, it's less of a jam band thing and more of just like, straight songs. And\nthere's probably definitely something to that, because I think that's something that happens when someone's on stage performing. It's like, you let them take over your mind, you know? You let the music and the song, it's like creating a holographic bubble that you're all participating in this,\nYes, this vibe. Yeah. And it's, I mean, you were there at, at the MCA thing, which it was an electric feeling, right?\nYeah. It was pretty wild.\nIt was wild.\nYeah. It was awesome. And I felt like, you know, it was cool to see everyone there and just like, you know, it, it just, there's also, like, the added thing to that that, you know, they do that every year, and it's a charity. Yeah.\nAnd all the money goes to good, giving back. Yeah.\nAnd a lot of charities, right? There's, like, five different charities that they were given to with McConnes. He's a, he's a good guy.\nHe's a great guy. He's a great guy. He's a very wise man, especially for someone who's an actor.\nYou know, a lot of them. And that's again, that's a thing that I, I have to get over, because I was around so many of them in LA that were fools that I, I just immediately associate acting with, like, these empty vessels, right, that are, you just struggling for attention and trying to say the things that they think will get them sure, the best spot.\nYeah.\nYeah. I think that, look, I mean, to become an entertainer, there's a level of, you know, self-absorption, you, like, you know, that you have to sort of, like, accept, all right, I got a big ego now, can I keep my ego in check for my whole life? Like, I think my dad has, you know, right? I mean, I see my dad as a great example. I see Paul Simon as a great example. I see, you know, um, Neil, and, you know, I see these people that, like, that, they're just, they're just artists through and through, you know what I mean? And, and, you know, for, for better or worse, not perfect people, but they are who they are. And they, for the most part, I know my dad has an ego, but he, he has a good relationship with it, because the ego is just the representation of who we are to the rest of the world, you know.\nWell, everyone has an ego.\nYeah, we all do.\nAnd the struggle with the ego is just like the struggle of with good and evil.\nI think, I think part of it is necessary for you to overcome. You need that. You need th, those, and you, you also need to see people fall prey to it.\nYeah. And we see that a lot.\nRen, there's an artist named Ren. No.\nOh, man. You'd love, you'd love his work. He's like a, he plays guitar and he sings amazingly.\nSpell it. Ren, R E N.\nHe's from England, or he's from Wales.\nHe's Welsh.\nOkay.\nAnd he's, yeah. This guy.\nThat dude.\nYeah. So, he's got a, a song called\nListen to some of this.\nHigher end. Listen to Higherend.\nYeah. This is the one here. Put, put the headphones on.\nOkay.\nI've seen him for a while. He's like a, you started as a busker kind of, right?\nOh, one of them dudes at the, like, subway station.\nYeah.\nThis is a crazy song. It's about communicating with your ego.\nWhat a weird [ __ ].\n\n\nStart to a video. A guy with a pig mask on.\nOh, man.\nHi, Ren.\n[Music]\n[Applause]\n[Music]\nHi there, Ren. It's been a little while.\nDid you miss me? You thought you buried me, didn't you? Risky, cuz I always come back. Deep down, you know that. Deep down in the moment is in periphery. Rent on your please to see me. It's been weak since we spoke. Bro, I know you need me. You're the sheep. I'm the shepherd or your place to lead me. Not your place to be batting off the hand that feeds me.\nHi Bren. I've been taking some time to be distant. I've been taking some time to be still. I've been taking some time to be by myself since my therapist told me I'm ill. And I've been making some progress lately. And I've learned some new coping skills. So I haven't really needed you much, man. I think we need to just step back and chill. Bren, you sound more insane than I do. You think that those doctors are really there to guide you. Been through this a million times. Your civilian mind is so perfect. They're always being lied to. Okay, take another pill. Boy, found yourself in the sound of white noise. Follow this 10-step program. Rejoice. All your problems will be gone. [ __ ] dumb, boy. Nah, mate. This time is different, man. Trust me. I feel like things might be falling in place.\nRight. He just has a whole conversation with his own mind, you know, his own ego.\nYeah. And it and it tries to tell him, you know, that he's not worth [ __ ] And then he's like, \"No, wait. I'm getting myself together.\" And and this whole conversation with him with and and then at the end it talks about where good and evil isn't a battle, it's a dance. And no one ever wins.\nYeah.\nYou know, with their battle with their ego, it's always just a dance. And it's always just kind of finding balance, you know. And there's a song I have on my album called All God Did. And it's it's it's actually the same concept. So, and I wrote it before I heard that, but then when I heard that, I was like, \"Oh, [ __ ] that's way better.\"\nBut, you know, but it's great, you know, and it's super it's it's beautifully written. I mean, you know, it's very, you could tell all his influences. Um um and then he just kind of adds onto that, which is that dance is critical. You need that dance. That dance is I I think this is one of the problems that people that don't exercise. I think the struggle of exercise is often times conflated with vanity.\nYeah.\nAnd uh I don't think it's that. I think you you can keep your body covered up to the end of time and never be proud of it and you will benefit greatly from the struggle of exercise because I think the struggle of exercise is is mental as much as it is physical. There's a dance that that's like when I talked to Gogggins about it, like he's the most bizarre of all cases because he's doing it all in silence. He's doing it all by himself and occasionally he lets people peer into it. But it's it's going on right now. Like right now that guy is out there running probably 30 miles today. Sure.\nWith destroyed knees.\nLike he's a he's a real freak. And when I talk to him about he's like I'm downloading knowledge.\nYeah.\nThat's what he says.\nThat's great. He's like, \"I'm in the lab and I'm downloading knowledge.\" Like, he's struggling in his own mind every day and forcing himself to do it every day.\nThen he brings elite athletes to try to keep up with him occasionally. Like he brought Israel Adosana. Israel Adosana is former UFC middleweight champion. Like one of the best fighters of all time.\nAnd you realize like he can't even keep up with Dave. Not even close. This is one of multiple workouts that Dave is doing in a day. And this guy can keep can't keep up with them. And Dave's 50.\nWhat was the part of the brain uh that gets um Yeah. enlarged that that Hubberman was talking about that gets enlarged when you do things you don't want to do?\nI always forget the name of it, but Jamie will pull it up.\nYeah, the anterior mid. I don't know that.\nIt should be like a an easier name.\nCortex anterior or something like that.\nThe discipline part.\nYeah. The enlarges throughout your life when you do things that you force yourself to do.\nYeah, it literally does. It literally gets bigger, which is crazy.\nYou know, being so\nWhat is it, Jamie?\nThe ant\nanterior midsular cortex.\nYou got it.\nNice success.\nMidsulate.\nMidsulate cortex. Yeah.\nYeah.\nShout out to Andrew Huberman.\nThere you go. Um doing things you don't want to do can strengthen your brain particularly anterior mids singulate cortex which is associated with willpower and tenacity. That's incredible the that it actually grows.\nYeah.\nYou know, so willpower is not just a it's not like an airy fairy concept. It's like a muscle.\nMhm.\nNo, it's incredible that willpower can be also can be enhanced.\nYes.\nThat that that's it. It it just goes to brain plasticity and you know and and and that's a concept that I think a lot of people don't understand is that we are not set in who we are right we are if especially if we adopt a growth mindset right that we we are never set in who we are we can always improve and refine the neural structure of our brain to that it works more efficiently.\nNot just that, but you have to there's it never ends. Like there's never a time when you're done with discipline. It's not you don't just get it and now I have discipline.\nNo, every day is a struggle. Go said that. He goes, \"Sometimes I stare at my sneakers for like a half hour before I put those [ __ ] on.\"\nYeah. Yeah. At like 4 in the morning, you know, every day. But here's the thing is that it becomes a philosophical question because when you say you have to I'm you know there are people who get by life you know and they there is a Tibetan tradition in the that the monks do where they spend months and they take these little like flute things and they and they have colored sand right and they all sit in a circle and it takes them months sometimes to create this beautiful intricate sand heart and they chant while they do it and it's this most incredible thing. And at the end they go and they blow it all away.\nYeah.\nAnd and it's meant to represent the impermanence of life, but then it's meant to also pose the question, why make something so beautiful when it's going to be when you know it's impermanent?\nAnd I believe it goes back to the first thing we started talking about today, which is that meaning is everything in life. And nothing really in life inherently has any meaning except the meaning we give it.\nRight. Right.\nSo you could go you could like go through life as sand on the beach that blows in the wind and you you know you no one you you wouldn't it wouldn't really mean much when you blow one way or another.\nYeah. But if you choose to give your life meaning and build a sand castle and make it as intricate and beautiful as you can and make it like, you know, as detailed as possible, knowing that one day it's going to get washed away at the only person that it it matters to is you and knowing that you did the best you could at that moment that the wave comes. Yeah.\nIf that's true, they should never let anybody film them making those things.\nHm.\nThey should never let anyone film them making those things because then it becomes permanent. Someone can see it forever.\nSure. But\nyou know what I'm saying?\nBut yet again, I think it's for them anyways.\nYes.\nIt's not for everyone else.\nBut like when you let people peer into that world and you film it, there's something about that like, okay, you just cheated it.\nWell, in a way it becomes permanent. But it also I mean is you know just because you see it happening.\nLet's look at it. Can you find that?\nYeah, you sure you could find it on there.\nI mean I'm not dismissing it.\nNo, no. I think but I think it's an it's an interesting question because something that lives in our subjective reality if you see a video of that happening, right? And then you grasp the concept of it and then that makes you consider that concept in yourself. understanding that you know that that the meaning is a subjective experience anyways right then now you understand like okay what you you it it just causes one to ask the question to themselves and I think that's the purpose that the monks are you know they're they're there as sort of like in a way they're teachers you know so they show you something that like then you ask you know inside\nyeah so the what you were saying was that in response to the idea that everyone should exercise and and discipline.\nYeah. Well, but it it's like you don't have to do that, but your life will have you will experience a a a different sense of meaning.\nSure.\nYou know, if you do that and that will I think that's enough for me at least because I'm driven by finding a sense of meaning and I think maybe because of how I grew up, you know, maybe others aren't driven by that, you know. I think that's really important to say too because you never know like what what is driving one I don't know how your brain works. I could only guess.\nYeah.\nI could only assume your brain works like mine.\nSure.\nAnd that's silly. That's a silly thing to assume.\nYeah. We don't even know if we see the same colors, right?\nThere it is.\nOh, wow. That's so beautiful, isn't it?\nThat's amazing.\nAnd then they're gonna [ __ ] that up.\nIt's I wrote a piece once for god was it Esquire or Maxim one of those things about your body is like a sand castle.\nYeah.\nThat you're you're building this body but one day it will be eroded. Now they're just sweeping it away.\nMhm.\nYeah.\nAnd then they like Well, they like dump the sand in. That's kind of cool, too, though, isn't it?\nIt's kind of abstract as they swirl it.\nIt's kind of beautiful, too.\nYeah. But think how long that took them.\nOh my god. It must have taken forever.\nAnd they're scooping the sand up.\nThey scoop it up.\nYeah. Look, they're just doing it with like these little things. Wow.\nThey just tap on it. Look. Look at that.\nWow. That's beautiful.\nYeah, it's kind of amazing.\nI' I've always loved this that concept, right?\nAnd I think that, you know, Yeah. Maybe they shouldn't let you film it for I don't know, though. I'm like I'm glad they did.\nYeah. I mean, they're letting people watch it.\nYeah.\nAnd, you know, just allowing people to see what the whole thing is and it it'll allow more people to understand the concept. Well, that's kind of like Alan Watts like always says, you know, don't listen to what I'm saying, right? Because the Dao that can be spoken is not the real Dao, right? And yet here I am just loving the sound of my own voice and talking about it. You know what I mean? And like, you know, so it's like, you know, that's that's that's the great paradox of the spiritual self and understanding what that means, you Well, that's that becomes readily apparent after you have a psychedelic experience. I remember one of my first ones that I had, I realized when I was trying to describe it, like I'm trying to impress people with the way I use my words. I was very aware.\nYeah.\nI was like, \"Oh, I'm trying to impress people with my grasp of language that I'm using to describe an experience.\"\nMhm.\nAnd I was like, \"Oh, that's kind of gross.\" One of the great of course actually when I started listening to you it was in like 20 2007 2006 and um it was uh I was listening to a lot of Terrence McKenna\nah\nat the time and Terrence McKenna talk about someone who had a grasp on the English language.\nYeah. Oh he was amazing.\nWhat an incredible like I'd listen to his lectures you know that were available online. Psychedelic Salon is the best resource that's still up, right? Lorenzo from Psychedelic Salon, who had been on the podcast before back in the day, he's collected like the greatest assembly of McKenna, Allen Watts, Timothy Lee, Ram Doss, probably.\nYes,\nthere's a Ramdas conversation, I think, with Allan Watts.\nOh, wow.\nSomewhere out there, which is really interesting.\nWell, my friend Duncan became friends with Romas. Yeah, I actually met him in Hawaii one time. Really?\nYeah, I got to meet him.\nYeah, Psychedelic Salon. There it is.\nSo, it is psychedelicsalon.com and there's Lorenzo and um Psychedelic Salon is like this incredible resource of all the McKenna lectures. He's I mean he has because it's it's such a a great resource. so many people who were there at like you know some talk that he gave in Hawaii at some conference room somewhere recorded it and then they would send that to Lorenzo and then he'd put it online and have it available for everybody and you know some amazing yeah insights and conversations um he he lived not too far from where I live in Maui um so I went on a whale watch with him one time\nreally with McKenna\nno with Ramda\nwith Ramda Sorry.\nOh, okay. Okay.\nYeah. Yeah. But not McKenna.\nI think McKenna died in when I was a kid. Like really early.\nYeah. I think he died or something.\nNo, it was a little later than that.\nOh.\nUm, when what year did McKenna die?\nYou're Jamie, right?\nYeah.\nJamie.\n2000.\n2000.\nI heard you play golf.\nI do.\nAnd you were in a simulator earlier.\nI was. I I was in a simulator last night till like two hands my hands all blistered out. Yeah,\nI had that.\nWe were having a conversation while we were getting espresso and I was saying I can't play music for the same reason I can't play golf.\nRight.\nAnd then he shows me his hands.\nSo he's Yeah.\nWe're all like\nAnd you're\n\n\nLike, \"Oh, that's what he was just doing back there.\" Yeah.\nJamie's got this, he's got the bug.\nYeah.\nHe's got it bad.\nWell, he's he wants to [ __ ] his friends up.\nIt's fun.\nYeah.\nIt is a fun game.\nIt's fun to make people mad.\nMhm.\nThat's a weird motivation, but okay.\nYeah.\nYou know, yeah, there there's it's funny like the closest friends we have are sometimes, you know, the ones we give the most [ __ ] though.\nOh, yeah.\nFor sure.\nWell, they're the ones that know you love them, so you can give them [ __ ].\nYou can kind It's fun.\nThere's nothing like that feeling of like having a friend that can take it and dole it out.\nOh, that's why I love comedians.\nThey're the best.\nRight.\nRight.\nRight.\nThey're the best because they you [ __ ] on them.\nThey love it.\nThey [ __ ] on themselves.\nEveryone's having fun.\nYeah.\nYou know.\nExactly.\nThat's one of the great joys in life, I think.\nYeah.\nThe people that can't take that, boy, you're missing out on a giant chunk of what it means to be a person if you're so sensitive, you can't let people crack on you.\nLike that's so silly.\nWell, yeah.\nAnd Yeah.\nYeah.\nExactly.\nYou're missing out on a lot of the fun.\nYou're missing out on half the laughs because half the laughs are at your own expense.\nExactly.\nYou should be able I probably laughed harder at myself than at anyone else in my life probably.\nThat's that's a healthy perspective then then you're a fairly healthy person.\nOh yeah.\nWell I mean it's funny you know we're running around you know trying to find meaning in life and you know one day you know like one day is a crazy thought but one day the last remembrance of the human experience will happen.\nYes.\nYou know, and uh [ __ ] it might be in our lifetime.\nI doubt it.\nI think it'll be I think it'll be because even now we're uploaded into the AI system, you know, so like something will survive, you know, some fact.\nYeah.\nSome Well, whatever we are will lead to whatever comes next.\nThere's a great episode of Star Trek called The Inner Light.\nHave you ever seen that?\nThe first Star Trek, the real one, the next generation.\nOh, that's [ __ ] Star Trek.\nWhoa.\nWhoa, them's fighting words, man.\nYou're a Picard guy?\nHell yeah, I'm a Picard guy.\nI'd vote for him right now.\nThat's hilarious.\nMeanwhile, he probably could win.\nDiplomacy, man.\nSo, this is the inner light.\nThe inner light.\nHere's a story.\nOkay, here's the story.\nThey come across a probe.\nAll right, because they're exploring space.\nObviously, if you don't know Star Trek, they're exploring space.\nAnd the whole their whole mission is to go where no man has gone before, right?\nAnd so they find this probe and as they're scanning the probe, it zaps Picard and he goes unconscious and he wakes up in this on this world where he remembers the spaceship.\nHe remembers where he was, but he's got a wife and a family and kids and this world is being threatened by an exploding sun.\nAnd so he's got a lot of scientific knowledge.\nSo he over the next 20 years in this world.\nWow.\nHe eventually grows old and accepts his fate that he has no idea how he got here, but he's got to live this life now and he starts to love his wife and his kids.\nHe starts to try and save this planet from the exploding sun.\nHe ends up not being able to.\nAnd then as he dies, he wakes up back on the spaceship with only 20 seconds having gone by on the spaceship.\nWow.\nAnd the probe was a had been sent by that civilization.\nThey knew they were going to be destroyed.\nSo they uploaded this thing that like would let Picard experience what happened to their civilization and tell their story.\nWow.\nAnd and he did it experienced it.\nHe experienced a lifetime of 40 or 25 whatever years before he died in the span of 20 seconds and then woke up at the moment of his death in that other life and then was able to now tell the story of this of this forgotten civilization in space.\nWhoa.\nIt's the coolest concept ever.\nOkay, I'll have to watch it now.\nI mean, it's you know, I just told you.\nSo, do you know who Joseph McConnle is?\nNo, Joseph McGonagal was like um he was remote viewer number one.\nOh, interesting.\nHe was the first guy and they gave him an assignment once without him knowing like where he was looking into and what it turned out that he was looking into Mars 1 million years ago.\nMhm.\nAnd when he looked into Mars a million years ago, Mars was falling apart and there were beings on Mars.\nThey were going into hibernation.\nThey had built pyramids and all these structures and they had to leave Mars because Mars was being destroyed.\nTheir atmosphere was being destroyed and they had to come to Earth, right?\nAnd what he summised from that is that what we are is the children of the people of Mars.\nThat's why we're so different from all the other primates.\nThere's a whole movie dedicated to that exact premise.\nReally?\nCalled Mission to Mars.\nWho's in it?\nI don't know.\nUh, is it Greg Caner?\nMaybe.\nGreg Caner?\nNo, I don't know.\nLet's Let's look at it cuz it's like a great movie and it's about that at the end.\nI might have seen it now that I'm thinking about Gary Senise.\nGary Cise.\nGary Senise.\nDon Cheetel.\nWhat year was this?\n2000.\nYeah.\nOkay.\nI don't see it.\nYeah.\nAnd and that's exactly the premise of the entire movie.\nAnd so the premise of the movie is that these people they go on a mission to Mars.\nThey see like a structure on the surface of Mars.\nSo they go and they check it out.\nWhoa.\nAnd then like that's the whole thing.\nAnd they realize that Mars Well, you know, this is not outside of the realm of possibility.\nNo, not at all.\nOne of the reasons why I say that is like they've found recent they've recently found structures on Mars that are so obviously man-made that it's almost impossible to deny.\nLike I showed it to Elon and he's like, \"Oh, we should go look at the Okay, but here's the thing about like Have you seen that?\nDo you know what I'm talking about?\"\nNo.\nShow him this this the square on Mars.\nSo there's this in the 1970s they took satellite photos of what looked like a face on Mars in Sidonia and kind of weird kind of weird but it's hard to say if that's like there's things on Earth that look like faces that it's just like it's just a natural formation right but then they found this this is recent look at that.\nI mean what the [ __ ] is that man?\nLook at those right angles.\nLook at that.\nThat's on Mars.\nYeah.\nAnd that's interesting.\nThat may have been a structure at one point.\nYeah.\nI mean, look, it's it's too complete.\nIt's too square.\nIt's a square.\nYeah.\nI mean, look, I would It actually might be a rectangle, right?\nIs it kind of a rectangle?\nWell, I don't know.\nWe'd have to measure it.\nI'm sure they could measure it with, you know, throughout, you know, I just Here's the thing.\nWhen I looked up remote viewing, for example, and I really looked and did research on it, the studies that were done apparent were kind of discredited about how the effectiveness of those actually were.\nSo, if you like really dive in, there's literature that says that that that it wasn't really the reason that they, you know, apparently now this is all like but but conflicting information, you know what I I had Hal put off on who was a remote viewer and who's involved in the remote viewer pro the Stargate right so what does he say about the the idea that like that you know the actual studies were not that like conclusive and that you know that's why they depends on who's doing it who's doing it what's the methodology but they were ever they were able to accurately find within a small radius a downed Russian uh spacecraft so a Russian spacecraft that re-entered orbit and crashed It was a spacecraft or an aircraft.\nDo you remember Jamie?\nBut they used remote viewers and the Russians couldn't find it and they found it.\nAnd this is you're talking about in like a vast expanse of of wilderness.\nIt could have been anywhere, but they they found the area where it was.\nThey also found a Russian factory that was making an enormous nuclear submarine.\nThey they found it accurately described it, the dimensions of it.\nThey knew where it was.\nAnd it was it was an accurate location.\nYeah.\nNot just the thing that was being hidden, right?\nBut where it was, the dimensions of it.\nI don't dismiss it.\nI I can't dismiss anything.\nI just know that like when I looked up like UFO experiences and like, you know, this this disclosure stuff that's happening lately and and you know, I mean, I'm a huge I'm I'm not just a believer.\nI'm I'm a a hope.\nI pray that there is someone out there disarming nuclear missiles as you know especially right now like you know my my great hope is that there is someone just trying to like you know not step in but oversee it to the point where we hopefully we can survive to a point of of having an interstellar civilization you know would it would be it's the great dream of humanity right you know sure but we have to be a different civilization than we are now we're going to do the same [ __ ] that's the thing is And that's what I you know I I was always even before Elon was as famous as he is now when I was like 15 I read his book and the one thing that I you know I'm a I'm a friend of of what was his book?\nUh he read it was like a book about him maybe.\nOkay.\nBut it and I don't remember but I what I really wanted the focus to be on was let's put all these resources into getting this planet right first.\nUh-huh.\nLet's put everything we have.\nAnd you know, it felt at the time like, okay, well, yes, we're spending all this money to go off and maybe we're hopeless.\nIt's possible that we're hopeless.\nAnd it sounds like that's where they air on this, you know?\nIt's like, oh well, humanity on Earth is just is it's just over.\nWe just have to go somewhere else.\nBut then if we go somewhere else, we're just going to do the same thing like you're saying.\nYeah.\nSo like all of the resources in my opinion should be focused on like like there's devices that uh that that they they have invented that can be put in river mouths around the world to filter out pollution and plastics going into the ocean right and it's like this incredible technology if the budgets were spent towards these innovations you know uh you know and maybe AI will help it you know right now AI is a is is is kind of a tax on the planet in terms of like you know it's not very good good for it but maybe the AI technology itself will then invent something that makes itself more efficient for the planet.\nWhat do you mean by as a attack?\nWell, because the energy required for the servers and all of that is so is so uh you know it it drains a lot of resource.\nRight.\nRight.\nAnd so, but what AI may do is help us create like an ion battery or something that like that like makes energy give off less, you know, you can have this much more energy with way less heat and way less, you know, and so then you can create, you know, instead of having to have giant warehouses full of servers, you can have just, you know, like I mean, like it's the same stuff that happened with the computer where the computer required a giant building when it was first created and now you have computers smaller than a just to be clear Elon's position is not that earth is like that humans are are helpless or hopeless and we we have to just leave earth it's not that it's that life is so fragile here because of the possibility not just of us [ __ ] it up but of natural disasters and that we need to become interstellar in order to propagate life and to survive and so we can carry on this yeah growth grow that we're involved in as as a human species because okay there's I mean they just what was the number that they just found a bunch of new asteroids like the the possibility of us being hit by a near-earth object is extremely high over the next x amount of hundreds of years it's extremely high and these things might not wipe everything out but they'll start civilization all over again they'll bring us back to cave people so the idea was that the more places that we are the more likelihood that the human race survives.\nIt's not just that we're going to [ __ ] this up.\nAnd I appreciate wanting the human race to survive, don't get me wrong, you know, but it should be better than it is now.\nI I want I want us to learn our lessons on this planet.\nYeah.\nAnd I think that that's even more important than surviving.\nI mean, here's the thing.\nWhen you ask yourself when someone asks themsself, have I lived a life worth living?\nIs it be is a life worth living someone who lives a very long time or is a life worth living someone who's lived a good life and maybe for shorter so is what is the ultimate effect that humanity has on the natural world and environment are we do we deserve to be space fairing and if we do then I say let's go but I mean I think deserve by whose judgment though well I mean I mean by my own individual judgment at this point you But I mean I mean are we better than the lions who killed the gazels?\nNo.\nBut the lions everyone who all the natural world works cyclically.\nThe the way that the lion kills the gazelle and the way that the alligator takes the you know Yeah.\nExactly.\nEverything works with balance in nature.\nYou have just enough give and take.\nIt's worked that way for years and then yes, extinctions events happen and then things die out and they but there has never been um a creature on the planet with the ability like we have to take as much resource as poss as we can without replenishing that or balancing that out.\nRight?\nSo we I think have a responsibility as humanity to understand how to balance ourselves with the and and harmonize with nature.\nAnd I think that's where my great hope is is that we figure out how to find a cyclical um\n\n\nArrangement with nature where we\nwhere just like photosynthesis\njust like plants give us oxygen.\nYeah.\nYeah.\nAnd then you know the carbon dioxide we\nbreathe, then the plants then sequester.\nWell, our disconnection to nature might\nbe a part of our disconnection to\npsychedelics. That that might be one of\nthe reasons why we're disconnected is\nwe're lacking a crucial element that's\nthere to humble the human species.\nAnd I think\nthat's the great key.\nI think that's part of it. I think I\nreally do. And I think that these\nmonsters that were trying to silence the\nanti-war in the civil rights movement in\nthe 1970s\nby making those things illegal,\nthey essentially they hampered our\ndevelopment, but not all of it. Right. So\nour technological development continued,\nbut our spiritual development ceased.\nYeah. And and and intellect devoid of\nwisdom is dangerous.\nYeah. For sure. Especially like overcome\nwith ego.\nYeah. Intellect overcome with ego is\nlike really disgusting.\nSo, and the thing about it is is that no\none believes they're a monster,\nright?\nEveryone justifies their behavior and they think\nthey're doing good.\nI mean, with the exception of, like I\nsaid, a few sociopathic, completely\ndevoid of empathy individuals, you know.\nYeah.\nBut for the most part, everyone\neveryone justifies their behavior.\nYeah.\nFor themselves. They don't they judge\nthemselves and then they somehow make it\nwell because I'm doing this, because I'm\ndoing this, you know, I, you know, I can\nsleep at night, and so they let\nthemselves sleep at night, and a lot of\ntimes\nthey should be looking at themselves and\nchanging, but they don't, you know, and\nlike so that's why my policy is I try to\njust always look at myself and see, could\nis this actually beneficial for not just\nme, but for the people around me, you know?\nMusic has been one of the great things\nin life that is a win-win. You know,\nit's always a win-win.\nYeah, that's a great way to look at it.\nYou know, it's like, wow, I'm I'm so\nlucky to just be able to observe, be\nable to play, be able to sleep well for\nthe most part.\nYou're you're a chef for the soul,\nyou know, like a chef provides food.\nIt's a win-win. People eat. It's\nwonderful. You enjoy the food.\nOh, man.\nIt sustains you. And I think music is uh\nthat's a lot of what a musician is.\nYou're a chef for the soul. Jimmyi\nHendrix, you you're a huge fan.\nHuge.\nYeah. I He was\nother than my dad, it was Jimmy and\nStevie Ray Vaughan. And Stevie Ray being here\nfrom Austin,\nI sort of had a special affinity for. Um\neven though Hrix um\nSteve Ray is the only one who's allowed\nto do Voodoo Child\nother other than Hrix.\nI think you're probably right there, you\nknow. I mean,\nI mean, other people can. I'm just\njoking around.\nNo, no. I think I actually heard you say\nthat with Charlie and I was like, \"Yeah,\nI think I agree.\"\nKind of right. Cuz he's the only one\nthat I can listen to where I go, \"Yeah,\nyeah, this is like a Stevie Ray version\nof Voodoo Child.\"\nWell, and he was a disciple of Hrix, you\nknow, he was a, you know, he really sat\nand, you know, and really lived that\nlife. And but that's the thing that I\nlearned that was the best lesson I\nlearned. It goes back to why I am sober\nnow and where I'm at. It was because I\nthink the greatest lie I ever believed\nfor so long, I did 15 years on the road,\nyou know, 250 shows a year, and I told\nmyself I had to live like my heroes\nin order to be, you know, and I think I\nthink I think that's what\nit didn't kill Stevie Ray, but it\nderailed him for a long time before he\ngot sober. You know,\nSte Ray died in a tragic accident.\nObviously, it wasn't, you know, just\nthat's what happened. But\nI almost had a chance to drive him.\nReally?\nYeah. I was driving limousines for uh\nthis uh limousine company in Boston and\nwe were supposed he was supposed to take\na limousine, but he wouldn't take\nlimousines. He would take cabs.\nHe always wanted to take cabs. So, I\ndrove this limousine. I drove Jeff Back\nonce. I drove uh Annie Lennox's crew. I\ndidn't drive\nI love Annie Lennox. She's beautiful.\nShe's amazing. I went I had to drop off\nthe crew at this restaurant and Annie\nLennox was talking and her voice was so\npower. It was like the way I described\nit, I was like her vocal cords were made\nout of like piano wire\nbecause like her voice was carrying in\nthe room and and I was at the time I was\n20 maybe\nand I remember like watching her talk.\nOh, this is crazy. Like this lady's\nvoice is like traveling like it's a it\nhas a different power than everyone else\nin the in the restaurant.\nThe voice is such an incredible thing,\nis it not? I mean, you know, the power\nof a vocal cord, like look at James Earl\nJones.\nOh, yeah. Yeah. Yeah. Right. You know,\nlike to change\nDarth Vader, by the way.\nDarth Vader.\nYeah, he is Darth Vader.\nYeah. And he lived to be what, 95,\nsomething like. How long did I mean, he\ncrazy and he was still doing that?\nYeah. That's There's certain\nStevie Ray didn't wouldn't take limos\nlike [ __ ] this limo. He wanted to get, he\nliked to talk to cab drivers. He liked\nto get in a cab and he liked to just\nkeep it real. Even though he was a\nsuperstar, he didn't want to be treated\nlike one. He just wanted to be normal.\nSome of the best conversations I've ever\nhad have been in like Ubers or or lifts\nor what, you know, whatever. And just\nsitting and like chatting about like\nwhere they're from and like how they got\nthere and like there's a lot of\nincredible stories that you know of like\nyou know perseverance.\nYeah. you know, escaping certain\nsituations.\nYeah. No doubt. Yeah. I mean, and then,\nyou know, this everybody's got their own\nlittle journey, and sometimes you dip\ninto someone's journey and go, \"What are\nyou doing, man?\"\nYeah.\nYeah.\nWhat's going on? What you up to?\nI always try and learn a little bit of\nthe language, too. Like, how do you say\nthis?\nYeah.\nYou know, there's something like there's\nsomething that just makes people, I\nthink, really drop their defenses when\nyou submit yourself\nwith humility to learn their language.\nYeah. I say, \"You know what? I'm like,\n\"Look, thank you for driving me. I'm so\nglad you're here.\" How do you say thank\nyou?\nRight. Right. Right. Right. How do you\ncorrectly pronounce your name?\nExactly. Yeah. Yeah.\nWell, you know, I work for the UFC, so\nthere's a lot of people that I I have to\nask them, tell me how to say your name\nbecause some of these names are just\ninsane. Like some of the names from\nDagistan or from Yeah. you know, the\nKazakhstan, there's so many places where\nit's like Shavat Rockmanov, like Jesus\nChrist, like it takes forever. And I\nhave to I can't [ __ ] their names up. So,\nno, I'm glad that you think that,\nthough, because that's a beautiful\nthing.\nWell, it's it's interesting. I'm\nfascinated by the different sounds that\npeople choose to use as their language\nin different places. It's like human\nbeings evolved in all these different\nplaces\nwith all these different ways of\ncommunicating. Oh, yeah. They're all\ndifferent.\nWhat's the clicking uh in Africa?\nThere's there's a musician and I can't\nremember for the life of me her name\nwhich may is it maybe Angelique Kijjo,\nbut no uh but it's she sings in and she\nuses the clicks and then just does this\nsort of oh my gosh it's uses the clicks\nin her sing\nin her music. Oh it's so beautiful. Oh\nman. How you gota wonder like what what\ncaused them to develop that kind of\nlanguage, you know?\nIt's like they're all developing it in a\nvacuum, right? Because they're all the\npeople in that area, in that community,\ngeneration after generation after\ngeneration, all agree to communicate in\nthis certain way.\nYeah.\nYou know, and then they run into people\nin China and you're like, Jesus, this is\nso different.\nAnd in China there's like I don't know\nhow many different dialects.\nOh, yeah.\nYou know.\nYeah.\nAnd then different like completely\ndifferent.\nOh, yeah. Well, my grandparents were\nfrom Italy and they spoke a Sicilian\ndialect.\nAh, I'm Sicilian, too. My mother's side.\nYeah.\nBut I remember me like learning Italian\nin college and it was so different than\nthe way that they were speaking\nItalian. Well, and I think I'm not\ncertain, but Dean Martin had a a\nspecific and it may have been Sicilian\nor maybe a specific northern Italian or\nor Napoli, maybe it's, but but the way\nthat he would sing Domenico Modugno's\nsong, you know,\nyou know, and he would do it and he'd go\nhe, you know, he he'd have these like\nslang\nin his version, it's quite it's quite\ndifferent, the Italian, if you listen to\nboth of them together.\nInteresting.\nReally interesting. Yeah.\nYeah. Dialects are weird, right? Because\nlike people learn how, well, I mean, look\nin America, right? You can go to like\nNew Orleans\nand people have a completely different\nway of talking than people do in New\nYork City.\nOh yeah. Yeah. Have you have you heard\nabout the new speaking of AI, the new\nadventures that were now embarking on,\nsome scientists, they're like using AI to\ncommunicate with animals, like whales. I\nsaw that with cats. I saw that today\nthat a AI today. Yes. AI is translating\ncat language with like 95% accuracy.\nThey think they know what cats are\nsaying to each other. Now,\ndo you think that will have an effect on\nhow we treat animals if we're able to\ncommunicate with them?\nProbably. Yeah. Well, I'm sure you've\nseen dogs when people say, \"I love you,\"\nand they\nYeah. Yeah.\nYou know, like there Yeah. They're\ntrying to say, \"I love you.\" They just\ndon't have the same lips.\nYeah. And And they're very dogs will,\nyou know, they're very good at\nmimicking.\nOh, yeah.\nYou know, and behavior.\nWell, they certainly understand language\nbecause I talk to my dog like a person.\nI talk to him.\nYeah. Yeah. Like I can say, \"Come on,\nman. Is it time to go outside? What do\nyou What do you want to do? You want to\nget crazy?\" And they're like, \"I'm going\nto go outside.\" Like he knows what I'm\nsaying. Like I can I don't have to say\nit in a certain tone. I can just say\nhe knows. Yeah. It was funny. My dad,\nyou know, Roger Miller, you hear Roger\nMiller?\nWas Roger Miller?\nTrailers for sale or rent, rooms to let,\n50 cent, you know, king of the road.\nOh, right.\nKing of the road. That's right. So my\ndad and him were good friends and he\nused to joke, he used to tell a lot of\ngreat jokes, but one of them was, it's\ntrue, you start what they say, you start\nlooking like your dog. I just got chewed\nout by the neighbor for [ __ ] in\ntheir front yard.\nhe's got my dad has so many amazing\njokes.\nwell, you it must have been really\ninteresting, the people that your dad\nbrought around\ncuz like oh man, one of the greatest\nmoments I ever\nfelt like I I was a part of was\njust a sort of a normal afternoon and I\nwas in Hawaii and I was uh at my parents\nhouse there and it was me and dad were\nsitting around and Christopherson walks\nby and in behind walks in, they're on\ntheir way to the airport or coming from\nthe airport or whatever, and in walks in\nwith him Muhammad Ali.\nWhoa. And so I'm sitting there and me\nand dad are just picking and Muhammad\ncomes and sits down and Chris is on one\nside of him and dad's on the other and\nI'm the one who got the guitar and so we\njust start singing for him and he's\nshaking. He can't speak really, you\nknow, but you could just see me and dad\nand Chris was just like serenading\nMuhammad Ali one afternoon.\nWow.\nAnd we we sang Help Me Make It Through\nthe Night. We sang Always on My Mind. I\nsang one of my song, you know. So, it's\njust like it was like a a beautiful\nafternoon. Uh I'll never forget that\nmoment.\nIt must have been so strange to be\nconstantly surrounded by these\nexceptional people. Not just\nexceptional, but exceptional worldwide.\nLike the way they're received worldwide.\nLike these are like iconic humans. Like\nChristopherson is like an iconic human\nbeing. Muhammad Ali is an iconic human\nbeing. Yes, he's and um\nuh the and the key language there is\nhuman being, well-rounded.\nYeah.\nThoughtful, empathetic, you know, I\nmean,\nwise, you know, and these people are,\nyou know, they they they made their life\ntheir work. Jimmyi Hendrix, I think,\nwas famous in saying that you you you\nyou know, your art isn't just the music.\nIt's it's your life. you make your life\nthe work of art, you know, and that's\nwhat I mean, he had no problem\nwith all the colors that he used in his\nwhole life. You know, he had no problem\nexpressing himself in many other forms\nother than, you know, and how he dressed\nand how he worked. You know, everything\nwas\nan expression of who he was in his art.\nAnd I I you know, I'm grateful to have\nbeen exposed to a lot of those people in\nmy life. Yeah.\nIt's a very exceptional childhood in\nthat regard, right? Because for some\npeople they grow up and I remember the\nfirst time I ever met like a really\nfamous person I was like whoa this is\nweird\nyou know, like it was probably my tw\nother other than like seeing Jeff Beck\nand seeing Annie Lennox, I never really\nmet them, you know, I didn't really start\nmeeting famous people until I became a\ncomedian, then really meeting famous\npeople until I got on television, right?\nAnd then it was just it was odd was just\nso o was and still to this day sometimes\nI'll have someone in here, like I had\nBono in here\nand it's just weird to me, like\none of my first Bono memories. I was I\nwas like 25 years ago. I was doing\nMushrooms and I was listening to In\nGod's Country and I got to tell that\nto Bono. Wow.\nI was like it was one of the wildest\nversions of your songs, like looking out\nover this canyon while that song was\nplaying.\nIt's\n\n\nBeautiful though.\nYeah.\nOh, it's amazing memory.\nYeah.\nBut it's just weird, you know, to just accept that they're human beings because you see them on television, you see them in all these things and you you grow to realize like, oh, we're all just human beings.\nAnd like that's part of the lesson of it is to meet someone who you don't think is just a human being and you realize like, oh, all of us are human beings with all of our\nThat's a great lesson.\nI mean, and when I think that I was able to understand fame and its trappings at a young age, and that's I'm, you know, that's something I'm also very grateful for that I, you know, I was able to see like, okay, a lot of dad's friends, a lot of the people that that I grew up around didn't make it very long because they got into this or they got into that or they or they, you know, or and I see it all happening a lot to a lot of young people that are unable to handle fame.\nOh, yeah.\nYou know, and fame is not inherently a good thing.\nI think it's actually probably a net negative, although it's a necessary thing if you want your art to get out to as many people as possible or if you want to create a living.\nLike, I don't depend on my parents.\nSo, I want to my music to get out there so that I'll have a career when I'm 90.\nI want to be playing, you know, I don't want to I I don't I mean, eventually I have to keep making a living, you know, and so\nSo, you have to be a little famous.\nI have you think there's a part of you that has that you know part of of of the entertainment world where you have to make sure you have to put yourself out there.\nYeah.\nAnd that's kind of despite knowing that when you put out yourself out there then all the you know that you you get unwanted attention too.\nI think one of the worst things about it is the scammers on the internet.\nThere's so many scammers now on Instagram and Facebook and everyone and they pray on elderly people.\nOh, yeah.\nAnd they pray on\nOh, you mean scammer pretend they're you?\nThey pretend that they're me and they go out there and these people are are I think they're the lowest form on this planet really?\nCuz these are people that have dementia issues.\nThey have, you know, uh, you know, they're elderly, you know, and they and they prey on that demographic specifically because they know that they're more gullible and don't understand technology and they think that I'm talking to them and they'll give in some cases thousands and thousands of dollars of their own savings in my name.\nYeah.\nAnd that has almost made me get off the internet many times.\nBut even so, e what happens when I get off is then they just run rampant.\nMhm.\nYou know, they create new accounts and then the people that are, you know, sort of and they they don't want to believe it's not me, of course, you know, and so like the people that are caught in it get caught and they get hooked, you know.\nI remember watching this documentary once and it was about people that get scammed romantically online, right?\nAnd there's this guy who's this uh lonely man who was in his 60s and he had this girlfriend that he was communicating with in Europe that was non-existent and he flew over there twice to meet her and every time she conveniently couldn't meet him\ntotally.\nAnd his wife his daughter rather was trying to explain to him that it wasn't real that he was getting scammed and he didn't want to believe it.\nAnd in the documentary, you could see like this guy like coming to grips with it, but not wanting to believe it and like, \"Oh, something just came up.\nShe couldn't go.\nShe loves me.\"\nIt's the saddest thing.\nI That just happened to us recently.\nI played a show with Eric Church at Chiefs, and I had a bunch of friends there and everything.\nAnd I and we had someone show up um at the door saying that they had been given been they had been put on the list by me, that I was in a relationship with that person.\nAnd\nyou said they weren't just schizophrenic.\nWell, these people are in some cases schizophrenic or they have Alzheimer's or dementia or memory issues or whatever, but a lot of times they're just being catfished, you know, or just like, you know, like I mean, I've seen there is that show catfish that was on the TV not too long ago.\nI don't know if it's still around, but like these are otherwise sort of normal people that get that get tricked into believing they're in a relationship and they have a girlfriend and they're online and they get to the place and it's, you know, these are like sometimes younger people that even get it.\nIt just shows you how easily sometimes even intelligent people can be manipulated.\nFor sure.\nYou know.\nYeah.\nWell, it's just the perils of dealing with this non-material world.\nYeah.\nDealing with the internet world.\nI mean, and I'm sure it happened in some ways back in the day, you know, with letters and things like that.\nOh, it happened with everything.\nI mean, snake oil salesman.\nI mean, there's I was reading some Oh, no.\nI was watching Cody Tucker today.\nHe had something about uh this guy who was treating people for cataracts and it it didn't really treat them.\nIt actually blinded them.\nAnd he had done it to two different famous composers.\nThis one guy was like, and he was a traveling guy.\nHe would go from town to town and and do things like that.\nThere's always been people like that.\nThere's always I mean\nand and you ask yourself, does do those people have any like conscience, you know, at that a certain point, what are they telling themselves to justify their behavior?\nYeah.\nThey're probably just getting by and probably they've been [ __ ] over too.\nYeah.\nMost of those people have been [ __ ] over to the point where they can justify [ __ ] over other people.\nLike those people have it coming.\nYou know, someone did it to me.\nI'm gonna do it to them.\nThis is the game we play.\nWhat is the antidote to that?\nYou know, I think those people exist so you can appreciate people that don't do that.\nYeah.\nI think I think that's where like heartless, nasty, vicious people exist.\nIt's like if you ever been in a relationship with someone who's just like a a real [ __ ] just mean, nasty, insulting, gaslighty.\nYeah.\nAnd trying to diminish you as a person.\nAnd then you meet someone who's not like that and you're like\nif I didn't know someone who sucked, maybe I wouldn't appreciate this person.\nTotally.\nYou know, and like that's the beauty.\nLike one time uh me and my friend Brian, we went on this uh hunting trip with my friend Steve Reanella to this island uh in Alaska.\nAnd we were there for a week getting rained on every day.\nIt was miserable, just freezing, shivering every day for a week.\nThen I came back to LA and the sun felt so good.\nIt never felt that good.\nI've been living in LA for 25 [ __ ] years.\nIt never felt that good.\nBut I appreciated the sun.\nWhy did I appreciate the sun?\nCuz I had just been rained on for a week and I had taken it for granted.\nThis beautiful, amazing sunlight that I just just go, \"Oh, it's [ __ ] sunny day.\nWhere's my sunglasses?\nLet me drive to work and get inside real quick because it's too [ __ ] bright out.\"\nYou know, and I didn't and but because of the rain for a week of rain, I I really felt it.\nAnd I remember calling my friend Steve, I have never been happier.\nAnd that's why is because it sucked for a week.\nAnd I think you need that.\nI think you need shitty people so that you appreciate good people.\nAnd I think when you meet someone who's gaslighty and you know, someone who tries to ruin your life, like those people exist so that you can appreciate people that aren't like that.\nWell, yeah.\nThe yin and yang of life.\nThe great another great example of that is when you have to pee so bad, right?\nAnd then that moment when you get to the toilet\nand it's\nbeer drinkers understand that.\nOh man.\nYeah.\nOr when you're sick and you, you know, and then you're like, \"Oh man, it's almost like you can't even remember how it felt to feel good.\"\nAnd then when you feel good, you're like, \"Wow, I'm so grateful that I feel good.\"\nThat's it's an amazing feeling.\nYeah.\nAnd that is the thing we take for granted more than anything is personal health.\nAnd you give up personal health for short time, short-term experiences like you know drinking like drinking is terrible for your health but you give it up you give up these little chunks of your health for these like small bursts of release of inhibition you know right?\nYeah.\nI never really liked it anyways.\nIt never really actually put me in too often.\nI I always was like h I wish I hadn't.\nIt puts you in bad spots sometimes.\nI feel like like I think the people and I've I've read this that the people who actually sort of drink and become h like happier with the life of the party or whatever are the ones who are more likely to become addicted obviously.\nOh for sure.\nYou know, because there are there is like there are two types of people that when when they drink, like for me, when I drink, it kind of makes me think more and I get kind of depressed and I like kind of like down and like I don't really actually\nWell, you're a sensitive artist.\nLiterally, that's literally what you do.\nHold on.\nYou're right.\nNow, you can lean into that.\nBut it's a weird thing, too.\nPeople lean into that sensitivity.\nThey lean into it.\nThey carry it around as a badge of courage, you know, which is fine.\nIt's okay.\nBut, you know, that's those are the type of people that I mean, that's why it feels so good for them.\nYeah.\nExactly.\nWhen you um when you know, you drink and then you just like become overly sensitive and think about things.\nIt's just like it's because you have a lot of empathy and the alcohol, the the release of inhibition makes you like be overwhelmed by the empathy.\nYeah.\nBe overwhelmed by thinking.\nI mean, you know, the world is filled with a lot of weird [ __ ] man.\nAnd it it's like there's all these different channels that you can tune into, all these different things that you can focus on.\nYeah.\nI I think that that you know, the ice bath analogy for me, it's like I love the clarity that I get after an ice bath and I feel like sobriety gives me that.\nYou know, it's just like it's just like this great awake, alive feeling, and I'm living in that clarity.\nIt's\nYeah.\nIt's a perfect example.\nYeah, because you have to go through it to get there.\nYou get out of that ice bath, you feel so [ __ ] good.\nWhy do you feel so [ __ ] good?\nBecause for three minutes you feel like you're going to die.\nExactly.\nIt's literally the the benefit of it.\nAnd what's fascinating to me is I watch all these people try to dismiss it and all these people try to say, you know, it's foolish and silly and like the one thing those people all have in common, the dismissers, is they all lack discipline.\nThey all are fighting it intellectually.\nThey're fighting whatever that [ __ ] mids singulate cortex thing\nanterior mids singulate cortex.\nYeah.\nTheirs is weak as [ __ ] and they don't like it.\nAnd so they try to diminish the people that do have it.\nYou know they they try to diminish it which is just a compensation thing that people do.\nPeople are always doing that.\nYeah.\nAnd you know those voices are important too because those voices like you go, \"Oh, I know why you're doing that.\"\nEven the gaslighty people like, \"Oh, I know why you're doing that.\"\nWell, it's helped me get through life understanding people and that their their behavior comes from their own trauma and their own past.\nSure.\nAnd the thing that you hate in other people oftenimes you hate it because you're terrified of seeing it in yourself.\nWell, that's the great that's the great lesson, you know, I mean, and or or it doesn't mean that\nhere's what I think.\nIt doesn't mean that you are that.\nIt just means that you're afraid of that inside.\nOh, yeah.\nYeah.\nIt doesn't necessarily mean you are that.\nBut I think that yes, it's like what you're most afraid of, you know, because you know it exists in you because every everything exists in all of us.\nWe're the exploded universe in manifested motion.\nYou know, we are the unfolding universe every moment.\nYeah.\nAnd all when you get angry at foolishness that you see in other people, you're what you're angry at is that that thing could be it could be in you and it it is in you.\nIt's just you haven't fed it.\nIt's the wolf you haven't fed.\nYeah.\nAnd discipline helps with that.\nIt helps you to understand that you are responsible for your feelings, you know.\nYes.\nYeah.\nYou're responsible for your feelings.\nAnd also like there's things that you can do that can make life more bearable.\nAnd one of those things is physical exertion.\nIt makes life more bearable.\nAnd the way I realize this is when I don't exercise for like three or four days in a row, which is very rare.\nOh yeah.\nBut when it does happen, I start getting really weird and anxious and I'm like, \"Oh my god, people are like this all day.\"\nLike some people are like this their whole life where they just riddled with anxiety and all everything is a crisis.\nEvery little mo every [ __ ] moment is unbearable.\nI'm like, \"Oh, this makes sense.\nThis makes sense in our sedentary weird world where people just sitting and staring at a screen all day and yeah, you know, and not doing things.\"\nSo you're not you don't have you don't have meaning, right?\nAnd then you're just overwhelmed.\nYeah.\nAnd then you know then you'll find a protest and go out there and start [ __ ] screaming in the streets.\nWell, yeah.\nI think there's more to that than that.\nBut yes, I agree.\nI mean, I think a lot of it is that though.\nA lot of it is that a lot of\n\n\nWhat people protest?\nThere's a lot of protests that have like a real good purpose behind them, but a lot of the people participating in those protests are looking for meaning in their life, and they don't have it anywhere else.\nYes.\nWell, and, and you know, I mean, look, we need those people, too.\nWe need, we need those people to drive change, you know.\nSure.\nIf they're organic.\nAnd again, the problem with this world is that those things are manipulated, just like, and that's, yeah.\nYou have to be weaponized.\nYou have to, yeah.\nIt's important that you don't let your emotions be manipulated.\nI think that's one of the great lessons in this wild world that we're in.\nI mean, that's what I try the most.\nThat's why I try not to make concrete statements, you know, unless I know at least, you know, where I heir on is like, okay, this is, this is the compassionate thing to support or do.\nI, I have a charity that I work with called Music Heals International.\nAnd it's a music school in Haiti, in Venezuela, in India.\nI think there's a presence here, too.\nAnd, and, and it's just, I know that I can in concrete ways make someone's life more joyful and on a face-to-face basis.\nDavid Blaine was telling me about, I, I met David Blaine one time, and he was, he, he's a cool guy, very cool guy.\nAnd, and we were discussing that it's, it's almost more powerful to be at a hospital and, and, and go and talk to the kids that you're supporting in this hospital rather than to donate to that hospital and just sort of be, I, I think there's just such something so spiritually significant about being with the people that you're helping and the joy in that being reciprocated, and that, that feeling of being at the, you know, you just giving is joy, you know, ultimately.\nI think that's a really cool thing, you know, like, there's a great quote: \"A man slept and dreamt that life was joy. He awoke and found that life was service. He acted and behold, service was joy.\"\nAnd I like that.\nAlways remember that.\nYou know, there's definitely something to that, right?\nMaking people feel good is selfish.\nIt is.\nAnd it's a joy.\nAnd it's, and it's a win-win.\nYeah.\nIt's a win-win.\nLike you get rewarded for being nice.\nYeah.\nAnd I mean, there's also, I don't, like, I think the word kind is more appropriate, 'cause people can be nice and not good.\nBut I don't think you can truly be kind and mean it.\nBecause if you're kind, you actually are thinking, you feel it.\nWhere others, you're just being polite.\nYeah.\nYeah.\nYeah.\nAnd you can be, you could say the right words with like a shitty feeling to it, like, \"Have a good day,\" and you're like, \"Ew.\"\nYeah.\n[ __ ] you.\nYeah.\nYeah.\nExactly.\nYeah.\nLike I know what's behind that.\nBritish people are really good at that.\nYeah.\nYou know, they're, they're really good at like saying the right words with like a [ __ ] attitude behind it.\nBecause that's part of their culture.\nIt's like keeping up appearances.\nWell, I mean, in a way, it's part of every culture, you know.\nSure.\nAnd I, you know, I think that, you know, yeah.\nKeeping up appearances, you know, keep, one of the things I hated the most about Los Angeles, it's like that, this, the hollowness of communication.\nThat's my, my bias against actors and people because I, I encountered so many people that were like artificial constructs.\nWell, I, I loved it there when I went, and I still love it when I go.\nI mean, I, I've spent a lot of time, yeah.\nI lived there for 10 years.\nWhere'd you live?\nUh, in Venice.\nOkay.\nWell, that's a little different.\nVenice is, it's kind of, at least it was before it was overwhelmed with homeless people.\nHere's what I think about community about Los Angeles: Los Angeles is like the cave in Star Wars and Empire Strikes Back, and when Luke asks Yoda what's in there, and he says, \"Only what you take with you,\" because you can go to LA and find any type of energy.\nYou can go to, you can go to LA and find any type of person.\nThere's groups of really amazing people, and there's groups of people who are lost, you know, and there's different areas, and there's different places that, that, you know, where these different types of people congregate.\nBut, but LA is a very powerful place.\nIt's a lot of moving pl, you know, and I, I prefer to be in places that are less, there's less movement.\nI, I'm a, I live in Maui.\nI have my friends in Maui.\nUh, my best buddy Matt Miola is a professional surfer, and he's a bow hunter, and I, you know, and my, uh, my friend Olly works construction.\nAnd you know, when I go home to Maui, I like a simple life.\nYou know, I like, you know, my friend, they're all fishermen.\nThey're all, you know, I like to go out there, and, and that's how I would want to raise my kids, you know, when I want to be out there in nature.\nI want to be giving and taking with the land, and I want to be able to understand the planet that I live on by working with the earth and working with, you know, and, uh, and that community in Maui there is a really special place, you know.\nWell, I think Hawaii in general is a very special place because it's surrounded by ocean, and I think there's something about the ocean that gives you humility and it like lets you understand that you're a part of nature because that's where we came from.\nYeah, we came from it.\nAnd not only that, it's so huge and massive and overwhelming.\nIt's like the mountains.\nMountains have a similar effect.\nIt's like they're, they're, they're so vast, you, you can't have much of an ego when you're in their presence.\nIt's my other favorite place is Montana.\nOh, there you go.\nMountains, you know, other than, you know, yeah.\nI mean, I, I anywhere there's nature, but I, I really like, I, I like that's being in the mountains of Montana and being on Hawaii.\nThere's only a few places in life that I actually am sad when I leave.\nLike I get really upset when I, you know, it's like breaking up with someone, you know, when you have to leave.\nBut yeah.\nUm, when you write, do you have a purpose in mind, or do you just sit down and try to find out what comes to mind, or do you have a thought in your head before you write?\nWhen my best work comes, it just, um, it's like a conduit.\nIt like comes from another place, and I, I hear, I hear like a, like when I was, uh, 11, I wrote this song called \"You Were It,\" and, um, and I was on the school bus, and I started hearing this song in my head, and I realized that it hadn't been written yet.\nIt was something that was coming from, I guess, my own experiences, but also filtered through somewhere else.\nIt felt like it came from somewhere, you know, like it was a download, you know.\nAnd I, I, I think that I look at, I look at writing as if like there's a beautiful muse sitting there, and she's giving me these gifts every once in a while, and then she sends them to me.\nAnd if I'm open and clear and not in my own way, and I'm, you know, if some, if I get like an a something that hits me like a clever line, like there's a song I have called \"Find Yourself,\" and I hope you find yourself before I find somebody else to be my love.\nAnd I start singing that in my head, and I start like, \"Oh, the melody comes,\" and it's a gift.\nAnd I, I, wherever I'm at, if I was got one right now, I'd have to write it down while we were talking, right?\nYou know what I mean?\nI'd have to sit down.\nI'll be like, \"Hold on, let's write a song.\"\nAnd you know, and but I, it, I try not to, you know, I can't force her to send me because they're gifts, you know.\nYeah.\nAnd I, it's like my dad always says, it's like waiting for the rain to fill up the well.\nYou can't force the rain to come.\nYou just have to wait.\nAnd the real stuff comes when you just allow yourself to receive it.\nYou just, and I think I like what you just said, too, about getting out of your own way.\nYeah.\n'Cause that's the thing.\nIt's like these ideas are out there, but you're so in your own head and so worried about yourself and your own [ __ ] that sometimes like you, you block them.\nYeah.\n'Cause all of your attention is on yourself.\nOh yeah.\nI mean, you know, and you overthink it, and you over analyze it, and how am I going to look?\nYeah.\nAnd is it going to be cool?\nPeople going to like it?\nThat's the big one.\nIs this like, I think a lot of people get caught up in like, well, you know, like this latest record, you know, people like, I didn't want to be too flowery with it.\nI didn't, I wanted to write simply what came to me, and sometimes the songs are simple.\nAnd I think that simplicity for some people can be like, \"Oh, well, what about the, the intricate arrangements, and what about the long jams and the exploration?\"\nLike that's not what came to me, right?\nAnd I, I can't cater to those people, you know.\nRight now, where my heart is is zen.\nIt's I'm trying to be as simple as I can be in terms of just only putting out what comes to me at the moment.\nAnd, and sometimes people aren't going to like it because they're used to me rocking and jamming and doing all that, or they're used to me doing that.\nBut that'll come back.\nIt'll come back around.\nYou know, there's, there's a time and a place for everything.\nAnd right now I just, I have to be, I have to be open to it as it comes, not as I want it to be, or as I think other people will want it to be, you know.\nThat's it, right?\nYou know.\nYeah.\nYou just have to, whatever.\nAnd the thing has to be kind of pure in its form.\nYeah.\nAnd don't over molest it with a bunch of different production values and [ __ ] layers and sound.\nYes.\nExactly.\nYeah.\nAnd, and I, I, I prefer, I mean, when I listen to my heroes, you know, Hank Williams, Dad, Merl Haggard, uh, Stevie Ray, and, and Jimmy are, are, look what came to Jimmy was an explosion of color and sound.\nI mean, when I hear his music, I see colors that are like I can't even describe in real life, right?\nMight have something to do with the psychedelics that I also took.\nBut at the same time, it's, I think that other people and the psychedelics he took, too, and that's the thing is that he, it goes back to what we're saying, like the state of mind that he was in, 100%.\nHe captured, and he put it out.\nImagine writing \"Voodoo Child\" if you're sober, you know.\nYeah.\nYou know, like, yeah.\nExactly.\nAnd, and there's a time and a place for it, you know.\nYeah.\nYou know, and, and but, you know, I have hundreds of songs I've not released that I wrote at different times in my life.\nAnd I'll eventually put them all out, hopefully, if I'm lucky, you know.\nDo you just go back to them and look at them every now and then?\nLike, how do you, how do you file them away?\nDo you have them on a computer?\nI have on a Dropbox file.\nOh, okay.\nYeah.\nAnd so every now and then you check them out.\nA couple hundred songs in there.\nMore probably now because I write them all the time, you know, and, and, uh, yeah, it's like just kind of, it just like sometimes it's like, \"God, I wrote another one.\"\nIt's going to go there, and then that one shoots to the top of the list of the one you're interested in because you just wrote it, and then something that might be really great just gets kind of pushed down, and then like, so what really you really have to do is each project that comes up, you have to say, \"What am I trying to, what am I trying to get across right now?\"\nAnd it's not about whether a song is better or worse, it's about what, what am I trying to say, and how do I present that, you know?\nAnd so I have to collect 10 or 12 or 14 songs from that that kind of fit in this in a narrative, you know, that you're trying to put out there.\nAnd do you write on pen to paper, or do you write on a computer?\nLike, how do you do it for the most part?\nYou write on your phone?\nI do it for the most part.\nReally?\nYeah.\nWell, because I, I have fast thumbs.\nOkay.\nAnd my brain works really fast.\nAnd when I get really excited, I'll write it down there.\nI can read it properly.\nSometimes I'll write on a piece of paper.\nDon't get me wrong.\nI, I, uh,\nDo you ever talk it to your phone?\nLike, use voice?\nI use voice memo to record everything.\nSo the, a lot of the demos that I have are, are just voice memo to phone because my brain's working fast, and this thing works pretty fast.\nYeah.\nYou know, voice memo has a transcription aspect to it, too, now.\nOh, I didn't even realize that.\nYeah.\nYeah.\nI've been using that a lot.\nSo when you, it works on both Android and on, um, iPhones.\nYeah.\nBut you, when you, uh, make a voice note, it can transcribe it now.\nSo like what I'll do is I'll, you know, record sets, and sometimes we do, we do this show at the comedy mothership called \"Bottom of the Barrel,\" where you have like a whiskey barrel, and inside is all suggestions from the audience.\nYou just put your hand in there and pick out a piece of paper and pull it out.\nIt's like tomato soup or whatever, and you just have to start talking about it.\nTry to find something in there.\nAnd every now and then it's like, you know, one out of x amount of times you have a genuine idea that becomes a bit.\nSure.\nAnd the best way for me to fish those out is to go over the transcription instead of just listening to myself for an hour.\nYeah.\nI mean, that's great.\nI didn't realize that was a feature, and I'm, I'm going to start using it.\nYeah, it's pretty dope because you can just talk and it'll transcribe it, and then you can copy and paste that transcription into voice note or into notes.\nOh, and even notes itself has a voice memo aspect to it now.\nOh, wow.\nSo, if you go to just when you're in notes on, on an iPhone, like you can actually make a voice memo, right?\nVoice note from that, and it'll transcribe that for you.\nWhen you're doing a\n\n\nSet, do you have people put their phones away?\nYes.\nYeah.\nYeah. The club has, we have most comedians do that, right? Because they're trying a lot of material out.\nYeah. You're trying material out and also you don't want people distracted. It's better for everybody. It's better for the audience. It's better for you. And also, you're saying a lot of stuff that's like not done.\nAnd if somebody releases it because they want clicks and then they put it on YouTube, they'll [ __ ] the whole bit up because it's not done. It's like, and a lot of bits, they suck at first. Like, you don't know where they're going. Like, you have an idea and the only way comedy really gets made is in front of a crowd. I have a lot of ideas that I think are really good until the audience tells me different.\nYou don't know. Really have no idea until you say it in front of people.\nThat's interesting. Yeah. And it's very much the same for, you know, in music. I feel like there's stuff that I try out live, you know, uh, there's a song new. I do a lot of new material live just to see how the audience will react.\nDoes it feel weird the first time you sing it?\nYeah.\nYeah.\nIt depends on what type of song it is, too. If it's a song that requires focus on the lyrics, you know, then sometimes it feels weird because a lot of people when they listen to music, they don't hear a lot of, they like, it's hard. It takes a certain type of listener to listen to lyrics and be able to internalize them.\nA lot of people take the song as a whole and the melody and they hear it and they're like, \"Oh, this song makes me feel good.\" And then later on, if they like the song, they'll go in and listen to the lyrics. I found a lot of people listen to music that way and then it takes them a while to actually hear what, you know, unless, unless it's a stripped down me and a guitar with no band around and then it forces the listener to then listen to the words, you know, which I actually, I really like doing that sometimes. I like just playing just me because then it, it, there's no distraction around and it's sort of just me, a guitar, and the words that I'm saying. And I think they have more impact sometimes that way.\nYeah. People love that too. That's why they love acoustic performances, right?\nYeah. Exactly. Like Bob Dylan was an amazing Paul Simon. Again, I, I, you know, these are people that I, I cite a lot, you know, in, in this, in this way. But, you know, Sierra Ferrell, do you know Sierra Ferrell? Oh my god. She's on my new record. Stephen Wilson Jr. He's another great, amazing country singer-songwriter. Sierra Ferrell has one of the greatest voices I've ever heard.\nReally?\nOh my god. Yeah. You got you to love her music and and and uh Stephen Wilson Jr. not only does is he a great writer, he used to be a food scientist. So he was a, he was a food scientist uh and he and he wrote songs kind of as a hobby on the side, but he was responsible for like what percentage of what sort of, you know, goes into making dog food and like things like that. It was really interesting. Yeah. And he be now he's like really hitting it off. He's, he's a great artist.\nUm, that's interesting.\nYeah.\nLike a food scientist to... Well, yeah. I guess there's probably an art to that too, right?\nYeah. Absolutely. Yeah. Yeah.\nCreate something delicious. Well, you could be an evil food scientist creating just junk food that's like super addictive.\nI think there's a lot of those out there, man. Oh, hell yeah.\nYeah. You know, but I don't, you know, do they think they're evil? They probably just, you know, getting a job, you know, getting the job done.\nThey're just doing their job. What's their job? You know, I mean, a lot of these food companies, unfortunately, are now owned by the same people that used to own tobacco companies, right?\nOr still own tobacco companies.\nYeah. That's interesting.\nYeah. And then they develop super addictive junk food.\nFamily farms, man. Family farms.\nRegenerative farms. Support your local family farmer.\nYeah. You don't have to eat junk food, but\nNo, you don't.\nBut also, you can.\nYeah.\nJust don't eat it all the time.\nYeah.\nTwinkies are great.\nYeah. They make you feel like [ __ ] but while you're eating them, they're delicious.\nYeah. I like uh, I think as far as junk food goes, I'm just a good old Snickers bar.\nOh, yeah. Snickers bars are great. I don't even know if Snickers bar is like really junk food because there's place for Snickers bars.\nLike uh, if you're in the back country, say if you're hiking.\nYeah,\nSnickers bars are...\nHas nuts, some, some protein.\nThere's plenty of sugar in it, too, which you're going to need if you're burning off a [ __ ] ton of calories.\nYou're operating at a calorie deficit and sometimes that's like exactly what you need.\nYou know, you need like a little bit of protein, a lot of sugar, and you know, it helps fuel your muscles.\nYeah.\nAnd it gives you just simple, simple, simple calories.\nWhat were you, you, I think I just heard you were talking about this, um, was it George Foreman? He used to drink a Coke after each...\nNo, Floyd Mayweather. Floyd Mayweather.\nYeah, he drank Coca-Cola after he worked out. Yeah. There's, there's something to that. There's something to that. As hard as he worked out, just like immediate sugar after exercise to replenish the body. Yeah. My friend Cory Sanhagen was talking about that. Okay.\nThat he does that.\nYeah.\nYou know, he's, he's a big fan of like, cuz he's an MMA fighter and so he'll do two and sometimes three workouts in a day.\nAnd you know, like if you're going to do that, you have to do something after a hard workout to replenish the muscles in order to be able to work out.\nAnd the carbs then replenish the muscles.\nYeah. You need those sugars.\nYeah.\nYeah. You need fruit. You need fructose.\nBut wouldn't you want it to be like a more pure like form of sugar than the, like, isn't there, are there different types of, like, refined sugar is not, you know?\nYeah, perhaps. But also the, the, like, high sugar stuff gets in the muscles quicker.\nThat's the argument for doing it like right after a workout.\nOkay. Yeah. And is when, what is right after? Is it like within 15 minutes?\nI think it's within 30. I think that's the argument. I mean, you have to like look at, I mean, there's a lot of exercise scientists that I'm sure would have arguments one way or the other, which is interesting because they can't all agree, right?\nYou know, there's a lot of arguments.\nYeah.\nAnd it, it also depends on what kind of exercise you're doing. You know, are you a weightlifter or are you a marathon runner? You know, because uh, we had Courtney Dauwalter uh on the podcast once and she does ultramarathons and you know, uh, my friend Cam Haynes, who also does ultramarathons, says like, she's like one of the toughest human beings he's ever met in his [ __ ] life and she exists on sugar.\nShe eats like candy and drinks beer.\nWow.\nLike it's not uh...\nShe's not like formed in a lab. Like, whatever willpower that she has that allows her to, you know, she's beaten people where she does like these 250 m runs where the second place person was like eight hours behind her.\nWow.\nWhich is just bananas. The idea of like, you could run 250 miles and then second place, it takes them eight hours longer than you to run those 250 miles.\nWow. That, that's got to be genetic slightly, too. I mean, it's got to be like the V2 max is pretty high.\nI don't know. Genetic. It's body type for sure. You're not going to get like a 6'5, 300 pound man that can do that.\nSure.\nBecause your, your form physically can't really per you. There's so much of a physical energy requirement to move that much mass in defiance of gravity over long periods of time. Most of those people that are ultramarathon runners are very slight, small people. Mhm.\nLike Cam, when he gets ready to do ultramarathons, he loses like quite a bit of weight, you know, like, at one point in time he was like in the high 180s and now he's down to like 160 and he'll get even lower than that before race. He's my height. So he's like 5'8. Okay.\n5'7.\nSo he'll get down to like 150 something when he's going to do like a 250 mile race.\nYeah. Yeah, but that's like a, that kind of mindset is a crazy mindset. That's like a very unusual punishment that you're going to put yourself through voluntarily.\nYeah. When Chris died, Christopherson died, it hit me real hard and I went and ran. I just kept running like Forest Gump and I ran um, just 13.1 miles. I stopped when I got half a mile, a half a marathon. And I, I was worked. I was like, \"Oh, man. Another 13.1 miles for a marathon. That's a lot.\"\nWell, you build up to it, right? That's the whole thing.\nIt's like, you know, like if someone wants to work out tomorrow and they never worked out. Like, I've done this with a lot of my comedian friends.\nI take them to the gym. I go, \"Look, we're not going to break you. I, if you're going to work out with me, we're, it's going to be very easy and you're going to maybe want to do more, but I'm not going to let you. Like, I'm going to make you do a certain amount of push-ups, a certain amount of body weight squats. We're going to do a few of these and a few of those, and then we're done.\nWe're done. And I don't want you to be tired. I want you to be just a little energized. And then two days later, we'll do it again. And then we'll do it again. And then we'll do it again. And then we'll do it again. And then after a while, your body gets stronger. Like now, I'm going to require more of you. Now we're going to actually exert. And now, okay, now you've got some muscle mass. Now you've got some endurance. And now we're going to build on top of that.\nThe way I describe it, I'm like, you're building a mountain one layer of paint at a time.\nWow. You know,\nthat's a good way to describe it. Do, do you do the um, the uh, scans, the body scans?\nDEXA scans.\nDEXA scan.\nI have in the past. I haven't done one in a long time.\nI just found this guy Colin Anderson.\n287 pounds. Did a 100 mile race.\nHe set out to do like to break the world record.\nI like it says ultra large.\nYeah, that's the name of the little documentary they made.\nSo he's 280 lbs and he ran an ultra marathon. Wow. That must have been hell.\nWeight he lost at the end of video there, too.\nOh my god. I bet he lost 50 pounds.\nIt just checks right here.\nHow much weight did he lose?\nAbout to find out. Skip ahead. Spoiler alert.\nSpoiler alert. Get to the end.\nSuch...\nWait, gained weight.\nNo,\nit's 297. It says...\nWhat did he weigh before?\nIt's 287 is what I was seeing.\nWhat? How's that possible? 10 pound weight gain after 100 pounds.\nOr 100 miles around. What the [ __ ] did you eat, bro?\nWow.\nCrazy. I mean,\nyeah. He must have been eating the whole time. Like, right, like every few miles.\nSnacking every five minutes.\nCompletely. Yeah.\nIncredible, though. I guess. I don't know.\nI guess.\nOh, yeah. Your body probably is doing everything it can to keep the water.\nI mean, I can only guess.\nYeah.\nThat's pretty wild.\nThat is interesting. That's something I didn't expect to see. Yeah.\nYeah. To be that big and run 100 miles is very, very unusual. Most of those guys are super slight and you know, they just keep on trucking.\nYeah. Did you read that book a long time ago, ago it came out? I think it was called Born to Run, but it was like about the Taro Humara tribe.\nThey run barefoot.\nMhm.\nAnd um, I don't remember what it was actually called. Um, but really interesting.\nYeah. They run through the mountains.\nIt's like a South American tribe, right?\nYeah. South American or or even Mexican. I can't remember. I don't remember. But um, but the taro is what they're called and they would run barefoot. Yeah.\nWild.\nMhm. What the [ __ ]\nAnd and apparently they, you know, they uh, they would, they would also run, which was interesting. They would run happily, but they would have smiles on their faces and they'd be light and that and and they said that that was like helped them sort of lightly grace themselves through the the mindset that they had when they ran, help helped them to outperform everyone else. Well, they're probably doing it all the time. And in order to be able to run that much, again, you're building slowly but surely building on top of what you had before, right?\nLike, you can't stop. It's like if someone wants to just get out today and run a marathon. Don't [ __ ] do it, right?\nYou're going to blow your ankles apart. You're going to [ __ ] your knees up. You're going to ruin your hips. Like, don't do that.\nDon't do that. Run around the block.\nAnd then the next day, maybe run twice around the block.\nBut you have to get better the same way you got sick. Like, you didn't get unhealthy, you know, in a day. You got unhealthy over the course of a long stretch of life.\nDo you run? Do you like to run?\nNo,\nyou don't run.\nNo, I've done it.\nUhhuh.\nUm, I have a knee issue. And\nso you swim instead?\nI swim. I do. But most of my uh cardiovascular exercise I do on a air dye bike.\nOh, it's a...\nOr I hit the bag.\nBut does the bike hurt your knee too?\n\n\nNo.\nNo, it doesn't.\nNo, because you're not pounding, right?\nYou know, I've had knee surgeries, you know, from all years of martial arts.\nSo, I have like one knee that has meniscus missing, and I can run.\nI do, but I just don't think it's the best thing, you know, for someone who's got like, but then again, there's Gogggins who has like [ __ ] zero meniscus, and he's basically bone on bone just running around.\nBut he gets a bunch of operations.\nHe's on like seven or eight operations to try to correct his knees that are [ __ ] up from doing this.\nThey put plates in there and [ __ ] and he wears them out.\nLike it's nuts.\nI, you know, I respect the guy, but that's a lot.\nOh yeah.\nI mean, he's ruining his body, and he's hoping that science will get to a point where they could repair all that [ __ ] without him having to get a knee replacement.\nHe's like placing it on that.\nWell, it's like you can get a knee replacement now, right, and you'll be in significantly less pain.\nBut once science comes around, well, they're they're getting closer and closer every day to being able to completely regenerate cartilage, meniscus, and all that tissue that you have inside your knee that keeps it healthy.\nIf you decide that you want to get a knee replacement, that kind of stops all that because now you have an artificial knee, and you can't regrow a knee once you've cut your knee out.\nNo, you can't.\nYeah.\nAnd so this is why he's not doing that yet.\nI think he's talked about it.\nHe's like, \"Maybe someday I'll have to, but right now it's just he'll just deal with it.\"\nWow.\nYou look like you have to pee, do you?\nNo.\nOkay.\nI thought you did.\nYou're weasling around a little bit cuz I always get sensitive to guests like if they moving around a little.\nI was like, \"Oh, you got to pee.\"\nWell, now let me take an assessment now.\nCuz we're like 2 hours in.\nWe are two hours in at least.\nYeah.\nI I feel good though.\nI don't have to pee.\nI just sort of like Yeah.\nI guess I've just been sitting a while.\nIt's kind of like Yeah.\nNo, I do that too.\nI do that too.\nYeah.\nThe but the for people out there that are thinking about like, oh, this is inspiring me, start slow, but do it again.\nMake sure you don't just get inspired one day.\nInspiration is great, discipline is better.\nYou know what I did, which I loved, is that really helped me was in like wherever I would walk, just in general, I would just do a little like jog in instead of walking somewhere.\nI'd just go like, you know, just a little something, just like this.\nYeah.\nJust kind of like almost like this.\nAnd I'd walk wherever I was going, and and I started to do that every day.\nJust instead like, you know, instead of walking to to get my coffee in the morning, I kind of do a little jog, you know, and throughout the day I'd do that.\nAnd eventually I started like wanting to just go out for a run.\nLike my body just started warming up.\nI started like want and I kind of wanted to do that.\nSame concept.\nYeah.\nYeah.\nSame concept.\nBuild it up slowly.\nYeah.\nExactly.\nJust do something, people.\nI'm telling you, just go [ __ ] do something.\nFind a yoga class.\nDo something.\nTreat your body like a temple.\nWell, just just for your brain, you know?\nYou got to understand that there's a connection.\nIf your body is sedentary, it's just sludge.\nIt's all just it's all blocked up and y that [ __ ] with your mind.\nThe mentally unhealthiest people that I know are all terribly out of shape.\nYep.\nAnd that you I mean, you know, there is a correlation for sure.\n100%.\nYou know, this is this life.\nThis life is you you've you've given you've been given this meat vehicle, and you got to maintain it.\nIt's a good band name.\nMeat vehicle.\nProbably already exists, probably.\nThey probably have some banging songs.\nIt's probably a hardcore band.\nDefinitely a hardcore band.\nMeat Vehicle.\nWait, there's some other ones.\nOh, Biblically Accurate Angel.\nOoh, biblically accurate Angel.\nHave you seen what a biblically accurate angel is?\nYeah, they look like aliens.\nThat was pretty cool.\nYeah, they look like geometric patterns.\nYeah.\nI always wonder what the alien, you know, Tucker Carlson's convinced that aliens and devils are that's that's what you like angels and and devils and aliens are all the same thing.\nHe thinks that they're not visiting from somewhere else.\nThat they've always been here and that there's some sort of spiritual aspect to like the UFO encounter UAP phenomenon.\nOh, I see.\nYes.\nUm, well, there's a lot of interesting pictures that are, you know, drawn on cave walls.\nOh, yeah.\nThings like that.\nOh, we've gone over a [ __ ] ton of them.\nAnd then also ancient religious art where it looks like people are in vehicles flying through the sky.\nI'm sure you've seen those, too, right?\nYeah.\nLike, what is that?\nLike, what are you trying to There's no other stuff that you're in that thing that's fantastical.\nEverything else is like an accurate representation of life at that time except for these people that are in these flying things in the sky.\nLike what is that?\nYeah.\nWe just don't know.\nUnfortunately, when I looked at all of the credible UFO reports, the only ones that really had no explanation, I actually asked chat GPT of all of the credible UFO of all of the UFO reports, which ones have not in some way been sort of explained, right?\nAnd which ones are the ones that are still like And the one that was not comp the one that's still sort of outstanding is the USS Nimmits experience.\nCommander David Fraver, right?\nYeah.\nI've had him on the podcast talking about Have you really?\nYeah.\nYeah.\nThat seems to be the most compelling.\nMhm.\nUm, there's other ones though.\nYeah.\nRyan Graves, uh, he's another fighter pilot, and that was off the east coast.\nSo the Nimitz is off the coast of San Diego, but off the east coast, they upgraded their sensors in 2014 on the fighter jets and then immediately started encountering these things that defied known physics that were in the sky.\nAnd you know, and these guys had these encounters with these things that were like a cube inside of a sphere that's like motionless at 120 knot winds and no heat signature moving through the sky.\nThey don't know what the [ __ ] they are.\nWhat what what do you say to the theory that of the possibility that that is um sort of black ops, like the idea that the SR71, I think um blackird, the blackbird, um there's a there's a company called skunk works, right, and they were they were responsible for the declassification of that aircraft, and then I think the F11 or the the stealth bombers, you know, but since then, and that was like 25 years ago or more, there have not been any more declassifications.\nYeah, it's a good argument.\nI I just I'm curious as to like what you know what in 25 years based on the technology that we've been able to see that makes it through modern society, how much is, you know, held back and what we don't see.\nUm, you know, it just interests me, and I and I I I don't know.\nI don't have an answer, you know.\nI'm not asking myself whether you know, I don't I actually believe that it's it's almost unlikely that we have that technology, but because I feel like it would just take so much more than we may be capable of to cover it up, but maybe not.\nI don't know.\nYeah, I don't think it would.\nUm, I think there's a high likelihood that a lot of this stuff is ours, and I think one of the reasons for that statement is that this stuff always happens over military airspace.\nYeah.\nEast coast and west coast.\nLike so the east coast stuff, the Ryan Grave stuff, they're doing it over areas where these fighter jet pilots run training missions.\nYeah.\nAnd then the same thing as the West Coast stuff, like that where it's off the coast of San Diego, which is like tons of military out there.\nYeah.\nUm, I I do believe that there's some programs that are operational, and there's a great uh podcast.\nJesse Michaels has an amazing YouTube channel that's he's he's covered this stuff like really extensively, and he's a brilliant guy.\nHe really understands it.\nAnd they were working on some anti-gravity technology in the 1960s, and most likely they continued that work.\nYeah.\nArtificial horizon technology, stuff like that, you know, that that I mean there's got to have come far since then.\nYeah.\nAnd there's the idea that they could hide all that stuff.\nNo, they could never hide it.\nOf course they could.\nOf course they could.\nThey definitely could.\nYou being naive?\nYou're being naive as to how much the the government I'm I'm I'm only asking the question, you I don't mean you say that.\nI actually pretty much that's where I lean towards when it comes to that.\nI think some of it, but some of it also could be from somewhere else, and I think some of it just exhibits like the the Nimtts one, okay, this is 2004, so this tic tac goes from more than 50,000 feet above sea level to sea level in less than a second.\nYeah, like seven eighths of a second.\nSure.\nLike that's crazy.\nThat is.\nAnd you're right.\nWhat is that?\nAnd it does it does it changes it when you remember how long ago these things were being seen, right?\nBecause this is 2004.\nBut then you go back to the 1960s, if they're really working on anti-gravity technology back then, it's possible that they could have created a drone, right?\nThe the the thing is like could a human being survive inside of those things at those extreme speeds?\nWell, the question is like what are they experiencing in that?\nBecause if it's a gravity device, if it's moving, if it's manipulating gravity, so it might not have g forces at all.\nIt might be operating in a completely different paradigm.\nYeah.\nWell, there may be sort of just you know trillions of calc of of of alternate sort of uh you know uh momentum shifts in the outside protective layer that that balance out whatever is happening on the inside to the point where you know they're using this crazy technology.\nThat's also why the argument is that they're blurry, like so a lot of the photographs of these things are blurry.\nIt might be because they're actually existing in some sort of a gravity like void.\nYeah.\nAnd what you're seeing is not exactly what's there.\nYou're see you're seeing it through like a dirty windshield.\nI've seen some stuff.\nHave you?\nYeah.\nWhat have you seen?\nWhen I was in Maui, um, twice I've seen something that I could not explain.\nThe one time I I looked up, and about nine of us were hanging out, and we all looked up at the same time to see an orange orb, and it was probably it looked like it was a hundred yards away, maybe 200, just floating kind of observing.\nAnd then I swear it seemed like as soon as enough people saw it, it went, and then it went, and it moved like nothing else I thought possible at the time.\nIt went out of the atmosphere, you know.\nUm, and it was crazy.\nFaster than any drone.\nAnd that this was back in like 200 four, 200 five maybe, you know.\nSo it's very, we were all, you know, young.\nI was maybe a little teenager.\nSo, it was probably like 2006, you know, but it was like it was crazy.\nI'm not telling you.\nIt was like, you know, uh, and and uh, well, a lot of them happen near the ocean, too, which is interesting.\nAnd another one I was out on Lai, and we were hanging out with some friends, and we were laying down on the lawn, and and when you're out in LAI on the back side of LAI, there's no light pollution at all.\nAnd so, you have just this big giant fishbowl of stars, and it's the most incredible.\nIt's like you're sitting in a spaceship.\nIn a in a spaceship.\nExactly.\nAnd you feel that you're on spaceship earth at the time, you know, like you are on that rock hurtling through space at that point.\nAnd I saw this, we all, it scared the girls.\nWe all saw this pulsing colored thing go from one side of the horizon to the other.\nUm, but in a in a very like it was like pulsing different colors, and it was like really interesting.\nAnd so, you know, who knows what that could have been, but it was quite interesting.\nWell, the vast majority of the ocean floor is unexplored, right?\nAnd so, this is the theory is that if you were going to set up a base here to observe human beings, if you came from somewhere else, you would probably do it in the ocean, especially if you have the kind of technology that allowed them to travel here from other star systems would also allow them to not be intimidated whatsoever by the pressures.\nI mean that's I guess the the deep pressure is what would be the uh you know it's almost the opposite of being in space, you know, the vacuum, and then you have the deep right pressure of of of you know that that like you know with the but there's videos of these things going in the water and not creating a splash.\nYeah.\nSo like what is that?\nIs it a hologram?\nSo, is it not a physical object, or are they doing something that allows them to not interact with any physical thing on Earth, like some sort of a a void that they travel through?\nSo, they can go through the trees.\nThis is like part of Jacques Valet's research, too, in one of his books that was really fascinating was this woman observed this like eggshaped thing, and when it took off, it went through the trees, but it didn't hurt the trees.\nMhm.\nBut it was on the ground like as a physical object, and when it took off, it went through the trees.\nWell, I wonder if then you you know we're talking about like bending spaceime.\nYeah.\nAt that point, are you creating some sort of like u uh warp?\nYeah.\nYou're creating some sort of warp drive thing.\nThat's the idea.\nYou know, where where you're just like warping space and time around a centralized location.\nYou sort of have to be, you know, use sort of the um you know, the these like different sort of\n\n\nExotic forms of matter and having an understanding of exotic matter, which we're now just starting to understand that there are like are these exotic matter types that you know that that work in these weird ways.\nAs as we if you read about it now, the only information available is that we're only like cracking the surface of the understanding of these types of matter and maybe hundreds of thousands of years away from understanding that.\nBut I mean, you know, that's old saying that any technology that's sufficiently advanced is indistinguishable from magic.\nIs it Carl Sean said that?\nI forget who said that.\nBut yeah, I mean, if you're looking at something from a thousand years from now, it would seem like magic.\nI mean, if if we continue, we don't blow ourselves up and science and AI continue to figure out more compelling uses of universal energy, like whatever background energy that we have.\nYeah.\nWho knows?\nWho knows what what human beings will be capable of.\nSo, you got to imagine if something's visiting us from somewhere else, especially if they have artificial super intelligence.\nYeah.\nIf they've if they've traversed this journey that we're on, if they've gotten to the point where whatever we're currently investig whatever they're working on right now in terms of like super intelligent AI, what if they've gone through that and they're a thousand years more advanced?\nAll that stuff would be probably simple for them to be able to go through the water to have these transmedium crafts that are capable of flying in the air through the water.\nRight.\nWell, the the interesting question for ourselves is is how do we get to a place as a society to where we can trust in our science?\nWe can trust to say that we trust it enough to fund it, you know.\nWell, you that's not trusting the science.\nThe tr the problem is the human beings are in possession of the science.\nWell, but that's what I mean.\nLike how do we restore faith in that?\nAnd and because there are there, you know, it's not all [ __ ] There is real, you know, like we we wouldn't exist where we are without the science that has brought us to where we are.\nYeah.\nTechnology and technology and and so understanding and trusting and and and and figuring out how to restore faith in certain institutions that we have because we need them to survive and to keep going, you know.\nSo it's like it's like not tearing down the airplane while it's falling.\nYou have to repair the airplane from inside, you know, and then keep it flying if you can, you know?\nSo is there a way to like write the ship while we're in it?\nI think the problem is a lot of this stuff is military funding, right?\nSo a lot of the applications for any sort of like super advanced technology is going to be weapon systems, right?\nAnd that's what everybody's terrified of.\nWhat they're terrified of is that you're going to develop more efficient ways to kill people.\nYeah.\nAnd that's really the only way these things get funded.\nYou know, they're not gonna\nNo, that's the problem.\nI'm what I'm saying.\nI'm like, how do we how do we switch it so that we can, you know, have people in power that really are looking out for the future of humanity.\nYeah.\nAnd then have people that actually want that.\nAnd because some people are going to have to take sacrifices for that, you know, in a way.\nAnd I mean people high up are going to have to say, \"Well, I'm going to have to, you know, get paid a little less because this, you know, it's a great struggle, Lukas.\nGreat struggle.\"\nYeah, it really is.\nIt's a great struggle.\nIt's the great struggle of like people in power, you know, don't necessarily deserve power and and the kind of people that you want running the world aren't interested in the job.\nOh, most of them.\nYeah.\nYeah.\nExactly.\nUm well, yeah.\nWell, hey, brother.\nI really enjoyed talking to you.\nThank you very much for being here.\nI appreciate you having me, Joe.\nAnd uh I encourage everybody to go see you live because you're [ __ ] amazing.\nIt was really an incredible performance at the MCA thing.\nAnd uh I wish you all the best, man.\nIt's been cool being your friend, too.\nEnjoy talking to you.\nI enjoyed talking to you, too.\nThat was fun.\nThank you.\nUh tell everybody where they can find you.\nWhere's the best place to find your music?\nYeah.\nUm well on all the platforms of course um uh we we're there and we're going to we got a tour posted.\nUh we're going to come um that's live in concert.\nOh, you're going everywhere.\nYou're like Johnny Cash.\nWe're about to put out new dates too for the fall.\nWe're going to be all over the east coast, the west coast.\nWe're going to be everywhere.\nBut this\nOh yeah.\nSorry Kansas City.\nThat [ __ ] sold out.\nSold out.\nYeah, that was the ones coming up.\nCharlottesville, Virginia.\nAllentown, Pennsylvania.\nOh, yeah.\nThose are May.\nI'm looking at May.\nYeah.\nYeah.\nSo, there's plenty of stuff coming up for people that want to go.\nMontana is going to be great.\nBig Sky.\nBig Sky.\nPark City, Utah.\nYeah.\nThere you go.\nWyoming.\nAll right.\nYeah, man.\nThank you.\nIt was fun.\nI enjoyed it.\nAll right.\nBye, everybody.\n[Music]\n[Applause]\n[Music]\n"
}