{
  "episode": {
    "id": "mYvGKBCM3Ps",
    "title": "Joe Rogan Experience #2332 - Oz Pearlman",
    "publishedAt": "2025-06-04T17:01:05.000Z",
    "description": "Oz Pearlman is an entertainer, mentalist, and endurance runner. ⁠https://www.ozpearlman.com⁠\n\nGet a free welcome kit with your first subscription of AG1 at https://drinkag1.com/joerogan\n\nDon’t miss out on all the action - Download the DraftKings app today! Sign-up at https://draftkings.com using my promo code ROGAN.\nGAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit ⁠https://gamblinghelplinema.org⁠ (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit ⁠https://ccpg.org⁠ (CT), or visit ⁠https://www.mdgamblinghelp.org⁠ (MD). 21+ and present in most states. (18+ DC/KY/NH/WY). Void in ONT/OR/NH. Eligibility restrictions apply. On behalf of Boot Hill Casino & Resort (KS). 1 per new customer. $5+ first-time bet req. Max. $300 issued as non-withdrawable Bonus Bets if your bet wins. Minimum minus 500 odds required. Bonus Bets expire in 7 days (168 hours). Stake removed from payout. Terms: ⁠https://sportsbook.draftkings.com/promos⁠. Ends 6/22/25 at 11:59 PM ET. Sponsored by DK."
  },
  "channel": {
    "id": "UCzQUP1qoWDoEbmsQxvdjxgQ",
    "name": "Joe Rogan",
    "slug": "@joerogan",
    "url": "https://www.youtube.com/@joerogan"
  },
  "transcript": "Joe Rogan podcast. Check it out. The Joe Rogan Experience. Train by day, Joe Rogan podcast by night. All day.\n\nOh, yep. All right. Surreal. Dude, you've only been here for 20 minutes. You already freaked me out. Joe's freaked out. And I'm freaked out for the fact that you're the first guy that's ever come here that ran a marathon.\n\nYeah. Before you got here. You know, wanted to clear my mind. It's a big day.\n\nHow long did it take you to run it? You got to check online. I don't know. I think it was like 3 hours 25 minutes, 3:30, something like that. Wow. That's a good time for Southeast thunderstorming in Austin, Texas, and then uh looped around, went back, got some work done. I always do phone calls while I'm running.\n\nHow often do you run? You said you ran 27 miles this morning.\n\nI think so. I I don't know. I just I I turned around, I got it done. I need to get ready for this shower. But yeah.\n\nIs that a normal thing for you to do?\n\nVery normal. Wow. That's crazy. That's a lot of distance, man. You know, I there was like a sweet spot pre having as many kids and more family constraints and and work and now life is busy, but where I do 20 miles every day.\n\nThat's crazy. Like what's the longest you've run?\n\nYou do 53 miles. Wow. How how long did it take you to do that?\n\nH 33 hours. Spartaflon in Greece. Epic in Greece. Oh, it's crazy, man. You run from Athens to Sparta. This race is amazing. You ever seen the movie *300* with Jard Butler?\n\nSure. So that's the story. A couple of crazy dudes in the 80s decided that they're going to recreate where he ran Fidypes to deliver the message cuz in that movie, you remember 300 Spartans defended against the Persian masses. And they frame it as the difference between us having civilization and not had those 300 guys not died while they assembled an army and he delivered that message to King Leonitis. So when you finish this race, if you finish, it's one of the hardest races in the world. Like there's Bad Water, you know, Gogggins. Mutual buddy of ours, but uh there's races they say are the hardest. This one kicked my butt. First year because of the elevation.\n\nWhat is it?\n\nIt's because Europe does not believe in ice. So there's nothing cold for the first 50 miles. Ah, you're hot and then the the cut offs are much stricter. So at 50 miles, you have to be done. You got to fact check this, but 9 or 10 hours. So you have to finish 153 miles in under 36 hours. You need to be running at all times. You can't walk for two hours and start throwing up, which I I was puking for eight hours straight the first time I did it. Still excuses. This is me just bitching. I should have finished that year. I wasn't mentally tough. But 100% that year, I just didn't have it mentally. And the next year, I came back ready to die. I was like, I'm going to finish this race. Yeah. There was a guy in the middle of the night, I won't kid you, who looked at me and he says to me, there it is. He goes to me with like crazy eyes and I've already given up in my mind. You know, you know, like they call it dnfing, did not finish in ultras. I already wrote the speech of like I'm going to tell my friends I learned from this, you know, all that all that stuff of like I already gave up in my mind. And I saw this guy at mile, I don't know, like 72, middle of the night, who looks at me with these crazy eyes. I'll never forget his looks. Crazy eyes like that, but a hundred times more. And goes, \"You're going to give up?\" He goes, \"If you can't run, you walk. You can't walk, you crawl. You never ever.\" And I was like, \"Yo, man. this guy needs to chill out right now because I've already quit in my mind. But I channeled that guy when I came back the next year. And it was that it was I'm going to the hospital and you're not putting IV. I'm going to finish this race. And I came back the next year mentally like there's no way I'm not finishing.\n\nDid you do anything different in preparation?\n\nListen, it it all mental. Anyone who tells you otherwise, physical is meaningless at that point. Physical is meaningless in most points to be honest. There were guys who I saw when I quit. It was, you know, 2 a.m. who were slower than me. They were older than me. Every objective measure, I should have beat them, but they mentally finished. The next morning, I got a night's sleep, woke up, watched them, ate lunch, and saw them finish. I was like I was crying. I I couldn't believe the emotions of this guy finished who was two hours behind me when I quit. And I learned that day, it's mental 100%. The mindset is when you get there, you know, if you're finishing at the start.\n\nSo, did it haunt you that you didn't finish?\n\nOh, haunted me every day.\n\nIs that crazy? Haunted. Like what you did was really hard, but you\n\nNo, that's [ __ ] hard. It was I should have finished.\n\nHow far did you get?\n\nI I got halfway.\n\nSo that's pretty hard.\n\nNo, I got 75 miles. This I quit when it was convenient cuz I got to an aid station and I'm like, \"Oh, you know, I got 30 minutes on the I already decided in my mind I was quitting.\" Uh, but hold on. I got to pause cuz I walked in here and I told you before we start, I have something for you. Right. Right. People say, \"Can I read minds?\" I can't read minds. I read people. Okay. this envelope. If they can't see it and they're listening, your logo sealed, right? This is your future. My future. This is your future. I'm not psychic. I'm not supernatural. But I assure you, I want you to hold this from now until the end of the episode. Okay. That's when we open it. I don't even know if I want to know my future. No. No. This is all good stuff. Live to 120. Joe's going to be a two-term president. You know, you know. Shut the [ __ ] up. That's not good. I don't want that job. You take it before we even start. And at the end, we open it. So, nobody skips this episode. You buckle up for the ending. I'm I'm here. People will just fast forward. They'll fast forward. They'll miss all the good stuff in the middle. The quitters. The quitters. The people who did not finish Spartathlon.\n\nThat's So that's insanely impressive though that you run that much. When did you start doing this?\n\nMy sister ran a marathon. Shout out to my older sister. And there's a little bit of sibling rivalry. She's 8 years old. I have twin sisters. And do you remember when marathoning became like common place? Before you say anything, I have to shout out to my sister. She cuz she got upset that I didn't shout her out before cuz she ran Bert Chryser's 5K. She's like, \"I can't believe you didn't shout me out.\" Sorry, sweetie. Love you. Well played. Well played. Yeah, she's the best. They all are. Right. So So my sister ran it and and everyone at a certain point marathoning became like a thing. Do you remember when Oprah ran one and then everyone's like, \"I'm running a marathon.\" I didn't pay attention. Yeah. But there was like a moment where the zeitgeist everyone started running marathons. This was before that. I believe you. Yeah. But I wasn't tuned in to that frequency. I was I when my sister said she's running 26.2 miles. If she had told me this is not that she's not fit. She was like a collegiate D1 athlete swimmer. I'm like what do you if she had said I'm going to the moon it would have been equal of like what do you mean you're running a marathon? And so when she did it I immediately that day signed up for a marathon just to be like no screw that I'm not I'm not not doing this right? And I was working on Wall Street. I was kind of getting fat and lazy happy hours and I I go this is all there is. Like I'm just going to keep I'm making money. Don't get me wrong. I'm blessed, but I got I got to have something that fires me up. That's my instinct. And so I signed up for a marathon.\n\nWhat year was this?\n\n2004. Okay. And then I did one Philly marathon. You know, the Rocky, the whole thing. And at mile 23, I start I stop and I I'm like crying. I again, this is a common theme. I've cried like twice in my life. My wife will ask say, but I was wrecked. I was going to quit. I see two dudes walking because I'm going decently fast at this point. I've trained terribly. I see two dudes walking about a hundred yards ahead of me and I go, \"Misery loves company. I'm going to walk up and I'm I'm going to catch them, but they're walking the same speed as me.\" So, I decide, screw it. I'm going to run to them. I run. I get about halfway there. Do you know what they do? They looked at each other and they started running. And I literally screamed at them. I go, \"Fuck you.\" Like, I and I got fired up. And I learned that day anger is a great like in in incentive. It's like something to fire up. And I got so pissed off that my blood pressure I ran the rest of the race. You know, Gogggins takes all of his haters comments and he records them and then plays it back to him while he runs.\n\nOh, I know David well. I've known David going on like 15 years, man. Before Gogggins became Gogggins. I've seen the whole come up.\n\nHow did you meet him?\n\nSo, we train for ultramarathons together. He used to live in New York City. Oh, wow. And we'd go out there and, you know, he's shirtless. And this is before now, man. He can't go anywhere. He's just It's like next level. He still runs on the street. He runs, but man, he's he's like that's such a fame. That's you know, we've talked about, but it's he's he's I mean, he's inspired countless millions.\n\nOh, for sure. But you see, I don't know what your version is, but like somebody sees me, I just get like a oh, hey, love what you do. That's it. You know, maybe a selfie. That's it. Occasionally some drunk [ __ ] is like, \"Read my mind right now.\" And I'm like, \"All right, all right, buddy. I'll do it. I'll do it.\" You know, I don't want to leave somebody behind. But his is someone comes up and you have to you change my life. Like I didn't kill myself or my brother. That's That's a religious level fervor. Mhm. Yeah. No, for sure. I've been I've been around him when I've seen it happen. Yeah. Yeah. He runs on the street. He was run on the street in Vegas. My wife was in the car. She rolled down the window and yelled out, \"Stay hard.\" Second time he's ever heard that, right? Who's going to carry the boats? That's all he hears all day long is people yelling, \"Stay hard. Stay hard.\"\n\nThe memes that people have put together are just those videos. And he's got a great sense of humor, which people don't realize. He's got a great sense of humor. He's a fun dude. He's a really fun guy, man. Love that guy. Yeah, he's he's a fun dude. He's just very [ __ ] serious. Yeah. About about pushing himself.\n\nDid you see the video of him and Israel Adosana?\n\nYeah. Yeah. It was crazy. Like Israel, world class athlete, world championship fighter. Yeah. Cannot compete. Can't keep up with this 50-year-old man.\n\nWho was the other one? Was it Was it Was it Jon Jones? Who was the other one he trained?\n\nTony Fergus. Tony. Tony who's like cardio is through the roof. I mean, Tony was like that guy five rounds. It's just insane. Never never gasses out. Yep. Yeah. He might have overtrained. He got He might Gogggins run ran through uh the washer right there. Well, it would have been interesting if he got a hold of Tony when Tony was in his prime. You know, he got a hold of Tony when Tony was at the end of his career essentially. Yeah. You know. Well, I mean, that's always it, right? Judge a fighter at the prime. Well, yeah. And absolutely. And with fighters, you know, there's just especially natural fighters that aren't taking any steroids or anything. When when it gets to a certain point in time, the game is over. Just that's just how it is, right? Time is undefeated. Time's undefeated. But [ __ ] Gargens almost 50 still out there doing it. And has been injured so many times. Not just injured. People need to understand the mental strength. And we've talked about on the podcast before. We showed his X-rays. Y the work that he's had done on his knees. I mean, it's all insane. It's insane. They do experimental stuff on his knees, right? His knees are destroyed. I mean, they must be Yeah, they're destroyed. They're complete bone on bone. And he just keeps running on them.\n\njust like okay he cross trains though I mean the dude like the pull-up record his hands Cam Haynes son right I just saw that man what a stud that kid is I've been watch I follow him he is I've never met him but man he's that consistency and that putting that together and uh yeah very impressive I don't know like I I've known him since he was a kid so to me it's fun to watch\n\n\nHim become a man and then be become this beast. Beast, yeah, it's amazing. I mean, he did, I think it was, was at 9,000 chin-ups in 24 hours or 10,000. 9,000 was the record. 10,000 in one and I'm good. 9,000 was the record, and he got to 10,000. So he broke the record first, and then some cat in Australia broke the record, beat his record, and then he just demolished that guy's record. And then I saw his thing, which was a flex, which reminded me of something I did, which was like one of the highlight moments of my running career, which is he goes, \"I got another personal best in the same week at a marathon.\" And so he ran. So I one time did two marathons a week apart, like six days apart. I did New Jersey Marathon. I won it. And then the next week I did Long Island Marathon, and I got clipped by some college runner who beat me in the last like quarter of a mile. Damn. You won a marathon? I, I won that one four times in a row. Yeah, that's insane. What, what's the time? Uh, my fast time's at 2:23. 2 hours and 23 minutes for a [ __ ] marathon? Yeah, I love Gogggins, but every race we've run against each other, I beat him. Well, you have two knees.\n\nBut yeah, that's insane. That's, that's world class, man. I mean, it's like, it's like a fast for a weekend warrior. My claim to fame in 23 minutes. One year at the New York City Marathon. I want to, I want to remember this. I, I got 30th place, but at my shows, I tell people I was the fastest Jew. That's all that mattered. That's all fastest Jew. All that mattered.\n\nThat's super impressive that you win marathons. Well, I won that one, and then six days later, six or seven, I did this other one, and I got beat by this kid who was like 22. I don't care how old I was, 30s. And he beat me, and he fell and collapsed at the finish. And I'm like, again, I'm pretty fresh. And he goes, \"Oh my god, man.\" He goes, he goes, \"Is that your personal best?\" And I'll never forget looking in his eyes. And this guy's wrecked. And I go, \"Bro, that's not my personal best this week.\" And it was just, it was just the most fulfilling thing to say for not having won, but I'd run literally a week earlier faster. So I, that was a great moment. Yeah. But he beat you. He did beat me. True. First loser. It's a weird flex. Yeah, it's a weird flex. So you were a stock broker. I wasn't technically a stock broker. I worked on Wall Street, but I did what you do on Wall Street. So I, I went to school for electrical engineering and then worked like, I don't know, the tech guys who supported the eye bankers. Okay. And then how did you get involved in this mentalist thing? This mentalist thing, right? What a weird thing. So when I was a teenager, I started doing magic tricks. So I saw a guy on a cruise ship, and I, I'd never seen really a magician. I'd never, I wasn't into it. Didn't know about it. Didn't have a kids party magician when I was a kid. And I was obsessed. Literally, I was on a cruise. I followed this guy around the cruise ship. It was a little bit stalker-esque. And there's not that many places to hide if you're a grown man. So, I was finding this guy everywhere to just see more tricks. And I got back home and I bought every book I could at Borders. I went to the library. I was obsessive. I'm kind of those types of people who I don't do anything 80%, 90% given the running today. It's like 120%. Wow. And that was the thing for about, I don't know, 20 years. It was more I was doing magic. I was always doing magic on the side. I paid for college doing magic. Run a couple businesses. Yeah. What did you do, like, do shows? So I graduated high school when I was 16. Um, I like skipped a grade, all this, and then my folks got divorced. Long story. And uh, they moved back to Israel. I was born in Israel. So separately moved back to Israel. So I was a bit of a, I guess, I don't know, an adult. Like I had nobody supporting me. So when I went to college, I turned 17. I had, I had to pay all the bills. Whoa. Yeah. So I, I had, I was doing magic at restaurants. I've been doing magic at restaurants for like 30 years, and that's where I learned how to read people. Just how to go up to a table of people who are like, \"Who's this twerp?\" Like, \"Who's this nerdy kid with braces? Like, what are you doing here? Get out of here.\" And how do you win them over quickly? And that's honestly the biggest skill is how do you in sales read people effectively, right? That, that's what I'm selling. I'm selling the thought of reading your mind. Now, did you learn the techniques from books? Did you take classes? No classes. Books and videos.\n\ndid magic, and so mentalism is kind of a field like you had David Blaine in here, right? Legend, man, growing up, like, icon. So magic tricks are different because magic is, there's a slight of hand, right? So you're deceiving your eye by making you look at the wrong place at the right time when I do a move, and I can practice that move over and over and over until I get it perfect so that when I perform for you, it works, right? Okay, standup comedy.\n\nthe most pure art form, right? You and a mic. That's it. Mine is the closest. Magic, you have props. Men's, there's no props. Like I don't need you to pick a card anymore. I don't need it, right? I can just tell you think of a card, and that's where I go with it. So now you start knowing how people think, and you in essence reverse engineer the human mind. It's kind of like magic of the mind. And so that's where it kind of went from magic, and I kept doing more of the mentalism, more of it. But mentalism has a very steep learning curve. If you go do an open mic and you suck, how many people get to the level of getting better, getting better, putting in the work, takes 10 years to be funny for most people, right? Uh, there's a couple phenoms, but that's a different story. So most mentalists, they drop off cuz I'm just going to go back to magic tricks. This works every time.\n\nSo it's more difficult to learn. Way more difficult. Is it sheltered? Like, is the, the material on it difficult to find? Is like, it's, it's, I think it's more that people don't have the, the thick skin, like the same way you said the quitting mentality where I came back the year later. Most people won't improve because you can't practice mentalism in front of a mirror. You can practice magic. So when I do the trick on you, and it's a card trick, no offense to magic. It's great, but what we're talking about is a much higher level. I can't get it right. And the first few times you do it, the first hundred times you eat, you know, you eat [ __ ], like you're going to get it wrong. And most people don't want to do that. Oh, watch. Watch. Let's try something fun. Okay. Okay. How about this? If I were to ask you how long you've been married? 16 years. Okay. Nailed that question. Well, well played. Thank you. You got your sister's happy, your wife's happy. If I asked you, would your wife know your social security number? No. She doesn't know it. No. So, is there any way in the world I can know your social security number? I don't think so. Right. You say, \"I'm a stalker. Who knows?\" Yeah. Yeah. You could have got the information maybe. Online. Agreed. Agreed. I'm skeptical. You're skeptical. Well, especially someone famous. Yeah, fully. Plus, you can't change that. So, I'm not going to do that to you. Data dumps.\n\nIf I told you right now to make up a random number, I'd say, \"Get out your calculator.\" I'd love that. And you add it up, and you do a random number. You know, I'm screw. I want it to be spontaneous. Would your wife know your ATM pin code? No. No. Lie to me. Do not tell me your real ATM pin code. Okay. Obviously, unless you want to make up a fake four-digit number off the top of your head. What feels to you utterly spontaneous. When I say go, 1 2 3 four-digit code, random go. Okay, say it. 2020. 2020. Okay, so you ask me how do I do what I do? I'm going to write down 2020. Okay,\n\nit's weird, but statistically men will lie bigger, women smaller. Men like lie by saying things are bigger, right? No shocker. Okay. So, I don't think I would tell you right off the jump for me that that means that your first number, you don't have to say anything yet. I wrote 2020 is smaller. That's what most people do when they're rushed. If I had given you five minutes, you would have done this different. No, I wouldn't have. No, you would have. You, because you would have thought about it, and then people go down a different path. Nope. No. Nope. Okay. Worked out for me either way. You'll be honest if I'm right. Okay.\n\nI got a hit, which means it's a zero or one. I think the first number of your code's a one, isn't it? Your real pin code.\n\nMy ATM ATM pin code. Why would I tell you that on the air? C, should I, should I only show this to you? Sure. Only show it to you. Yeah. Can we acquiesce that the first number I got was correct? Yes. Okay. Now, you did repetition. So, I like the fact when people always say to me it's fake. When they watch the videos, they're like, \"You must have said up. Joe doesn't even want this to happen right now. He had no idea this was going to happen.\" You used two numbers in repeats. What that means is you probably did the same thing. You also didn't use any of the same numbers. So, I know there's not a two, a zero, or two in it. I don't think so either. Mhm. And I'm watching you while I say it. You put the hand up. You might as well said yes to me out loud. So, now I know. Think of the second number. Okay. Third number. Fourth number. Every time you did it, it's a data point.\n\nOkay.\n\nI'm only going to ask you one more question. I'm not looking for answers. The last number is the biggest, isn't it? Yeah. Yeah. I'm showing this to you. Is there a camera behind me? Hey, I want to make sure I'm only going to show it to you.\n\nIt's not 2020. How'd I do, Joe? Is that your ATM pin code?\n\nYeah. That's\n\n[Music]\n\nweird. I'm skeptical because I got that pin code in the mail.\n\nYou know, he's calling his bank right now and being like, \"Yo, do you know this? Has this guy been playing the long game?\" Yeah. I don't like that. It's not 1950 anymore, people. We know our food is different, highly processed and less nutritious. Industrial farming practices often strip nutrients from the soil and can deplete the nutrients available for us from food. Even the healthiest diets can have nutrient gaps, but AG1 NextGen helps fill those gaps. It's a more daily health drink to give your body the nutrients that you can't get from food alone, especially in today's day and age. AG1 NextGen is clinically backed, rigorously tested, and trusted by athletes and experts. I've been partnering with AG1 for so long because they really do the work to help you feel a difference in your health. If you want to feel the difference and fill your nutrient gaps, subscribe today to try their newest clinically backed formula, AG1 NextG. You'll also get a bunch of other free stuff like a bottle of D3 plus K2 and five of the upgraded travel packs with your first subscription. Just go to drinkagg1.com/jjogan. One scoop a day. Your body will thank you. Again, that's drinkagg.com/joan. Have you ever done that to people and then withdraw money? No comment. Interesting. Interesting.\n\nI'm trying to avoid criminal. Yeah. So, I want everyone to know that was correct, right? That is you went 2020. Yeah, that was correct. Your wife of 16 years doesn't know it. It's 2020. Not. It's just cuz that's the year I moved here. It wasn't like I think I know you think that's the case. No, that's 100% the case. That's exactly what it is.\n\nWhat do you mean? You know, I think that's the case.\n\nYou said a four-digit number and I was like, oh, the date I moved here, right? 2020. Perfect.\n\nI hear you. You don't believe me? It's not that I don't believe you. It's that we got layers. So, like, we're peeling through. And I know why you think you picked it. And I know that you think you gave me no information, but I'm telling you that good luck finding out. How in the world could I have found out your ATM PIN code? You said nobody knows this. That informed what I did. So, had you thought of a different number of your social security, you wouldn't have said 2020. But that ATM PIN code is one that was assigned to me by the bank and I never changed it. Right. It's not I didn't pick it. That's even better, isn't it? Had you picked it, I could have looked this up. That's actually to me more of a No, because you could get it from the bank cuz the bank is the one that [ __ ] sent it to me. If I guess, man, if I have broken into your bank account, there are bigger things at play than this podcast. I feel I don't keep a lot of money in that account.\n\nWhat? Watch this. Watch this. How many UFC fights do you think you've seen in person or commentated?\n\nBoy, I don't even know. I really don't know. What UFC number are we\n\n\nOn? UFC.\n\n2000, 200. What is it?\n\n200, 234 or something. What is it at now? 235 is the next one. But each fight has an undercard. You got the title fight. Sometimes as many as 15 fights or as few as three. 316. What is it? 316. UFC 316 is now coming up on June 7th. What did I say? Two. Yeah, I was thinking two for a second. Didn't we have 300 already? Oh, you know what? I'm think I'm confusing podcast numbers. We're in the 2000s. A lot of podcasts. UFC. Yeah, that's So, it's UFC 3 what? 316. 316. 10 fights per So, I haven't been on all of those cards. Um, but I started commentary-wise in 2021 and uh just as a post-fight interviewer in '97. So, '97 I did it for two years, not as many shows. And then from 2001, I used to do 20 a year. I used to do a lot. I was doing most of them. I would say thousands of fights. Thousands. Right. So, probably watch this cuz I love that. I like the way you think and I like that you're skeptical cuz I'm a huge skeptic. I'm always the one calling BS on this. Okay. Right. That's how I be that's how I started doing it. If you think through all your fights and you go back in time and they need to know this is spontaneous. This is impulsive. You have not thought of this before this moment, have you? Right. I want you to stop and start thinking of different fighters, past or present. Mhm. Could be somebody huge, could be a legendary figure, could be somebody more under the radar. Okay? Maybe you've had them on the podcast, maybe you haven't. Watch. Make sure you think I'm not guiding you the same way you said 2020. If I said that, I would have said that no matter what. Let someone jump into your mind right now that you've definitely seen one of his, I guess, or her fights. Okay. Bam. I'm not guessing it. I don't care. Tell us. Was it a specific fight you saw this person in or you just seeing the fighter? Just seeing the fighter. No. No. Go to a specific fight of that person. Try to like contextualize it. Or change to a different fighter right now if you feel like you need to. Maybe. Let me think. Let me think. See, Joe's not going to want to change now that I said that. I'm trying to get it crafty. Yeah, get crafty. Move along here. Are you going to come up with the name of the I'm not coming up with anything. I want to see how your mind worked. I'm only doing this because you told me I would have said 2020 no matter what. You think that you had the thought regardless of what I did. And I want you to see that there's causality. Boom. Do it now. Who just came into your head? Okay, tell us. I'm not guessing. Anderson Silva. Anderson. Legendary, right? Yes. Did he win or lose that fight? He won. He won that fight. Yes. How many people did you go to? So funny you said Anderson Silva, legendary guy. How many people did you think of before you landed on him? Oh, I don't know. I scrolled a rolodex. They just all went flying through my mind. Just give me a guess. How many times did you dozens? Dozens. Yeah, they just all went flying through my head. Dozens. Yeah. If you had to put a number on it and you actually count them, how many do you think you went through? Guess. I mean, let's be conservative and say like 14. Let's like not even say dozens. He was the 14th fighter that popped in your head. No, no, he was in there. He was in the mix. He was in the mix. I was just trying to figure out which one to pick. I was going to get one with a crafty Russian name. Should have one of those. Yeah. All right. No, 14 people went through your head. Anderson Silva. I It's Do you think that at some point in this week you heard something that got that in the back of your head that made you say that now? Do you think there's any way that that could have happened? No, I don't believe so. You don't write? No, I don't believe so. I've just been a huge fan of his forever. I I don't think something popped up that made me think. I'm just curious. Okay. No trick. I'm just curious why that happened. Yeah. Where do we go from here? Where you going with this? Where are you going with this? I don't know where I'm going. You don't know? I do. Okay. But I'm not telling you yet. Oh, okay. No, Joe's flumming. He's like, \"Where do we go?\" No, I mean like I don't know why you asked me the question if you don't have a resolution. Oh, I'm not guessing it. I wanted to see where you thought of why it came to your mind. There there'll be a reason. I don't want to explain it yet, but you'll see. Okay. Yeah, there'll be a reason why it came to mind. I think there is. Yeah. What's the reason? Well, I don't I don't want to tell you yet. I'm selling the sizzle, not the steak. So, these techniques that you use, are these ones that you've invented or these ones? A lot of them. Yeah. And how did you invent them? How did they come to you? I think my favorite form of entertainment by far is standup comedy. Like straight up, I'm a fanboy of comedians, like not the people that do what I do because that's I just love watching how you can take any premise and stuff that's not funny, right? The people that really go, you know, you like Andrew Schulz, you life. Did you watch his? I haven't seen it yet. You haven't seen it? No. So, how do you take infertility, right, and just it's not really a very funny subject and make it incred is incredible. One of the best. He's so good. So good. And so, I like the fact that how you invent that. So, I design with an end in sight. I say, \"What do I want people to remember about what I do because I'm not really in the business of fooling you honestly and like entertaining you. All of those are side effects. What do I think I do for a living? I create memorable moments which is very definable because if you go see a movie let's say you see a popcorn flick you walk out of the movie theater 10 minutes like what happened in the movie I don't know I it was fun I don't know that to me is 100% like the death of my show you leave and you will remember things hopefully for years to come and that's because I can rework your memory that's really a lot of the techniques I do people think that your memory is infallible that what you see is some sort of blueprint like a video and it's not it it has to do with how you feel in the moment, the emotions, the things you can position the same way hypnosis works. So, I can kind of engineer memories in a certain way, the way people remember things, the way they think, and create those moments that people talk about hopefully for years. And that's what's been, you know, I guess that's what's been a driver of my business and what's helped helped lead to my success. Engineering memories. And when you first started getting into mentalism, is that the word to use for it? Mentalism. Yeah. You're a mentalist, but do you call it mentalism? I guess so. Yeah, mentalism. Did you know that or is that something that No, I learned it. I learn, you know what, I learned certain things and I observed them and I didn't understand why they happened. You ever have that? You ever have a moment in a set where you say something that you didn't think was funny but got a huge laugh? Mhm. You know, do you have that or do you always know? Cuz it's it's usually not the punch, it's like, I didn't know that would be funny right then. Often times with a new bit. Yeah. You you don't exactly know where it's funny where the beats are. What was the word I said in this way? What was that inflection point? So, when I was uh doing restaurants, I had this trick where I would have somebody pick a card out of a deck of cards, right? They would put the card back in the deck. They sign it with their name, and I used to do this at a bunch of restaurants. They would shuffle up the deck. I give them rubber band. I say, \"Rubber band that bad boy.\" And I would take the deck, and I would throw it at the ceiling. It's kind of a famous trick. And then, boom, the ceilings were really high at all the restaurants I worked at so nobody could peel. Their card would be stay stuck to the ceiling. And this was great for multiple ways. One, everybody talks about it and they're like, \"Dude, this guy stuck my card to the ceiling. How to do that? They would also bring people back to the restaurant, right? Chuch-ching, chuch-ing. The managers loved me cuz we'd bring more people back to see it and point at where their card was, right? Business 101. And so I created a great value proposition to the manager. Why am I there? I'm, you know, getting you guys more customers. But one time I'm listening to people that came back in and they're talking about the trick and they go, \"Yo, man, I I picked a card. I I put it back in the deck and and I shuffled it up and next thing I know I look at the ceiling and my card's on the ceiling and I'm like, \"Yo, that's not what happened. I threw the deck up, the deck fell down, and then the card was on the ceiling.\" So, I go, \"Why did that guy misremember it?\" Right? Maybe he's just drunk. Maybe whatever, but I'm trying to understand why did he have a different memory of the same event. And what I realized is that people observe what you have them focus on. Right? Tony Robbins has a great bit where he goes, \"Right now, close your eyes. tell me everything that's green in this room. And you're like, green? I don't, you know, but then when you open your eyes, I see that the UFO lights are green instantly. But I say, close your eyes again. What's purple in this room? I'm like, I didn't look for purple. You find what you're looking for. So if I didn't say it, it took me a while to like iterate and figure it out. But if I don't look up when I throw the cards, when I would throw the cards up and let them fall back down in my hand and not look up, the percentage would go 80 90% that afterwards people when they told the story, they edited, they clipped out the part of me throwing the the the deck and now it becomes a miracle. How the hell is that card on the ceiling stuck? You mean you shuffled it, it was signed, it's on the ceiling? That went from being a good trick to a miracle. And I kind of learned that at about age 15. And now I started to realize, how do I do that with everything I do? Because that's a life hack for everything you do. That's not magic. That's life. How do you get people to remember what you want and forget the things you don't want. Wow. That's how you achieve success. You start to highlight your strengths. You find ways and that's a learnable skill. That's not something for magic. That's something in all of life. And what is like when you're thinking this, when you're thinking I'm going to get people to remember something, like how how do you how are you doing this? Like what's your intention when you're trying to devise like what to what to do? Well, I guess I guess my intention well at the end of the day I'm a competitive so I want to be the best in the world at what I do. Like I'm driven by that like Olympic gold medalist. Like I want to do the best things possible. Most people don't know what a mentalist is. You go on the street 100 people. How many people are going to say, \"Yeah, I have a second um ATM card.\" Leave that for the end. Huh? You want to try it again? Not yet. I don't like to do the same thing. I got to do bad stuff. I want to see it again though. I want to see if you could do it again. All right. Before we go, how about that? Not right now. We're we're we're in flow. Okay. Okay. Uh but I'm trying to throw you off. You could listen. I don't get it right every time. That's the other part. A magic trick works every time. This doesn't. I've eaten it on live national TV with millions of people watching. Yeah, man. There's no safety net. Like, it's not a trick. There's not a car trick where you put it in, I find it. There's not like that. So, how are you doing it? Well, I mean, I'm telling you, I don't read minds. I read people. I've got a whole host of different skills, algorithms, you name it. Like misdirection. It's all a wheelhouse of skills that I'm using to create the impression I can read your mind. But this has got to be a weird thing to know how to do. Weird like in a bad way or a good way. Uh definitely a good way. Yeah. But weird to like you have like an extra frequency. I agree. That you're tuning into with humans. Like you're experiencing life in a different way because you're experiencing life through this understanding of like thought patterns. You know what the best way? Do you remember in Born identity the first scene like one of the scenes where he loses memory and he walks in the restaurant. Do you remember that scene? And he's sitting at a diner. Do you remember that one? I don't. He sits there and he turns and he goes he doesn't remember who he is and he goes why do I know and I'm going to massacre this quote but I why do I know that that guy's 250 can handle himself in a fight? Why do I know this? Why do I know that right now I could run for 2 and a half miles before my core temperature goes down to this? Like he it's like this amazing superhero spy moment of like how the hell does he know all that stuff? So he's observing\n\n\nLife at a much more hyperfocused level than most people are. Most people are dialed in at autopilot. If you could set a speaker to autopilot and here's what you're observing. I don't do it in my day-to-day life. It requires focus. It's not the same. It's kind of like, I guess, I don't know. I don't lift weights. I just run. But how much focus is required to try to do, you know, the large bench press you ever done? I assume that you have to get psyched up. You have to focus. You have to do everything right for that to work. Just an analogy. But for me, when I'm performing, you ask me why I run 27 miles this morning. That dials in my mind. Like I'm focused where I thought through everything I'm going to do today. I'm it's it's a laser focus that got me kind of in tune. I could also have not run, but I that that's that's I'm also away from home, so that was like my joy.\n\nIs a sequel better than the original? We're going to find out at UFC 316. It is a rematch 9 months in the making. Get in on all the action at DraftKings Sportsbook, the official sports betting partner of the UFC. It's a huge night of fights headlined by a rematch between Morab Dwaves Willie and Sugar Shawn Ali as Ali looks to avenge the unanimous decision that saw Dwave Willie take the bantamweight title back in September. First time betting on UFC at DraftKings. It's easier than you think. Just pick something simple like a fighter to win and make your pick. That's all there is to it. And if you're new to DraftKings, here's your shot at cashing in right now. New customers bet $5 to get $300 in bonus bets if your bet wins. UFC 316 and DraftKings one night only for a shot to win some cash. Download the DraftKings Sportsbook app now and use the code ROGAN. That's code ROGAN for new customers to get $300 in bonus bets if your bet wins when you bet just five bucks. Only on DraftKings, the crown is yours. Gambling problem? Call 1-800-GAMBLER. In New York, call 877-8-HOPE-Y or text HOPE and Y at 467-369. In Connecticut, help is available for problem gambling. Call 888-789-7777 or visit ccpg.org. Please play responsibly. On behalf of Boot Hill Casino & Resort in KS. 21 and over. Age and eligibility varies by jurisdiction. Void in ONT. Bet must win to receive reward. Minimum minus 500 odds required. Bonus bets expire 168 hours after issuance. For additional terms and responsible gaming resources, see dkg.co/audio.\n\nUm, so when you're like putting together a show, when you're going to do a show, how do you structure it? Like how do you when like day one you're like, okay, I'm getting ready to do a show. You mean something on TV or like what I do for a living, like, like or either one, any kind of show you're doing? So for my day-to-day living, which is I do a lot of like really big corporate events and then I do, you know, I guess a lot of private parties, things of that sort, performances, like live performances. Uh, typically I structure it the same way I think anybody would. I want to go out the gate very strong. I want to very instantly establish credibility. Who am I? What do I do? Am I any good at it? Uh, and why should you be paying attention to me? Because all those questions off the jump is like, who the hell cares? I always go in with, who cares what you can do? You're special. I don't care. I like the thought of I'm going to prove to you that this is something incredible and that it's something you're interested in emotionally, right? If I told you just make a random number up, who cares? But now it's going to haunt you that that's your freaking ATM pin code. So, I prefer that. So, I do something very quick that freaks you out. And then every single thing needs to have a very clear premise. Like I call it clarity of effect. I don't like a trick where I'm like, get a book, get a Rubik's cube, get the like it's too confusing. You need to be able to explain to a six-year-old what I did in one sentence for it to be memorable. That's the key. The best things you've ever seen are typically stuff you can describe in one max two sentences.\n\nUm, and for TV, for TV it's the same, same exact thing, but I always like to do new stuff. So, I've done a lot of TV appearances and I always structure it based on who's watching. So, rather than it being about me and me saying, \"Oh, look what I can do and look how cool this is.\" Right? You do a card trick. Again, I'm not saying that's not amazing, but the card tricks about you. Typically, if I'm on ESPN and I've, you know, done hundreds of millions of views doing stuff for football players, you're watching this. You're a football fan. And you're like, \"Who cares about this guy? I'm going to do stuff about football players and about what interests you if you're a fan.\" I don't know if you ever seen I did a clip with Joe Burrow from the Bengals where I said, \"Joe, I never spoken to a word in my life.\" He goes, \"No.\" Like I honestly The funny thing about that is I wasn't even supposed to use him in the show. They told me he's shy. He don't want to like don't use him in the show. And they said, \"If you can't avoid him.\" And I got in there. I tried to rile up the gang, you know, kind of pure pressure. And I'm like, \"Should we get Joe in here?\" And they're like, \"Yeah, get him up.\" Haven't spoken a word to this guy in my life. There's no access. I went in with ESPN, shout out to Adam Shfter, who I love, who set all these wheels in motion. But Joe stands up, doesn't know me from anyone, and I say, \"Every wide receiver and tight end in the room, stand up.\" And I go, \"What if I could tell you who you're going to throw that ball to? What's that worth?\" Right? That's the holy grail if you're in football. I go, \"Catch the ball, quarterback.\" I go, \"Look at everyone in this room and now look at me.\" And I wrote on a huge, huge thing. Showed the camera. Throw it to anybody you want. Throws it. Got the first one right. I go, \"Let's do it again.\" I go, \"Throw it to anyone you want.\" Anyone? I go, \"Anyone throws it. Got the second one right.\" Everyone's freaking out. I go, \"One last play. One to two is luck.\" And I write fakes to Jamar. You can watch the clip. It It's most viral thing I've ever done. And he fakes it to Jamar. Turns around, throws it to another guy. Nailed it. Exactly. Just And you just see his face. And so I was thinking about how I would do that for two years. two years of thinking of every single way that could work, not work, go wrong. Everything about it was, you know, he thought I went in the room and it's so simple. That was two years of me thinking about it during every run.\n\nSo for two years, you knew you were going to do this or you knew that you were I I started with the end. You asked me the same way. I don't know how you like form a set, but you asked me how do I design? I was designing with the story people would tell. And so people that don't know who I am, don't know anything, go, \"Yo, we saw this guy. Did you see this guy?\" He just told Joe Burrow to throw the ball to any people. Throws it, gets it right, throws it. Like the story is I told a quarterback, anybody he would throw the ball to. So it was any quarterback. It wasn't Joe Burrow in your head. Uh well, I didn't know who would be, but he said you could do it for two years. So for two years, you thought you were going to be on ESPN and with a quarterback? Well, no. So I had He was the second season. So when I first started it, I I start brainstorming. I'm like, I can't control what thoughts come in. I'm constantly think about what I'm going to do and I I just do notes apps. I write stuff down in the shower. Like when I run is when I come up with stuff and in the shower sometimes on airplanes but I sleep on planes. But that's when it hits me. Like where are your where are your bursts? You must have like where are you getting material? Mostly late at night, right? Yeah. But sometimes driving. Driving. You don't do phone calls or anything? I mean phone calls I'm usually concentrated on talking to people. They're not the times where ideas come to me. A lot of times it's driving with no music on. Wow. Yeah. I I'm never in the car by myself ever. Oh, really? Mm- family. That five kids. Oh, wow. Yeah. Um driving to work, you know, usually that's when it comes to me. Yeah. And I'm in New York City, so there's no sauna. Sauna. Sauna's good because you can't be on electronics, right? Yeah. Yeah. The phone's are a killer. The phone's like you zap any creativity or boredom. You need boredom. Yeah, you do need boredom. Yeah, you need boredom for ideas to come to you. For sure. Yep. Yeah, that's the problem. But essentially with social media, it's like it's a boredom. It You are still bored, but you are occupied, right? You don't get to sit with it. Yeah. Yeah. Yeah. Which I think is key because that's when they kind of fire off. And I think that's, you know, not to get into it, but like so many kids now have no way to deal with boredom. Like it's like panic. I got to get my phone. I got to, you know, that whole feeling of I wish there was a way to do that. Yeah. They're just completely unaccustomed to not being constantly entertained and even entertained by nonsense. It's not even really entertaining. It's just distracting. Yeah. Which is a big part of it. Yeah. Yeah. So, you sat out for two years prepping this thing? No, I didn't set out. I was just always thinking. It's like a Right. I mean, but you know, you set out, I should say, set out in your mind. You had this idea in your head for two years. How do I do it? Yeah. How do you do it? How do you do it? That's that that that was the question because I didn't know how to do it at first. How did you do it? Million-dollar question, right? I wouldn't be in business if everybody knew. That's kind of Well, okay, even better. How did you learn how to do this kind of thing? So, I I started with books and then there's some videos, but it's a very What do the books tell you that's applicable? They give you a series of foundational things like, right, almost everybody who becomes a mentalist stars a magician. It's kind of like if you're a doctor, you got to be a doctor before you become a plastic surgeon. M so there's a core set of skills that you utilize to to know how to fool people, right? To know how people think. Okay? Right? Think about you. If I taught you a card trick right now, there's always a level of deception. Oh, that's slight of hand. Well, not even there's tricks called self-working tricks where you don't need to do any slight of hand. Okay? They work by themselves as long as you follow the instructions like IKEA furniture like step one, step two, step three. As long as you can work people in a certain way to do the right things versus somebody, I'm not doing that. you're like, \"Oh [ __ ] what do I do right now?\" Right? You have to know how to finesse people. You have to influence people effectively. And so that same stuff within magic almost always applies to props. You need a thing to do the trick. Okay? Now, it could be a regular deck of cards, in which case you're learning slides, but also there's gimmicks, right? There's tricks you can buy at stores, which when I was a kid, I'm like, \"Oh, teenager, I'm like, get me the next gimmick.\" But then to get better, you start being able to do stuff impromptu, right? That's when you kind of hit another level where I don't need stuff. I can do stuff with anything, you know? I could do stuff. It's like uh this a good story for my book that I'm writing right now, but it's like where where I I just needed anything around. I was like I end up in jail for a weekend. It's a long story, but like in jail one weekend, stupid weekend, but I walk in there by myself and I I should have been out that day, but anyway, I got stuck all weekend. And I watched them with cards and it was like I had trained my whole life for this moment where I walked up record scratch to like 40 dudes and I go can I see those cards? And it was like everyone looked at me like what's this guy about to do? And I just did car tricks for the next eight hours. When I went to take a shower I'm like am I I'm like thinking of the show Oz. I'm like oh my god right now I take I had protection. I went to the shower masta county jail in in Michigan and literally I had people being like go take a shower. We got you bro. Uh what did you go to jail for? So stupid. So, we had, this is so dumb. This almost derailed my whole career. Drunken idiots. I go up to visit a buddy in college and we steal from a Papa John's. God, don't ask me why. A broken phone at a college Papa John's. Just being idiots. I paid for the pizza, but there was a broken phone on the counter. And\n\n\nYou know, this is like my slight of hand style. I'm like, I'm just stealing this thing. It just gone. And it was in my jacket. And then I told my buddies, you guys got to get something, too. So, they go in the bathroom, which doubles up as the employee locker room. And they take three dirty shirts, dirty shirts from a laundry bin, and we bring them back to my buddy's house like idiots. We wear them and we at the party, I barely remember this. I was like blackout drunk are like, \"Papa John's, who wants a pizza? Who wants a pizza?\" I end up going to sleep on his futon right at like 2 a.m. And at 4:00 a.m. someone comes in and they're like, \"Yo, the cops are here.\" I'm like, \"Dude, it's not my house. What do you want from Did you guys post the videos?\" No, this is preocial media, man. No, no. Somebody ratted us out. Somebody's roommate, I found this out way later, call and go, \"Yo, bro, there's a bunch of dudes here with a broken phone from Papa. I didn't know any of this, but somebody comes in. They're like, \"Yo, the cops are here.\" I'm like, \"They're here for you.\" And I'm like, \"Here for me? What do you mean they're here for me? I don't live here.\" And cops come in the room and I'm wearing like aggressively small underwear at this point. This is like tidy whies. This couldn't have been more of like a bad per walk. And I They go, \"Yo, you're under arrest.\" And I'm like, \"For what?\" And they're like, \"For stealing from Papa John's.\" And what am I going to say? I'm wearing the shirt. Oh my god. This is on a Friday night. How old were you? I was 20 years old and I was just about to get an internship from Meil Lynch. And while this story is hilarious now and it's like a funny chapter in my book. It was like, God help me. Did I avoid everything? And then when I went to jail, yo, scariest one of the scariest days of my life cuz it's it's How did you get out of everything? So I got out of everything cuz I had a clean record. I was pretty upstanding citizen and um you know, not to get in the weeds, there's something called Holmes Youthful Trainee Act. I wonder if they still have it where was expuned from my record. Didn't have to report it to like the Wall Street firm. And they also said they were charging me. They put us in like a drunk tank, me and two buddies, and they said they're charging us with felony larseny. And I'm I've seen some like law and order. I'm like, felony? What? It's just like what do we steal? Like 20 bucks worth of stuff. They go, but you stole things they don't sell. Had you stolen $999 of pizza, it would have been a misdemeanor. And I know they're lying to me. I'm not a mentalist then and I'm inebriated, but I can read the room. Didn't say a word. Knew this was BS. And then they separated us when we went to general population. Uhhuh. And it's not like the movies, you know? It's it's like it was it was wild. It was wild when I went in there and I just knew this is my cheat code. It was like everything in life had prepared me for this moment. And the jail was also again I didn't know this, but it was very segregated. Like the white dudes are here, the black dudes are here. And I didn't know what do you do when you go in? Like what do you do? I'm 5' nothing. I'm like a buck 40 dripping wet. What do I do? How do you make friends right now? And and I see the black guys playing spades and I just walk up and it's like you make your move and I'm like let me see those cards. And it was just it's it's like a moment I have and I didn't stop for hours and I didn't repeat a trick. Like I know tricks encyclopedically. I just go all day.\nWow. What an experience. It was crazy. And then it was all thrown out and cost me some money. It was definitely a very very stressful few weeks and I never stole anything since honestly that was scared straight. That was very very smart. Like I you prefer to learn a lesson like that for my kids especially without being stupid. But so many of us have to be stupid to internalize a lesson of touching the stove and I had to burn my hands. But did you always talk this way the way you talk? You talk very fast with a lot of energy. Is this your whole life? I think so. Even though man, anyone on 1.5x the way I listen to podcast is going to be miserable with me. But yeah, talk fast. Like you're listening to podcast at that speed. You're communicating at that speed. It's like you're on, you know, and you ran 27 [ __ ] miles. That's true. No caffeine. So I'm not a caffeine guy. You don't drink caffeine at all. I try to avoid it. Like I'm not a coffee guy. I missed the boat on coffee. I honestly wish I did. It probably wouldn't be good for me given how dialed in I am. But like I just never started drinking caffeine so I never got into it. Do you ever mess with any stimulants? Not really. No, not really. What does that mean? Like what do you mean by stim? Like I'll have like anything. If I don't sleep Yeah. And that happens a lot. So if I'm not like getting enough sleep and I've done a red eye and I'm this and that. I will occasionally do like a Celsius or Red Bull, but I don't really like it. I do it kind of as medicine because I have to be alive and function, but I really try to avoid it cuz What is it like when you get hit with a Celsius and you haven't been drinking any caffeine? So, I only drink about a third of it and then I pour it out. Um, and and my kids are always like, \"Why are you pouring that out?\" And they call everything a bruski, which is a weird thing they call just cuz before I always like it was always like a bruswi is what they they've extrapolated to every beverage in a can being a bruswi. That's hilarious. It's hilarious. That's funny. And so, uh, but one third just like must jolt more than the roof. Yeah. Yeah. Like if you drank a four loco I did four loco have booze in it. Yo, four locos are like Yeah, that's what I'm thinking. But it has like caffeine too, right? That's like bad decisions in a can right there. Yeah. Like what am I thinking of? Oh, a red line. Is that the one? No, I think it's four loco. It's caffeine with alcohol. There was one that's like was just caffeine. It was [ __ ] crazy. Oh, that was the stuff to take like pre-workout that was [ __ ] people up. Was that a red line? Something like that. Oh, there was that one. That was the other one. That was a rip fuel. Yeah. Yeah.\nYeah. So, you've always been like this. I got my wife. I think so. Well, I'm more on now because we're doing something, but if I go on certain platforms or TV and I know I want to be slow, then I'll just calibrate down. But I'm getting fired up. Do you when you plan out a show, whether it's a corporate show or a television show, do you have like a whiteboard? Do you like put your ideas on? Like how do you how do you do it?\nSo, I I take meticulous notes about everything. Everyone I meet, everything at the end of a show immediately if as quickly as I can afterwards. Probably some people record shows. I hate re-watching myself on corporate shows and like live shows. I don't mind TV stuff, but for some reason those if I've repeated material cuz I, you know, it's like muscle memory. You've done this before. It irks me to watch again. But I write down everything that happened. every sing nuance like paragraphs about everything that happened which is a useful like life life hack because I remember it all but also I get repeat bookings a lot so somebody brings me back now it's like a real magic trick where I know everything about what happened and if you even just recount stuff from two years ago people think you have superhuman memory or what do they like people's number one subjects are themselves their family and their friends the more you can do that and give them back stuff about them the more they're like wow what a caring indivual Right. Being a good listener a lot of times just repeating back to people what they just said. Right.\nRight. When you do these corporate shows and you do these television shows when it goes great, do you have this idea in your head like now I've got to ramp it up. Now I've got to push it even further. Now I've got to make it even more difficult for me. For sure TV more than corporate because corporate's not as big of a deal because what does somebody want there? They want a defined quantity, right? They don't want somebody You don't want to work out new material if you're being paid a lot. It's just it's at a stadium. Are you doing new ones? Like you're going to do your hour. You're going to do what's solid. So, I do a lot of that. And the problem is I don't really have a lot of places where I can do new material because I'm I'm just so busy. So, I have so many events that I I don't really have like anything that I Yeah. Are there like open mics for mentalists where you can go and practice? There might have been in the past, but right now it's not it's just not where I'm at. So just practice on Friends sometimes and people Everything's in my head. Yeah. So I I a lot of things I'll I'll do on TV I've never done before ever. Really? Yeah. So I'm just thinking through everything that could go wrong and I go through kind of like a list of what could go wrong here, what could go wrong here? What if they think this right there? What if we change this? I have like plan A, B, C, D, E. I have just a long list of what everything will go like a pick your own adventure. And typically I know where to go with it. And then controlling your body and your tension is everything, right? So you're a hunter. You step on a branch. Animal hears it. What happens? Right? Gone. Right? It's a it's a it's a sense that we can feel. We have the same thing. We're animals. If I get tense when something's going wrong, you can sense it. Even if you don't know it on a conscious level, you can sense it. And now we have a cascade. So my job is is based upon me being somewhat of the alpha and being in control of a situation. And so if I right, think about it. If I just said, think of your pin code. I don't want to, right? I don't want to. I'm going to do this instead. I'm going to do this instead. Right? How did you acquiesce to my will? You did what I wanted in essence. Right? We could manipulate any way, but at the end of the day, you did what I wanted, right? And in my show, I'm the one pointing the camera. I'm always the director. You don't get to point where you want. I'm kind of in charge. And even if I let you think you're in charge, I'm still in charge at the end of the day. Right. Right. I come to my kids, I want them to eat veggies. I don't say, \"You got to eat your veggies.\" They'll say, \"No.\" I go, \"You're so lucky right now. Carrots, cucumbers, or peppers? Which one? You're so lucky. You get to choose first before your brother or sister.\" Now, I've framed it differently, right? Anybody has toddlers knows that's the best way to do it. Don't go straight on. That's not going to work, right? So, the same thing applies. Power dynamics in relationships with people. So, I got lost in my train of thought, but in essence, if I am messing up and you know it, it's going to go downhill really fast. And so, on TV, some of my biggest mess ups, you don't know. But I am [ __ ] my pants, flop, sweat, like fully. And I can't let you see that. I need to be so calm because if I am not calm, you can actually you can actually tell and it's going to keep going worse and I can't get you to go back to what I want. And now I've lost control of the situation. So years and years were spent doing that. It's it's I would say it's very akin to a sniper. Um I'm I'm not a sniper, don't get me wrong. I'm not military, but how do you calm your heart rate? How do you stay calm even when you're not? And I I could have an HRM on me. I'm calm when things are going wrong. That must help. The running must help for that. Control your heart rate. Low heart rate. Just in control of it as well, right? Like your your heart muscles very finely tuned.\nYeah, I think it helps. I mean, it can't My friend Cam Haynes, who also runs these crazy ultramarathons, he's also the best bow hunter in the world. And bow hunting is a lot of it is controlling your anxiety at the moment of the shot execution. And I would imagine for him, his heart rate is like completely under control all the time because he's always like very low, you know, because he does so many miles like everything he can stay calm. It's probably a really great tool just for staying calm, right? I think so. I I mean I the way I describe the ultramarathons because they're silly, right? You He just ran I love Cam ran 250 miles. Do you see that thing? Amazing. That's a crazy thing to do. That's not healthy. And I'm a nutcase who\n\n\nI can say that. And for most people, they're like, I don't want to do that. And you don't need to. But what is that? What is that really? When you do that, everything else in life becomes easier. Mhm. The lows that you experience when you do something like that is a way you cannot fake in any other way. You cannot test who you really are than putting yourself. You could be on the couch saying what would I do and be tough guy and you're pretend to be Gogggins or Hannes. But until you get in that level where you're miserable, you haven't slept in a day. You have all that. There might be another way to push yourself, but that's where you learn who am I really at my core. And then when you go back to normal life, everything else the volume is turned down. And when I come back from those races, all I do is get a mirror to put up to see who am I really when things are at their lowest and when I want to quit and I don't.\n\nYeah, I think that's that's a very strong statement. I think one of the things that you just said there, I've said a bunch of times is that if you can work out really hard and push your body and push your mind, it makes other forms of adversity that you face during the day much easier. And I think that's one of the reasons why so many people are so filled with anxiety. It seems like that's such a simple solution that most people don't want to accept it. They're like, \"Oh, there's more to that. There's a mental imbalance. There's a there's a this, there's that.\" like perhaps, but everybody that I know that does what I'm talking about, everybody I know that pushes themselves very hard in the gym or running or doing yoga or whatever, they're the most happy and the most relaxed and they're the able to face adversity throughout the day much easier than people that don't take care of their body, that don't eat well, that don't exercise, and don't experience any voluntary physical discomfort. I couldn't agree more. It's just I think it's it's I think it's mandatory, you know, and it doesn't have to be what I do or it doesn't have to be what you do. It's go find do pickle ball, okay? Go play some other sport. Tennis, do something that's fun. Jiu-jitsu is a great one cuz it's fun to do and then you learn how to do something while you're working out. Muay Thai is another one like that. You know, there's a lot of stuff that you can do that's fun that's exercise. But man, you should exercise. You know, you got to move your body. You got to move your body. Again, I don't want to speak out of turn like medical, but they've shown over and over that exercise is just it's almost as effective in certain regards and like like just being a certain level of healthiness than anti-depressants. Yeah. More effective. It's unbelievable. Statistically, clinically more effective. More effective. Yeah. Because it's of course it is. Of course it is. Like this is the reason why people are so filled with anxiety is because your body has certain physical requirements, right? Your body was designed to fight off predators and to run away from enemies and to hunt and gather food. That's the same DNA as people that lived tens of thousands of years ago. Courses through your body. That's or it's the fabric of your body. That's you, right? You like you can't deny that. And there's a reason why this sedentary sort of generation that we're experiencing right now because of phones and tablets and all the sitting in front of screens all the time is the most depressed. Right. No. for sure anxious too like the Jonathan hate on like it's it's it's it's wild the correlation and it's just so clear-cut but yeah social media is very uh it's it's it's one of those things there's some benefits but man oh man you can't put that genie back in the bottle so you got to find the right way to do it there's some benefits in that there's a lot of inspiration I agree you know and also information you know I'm not completely off of social media I I tap anywhere but I've radically reduced it over the last month or so. And in doing that, it's really been much much nicer. Like life is way easier. But occasionally, I'll find something really interesting on social media. So, it's like, boy, I don't want to not know that. I don't want to not like find out about some new scientific breakthrough or some new thing that's going on. One of the things that I found that um helps me though is instead of social media, I just I just have a bunch of stuff that I curate in my Google News app. And so I'll just like find like any sort of scientific breakthrough or some weird discovery or a lot of really interesting things about ancient civilizations. I just have that stuff curated so it just shows up on my feed. Where do you get that on your phone? Right. Yeah, it's just the Google News app. It's great because it's like that way I can find stuff out without having to go and just hopefully randomly run into it on X or on Instagram, right? You know, that's help that helps a lot. I'm terrible with X. A lot of my friends get news on X. I'm just like too much negativity. It's all a lot of negativity. And for Instagram for years, I started realizing that it just uh like a compare and despair is one of Do you know that? Like where I'm I'm like, why am I getting off of this and feeling worse than I did getting on it? And so I really had to flip a switch in my brain to to to I got rid of that. Anything that I don't like, I don't show. And I stop focusing on what's I don't have. and what I focus on what I do have. And so it So did you like used to go to it and you see someone with a giant house and a Lamborghini or something like that? Was it material possessions? It wasn't material. It was I need to you so I don't look at people and hope poorly upon them. I look more at it and say I'm not doing enough. So it's like a inferior. You're always going to be lesser than, right? it was going to be someone's going to be younger, richer, smarter, like every but in my case it was more of I wanted to achieve a level of success and just seeing other people in my field or other fields and I felt like I'm not doing enough. I'm somewhat driven ambitious. So I'm like I'm just not doing enough right now. And it's that constant feeling of I'm not doing enough doesn't drive you. It would be better to see look at them. I'm so happy for them. I'm going to do that too. Like I it should be a positive uplifting thing and it's a flip in your brain. It's like multiplying negative 1* negative1 and much more of a inflection point of gratitude. Like I I do you know J Shetty?\n\nJ uh I don't know podcaster really good dude. I've definitely heard met him last year and he told me something very stuck with me for the last year which is million thoughts a day. We're on social media. We're all this that. He goes the only two thoughts you can't control them all but try to control two thoughts each day. the first one when you wake up and the last one you go to sleep. It's that easy. Those two just try to have the first thing you wake up be one and before you go to bed just have one last thought. Okay. And I they're always for me it's like yo I'm every day alive is a blessing. Like I I literally I believe that in my core you I don't know what's going to happen tomorrow. Like a parent in my school just passed away recently. Shattered like young kids cancer. I've known a few people and you see that and you're like no that's for real though. You don't know what will happen tomorrow. Right. So, I've hit the lottery. Like, I'm blessed beyond measure. Wife way out of my league. Smart, gorgeous, sharp as a whip, five beautiful kids. Like, I try to focus on everything I have and never on what I don't have. I get to do what I love for a living. Like, my mindset is completely evolved of why would I think of what people don't. And everybody, if you're alive, you should be happy. You do not know what tomorrow will be. And I know that's all like newagy, whatever, but that's you don't know when your your clock's up. We were just talking about that in the green room last night at the comedy club about gravit the the problem with gratitude is that too many people have co-opted it right and really annoying people annoying annoying like wooden beads types you know like gratitude but gratitude is really important but no it's actually what you think because your thoughts create a lot of your reality the same way I said looking around the room so if your mindset starts to become one more of rather than you see someone you're like screw that guy he's rich right that's how the mindset that's easy for you to say they're rich you see that in comments all the time. I'm like, I think that person worked their butt off to get to where they are. And what did they do? And you know what? That's inspirational to me. What can I learn from that? And so that's just a mindset of I don't see it as a zero sum game. Well, it's one thing that those people that post things like that have in common. When you go to their page, they're all very boring, right? It's really interesting. You see like the expression of their dull mind that's like, \"Fuck them. They got money, right? I don't have money. They got money.\" It's a dull brain. And I always wonder like what is it like to be that person? Is that person is that a biological hitch or is it just learned behavior? Like what is it that makes them that stupid? I don't know if it's stupid. I I don't know if it judge but I think you project your insecurities. It's a little bit of that but it's a it's a clearly a stupid way to think, right? You know, it just it's totally not empowering. Like to complain about uh someone else's success or be angry about someone else's else's success is not empowering in any way, shape, or form. And so that's inherently stupid, but you find the excuses cuz you're like, \"If I had that, if I had that,\" and rather than must be nice. Well, exactly. Must be nice. Rather than saying, \"How do I do this for myself?\" It's much easier, especially if you've given up on certain things. Now, once you've given up, it's better to make excuses and bring someone else down to try to bring you up. Well, here's what's dumb about it, and this is why I said it's stupid. It doesn't get any better when you think like that. Instead, if you can shift your focus and see someone doing something, recognize that these tinges of jealousy that you feel are completely natural, but realize that to get the most out of this, you have to switch that in your mind to inspiration. And that person's success that's kind of freaking you out now becomes fuel. Right? Now becomes fuel. And you can motivate yourself. But you have to avoid the [ __ ] that guy and [ __ ] this, [ __ ] that. That doesn't help you at all. That does zero good for you. And in fact, it occupies all of your precious time with complaining when instead if you can manage it, and it can be managed, you can turn that into inspiration and then go out and try to do something. either focus more on what you're doing. Realize maybe I'm doing this uh where it's not as efficient or maybe I can have more energy. Maybe I just need to do it more. Maybe I need to be a little bit more disciplined in my approach. Whatever it is, but those little shifts will have measurable changes in the outcomes. Huge, huge changes, major down the line, especially the big one. Change jealousy to inspiration. Love that. You have to be able to do it, right? It's it's a giant key. You know, I remember when I was uh 21 years old, there was a guy who was going on stage and I was hoping that he bombed, right? I remember thinking that I was hoping that he bombed. And the reason I re recognized it, I was realizing that I was recognizing that he was talented and that he was really funny. And it bothered me that maybe I wasn't as talented as him or I wasn't as funny as him. So instead of like seeing him going, \"What is he doing?\" like, \"Wow, this is great.\" Instead, now all of a sudden, I was hoping that he failed, right? And then I realized like, \"Oh, here's the problem.\" You, first of all, that's just like general [ __ ] thinking that like can enter into your head and you got to figure out how to stop that. Yep. But I also realized that I was getting to this weird precarious position, which happens to a lot of artists, where you get into something, whether it's music or stand-up comedy, because you love it as a fan. you love watching it. Like I loved comedy. But then I when I became a comedian, I stopped loving comedy. Now I was comparing everyone to myself, right? That's brutal, right? Yeah. And it's not good for you. And I was like, no, no, no. You got to go back to laughing at stuff that's good and not connecting it to you at all. It has nothing to do with you. So when someone is really good, that should be great, right? And then you should be laughing. Even if you don't like that person, you should be laughing. Like just you even if you hate someone and they're funny, you should be laughing because it's good for you.\n\nYeah. And it's I find that it's over time, it's it's it's almost it's selfish, but it's selfless at the same time. Is I like to show love to people coming up as much as possible and try to highlight them and try to kind of pay it forward in a way that's for the new people that are kind of doing what I do or doing different things. It makes you feel good. It makes you feel good to do good for others. It's selfish to help people. Isn't that funny? I say that, too. I say it's very\n\n\nFunny. We think the same. Yeah, I think exactly the same way. It's kind of selfish, but it's also, it's that's what community is supposed to be about. It's supposed to be not just about you. And that's the difference between right community and a cult, right? A cult is like then you have the cult leader. He starts bagging everybody's wife and he wants everybody's money. There's always an inflection point where you're starting to bang wives. That's always where is that in the cult? There's always a message from God, right? It tells you you need more [ __ ] and you're like those two right there. I don't know why he didn't I didn't say it. I didn't say it for the record. Yeah, he said it. God said it. And then always the part is there's always some sort of a end point like the world's going to end, but it didn't because we prayed so hard. So, we're back, baby.\n\nYeah, those guys are great. There was a billboard in Los Angeles a while back that had the date of the end of the world, right? And you drive by and I was like, I can't wait to show up here and take a selfie in front of it the day after this [ __ ] stupid date, right? Cuz those guys are never right. Never right. The That's weird. They're the worst mentalists, you know? The uh the cult leaders. Yeah. Cult leaders, they just never see the writing on the wall. The cult leader has like a very unique where again I there's there's a fine line between if you looked at a path in my life again I don't see myself cult leader but a a con man is very similar in many regards to what I do because that's using these skills in what I would describe as um like an unethical way. Right. But don't you think they're the same thing? A cult leader is a type of con man. Oh, I was saying what I do is like a con man. Yeah, but you are a con man for entertainment purposes. Exactly. It's different. Like you you're have an understanding of the human mind but instead of using it in a you do it for entertainment which is like a good way to use it. Everybody gets happiness out of it. It's happiness and you're not lying about the premise which is the premise is I'm starting from the jump. I'm not psychic. I'm not supernatural. People ask me is this like a talent or is it a gift? And I think it's similar. Well yeah I mean you've got to have some sort of thing in you to be a good comedian or a good musician or anything like that. You can work on it and get better, but I'm never going to the NBA. You know what I'm saying? That's You have to have some attributes, right? There's like a personality trait that just is embedded in you from the time you're young for whatever the thing is that you love to do. Maybe it was like watching my folks. Maybe there was a lot of weird stuff. I was very good at math as a kid, like unusually good at math. And I would do weird stuff like I'd count steps every time. I knew every step in every place I ever went to, like some Rainman stuff. And when I would go, this is from the time I was like six, we go to Little Caesars. I'll never forget, I lived in Metro Detroit. And before they rang up the food, I knew the percentage tax it would be. So when they did it, I would instantly say before I'd look and I know what my mom was going to take on, you're going to you're going to get $168. How'd you know that and change? And it was like a weird That's crazy. And it was like a weird thing that I got very good at. And I think the boom, dopamine hit, dopamine hit. They would like that. And so it's ingrained where I was good at again people become the joker because there's some sort of dark thing in their not everybody but typically there's some I don't want to say trauma but you're not going to be funny or amazing unless something happened in your life where you have a reason to be entertaining and so I think there's points in time where I could take people's minds off things and this was a great way to do it and also magic people don't get to know you they get to know the character the performer so you get that nice little separation which I learned at a young age was really like how to make rejection, fear of rejection, fear of failure. Most people that's their number one fear and I learned at 14 how to make that gone, like eliminate that entirely.\n\nInteresting. That's interesting. It's also the dynamic of you being in control, which I think you you know, you talked about earlier, I think is for whatever reason imperative when you're speaking to people. You have to be in control for them to let you kind of guide everything. You don't want other people, you don't want to ask questions and have everybody like free to talk and loose. No, I don't mind that. But if they do it when I want them to, right? It's like again, so the best salespeople in the world aren't the used car sales like buy this, buy this. That's nobody does well. The number one salesperson in organization is the one who gets you to sell yourself. they're bending over backwards to be like, I gota I got to do business with you, right? You get someone to the point where at the end you don't have to hard close, right? Every organization I work for and I go in there and like show you how to do sales training 101. It's going to be the person who gets the other person to sell themsself. That's what you do. You lay the breadcrumbs into the trap. The trap is not a bad thing, but the same thing happens in my show. I am leading you in a certain direction.\n\nWatch. I'll show you something. How often is Jamie I Jamie when I walked in I talked to him for like two minutes said he loves magic. He does. Is that true? Is Is Jamie off mic? Yeah. What's up?\n\nI didn't know I was going to do this. You have uh daughters, correct? Yes. So, it's hard. I I I have I have three girls, two boys, and I found when I named our girls, well, we named them together obviously. The naming of the girls was far harder than the boys. When you named your daughters, was it agreed upon? Were you like shortlisted? How did it go about? Well, I feel like my wife did way more work than I did for sure. So, she carries the baby in her body and I said, &quot;Listen, I I would just want veto power.&quot; Veto where you can't name the kid Applesauce or something [ __ ] stupid. But she I go, I don't think it's a fair proposition.\n\nThat's like literally what I said. I said I And I don't give a [ __ ] about names. And they've got your name for last name, which might be fair, but Right. That's right. Exactly. And so does she. But my name is Joe. It's a boring ass stupid name. It doesn't bother me at all. That I have the same name as a billion people, right? So for me, names don't mean anything. And it meant something for her. So I said, &quot;You decide.&quot; So watch this. What are the Do you know what the most common names are right now? I know this recently have like a one a two week old, but the most common names right now are not the same as when you were naming your daughters is my guess. If they're teenagers, what do you know what the most common name right now in in America? I think it's six years running. Mom, look this up.\n\nNo, no, for girls. For girls. What is it? No. Olivia, check. Jamie, can you look up top 10? Look up. It just came out. Social Security. I know this because like I said, we were trying to figure out names. Is Am I right? It should be Olivia's number one. I don't know what site to go to, but I don't Google top 10. Who do you think of when you think of Olivia?\n\nI thought initially of Olivia Wild.\n\nWho's Olivia Wild? Movie star.\n\nQuiet place. Do you know who she is? Oh, that lady. Yeah. Oh, she's great. I thought of Olivia Newton John. Yeah, that's second. That would have been second. Physical. Physical. I performed for Olivia Wild. Never Olivia Newton John. What did you get? Did you find out? Yeah. Do you want me to show you the list? Oh, yeah. It's not a trick. I just want to see Olivia's number one.\n\nEmma. Emma, Charlotte, Mia, Sophia, Isabelle, Evelyn. That's interesting. Eight. I would have never imagined that. Right. You did not hear those names when you were growing up. There were probably no girls named Ava when you were a child. No, none of any of these names. Maybe Olivia after Olivia Newton John. But that's crazy. Sophia's number 10. That's interesting. And Sophia's spelled two different ways, so it's technically number one. Jamie. Oh, really? If I ask you. Okay. Oh, that's right. It is. It's spelled P, H, and F. Wow. Interesting that Sophia is number one. Really? Huh?\n\nHarper. What's Harper? 11 12. Camila. Camila number 11. That's nuts. Eleanor. Older names are coming back. Yep. Really older names. Yeah. That's like Eleanor is like my friend Elanor Carrian. She's in her 50s.\n\nUm\n\nIlana's number 18. That's crazy. What are the odds, right? What are the odds that If you told me is Ilana in the top 20 of names, I shut the [ __ ] up. Whose name's your kid that? I think someone someone I know did. No, it's a beautiful name. Love that name. It's not a bad name. It's a beautiful name. But it's like it's like I would have never thought it was that common. So, when you think of how this is happening, watch this, Jamie. I ask you to come up with somebody absolutely random from your past. Absolutely random. I dug deep. You You already got it. Yeah. Okay. You know what?\n\nUh, it's not on. How do you know this person? Not Oh, you shouldn't have said that. Oh, I shouldn't have said a word, you know, right away. It's from preschool. Preschool? Somebody in preschool? Yeah. You still keep in touch? Where I met him? No, she said him. Why do you say him and then her? I'm sorry. I met them is what I guess I was trying to say. This guy's playing pronoun game. What's going on here? You know what? No. No. There's too many giveaways. Just said wasn't on the list, doesn't this? Let me ask you a question. Want to try again? No. No. I'm do something better. We'll switch. This is a glitch in the matrix.\n\nJamie, close your eyes. Close your eyes. I have to look at the stuff. You got to look. Okay. So, pretend you're closing your eyes. I'm gonna put you on the spot. Okay. Uh it's not the pre preschool girl. I want you to close your eyes, go back in time, and try to picture the face. I always call this the one that got away. Your first big crush. Can you visualize her face or you can't see her clearly?\n\nYou asked me this before. It's like a It's a tough question because the way you started wording it was like is this a first crush for me was like the first person like I knew there was like TV people and stuff like that. Oh, is it a TV person? That's what it would have been technically, I guess. Yeah. Your first crush was a TV person. Sure. Yeah. Someone and I saw on TV. Is that right? I think so. Okay. I guess. Yeah. Well, I don't know. Is that I don't know. I'm trying to I don't If I were to ask you to look up how popular this name is. Well, no. I'm not going to do it again. It's not top 10. Is that correct? Right. It wasn't. Okay. Hold on. Look this way at me. I want you without using your fingers to count the number of letters in this person's name. The real name or the the character's name. I don't know if that matters. I don't know. I don't I I've never had a fictional character as my first crush. This guy got weird. Uh I don't know. Whatever. I don't Whatever name you went with. I I Don't say it out loud. I'll go with the fiction. Don't say Don't say it. No. No. To me, they weren't a real person then. So, you know. Well, I don't know. I don't Oh, don't say it. Oh, no. Don't. Oh, don't tell. Oh, man. Don't tell me. Don't give me any more clues. You're not going to figure it out. Good. All right. You know what? Do this. Joe, I want you to see this. Should we get a a piece of paper right down? There's mics everywhere. Okay, screw it. Don't even write down. Don't even write down. No, no, not you. I was going to have him write it down. Okay.\n\nEight or nine. Do it. Do me a favor. Sure. Count again, but to yourself. Don't do it out loud. Count to yourself. What? The letters? Yeah, don't do it out loud. Oh, the eight or nine wasn't the letters, but go ahead. Yeah. I'm so confused. All right, good. This got all over the place. Jamie wants this to go wrong. He does. I do, too.\n\nI don't know if this is the real name or the fake name anymore. But before today and me asking you to think of this person, be honest. Y would it have been days, months, or literally years before today since this person even crossed your thoughts? Uh, honestly, this would have been a couple months. Couple months. Couple months. Could Joe know it? No. All right. Mix up the letters and stop like Scrabble tiles. Freeze and grab out a letter somewhere in the name. Maybe grab one out of the middle. Okay, you got it. Sure. He did too when he switched. I was trying to look to you. No, no, you did shifty eyes. He did this one and then this one. You didn't do a vowel, did you? I don't know. Well, you can tell me. It's It's You did a vowel after all that. A, E, I\n\n\nLook at me. The first one I picked. And you went to the end.\n\nDo you think the last letter? No. The last letter is a vowel though, isn't it? Sometimes. It is. Here we go. I'm Sometimes Y. Yeah, that's the only way. A E I O U. It's sometimes Y.\n\nTake a look. Don't say it. Don't say it. Okay.\n\nI don't know. I This is Who knows? Was it nine letters? The name is nine letters long, isn't it? Her the real person's name is nine letters, I think. Yeah. Yeah. The real and and he hadn't thought of this person in months. It doesn't do in a vow. Yeah, it does. I know. I saw I I saw it. And you switched the one and I wrote this down. Joe, you see it right? I can't change it. No trick here. No BS. What's her name? This first crush. saw on TV. Her real name is Christine. Christine is what I wrote down. Christine is what I wrote down. Her fake name is Melody from Hey Dude, you don't have to tell me. I know. I know. Just saying. Christine Taylor. How did you know?\n\nThere's this I Wait. Wait. Hold on. Right now. Right now. I want to try this. Here's what I want to try. Joe, how many people How many people just happened? Wait. Where did I put this? Are you an alien? Do you work for the CIA? I got to take a leak like crazy, too. There was Where's the bag? God. Dude, I drank like two gators before I got in here for the run. That was a mistake. What bag? There's a bag. Oh, I didn't bring it. You didn't bring it. Why don't you go pee and get I've got it. I've got it. I've got it. I've got it. I've got it. Look, I want you to do this. I put together this is for you, Joe. Take these. Okay, 50 people chat GPT. Okay, look through that list. Okay, and these are all people. I didn't make this up. I just wrote them down. Okay. Who have been on the Joe Rogan Experience multiple times and that or or and that idea, how would I describe this? My guess is you have a personal connection. You know these people. Is that a fair assessment? And rattle off if there's anybody in there that you feel is not fits the bill or you don't talk to them anymore. Throw it away. I don't care. Okay. Yeah, I know all these people. You know these people? Okay. Sure. And not a trick. I'm not going to guess who it is. I wrote the list. I know who they all are. Got it. I don't care. You want to mix them? You want to do something? I don't care. Whatever you want to do. Once you mix them up or whatever you want to do, put them in front of you, please. Like a pile. Turn kind of Oh, you're not going to look cuz I don't want to be uh like random. Okay. Kind of put them in front of you. Kind of turn them sideways. Sideways. Well, I want to see what you're doing. Okay. And I think we're going to do this together. I don't if I'm going to reach over or not. Okay. Here's what I want you to do. Okay. I want you to take I'm going to do it with you. Is I want you to lift off like a chunk. A chunk. Okay. Yeah. Like a chunk. And put the chunk over over here. No, no, no. Like next to you. Okay. Like uh I don't know. How do I Can I move over with the mic or No. Yeah. Just come over here. Yeah.\n\nTake the headphones off. Should I take them off or leave them on? Take them off. Take this. Take this. Okay. Well, take take the piece and I want you to take and the same way that I'm making a bunch of chunks like this. I want you to take and I want you to be in charge of this. So, take these ones. Okay. And would you agree that's pretty randomized? Very randomized. Okay. And I want to assess right now. There's five of them. Okay. Is take one of the piles. Okay. And put it like Which other pile you going with? Another pile. Like point to another one. Okay. This one. How about this one? Yeah. Perfect. And I want you Don't show me. Okay. I want you like grab that one. All right. The card. The card on top. Whatever you want. Take it. Grab it and look at that person's name. Okay. And don't let me see it. How likely if you were to text this person, do you think would they answer? 100%. Oh, you sure? Yeah, 100%. Uh, most of the list was a guy. Guys, is it a guy? Yeah. Not judging. A lot of dudes on the show. Put them all back together. Okay. Let's assess this. I don't want to know who it is. I don't care who it is. As long I want to see. And if they're not going to answer, I would tell you to text somebody new. Text this person in your own words and say, I don't know, uh, got a minute, need a favor, and see if he texts back. If he doesn't, we go to somebody new. We'll give it like, I don't know, 15 20 minutes. Okay.\n\nCan I tell him what's going on? I would hedge and not say yet because I I want to see where he goes with it because if you tell him like I I don't care, but I want to I want to keep this very I don't want him to know where we're going yet. Okay. Should I tell him to text me back? I Yeah, I guess text me back. That works. Hey, brother. Do me a favor and text me back as soon as you get this. It's going to sound like someone's dying, but okay. All depends on it. Okay. All right. And put it down. We'll We'll revisit later.\n\nPressures. Let's see. Let's check back in a few minutes. Okay. Will it vibrate if he did? Uh, no. I have it on do not disturb, but I'll take it off. There we go.\n\nOkay. Um, he's very busy, so he might not be in front of his phone. No worries. If it doesn't go, we'll give it some time. And if not, we'll switch gears. Okay. Yeah, but uh turn your phone face down so you don't think I can see it. I don't want to know who what where. All righty. We'll revisit. We'll come back. Put it on my lap so I feel it when it vibrates. LMP later. I'm holding it in though. I knew the Joe Rogan effect.\n\nOkay, we're just going to sit here and wait for him. No, no, no. We'll check back in later. That seems ridiculous. Is it? Yeah, because he could be working out. He could be doing anything. So, if we get it, it's meant to be. This is uh We'll see. Okay. It's not It's not pressing. You have an idea who it is? I I don't know. I I can look through the list again. It's not Cam Haynes, is it? After you said all that, is someone popping it into your head? I'm not going to guess who it is. Not at all. No, because here's the reason why. If we reveal stuff, I don't want you to. If if I guess like something very specific about this person that will like he might not want everyone to know his ATM pin code or social security number. Oh, you're going to guess his I don't know what I'm going to do yet, but I don't want You could tip it, but he's going to be pretty pissed if everybody finds out something. So, I prefer if nobody knows yet. But if if we want to, you'll see. Okay. Okay. Take it to the next level. Jaime's in the room. Right. But what if we could just get anyone who you could have picked? Anybody you know, right? Now it's different. Right now it's never been done before. Right. You ask me what do I wake up with thinking about? How could I do this? Yeah. How are you going to do this? I don't know. Let's see if it works. Let's see if it works. So, okay. Was he good? Oh, he got me. He did. Yeah. Okay. Uh here's the thing. I think that if I were you, I'd say later, &quot;Well, it's texting. What if somebody saw something?&quot; No, no, no. I have an idea. Don't give any clues yet. If you're There's microphones everywhere. We just asked him to think of his first crush, but he did like someone fictional and like that's a Can I tell him I'm in the middle of a show?\n\nMaybe say I'm in the middle of a show. Okay.\n\nOkay. And say, &quot;Uh, we're doing a bit. I I Do you want to call him?&quot; Because if you're texting this, do you want to call him or do you want to text him? Well, if I call him, people going to hear his voice. No, but what if you call him and you just go over there? Which one's better to you? Which one's more impossible where later you go, there's just no freaking way? Is it better if he texts you or is it better if he calls you? What do you think is just more impossible? I could have him call me. Yeah, why not do this? Have him call you in a second. You'll go over there where there's no microphone and I want you to ask this guy the same question I asked Jamie. Do you remember the name of the first grill you had a big crush on? And sometimes people don't remember. I just want you to know I've done this a lot. Should I ask him that? Not yet. I would do it on the phone. Okay. Yeah, screw it. Ask him that. Okay.\n\nDo Okay, hold on a second. I should have just did it with voice. No, no cuz I know. Well, yeah. Nobody's listening to this, I'm sure. No, but I mean it's quicker.\n\nDon't tell me what he says. Okay. If he says no, a lot of people don't remember this question. Okay. So then I hedge and I go, &quot;Well, who who's the first girl you ever kissed?&quot; Let's see. But make sure there's absolutely no way I can see what's on your phone right now. Are we clear? Boom. Get that tight. I can't see, [ __ ]\n\nJust get mad. Okay. Does he know or he doesn't know? He knows? Yep. Right away. Did he tell you? Yep. No [ __ ] Yep. Ask him. Is it the same as the first girl he ever kissed?\n\nOkay. See what he says. Here we go.\n\nNo.\n\nDoes he remember her name, too?\n\nOkay, there we go.\n\n[Laughter]\n\nYep. It's two weeks ago, right? No, I'm kidding. Uh, put put away. You have two names in your head. Okay. Can we establish the fact that you have 50 people that have been on your show? Yes. That you took anybody, right? If this person would have texted back, text somebody else. I don't care who it is. There is no conceivable way. This isn't a bank that gave you a number, right? And if he didn't know who it is, we would have done something different. I don't care. Put the phone away. Okay. How am I going to do this? How are you going to do this? How am I going to do this? Right? And he said, &quot;What happens when it goes wrong?&quot; Nothing. I'm not getting paid to be here. I don't care. You're freaking me out. Think of both names. They're different. He had two different people. Yes. The same way that you did 2020. And you didn't know. Think of both names. And I want you to juggle back and forth between the two. The first kiss and the first crush. Okay. And uh is one name more interesting to you or like they're equal or is one name more interesting or not really? Um not really. Okay. So you know like if you gravitate I would have been like go to one. Okay. Count the number of letters in the first crush to yourself. Don't use your fingers. I can see count the number of letters to yourself for the first crush. I did that psych you out. Yeah. I started doing this and then count the number of letters in the first kiss.\n\nOh, you looked up.\n\nInteresting. They're not equal. Can you agree with me? They're not the same amount of letters, are they? No, they're not. No. See, because you would had the same reaction. Do you know when you put somebody in a polygraph test? Have you ever been polygraphed? No. They can't just ask you the questions right away. They can't because they first have to get your benchmark. Same way blood doping, you got to test someone's blood against their blood. People have different amounts of testosterone naturally.\n\nSo, I had to see how you would do each one. Mhm. And then you did the thing with the eyes that throw me off. The first crush. Is that name shorter than the first kiss?\n\nYes. Yeah. Go to the first crush. I'm going to go with that one. Less work for me. Okay. One more time. Count the letters. Okay. And you were trying to avoid it. Six letters. Is that name six letters?\n\nYes.\n\nYeah. Mix up all the letters. Okay. In that first crush's name. Forget the first kiss. Scrap it. Okay.\n\nAnd pick any one in your head. You got one. Got it. Jamie gave me a gift on a platter. Thought of a vowel. When he did that, it was 100% you wouldn't pick a vowel later. You didn't do a vowel in the name, did you? No. Dude, I'm here for a reason, right? I haven't done this. I've been doing this for a long time. Right. Told you. Goal is to be the best in the world at this. I have watched. I know everything you just did. Second letter. Do you think of the second letter? I will. Mm. Amanda is the name Amanda. Yes.\n\nWhat the [ __ ] did you say? And you will talk about this for years. Hold on. I'm texting him back.\n\nCan you figure out the second one? No. I'm done, man. Come on. That's Showbiz. You do your closer. You drop the\n\n\nMic and you pick the mic back up. Never. Do you want to know who it was? No, I don't want to know.\n\nMy friend said you're a witch, and he said, \"Kill him now.\"\n\nFeel like I know who it is. Definitely a comedian. Definitely a comedian after that. It's definitely a comedian. It might not be. I hang out with a lot of weird people. Yeah.\n\nI don't know how to go back to conversation mode. Am I right? And I got pissed like a racehorse. What do I do? Go pee. Go pee. Do I pee or no? Do we keep going? Do we go strong with this? No, I'm just saying we'll recalibrate. Pee. It's always easier to pee. Is that all right? Yeah. Yeah. Yeah. No, it's perfect because you don't want to. It's too hard to form sentences when you have to pee. All right, I'm going to take a quick break. Quick break. We'll be right back. Rapid fire. Are we back? We're back.\n\nLightning. Feel like uh much better. Brand new. Yeah. Oh, yeah. Yeah. I know the feeling. I was sitting on it. You rehydrated, and I drank so much Gatorade right before, and I was like, \"Oh, party foul. Should have thought that one through.\" Miles, you deserve a little Gatorade. So, do you want to know who it was yet? Uh, it's up to you. I I I like hanging hanging thread, but it's up to you. But what is the purpose of hanging the thread? No, I guess tell us at the end. Can you tell me who it is? I could, but come on. No, I'll tell you at the end. Okay. You already gave the comedian. You said this. I didn't say comedian. No, it's a comedian. He's a witch. Kill him 100%.\n\n100%. That's not Ben Shapiro. You know what I'm saying?\n\nDid you say witch? Did he Did he tell you? No. No. No. I took the quickest pee of my life. I raced over there. I didn't tell him. You didn't tell him? No. I don't want him to know. Curious. Do you think that there's people that knew this back in the days of witches? They figured out some of the powers. Maybe not powers. I think that 100% psychics of the past used a lot of the same techniques I'm using. Cuz when I watch psychics and I have people always tell me at certain things, they tell me like, \"Oh, you know, uh, I saw a psychic do this and this and this.\" And I hear it and I go to myself, you know, I could do that same trick and I could, no offense, do it better. But think about it. I'm doing this right now from with an ethical compass versus if I go, \"Oh, I'm getting this and I thought about this and this is what happened with your dad.\" You're like, \"Oh my god.\" You know, I'm like, \"Well, it's only 25 grand more to have a private session. Let's talk to him a little bit more.\" Right? I'm not saying there's nobody psychic. I'm telling you that a lot of the psychics I'm watching them like, I don't know how you're doing that. That was my other question was going to be, has any Have you caught anyone trying to get some stuff by you? Like I don't know, like a psychic. Not a psychic. You're buying a car and someone's trying to pull some trick on you. You're like, I know what you're about to do here.\n\n100%. You know, not a shameless plug, but like I literally write I wrote a book. It's coming out October where it's all about it's called Read Your Mind. And it's not me telling you how to be a mentalist because 99.9% of people don't want to guess a first crush. It's not useful to you in your life. But what if you could read people more effectively to help you in your life at home, at work, in relationships? That is a quantifiable thing that the tools of a mentalist when not used for entertainment but in life day-to-day are extraordinary for sure. Yeah. Yeah. I mean you must be great at all kinds of things because of this. I don't know about that. Anything dealing with human beings, right? Negotiating. Yeah. Oh, I would imagine. I've never sold a property at a loss. Let's just say that. It's been pretty good so far. You get in there, you're like, I won't take a dollar less. I'm like, I know you will. I know you will.\n\nThat's funny. That's funny. What a weird skill to have, right? What's a good book? A good book to read on this. Well, on becoming a mentalist or so on any of these skills like what did you start with? Do you remember the book you started with? Do you mean if you want to learn how to do you remember the book that you started with when you first started learning this stuff? So the first book I started reading was a book called 13 Steps to Mentalism. But man is it going to be tough for most people because it was written in the 1920s. So, it's kind of like, you know, when it's like watching an old movie, no offense to old movies, but I'm like, \"Oh, it's hard to get into this with my attention span now, because it's antiquated. Some of it still applies, but you have to really do a big reach to know how do I apply this?\" Because back then there were no TVs, there were no phones, there's no it just that's what I started with, but I had to learn the hard way. So much of what I do now is again I told you is I don't really do what other people do because I I don't know how to explain. It's they create different, right? If if if you were building a house and you have all these tools, you're going to build using your tools. Does that does that make sense? So, I've got this set of tools. I knew a hammer does this, I do that. I create with the house already built. So, my vision again and why what's been a differentiating feature is I build with the person at the end in mind and I already know what the house is going to be. I know what the memory. I know what you're going to say. Like CNBC, do you ever watch that channel? I try not to.\n\nSo CNBC, Fox Business are financial channels. I have been on those channels dozens of times. How many other mentalists or magicians have ever been on them? Zero. Why is that? Because it's un it's unusual. That's a serious network. Why do you put me on? Because I do stuff around the markets. And so if you're watching it, you buy in because my stuff's about stock market, interest rates, all stuff. And it's like, this is crazy. But it had to do with stuff I know. So the same thing when I do ESPN, I'm creating from a different perspective than most. I customize the content. Like when I do a corporate event, I learn in and out your business. And when I go up there, I sneak in the medicine. So now your people aren't just seeing a show. They're getting messaging and they're getting it in a way where they don't tune out because they don't realize they're being spoken to. It's mostly entertainment. But boom, I've planted those thoughts. And you leave there with, you know, what's the product launch? What's this? All those things are now internalized and remembered.\n\nWhoa. And this 13 steps that was you said it was written in the 1920s. H fact check me, but I think it was the 20s. What did this guy do? What was his job? He was a mentalist. Yeah, but there were no mentalists back then. There were just a few people, but they was mostly they were telling you the skills of psychics. They were showing you how psychics did stuff. And it wasn't really debunking, but they're showing you all the tools, the 13 steps, like what are the ways that we can read people more effectively and what are the tricks of the trade of what we do, right? Like how do you know when someone's counting something like that, right? And you're counting the letters. You know, because to me, you might as well be playing drums. Do you understand what I'm saying? Like if you're playing drums and I have an ear for it, I can hear the beats. So once you learn how to do certain things, they build on top. I can if you're counting letters like again names are anywhere from 3 to 12 letters. It's not rocket science for me to figure it out. And again I can't do it in a vacuum. If you turned your back and said I'm not doing anything not again if you controlled the environment I can't do it as well. That goes back to that fear thing. If I started messing up right now you'd be like oh it's getting awkward and and you would pull back and I wouldn't be in control anymore. So, like a lot of what I'm doing is is I'm, you know, showing you how I can read you, but also you're allowing yourself to be read, right? So, like when you're saying count the letters, you can see me counting them. I can see when you're counting. I can see when you try to throw me off the count. It's like a poker player. Poker player knows if you really have aces, pocket aces, or you have two, four, and you're bluffing. The best ones do.\n\nWhich brings the question up, why don't I play poker more? Yeah, why don't you play poker? It's just it's too boring. Like I I\n\nThat's a grind, man. I'd rather make money doing this. This is one and a half speed. Your whole life is one and a half speed. That's wild. That's really interesting. I I'm fascinated. No, I think I want to read one of those books. I'm going to probably get that one. I'm going to send you one. I'll try and find a better one. Well, that one seems interesting, too, because I want to I want to read the origins. I want to read it like when it first started out, like what was it like in 1920? Like what did he learn and where did he learn it? Is this it? You find it 1950ish or so. Oh, 19. Well, but it's also not known. He was This is the guy. So, he's born in the 1930s. Oh, I screw this up. It wasn't 1920. So, no, the other one's 13 Steps. There's another one by Theodore A. He did not make his birthplace public. Oh, you sneaky. He's a sneaky. He's a first mentalist and he's sneaky. Though, is believed to have been Milh Hill suburb of London for unknown reasons. He renamed himself Tony Cornita. Corinda Cora Corinda. So he's born Thomas William Simpson and he renamed himself for some reason Tony Kinda a variation on the surname Conrad uh when he began working as a mentalist in 1950 he opened up a shop where he sold all manner of stage magic goods but catered especially to mentalists later took over the magic shop on Oxford Street was at street level and thus catered mainly to the regular public so that many of the items sold were either practical jokes or beginner's tricks but items for semi-professional magicians and hobby Hobbyists were also sold. Around the same period, Karinda had the magic concession in Hamley's Toy Shop on Regent Street. Interesting. So, the book 13 Steps to Mentalism was in 1961. Uh, so he wrote a series of 13 booklets on mentalism between 56 and 58. Each one dealing with a different aspect of mentalism or allied art. Interesting.\n\nI'm getting you a copy. I am. I'll buy it. Is it is it reprinted or is it one of those ones? It's definitely reprinted and see it's it's since become to beware of the essential mentalism reference book. But again, you're going to have a big problem because you're going to read that book and if you make it through to the end, which God bless you if you can. You're going like, \"Yeah, but how the hell did you do all this stuff, not you're going to get to the end of it and been like, so it's that's baby steps and then you've got to like yeah, get to the next level.\" I'm sure I'm not thinking I'm going to get all the information from that. But I'm I'm curious as to like what the origins of it was. Like how did this guy devise these things? He's like, \"How did he figure it out?\" Psychics. So, it's again, people with psychics want to believe. Anyone who's in that room who paid that money to hear psychic has someone they've lost and they want something with them cuz there's, you know, do you believe in any psychic powers at all. So, again, I'm not like a debunker because I I'm kind of like agnostic in this thing, which is I just believe what I've seen so far. And in a lot of instances, I've never personally experienced something that I couldn't explain yet, but a lot of people have told me their experiences. Have you heard of the telepathy tapes? Yeah. So that I know you had her in here, but that's Have you watched the videos? I mean, come on. Yeah. That's wild. No. No. I'm the opposite. I do not think that's real. Oh, yeah. Yeah. Oh, really? No. Why? Well, you tell me about what the videos. So, can we show the videos? Well, I don't know if he's got the paywall again. And I don't want to controversial, but they're holding in many instances in that form of communication. The person who knows the information is holding the letters. Do you understand what I'm saying? So right now, if I had shown you a word and you're either touching somebody, right, if you could get, do you know what a twoperson codeact is? No. So two person code is like a mentalist thing with two people. There's a few that are the best in the world. Aison's uh mine to mine in Dubai. like a few really good ones who've done this. And what they do is they can be blindfolded in a different area and anything you hand to them, anything you say, the other person knows it. No electronics, no nothing. They just look at your credit card and\n\n\nThey'll guess the credit card numbers. And what the way that's being done is they're communicating to each other based on pauses, based on like a million ways that you can't think of. It's the best codec ever without speaking. And you'll watch it and you'll be like, there's no way they're communicating, but they are. And so it looks like telepathy, but it's not. You get them in the room with scientists, you'll fool every scientist under the sun. Uh, what they're doing is like not bulletproof at all with the kids. And again, God bless, if I had a child in that condition, I for not one moment wouldn't want a solution. And I would want something to know that they're not that they're in there and I could talk them, and I don't want to speak out of turn, but from the videos I've seen, I can explain that in a minute. They're they are moving things around and positioning the letters. If you do a double blind study where the person does not know the word that they're trying to communicate, I'm not even saying psychic. Just don't tell them the word, the person holding it. And only show the word to the person who should be saying it. Right. Right. If you're the autistic child, show them the word so that I see it. And then have them type that word in and do that for me nine out of 10 times. And they've not been able to do that. That's not even psychic. That's just show me that you can type the word in that you saw. And so when you do like a deep dive on that, it's been. She offered to have someone come in with their parent and do that. Would you do that with us? Sure. So you could like... But I don't want to take anyone's... I don't want to take anyone's hope away. I'm a parent and like again, I don't think they're making money on it, and I, I like, I'm very... I don't like to, again, when you ask me psychics, there's people had real deep experiences, and who is it for me to take that away? But when I watch that and you're like talking to somebody who's a pro at doing this, same as psychics, I can see exactly how that's done. But what did you think about their ability to read languages that they've never studied? So again, you're missing it. So that's again, the devil's in the details. Okay. It's the memory, what you remember of the story. Show me how they did that. Did either of the people there present know that language, who was doing it, and how was that being communicated? Did the end person who's moving the board around know what the meaning of the word was? Do you understand what I mean? Yes. So like again, you're hearing the the cliff's notes, the end edition. Watch the video and show me something that I can't... There was nothing I saw in that special or that in that telepathy tape in the videos that I couldn't readily explain. Really? That's correct. Interesting. Very interesting. So, could it be right? Yes. I'm not saying it's not. I'm not. Again, they could be 100% right and I could be 100% wrong. Hubris, right? I haven't been in the room with them. I'm judging simply from videos I've seen. But as someone who is for a living pretending to read people's minds, but I'm actually reading people, I can see how it's being done. Interesting. The method, it's kind of like a casino boss. I see how that person's cheating when they're playing cards because I know all the cheating methods. Interesting. Um, the other thing that they said was these kids all have this area that they go to called the hill. Yep. They go to their... What do you think of that? So, again, I, I, I, I heard it. It was unbelievable. Like the podcast was incredible. I don't know. I, I don't like... I, you know, I've heard psychics tell me, people tell me, I saw a psychic and how do you know that my friend died after we saw Grateful Dead concert and did... I'm like, well, I don't... I'm seeing a lot of stuff on you that looks Grateful Dead vibes. Like if I told you that you're a big Roger Waters fan, you'd be like, \"How did you know that right now?\" So for everyone not looking, Joe's wearing a Pink Floyd shirt. Like you can you can figure out a lot of stuff based on cold reading. I can see what's the wear on your wedding band? How do you behave? What are certain things? When do you pause at a certain moment about certain things? Did you lose someone? I can tell instantly if you're having a feeling of emotion. Like anyone good at this and not even great, but like good can notice a lot of things. Like a psychic just watches you so you can kind of tell like what a person's done that day. I... Well, I think you can get like you can guide them to what you want, which is when you get a hit, right? Think of that game when you're a kid. Hot cold. You hide stuff, right? Right. Your brother or sister looks around and they go cold. Do you think I woke up early today or late? I don't know. There's no on demand feature to the show. I think you woke up early though. Really? Yeah. Why do you think that? I don't know. Just based on the way you said it. Nope. Woke up late. Good. I got it wrong. I'm happy. I'm happy. You'll be like, \"We screwed this guy. Finally. We got O's and it was with a 50/50.\" That was... Yeah, that was just a rando coin flip. Yeah, that was... You know, we'll do a coin flip before I leave. Okay. Who has coins anymore? I brought one coin. I heard that there's a penny that's in circulation that's worth millions of dollars. I heard that, too. Yeah, that wheat penny. The one with the wheat on the side of it. My buddy Lewis House had... I saw that on my social, he found one. Really? I think so. Whoa. It's [ __ ] super millions. I'd be like, \"Give me that wheat penny.\" That's crazy. A penny worth millions. Um, okay. So, what's in the um, the one that's sealed that package? No, that's that's nothing. I was... I was going to get it out, but I'll do it later as a gift. Not... No, it's something silly. Why do I not believe you? No, I swear. I swear. I thought I would have it out, but no. You thought you'd have it out, but you don't want to have it out? Not the right fit. What do you mean? I was going to do something. Then you had a lot of books here and I thought we'd get a book, but like, eh, I don't think I'm going to do it. Just doesn't feel right. No. What feels wrong? Self-curate. I don't know. It's not going to work. Go on instinct. It's not... You got to go on instinct. It's not going to work. It's not going to work. Nope. What was the goal to get it to work? You could say it now since we're not going to do it. The goal to get it to work was I thought I had some sort... I thought I know if I get you to get a book. We have less books in this room. We have books in that room. I just... I don't know. I brought it in. I always have a backup plan. Plan A, B, C. And this one's not meant for this one. This one might be if I ever come back and do another JRE. We'll put it in the safe. Okay. Okay. Do it. That's a great idea. Yeah, we'll put it in the safe. Put it in the safe. I'll never touch it again. Okay, we won't touch it either. Let's make sure that we know it's sealed. You know, two bricks of cocaine. You're in big trouble. Uh, no. We should get a wax seal. Yeah. You know, like Game of Thrones style. Seal it. I love that show. Great show. Yeah. We can't play this, but I found one of the tapes that someone put on YouTube. Do you want to? It's only a one minute clip. All right, let's watch it for us. Help or not. Let's watch it for us. We can't play it because it's copyright. Okay. If you right now got the best twoerson codec in the world in here, they would do nothing. She would literally be in another... She could be 100 ft away behind this person's back cuz she's touching and doing touching moving. I mean like those are for letters. You only have 26 options. Do you have any idea what this is right there? Somebody effective right now just this right now and pausing him before they say a word could have given you a full credit card number right? Insane. She was kind of moving him a little bit, moving him like if you could... If you can, how do you compress data, right? Like if you do hexadimal or asky, you could take a a 16-digit number and break it down into three letters. You see the movie The Martian? Yes, great movie, right? Another Matt Damon reference. Love Matt Damon by the way, too. Um, has he been on here? No. Such a good dude. Yeah, I talked to somebody about getting him on, like he was going to reach out. We're going to do it eventually, I'm sure. I love that guy. He's awesome. Met him a couple times. Love him. As nice as you'd expect. So, if you can in that movie in The Martian, he didn't know how to send data cuz he only had the camera. So, he shows a thing where he figured out how to take and compress big things into small. What's the easiest way? You can make it very small. So, you can send information in a certain way. Again, I don't want to blow anyone's cover, but there is absolutely when I see that, I I know exactly how it's being done, but I don't know if she's doing it on purpose. I think they've just learned each other's rhythms. And that's an agent. Oh, okay. Go. You know, like you got to have her in a different room. Right. Right. Right. Read my mind. Read my mind through a door. Haven't they done stuff in a different room, though? Didn't Kai Dickens? Didn't she said in particular that another magician actually told me that they had a issue watching that particular kid's videos? They thought that those two were doing something funny. Yep. Clearly. Um, but that's... I... The other videos I don't know. They're behind a payw wall. You have to get to them. And that's it. That's the sneaky biz is everyone that sees the payw wall. Uh, I had a couple sent to me and I'm like cuz people asked me this and they were like, \"What do you think, man?\" And I listened to all of the the tapes. I thought it was amazing. It got a little wild at the end if you got to the end like The Hill and that. And you want to believe, who doesn't want to believe that? There's psychics amongst us and especially kind of like the superhero story of all. These are kids who nobody thought was in there and they're really in there and they're communicating with each other. It's it's I mean so it's essentially you're saying that instead of psychic energy there's a sense of like a kind of micro communication, you know, and people want to believe and so you kind of have confirmation bias looking at the evidence you want to believe. Kai Dickens clearly wanted to believe. Just super simple, have a mentalist and maybe a scientist involved, and a mentalist is better than a scientist cuz scientists will... they can watch me and they'll be like, I don't know how he's doing it, right? We're designed, we're we're literally... it's like get a card sheet to beat other card sheets. Right? So, get me involved. Yeah. And then let's do the same thing and I'm going to say, \"Here are the three things I need you to do different.\" And I'm not going to say how you're doing it, but do it with these three things. And if you do that, I'm convinced. Okay. We might have to set this up. Yeah. I wonder if they don't. But the problem is is that exact... there's very little to gain from that. And then also, we got bad energy in the room, right? That's the whole thing. Do you ever see when Uri Geller was debunked by The Amazing Randy on Johnny Carson and he couldn't bend the spoons and he goes, \"I can't do it with him here. He's got bad energy.\" It's not. And it's like, you know, is it bad energy or is this a guy who knows how you're bending the spoons? And so every time you're about to do a move, he's like a so who's like, \"Stop right there. Don't move your hand. Keep the spoon right there. Don't... Don't... No, no, don't look away. Look.\" It's like... It's like my nightmare. I had a guy show me how they do the spoons. Yeah. We had a guy demonstrate magic. I could show you how to do this one. Yeah. And it was like a different kind of spoon. It wasn't a regular spoon. No. No. You could do with real spoons. I could do with any spoon. Yeah. Yeah. You could bend it with your mind. I mean, again, I don't want to knock it, but that's more of a... it's not really... It's not a psychic power. That falls more into the category of a magic trick where you're misdirecting people. You're doing something else where I... I'm not really bending a spoon with my mind. There's not supernatural powers involved. I can't lie to you and say that. I'm doing it in such a way where you don't know the method and it's layered, but it's sure going to look like it's bending by itself, but it's not. This guy was saying that's a kind of metal that as he moves his hand around, he heats it up. Yeah, he's lying to you. Really? Really? Damn, [ __ ] He lied cuz he didn't want to tell me how he does it. No. Yeah. Oh, damn it. Yeah. Got me again. Got you. You must enjoy getting people, though. The spark that lights in your face when you're accurate is really fun to watch. I hope it's it's contagious, but I... I enjoy watching reactions. Yeah, clearly. That's the rush, right? Laughs. Do you not love laughs? Of course. Yeah. You ever go into a room and nobody's laughing and you just bomb and you just eat it? It's like not fun. How often do you bomb anymore?\n\n\nNew jokes bomb. So you'll bomb for chunks. You bomb in segments. You know, you have to figure out how a bit works, and sometimes you try a bit in a way, like in the middle of it, you're like, \"Ooh, this is not the way.\" And then you have to kind of adjust. And you're doing a lot of sets at the mother ship, I assume. Yeah.\n\nYeah. And how much do you get allowances? How, what's the clock for being Joe Rogan before it's like, \"Oh, no. Let's just see if you're funny as a person.\" Where does that end? You got to be funny pretty quick. People, yeah. People are good for like a minute. Yeah. They're happy to see you for like a minute, and then like, it's only a minute, huh? Yeah. Not much time, man. Jerry Seinfeld talked about that once. He's like, \"Being famous buys you about 30 seconds.\" Oh, I thought it's more. I think that's what he said. No. No. Especially on a night filled with like really top-notch comedians.\n\nIs the mother ship every night? It's all a bunch of killers. So, you got to be... But that's also why we do it that way. You know, the one thing that's really bad for comedians is when they start only doing their crowds. So, like they do it on the road, and they do large places, and then they have the same opening act over and over again. So, they're never challenged, right? Yeah. That, that makes people soft 90% of the time. I made that number up. I don't know what the real number is, but it's like a high number, you know, because you get soft, right? Yeah.\n\nI did. This is funny. So, I used to go to the comedy seller. I told you I love comedy like an afficionado. I lived in the village for, I don't know, years. And this is pre-kids. A lot more time on my hands. We used to go to the seller when you could get in the cellar like that. Now, good luck. Right. And we would see just everybody over and over. And uh, I, I think you met him on Mike Veion. Sure. So good, man. Funny guy. Great guy. God. So great guy, um, amazing, super funny. And he went on on a night where it was just like dropping, dropping, dropping. And he had to follow Seinfeld. And Seinfeld goes on and just hammers it. And then Mike Veion comes on, and you know the bathroom in the cellar, right, which is about the size of like a quarter of this table where you're touching arms when you're taking a leak next to some dude. I went in there, and I was quite drunk. And I'll never forget this. I've, I've worked with Mike since. And I was telling him, \"Dude, you probably don't remember me, but I was such a drunk idiot.\" And we were touching arms while we're peeing, and I always felt bad about it. I'm so drunk. I'm like, \"Dude, forget Seinfeld. You killed it. You're the...\" He's like, \"Stop talking to me while we're peeing.\" Dude, I had crossed that threshold. And I tried asking him, I'm like, cuz we did a gig together. And he opened for me. And I was like, \"Do you, is there any chance you remember?\" He's like, \"Dude, so many drunk idiots have been next to me at the cellar telling me stuff.\" I'm like, \"The night where you dropped, you know, that, that trying to see if you remember it, right?\" And I wanted to apologize for it cuz I felt so bad. And I'm like, \"I was talking to you while you're pissing, and dude, I just loved you so much.\"\n\nAnd he had forgotten. He didn't even know this moment. You know how many drunk? But I'm like, I've been holding this weight for a while, Mike. And I'm a big fan. And uh, I'm sorry I talked to you while we both had our dicks out. It was not okay. It was not okay. There's, there's a line in the sand that I have just crossed, brother. That's hilarious. And he forgot about it. It's... No, dude. I mean, it's like when I have gigs where people come back to me and three years later like, \"Dude, do you remember this thing?\" And I go, \"Of course I do.\" Yes. No. Most of the, most of the time you don't remember. You try. I remember the best and the worst, man. I remember like, I remember some moments where I've bombed so bad that it is seared in your DNA. You know that feeling? Oh, yeah. And it's usually ones where you're not to blame, but the buck stops here. You know what I'm saying?\n\nThe setup is terrible, the outdoor gig, the... I had one where, god, it was like the town of Charlotte or some, some town hired me, some city, and I had to insert all these data points about the city, and we're like, normally we do two or three things. I will mention two or three things in the course of a show, and if it's 10 minutes, forget it. It's, I don't want to be a salesperson up there. People tune out if they're like, \"What are you selling me something right now?\" Right? And I had to say eight or nine things about the town of, of, was it Charlotte? And they, at the last moment, we do dress rehearsal, go, \"By the way, we're all dressing as genies, and we're gonna have a life-sized genie lamp on stage, and it's gonna start doing smoke while you're doing this.\" I'm like, \"I don't really like any of these things,\" but I was newer to show because I'm like, I go with it the whole time. I'm on stage, the smoke is going like at 100%. We're coughing. It's going terrible. I can't see the person whose mind I'm reading. I'm sweating. I'm trying to talk about the Billy Graham Museum. I'm dying a slow death up there. I get two things in a row wrong. And you know, if you bomb your opener and your closer, like you're dead. You're... I left apologizing. You never want to leave a stage... They somehow still loved it. I don't even know how, but I, I sweated through that suit. It was like, I, I, you know when you question what you're doing in life. Yeah. That was like a qu... I'm like, \"Maybe I'm not supposed to be doing this.\" Well, also you probably say, \"Okay, never doing that kind of setup again.\" Kind of. But me, I more catastrophize, and I'm like, \"Yeah, I should just be done.\" But then I came back. I came back. I picked myself up uh, to... Yeah. Funny enough, tomorrow's my, my, my one of my daughter's fifth birthday, and I'm doing a show at school for 5-year-olds. Oh, wow. Yeah, man. I got to get back. But, uh, sweetheart, this is like the sweet spot where they still think I'm cool. That's cool. Before I'm going to be like, \"Don't do this and embarrass us, Dad.\" Right. And last year for my oldest son, who was uh, at the time had just turned eight, I did his school second graders, and dude, they ate me alive, really, cuz I, I'm not doing this like this is, you know, my sweet spot is mentalist. I had to brush off the dust of my kids show, which I haven't touched in like 25 years. Thank god I'm not doing kids shows anymore. No offense to kids show magicians, but like that, that ship has sailed, and man, second graders are ruthless. Really ruthless. Why second graders? Cuz I don't know, man. Like, like one kid, I, I finished this show, okay? And during the show, my wife is in the room recording. I'm like, \"Don't record. Don't record.\" And and I had, I had to like look at my wife at one point, and I whispered, \"This is a nightmare.\" Cuz one kid's like, \"It's in your hand. Show me that. Show me that.\" And I'm like, \"Dude, shut up.\" And I'm not good at it. I'm not, I haven't done it in a while. Right. So, I'm just bombing on tricks. And thankfully, 95% of the crowd actually liked it. It was just these two kids who just got me. And when I went home, one of my neighbors saw me, and he goes to me. He goes, \"Oh my god, what's wrong? Are you okay?\" Cuz my face was like ash and white. He thought somebody died. And I'm like, \"Dude, I don't, I don't, you know, I don't even know what to say right now. Like I, maybe I shouldn't be doing this.\" I had to one point tell the teacher, I'm like, \"I'm actually like, I'm, I actually do this for a living.\" I'm like, I had to try to flex. I'm like, \"I have an Emmy.\" Like I, I wanted to let them know I'm not actually this bad. Like I...\n\nThat's hilarious. That's hilarious. Don't you think comedy is kind of a bit of hypn... hypnotizing people? Oh, yeah. The best comedians, you, the pacing, the rhythm. Like I was watching a Tom Sigura special this morning. I don't know how well you know his m... I mean, you know him well, but like he had a bit about flying first class. Do you remember that one? I don't. Oh, he talks about uh, I, I don't think he's using his material anymore. the fact that he gets upgraded. He buys coach tickets. It was early. It was years ago. And he gets upgraded so much that he gets first class tickets. And he go, \"Should I not say this bit? I don't know if I want to take this bit.\" And he goes, \"It literally the moment I get upgraded, this feeling of superiority washes over me where I'm like, don't, when people are walking, don't look at me, you poor piece of [ __ ]\" Like he's just so... He goes, \"I dare you, if you're in coach, to try to use my bathroom if I'm in the front. I will put my hand on your chest, bro.\" It's... I've seen that a hundred times, and it's just as funny if not funnier every time I watch it. And it's like the timing, the rhythm. I, I learn more from comedy than ever magic or mentalism, way more. Interesting. Cuz we've talked about it a bunch, comics. I'm like, \"I think we're hypnotizing people,\" because I feel hypnotized when someone's killing. When someone's killing, I'm allowing them to think for me. Yep. You like they're taking me on a ride, and I'm just, I'm not thinking at all about what would I say, what would I do? I'm just in their head, or they're in my head. Right. And also when you bring someone along, and when you have that like just you drop just amazing line, like uh, just there's so many, I mean, listen, I, I consume so much comedy, but like I love watching the rhythm, seeing where people go with it. The people that are more short form, like punch delivery, right, versus like a long form like a Nate Baratsi, like watching Andrew do his things. Schlaw's amazing, man. And some of these guys are just like, you can't see where the joke is going to come and how you just squeeze every bit of juice out of the orange and the good call backs. I think the ultimate hypnotist is David. Yeah. Oh yeah. David Dave, cuz Dave, there's a rhythm. There's a rhythm to the way he... It's like you just get lost in his thinking, right? And he just takes you on the... and he's so effortless, and and he does so many sets, like he's so polished that there's like this effortlessness to his movements and the rhythm and everything. It's like, it's wild. Oh, I like Sebastian Maniscalco. I freaking love watching Sebastian.\n\nThere's so many, there's so many people that came up now that I've seen like over and over and over and watch them go up. Like Samill, I've been a fan of for years. Sebastian was actually the first guy to recommend you to me. I love Sebastian. Shout out to Sebastian. I love you, Sebastian. Yeah. Was there anyone else after that? Uh, a couple people told me you were awesome. Quite a few. No, Sebastian's such a standup guy. This friend of mine, when I, I told him that it was Shane Gillis. It's Shane Gillis, isn't it? It is. Yeah. You just thought of... You shouldn't let down your guard. I just knew it. How'd you know? I just... I... That was it. That was the moment. What did you see? I can't tell you. But that right when you said, \"This friend of mine,\" you... I knew you were going to protect your parks, and I said, \"Could it have been Ari, could have been Mark.\" And I immediately knew it was going to be Shane Gills. Cuz neither of those two would have said... definitely not Mark would have said, \"Kill him. He's a witch. He's...\" I, I just knew it. Yep. That's Shane.\n\nThat's such his sense of humor, too. \"He's a witch. Kill him.\" Yep. That's so Shane. That's so Shane. Yeah, that was a little bit of a giveaway because I said it was my friend. Yep. That is... That was the giveaway. That was a giveaway because I didn't tell you it's someone that I... You said 100%. So now I'm thinking like he must live in Austin. Like there was a lot of, a lot of indicators. Yeah, whatever. But that's part of the thing, right? But that's also you admitting that this isn't like supernatural. I'm not psychic. So everybody, when people put me on the spot and like tell me this right now, I, I literally go, \"It's not Netflix, no on-demand feature,\" like I... again, that's where these skills, when people like, \"Why don't you win the lottery? Why don't you like all these things that are silly where you don't get what I do apparently.\" Do you believe that there is any sort of psychic power that people have? Like when, when someone gets a phone call from someone they're just thinking about, intuition, right? I think there's... I think there's... I mean, listen, that's like a bigger picture question, like, you know, where does your mind expand, like psychedelics, like where, where, what is there beyond this plane that clearly, you know, people are aware of? There's... it'd be...\n\n\nSilly to think, but how do you kind of get on that frequency? There's no question that people have an intuition. Again, could I call it psychic powers? I've had things happen that I can't explain to you based on the skills I have. Does that make sense? Well, I've guessed things from people where I didn't do the normal way I do it. Do you understand what I mean? Like I normally have a, there's a series of steps on how I do it. Kind of like a chess player, right? You get a chess player, you get Magnus Carlson, you get the best chess player in the world. They can literally blindfold play 30 people. And I'm like, how do you, how you, how you doing that? Right? That's like magic to me. But you're keeping track of all that stuff in your mind and you're doing stuff that is indistinguishable from real magic in my opinion. But you've hyperfocused on one skill. That's what I've done. You just think it's a lot of skills. What I've focused on is one thing: assessing what people are thinking and what they give away that they don't think they're giving away. That's all. I just guess secret information for a living. But to make it exciting, entertaining, I add bells and whistles to make it interesting. Otherwise, it'd be boring. How many mentalists are out there? Like, is there a community, guys? You share notes. Sure. So I, there's like a, I wouldn't call it a brain trust, but there's people I bounce ideas off of when I'm creating. Kind of like you'd punch up jokes where they're...\n\nHere's what's rare in our world. There's creators and then there's performers. Do you know what I'm saying? Like writers and it's like singer songwriters. How many people have their songs written for them? Some of the biggest stars in the world. And how many are like Taylor Swift style where you write it and this and you get a piece of you in it? Yeah. And there's something about when you write your own song. I'm not knocking people that don't write their own song, but there's something that you feel different. Do you know what I mean? Which explains the connection Taylor Swift has to fans. I believe so. Because you're getting a piece of you that somebody else can't. I'm sure that just a random pop star that gets like some factory. You'll still like it. Like I freaking love a Backstreet Boy song. Don't get me wrong. I want it that way, Joe. But like when you are with her and I'm sure like Jack Anton, she has a huge amazing crew of writers that I'm sure get things out of her and I know a lot of like music producers, but you feel some connection. So what again I think is differentiating, there's a lot of mentalists, but it's a really small number that are the singer songwriter, the creator performer who have the thoughts and are constantly doing new stuff because we are a cover band. Most mentalists are a cover band of other mentalists. Got it. We don't need to do new stuff. You could literally do the same thing. This is pretty amazing. I could do this for the next 40 years and make a good living. God bless. And why do new stuff? Like when Louis CK was popping out three specials a year, everyone's like, \"What the, you know, why you doing this to all the rest of us? You're so creative. You don't have to.\" And in our profession, you really don't have to because you don't have to bury material, right? If I'm not putting stuff online, if I'm not going like crowd work the Matt Refe model, who by the way, I love that guy. But like I, it changed the game. Now if you want to blow up on social, you've got to be doing this or do current events, do topical, do things you can burn. But I can't put my real act out there. Right. Right. Right. So, but you enjoy the creative aspect of it. I love it. I find it boring. If I keep doing the same stuff, of course, I'm bored. Right. Right. And I get like sad. Right. But it's interesting because like I, I wonder how many people you can bounce ideas off of. It seems like you're kind of a lone wolf like that in that world. I don't think there's, I mean, there's a lot of comedians, like I could call a lot of comedians right now and bounce an idea off of. There's way less mentalists and there's way more magicians. And then of the group of mentalists, if you were to do the core one, and again, this is not subjective, I'm much more like objective the way we looked at names, how many of them have done a certain volume of TV appearance, a certain volume of views, like which ones are getting the attention of the world in the zeitgeist? It's a very, very small number because you got to innovate, right? This is like an attention economy, you have to do stuff that's compelling to the viewer. And for me, I don't think about myself. It's a trick in life. I think about who's watching. Well, that's...\n\nWhat do you mean by it's a trick in life? Well, I, I like it helps you in everything in life, right? My secret sauce is that I hold the mirror up not to myself, but to you. Do you get it? Like when you're watching and you're watching a football thing, right? What's intriguing is the fact that you're a football viewer. If you're meeting somebody and you want to be memorable, learn more about them. Start listening more. Like I, I'll tell you a story. I met Stephen Spielberg. I did Stephen Spielberg's dad's birthday. And I got in that room. Have you met Stephen Spielberg? No. And I'm like, you know, a crazy fan. Like I can't explain to you how many movies he had as a kid that were life-changing. And I'm like, dude, Close Encounters, Third Kind. Like, yeah. He's one of the greatest of all time ever. Yeah. And so I'm in the room. I've done stuff for his family. This is not like a big blowout corporate event. Like 80 people. Hope he doesn't mind me sharing this. And and it was a great time. Amazing. And at the end of it, I'm like getting some facetime with Spielberg, right? And I walk up to him and we spent almost 20 minutes talking to each other, which is like I didn't expect that. I thought he'd be like, \"Oh, great job.\" You know, do you know how many questions I had? A million questions. Do you know how many questions I asked him? How many? Zero. Really? Zero. And that's like right there. I learned a lesson in life that applies to everything. That's why Stephen Spielberg, he is naturally curious. This guy wealthy beyond belief, stories beyond belief. He could make it ego-driven and he could have been telling me, \"Oh, this and I would have been hanging on my every word.\" But instead, he wanted to know more about me. And he kept asking me. I was like, just pause, dude. I have like a lot of questions. Like, come on. And so I learned and I could have just left that and been like, \"Fuck, I didn't get any questions in with Stephen Spielber.\" Instead, I realized this is the person at the highest level of what he does. And he is naturally curious and he lets other people shine. And this is something to do in life, right? Which is you don't know when you meet somebody who they'll be or what they'll be or what can I'm not doing it from a transactional sense. But why I've had so many TV appearances is when I go into a place, I'm going to do stuff for the security guard. I'm going to do something for the person who irons my shirt. I'm going to leave that place like a bomb went off of amazement where everyone around there now likes you. And you don't know when they'll jump ship to another network to another thing and if they like you, sales 101, they're going to want to keep doing business with you and so those people become your champions elsewhere and it was kind of a lesson where he could have talked about himself the whole time, he didn't. Interesting. So I shouldn't either. When you go to other places, let other people shine and that's something I've carried with me and I think that's a superpower in life that most people don't do. They think what am I going to say next, right? That's kind of the key to running a good podcast too, cuz you really want to extract the most out of the person possible, right? Where you just want my questions are basically just try to get you expand and I just want to find out how you think, right? And for Spielberg, a guy who deals in all these stories and narratives and all these characters and heroes to meet a unique character like yourself is probably really fascinating to him too because he's probably like, \"Oh, I don't know anybody like this,\" right? You know, like what are you doing? How are you doing? Like and now, now he's got like a new tool in his toolbox. Totally right. Cuz he's got you, right? Like this, you know, you have the spectrum of possibilities in terms of like the humans that you meet and then you meet one that's outside of that. You're like, \"Oo, I hadn't even considered you before, right? What do you, where? How's who the [ __ ] are you?\" That was pretty much the question. And then he had like, he, but he was interesting because I don't know if you get this, but I get like ex, like the 20 questions is what I call it, air quotes, which is how'd you get into this, like the opening questions, which you can't blame someone if you got a weird job, right? People want to know how about it, right? Like, did somebody in your family do this? Like, there's all these questions you're going to get every time. God bless people. I don't hold it against them. Mine is always I'm doing like a sound check for a gig and then they're always like, all right, so we got this. We got this. And I go, \"Don't you know that we have that?\" I'm like, \"Ah, you like I'm like, \"Okay, so just real quick, where's the green room?\" Like, \"You don't know already?\" And I'm like, \"Okay, this is, this is getting, I just smile and I'm like, you know, I never heard that one before.\" But it's uh, it's you get that. But in this situation, again, it's like he, he didn't ask those questions. He was very uniquely finding an questions that weren't like the usual. Of course, because he's a study, I mean, he studies humans, right? I mean, to be a great filmmaker the way he is, to do Schindler's List, to do, oh, that's, that's such a heavy movie, man. Have you seen that recently? Private Ryan, I mean, he's got heavy movies and then you know, Close Encounters was one of my favorite movies of all time. I mean, the, it's interesting, you know, one of the things I really liked about that movie is he, after he became a father, changed how he felt about the ending of his own movie. He wouldn't have the father leave everybody. Oh, wow. Yeah. Cuz at the end of the movie, Richard Drifus's character gets on the the spaceship and leaves with the aliens. Wow. He's like, I would never do that. I didn't know that. Yeah. Did they film it or no? Well, he, it was after the fact, like, you know, he made the movie, I believe, when he was younger and he didn't have children. And then as time went on, you know, he looked back on it like, \"Oh god, I would never leave my kids to go on this [ __ ] UFO, right? Nor would I and nor would you.\" No. No. Like, but in this idealistic version of who he thought the Richard Drifus character was and the circumstances, like he had to leave. He had to go. You got to go with the aliens. Like, sure as hell get my phone out and try and get good footage for a change. I'm like right here. Good stuff. I like the tic tac and gimbal, but I want to see it close up and high def. I know. You got anything off air? You got something? Come on. I, I have off air what I think. Are people bullshitting me? Oh, I, you don't have to be off air. I've watched these. I can read people. I can tell on, on air where the snake oil is, but I feel it. I, that's where it's instinctive. Like I don't have the tools that you have, but there's a part of me that's like, \"Hm, something smells.\" I told weird when I walked in here and I said, \"This is again passes sniff test.\" And pardon my French, but everyone takes a crap, right? Everyone in the world, I don't care if you're the Pope, you take a crap. So if they're being held in a facility, someone's taking craps, right? And who's cleaning it? I don't think the scientists are. There's a janitor. There's someone in that room. So, are you telling me that there's nobody in there that's got a 401k, health insurance, some sort of How is someone not getting Tell me, explain to me what NDA they're signing or what they're doing that if they found this out, someone loose lip sync ship, somebody would have told somebody who worked in that facility who's not the scientist, who's not the military person and word gets out. How is that buttoned up tight where nothing gets out ever? Well, for 50 years, you're telling me there's a basement somewhere in this country eight stories down where they got those things and no one else knows who's credible and can release it. How? Aam's razor, what do you think? I think the government can keep things secret for a long time. I think they did with the Manhattan project. I think they've done it with other projects in the past. I think it's possible. You think it's siloed? It's just siloed. Nobody knows all the info because people do talk. There, there's a lot of people talking and people share similar stories and they have for decades and I, I think there's something to it. I just don't know what it is. I think, you know, we had uh Jesse Michaels on yesterday who has this amazing show on YouTube, probably the best YouTube show uh on aliens and UFOs and UAPs and he's very agnostic in his thinking and he's he...\n\n\nIt's very objective, and he also is very, very, very thorough as far as his understanding of the information, and even he is baffled, uh, as much as he knows. But he knows more about siloed technology than pretty much anybody does in regard to this UAP phenomenon, right? And he points to this guy, um, Thompson Brown, who, uh, was working on gravity technology in the 1950s. They were, they had working models, like they, they, he thinks that they have some sort of a gravity propulsion device. But then there's things like Roswell, where the crash, like if all those stories are true, that's too early. It's '47. There's too early. There's no way they had working models of these devices back then. So, he thinks it's possible, you know, he's not a \"I know this is true.\" He thinks it's possible that it is both United States government secret projects that people are seeing, and there's probably quite a few of them. We actually pulled a few of them up and showed some of them that look like UFOs that probably is part of what people are seeing, but he thinks it's also probable that there's some other things, and these other things could be from anywhere. And then there's just the Fermi paradox, like, if they're all out there, where are they? There's so many planets or so many galaxies. Well, that's, that's got to be the case. It has to be the case. It's the question of whether or not they have visited or whether or not they're here, right? You know, and then there's these like weird Peruvian mummies that we went over, that these tridactyl mummies that they take, uh, CAT scans of, and you see the tissue and the bones, and you know, they, they were all found in what, what is it called? What's it kind of earth that they found that these things are the di something? Do you remember what it is where they were all dried out? I know the, I know exactly what you're the description, but I don't remember the word. Something earth. I, I know the word. I can't. It's, it's escaping me right now. All that stuff's very fascinating. So fascinating. Ancient depictions on cave walls of these things. And we pulled up these, uh, tapestries that were a thousand years old that had these three-fingered creatures. Very weird. Very weird. But that doesn't necessarily, doesn't mean they're alien, right? You know, we talked to, we talked rather about, um, all the various versions of human beings that they're finding now, you know, from Dennisovvens to the island of Flores, hobbit people, like there's like these, there's a weird variety of humans that went extinct, right? And these tridactyl things could very well have been that. Yeah. You had, it was Christopher Melanon, right? And I, that was my favorite one because he had, I think, I, I don't want to butcher it, but I think he called it ultraterrestrial. It makes the most sense, which is think about right now, if you just dropped a bottle in the ocean, right? What are the odds you ever run into that bottle in the ocean? It's impossible. That's what time is. If we've been around for 13 billion years, sure there's aliens, but how do you... We've only been around for a few thousand. Like, it's such an infant. It's, it's a grain of sand in the whole beach. So, what if you... What would you do right now if we had technology a thousand years from now, 2,000 years from now, right? AI, multiply it out, the whole nine. What would you do? You'd send these things everywhere. Sure. Just like sci-fi. And you'd plant them, and you'd come out every now and again and check what's up. Sure. So that's, I, I don't, I don't, my likeliest thing is I don't think there's any biological beings or aliens. I think you've just got automated drones in essence that are running patterns that have some sort of a, like, I don't know, that makes way more sense. It certainly could be that. I mean, that's what we're doing currently on Mars, and it's what we do with, you know, probes, you know, with the James Webb telescope, a lot of the different things that we use. We just send a machine out and get information from it. And then also, I think at a certain point in time, we're being realistic about what we're doing right now. We're going to have biological beings, and then we're going to have some kind of digital being. We're going to have some sort of a, whether it's, whether it's an actual physical robot or whether it's just an artificial intelligence that's a signal that we can send, and you know, it has enough compressed information where it can compute and calculate and do. It's a technology beyond our wildest, wildest dreams is a thousand years away from now, right? But a thousand years away, we have a god, right? So what, what if, if you extrapolate where we're at now with quantum computing and the ability to calculate things that if you turn the entire universe, every molecule of the universe into a computer, it would take you so much time, according to Mark Andre, that the universe would die of heat death before it could solve an equation that a quantum computer can solve in minutes. Right? This is, we're talking about nuts. No, it's crazy. And this is just 2025 stuff. You know, if you looked at the internet from 1994, it's like archaic. 144 modem. I remember it. I remember it. I'm that generation. You know, that's 31 years ago. So, like what are we talking about when we're, we're dealing with 31,000 years. So, if conceivably a life form has existed and gone through the same stages as us without catastrophes, without nuclear war, without all the things that could trip us up, we, we could be dealing with things that are beyond our imagination, literally beyond our imagination, and they're probably around us all the time. I had an idea that I wondered, I've always thought what if ideas are life forms, right? 'Cause we think of life as being, it has to breathe, it has to have cells, it has to, but everything in this room and everything in this city and everything on this planet that's a, a man-made physical object came out of an idea. And the ideas compound upon each other. You know, the more people working on these ideas, the more competition, the more the ideas will flourish, and the more the, the ideas will be more complex and and more efficient versions of this idea. Like it has, but it has to start as a creative thought inside someone's head, and either a creative thought you can apply to existing creative thoughts or a completely unique one, like Francis Crick, or you know, when they're figuring out certain aspects of biology or certain aspects of the quantum field, whatever they're doing, that's com, that's, that's a breakthrough thing, like where is that coming from? It's coming from an idea, and then these ideas, they manifest itself in physical form through human labor.\n\nWell, it's Schroinger's cat, right? Does it happen if you don't observe it? That's the weird thing about quantum physics, right? It's completely, you can't imagine it, but if you don't open that box, nothing's happened yet. It hasn't happened until you observe it, right? They prove that. Well, that's where it gets really weird, you know, when, when people, there's a lot of people that are deciding now that to approach it, approach it as if consciousness is the reason these things exist. Not consciousness is seeing that these things exist, that they only exist when you're interacting with them, which is like what some of the stuff, when you read that, like I've read books about string theory, about quantum physics, it's just they're too, it's too hard to process in the real world when you're like the table, but the table's actually empty space. There's almost nothing in it. Solid. Every atom, I don't even know what the, the numbers are, like Neil Dress Dyson, but how small is the nucleus and the actual physical items out of it, they're empty, everything's empty, everything's empty, and then you get to subatomic, and you're like, okay, well, now this is just pure wizardry, right? Yeah, they exist and they don't exist. This is something Michael Jackson said about ideas, uh, start like right here. Philip says, we went and met with Michael and Kenny said, \"Michael, you've got to stop. We've got an incredible show. We don't need any more vignettes.\" Michael said, \"But Kenny, God channels this through me at night. I can't sleep because I'm so supercharged.\" Kenny said, \"But Michael, we have to finish. Can't God take a vacation?\" Without missing a beat, Michael said, \"You don't understand. If I'm not there to receive these ideas, God might give them to Prince.\" Incredible. Just an incredible. Michael slept one night, and that's why Purple Rain exists. Did you know that little red Corvette was going to have a totally different meaning with Michael Jackson? Isn't that crazy? Too soon. God might give them to Prince. Yeah.\n\nWow. Wow. Well, songs are interesting like that. You know who I met last year? I was in Sweden. I did this conference, Brilliant Minds. Amazing. And I met Max Martin. Do you know who that is? No. Max Martin is, you should look this up. How many hits he has? So, Max Martin has, I think, more number one hits than anyone but Paul McCartney. Check that if I'm right, but I got there. There's so many interesting people. Amazing conference. And I was ready to geek out with him because I'm just so curious. It's all the creative, like how does somebody come up with something is fascinating to me. And one of his recent songs was, uh, uh, Blinding Lights by The Weekend, you know? I want such a massive hit, and I just, I love that song, and I just like, just like perfect. Sounds like a movie track in my mind. And how did you do that? Like how, you know, where did you start? Did you guys have a beat? Did you know the lyrics? Like I'm just so curious, how does that happen? Is it like in 10 minutes? Is it months? And he just walked me through, like he had a vision. We have this. We have like all this stuff that we sit down, and then the first the music, then this. I'm like, just wow. It's so amazing to create something like that that a billion people now listen to, number one in every country in the world. It's like how do you manufacture something so kind of perfect that everyone in the world likes it? Yeah. Uh, and is there a form? Do you know it's going to be the hit before it is the hit? That to me is the most, like how many bands get stuck for the rest of their life playing a song that they freaking hate that they didn't know was going to be their, especially if you're a one-hit wonder. You're like dead in the eyes. You're like, I got to play this again. I got to, you know, come on Eileen. Like, you better love that. You love a song, and the artist doesn't want to sing it anymore. Like, oh, and then they start singing it a different way at a concert, and you're like, why are you doing this weird ac capella, bro? I want to hear it like the radio. Yeah, that's, that's interesting. That's kind of the difference though between musicians and anybody else because musicians, you want to hear the same thing over and over again. Exactly. I have that a little bit where if I get clients who book me over and over, they'll, they say to them, \"Do you want me to do something different?\" 'Cause it's like jokes, right? You know, it's like I've seen gaffing. Are you going to do Hot Pockets? Like people call it out, and I want to hear it, but you know the punchline, something that especially you're known for. So I found that if I did a completely different show, people are kind of mad. Like you, I don't have exit surveys, but like I, I, I kind of listen in and see what's going on. I wish he did that one. Bon Jovi has got to do Living on a Prayer at every gig or people are pissed. For me, I need at least two of the things to be the same because people want to see if they can catch it the second time. Got it. So there's a level of they heard about it, and they're like, \"Oh, you got to do that thing with the thing.\" Like, you know, and so if I do everything new, yeah, they're kind of happy, but they still want a greatest hit. And it took me years to learn that because I used to be like, \"Oh, I can't do the same thing. I got to be, you know, unique.\" And then I, I learned that that's not, that's not better. You know, I was just thinking, like mentalists would be the best police interrogators, right? Minority Report style, right?\n\nDon't you think, like if someone... But don't you think if a police interrogator learned the skills of being a mentalist? I think they could, but again, it's the best analogy that I can give you is a director holding the camera. I'm always holding the camera and pointing at what I want. Does that make sense? What police interrogator is going to say, \"Okay, to the perp, think of where you were that night. Look this way. Look that way. Do like they're not going to do all that stuff. This is done when it's done under the guise of entertainment.\" And if they do do that, you're kind of leading the witness. You could lead whatever. People are going to... It's not a... It's not a show. So, you're not going to have a willing participant. You can't be hypnotized against your will. Most stage hypnotists, they do compliance testing first. Do you know what I mean by that? They have everyone in the audience hold your hands together and imagine and like and like who can't get their hands apart. And the person who goes like this right away, they're like, \"I'm not bringing them on stage. They're not doing anything.\" You have to be able to be hypnotized. You have to be suggestible. Mhm. Mine isn't necessarily suggestable, but mine is a maze where every time you hit a roadblock, I'm moving you around until I get you to the spot where you go through. And so that's why you ask me why I didn't do this. It wasn't going to work. I knew it wouldn't. I have, I have more things planned than you know right now. Okay? I've been thinking about this for a while, but I'm not going to do them all. Okay? Because again, how you structure an act, you leave the best for last. You never leave here doing the best. We're going down the home stretch. Are we? Are we home stretched? Are...\n\n\nWe at the final moment?\nWe were almost at three hours.\nSo, you, \"Wow, this goes fast, huh?\nFlew by.\"\nRemember when you asked me, did I wake up early or late, right?\nThe only thing I got wrong, right?\nRight.\nExcept, well, he said the vowel, but he thought of melody, but the Y was the...\nYou know what I mean?\nThat was a little bit tricky, cuz Ae, Ee, I...\nAnyway, doesn't matter.\nHere's what I want to do.\nYou said 50/50 coin flip.\nOkay.\nAnd I brought one.\nYou said, \"Who has coins?\"\nWhat do we got here?\nA coin.\nWhat is it?\nKennedy half, right?\nYeah.\nAll right, let's go.\nI feel like one is not exciting enough.\nThat's like a football game.\nHere's what I do.\nI don't know if you can see me from over there.\nLet's do three tosses.\nOkay.\nStatistically, how many we get?\nRight.\nTwo.\nOne and a half.\nAll right.\nAll right.\nEither way, call it in the air.\nOkay.\nCan you see me over there, man?\nTry.\nThe table's real busy.\nOkay.\nCall it in the air.\nTails.\nYou going tails?\nYeah.\nWhat do we get?\nHeads.\nAll right.\nAll right.\nWhatever.\n0 for one.\nOkay.\nOkay.\nYou felt good about it when you did it?\nNo.\nOkay.\nSo, you got...\nYou got...\nShould I really put it in my head?\nNo.\nDo what?\nI mean, it's a coin flip.\nIt's not a trick.\nOkay.\nNow, it gets in your head cuz you guessed it and you're like, \"Fuck, it didn't work the first time, but I...\"\nNobody cares.\nNothing riding on this.\nYou already call it in the air.\nWhat are you going with?\nTails.\nYou're going tails again.\nYeah.\nYou're going tails again?\nYep.\nI can't...\nI see...\nI...\nThat time I would never change his heads.\nIt's 0 for two.\nAll right.\nAll right.\nThird try's charm.\nOkay.\nYou think you got it?\nYep.\nWhat are the odds on that?\nSo, this has got to be your shot.\nCall it.\nTails.\nTails.\nI always go Tails never fails.\nWhat do we get, Joe?\nYou're 0 for three.\nHeads again.\nYou're over for three.\nYou done?\nNope.\nYou want one more?\nSure.\nYou insist?\nYeah.\nAll right.\nYou're not done.\nI said three.\nOkay.\nShould I go over here?\nHas that envelope been there the whole time?\nThis envelope?\nYes.\nWe sealed this, right?\nThe moment I arrived at the studio, right?\nOkay.\nYou're going to get it this time, just for the record.\nOkay.\nCall tails.\nTails.\nYeah.\n[ __ ] O for four.\nAre you doing this?\nI'm not doing anything.\nYou're not making it land on heads.\nNo.\nBut do you know how to do it?\nLike do you have a method?\nCall it.\nCall whatever you want.\nTails.\nSo I did...\nI do it?\nYou said it.\nWhat is it?\nIt's heads.\nBut that was...\nThat didn't count.\nThat didn't count.\nYou're just bad luck.\nIs that five in a row?\nI didn't really count that one.\nThat seems odd.\nLet's try one more.\nShould double check the...\nDo it still there.\nDo it yourself.\nDouble check.\nWhat?\nDouble check.\nThere's still tails on there.\nThere still tails.\nOkay, just check it.\nBut this doesn't count cuz this one's yours.\nWhoops.\nThat was very clumsy of me.\nPut it anywhere.\nDo on the table.\nI just didn't have room on the table.\nIt's tails.\nBut did you guess tails?\nYeah.\nOh, okay.\nJust kept going.\nI feel tails.\nIt's not a trick.\nIt's statistic.\nAll right.\nBut statistically, five in a row of heads.\nIt seems odd.\nI said to you, I hope everyone stayed along for this journey.\nI said, \"This is your future.\"\nThis is my future, right?\nBut I lied.\nPast, present, and future.\nOh my god.\nNow, hold on.\nI'm going to come over there.\nOpen it up.\nIt's your...\nYou'll see what I mean, but I want you to open it.\nYou open it up.\nThere's two things in there.\nNow, freeze right there.\nOkay.\nShow us what you have.\nTwo envelopes.\nWell, not one's not an envelope.\nFolded piece of paper.\nFolded piece of paper and one is a manila envelope.\nThat's...\nIs it all right if I come over?\nIs it tap?\nIs it taped everywhere?\nYes, taped everywhere.\nSo, I'm coming over.\nOkay.\nYou want to do it?\nCan you guys hear me?\nWe're gonna open it.\nWhere am I?\nIs a camera here?\nThis mic, but I have the...\nThere's a camera over there.\nThere's a camera.\nOkay, you tell me.\nOkay, I'll go around you.\nI just want to make sure I can see this.\nAll right, Joe.\nLook inside.\nOkay, I want you to look inside and before you grab...\nNo, no, no.\nLook, look, look, look, look.\nI'm looking and tell me you see it says two words.\nCan I turn this around?\nLet me see.\nJoe Rogan.\nIt says Joe Rogan.\nAnd I don't want to touch.\nWill you do it?\nI don't want to touch.\nGrab that one.\nThat pink one out.\nOkay.\nAnd read to us.\nGrab that.\nThat's your pass.\nHold on to this.\nOkay.\nRead out loud.\nThat's been in there from before we started.\nIt says Joe Rogan will get three coin flips in a row wrong.\nInsist on doing one more and then get that one wrong, too.\nThe present.\nYou can't change that.\nThe past.\nJoe, take out what's in there.\nOkay.\nTell us all.\nLook around the edges.\nIs this...\nIt's stapled.\nLike I usually used to lick stuff.\nFeel like do this.\nBring this over.\nI want you to see.\nLook.\nLook.\nYou...\nI don't want to touch.\nI just want you to like look around.\nYeah.\nThat's fully stable.\nIt's stapled.\nIs there any...\nWhen I walked in here, Joe, I made a big thing of it.\nI said, I want you to have this before, right?\nSealed.\nIt's been here the whole time.\nSealed.\nYes.\nImpulsive, spontaneous, in the moment.\nGot it.\nAnd I said to you, did something get in your head?\nWho earlier when I said any fighter you've ever... you've ever seen?\nWhat fighter came to mind?\nI said Anderson Silva.\nAnderson Silva.\nYeah.\nAnd how many fighters rip it open.\nOkay.\nHow many fighters did you say cycle through?\nI said, \"Be very specific.\nHow many fighters do you think cycled through your head?\"\nI don't know.\nI said a dozen at least.\nIs he...\nDid he say a dozen?\nWith 14.\nYou said 14.\nRead.\nPlease open that up.\nTake that out.\nAnd I want you to please read what's been in there from the moment I walked on this set.\nIt said Joe will have 14 fighters go through his head, but with Anderson Silva in the end and a fight that he won.\nPast, present, and future.\nThat's insane.\nPast, present, future.\nThe other piece of paper.\nThere's one that's got...\nThat's literally insane.\nBecause at first I was going to go with Zabit.\nZabit.\nMagamob.\nMagamob.\nSheriff.\nDo this.\nGrab the other piece of paper.\nIt's got a paper clip.\nFreeze right there.\nThis is the future.\nStop.\nStop.\nDon't move.\nHold it right there in your hands.\nOkay, I'm holding it.\nNobody knows the future.\nNobody knows the future.\nIt's true.\nNobody does.\nImagine right now.\nBest magic trick in the world.\nBoom.\nI throw a smoke bomb.\nDisappear.\nDisappear.\nRight.\nAnyone ever...\nSomeone famous though, otherwise I want to see my grandma again.\nOkay.\nAppears right here instead.\nImagine you literally...\nI don't want Jamie D, but you pull up a photo.\nYou show me this person's photo.\nGot it.\nSay it.\nWho do...\nWho do you see right there in that chair?\nSay it.\nWhat's their name?\nMiles Davis.\nCan I ask you a question?\nYes.\nCuz I like this.\nI...\nHere's what I always like to do.\nI always call it the grass is greener.\nI can see when people's eyes shift.\nWhen they have one person and they're like, I want that person, but that's the front of their mind.\nI can always get in the front, but for this to be a legendary ending, who is in the back?\nWho is the person you thought of before Miles Davis?\nTell us.\nMuhammad Ali.\nMuhammad Ali.\nRight.\nThat's what I love.\nThe gold standard.\nThe reason you're going to talk about this for years is cuz you changed your mind the last moment.\nThat's been in there from when I walked in here.\nLook at what's in there right now.\nMuhammad Ali.\nThat's insane.\nYou are a witch.\nWe're going to have to kill you.\nLock the door, Jamie.\nBam.\nThat's really insane, man.\nThat's really weird.\nI want to ask you how you do this, but you're not going to tell me.\nYeah.\nOff camera.\nTell you everything.\nYou show me where Bob Lazar is hiding the UFO.\nI wish I knew.\nI wish I knew.\nThat's insane, dude.\nThat's crazy.\nIt was Anderson Silva versus Rich Franklin.\nOh, what a good fight.\nWhat a great fight.\nThis you keep.\nThis you keep.\nYou lock in the safe or when I come next time, assume the clothes.\nI will.\nI'll keep that in the safe.\nThis is uh really nuts, man.\nI don't know how you did it.\nIt's really crazy.\nThe coin flip, the 14 different fighters, like all of it.\nThank you.\n[ __ ] nuts, man.\nChange your bank pin code right now.\nChange it.\nYeah, I'm going to...\nJesus Christ.\nJamie, anything to add to this?\nNope.\nI...\nWe should have walked off when you just was silent.\nWe should just ended it there.\nThis is like pure wizardry, dude.\nI...\nI don't know how you're doing it.\nAppreciate that.\nI...\nI don't think you're ever going to be able to explain to me either.\nThank you.\nI appreciate you, man.\nI'm a huge fan for many years and I love what you're putting out in the world and I'm telling you, I just...\nI love it and thank you so much.\nI'm honored to be here.\nOh, I...\nIt's an honor for me, too.\nThis is like truly insane.\nI've been blown away before, but I don't think I've ever been blown away this much.\nThis is really nuts.\nAnd uh it...\nIt's like shattered my worldview.\nI have to rethink how I think about everything and what signals human beings give off and like how someone could read something like that.\nPretty nuts.\nThanks, brother.\nThank you.\nBye, everybody.\n[Applause]\n[Music]\n"
}