{
  "episode": {
    "id": "mYVzme2fybU",
    "title": "Joe Rogan Experience #2341 - Bernie Sanders",
    "publishedAt": "2025-06-24T17:01:03.000Z",
    "description": "Bernie Sanders is the senior United States senator from Vermont. See him live on the Fighting Oligarchy tour.\nhttps://www.berniesanders.com\n\nVisit https://squarespace.com/ROGAN to save 10% off your first purchase of a website.\n\nGet 20% OFF Premium 100% Grass-Fed Meat Sticks https://paleovalley.com/rogan"
  },
  "channel": {
    "id": "UCzQUP1qoWDoEbmsQxvdjxgQ",
    "name": "Joe Rogan",
    "slug": "@joerogan",
    "url": "https://www.youtube.com/@joerogan"
  },
  "transcript": "Joe Rogan podcast. Check it out. The Joe Rogan Experience. Train by day. Joe Rogan podcast by night. All day, Mr. Sanders. Great to see you. Good to be with you, Joe. You've got a bunch of notes. Not all that much. Have you prepared for this? I am all prepared. Well, it's a good time for you to be in here cuz the world's gone haywire. Yes. Yeah. What are your thoughts on this? I think I start off with Joe trying to take a deep breath and doing what is not often done. Where are we as a country today? What's going well? What's not going well? And I don't think we don't we don't have that kind of basic discussion. And to my mind, I think in America today, we are facing more serious crises than we have in the modern history of our country. This is a pivotal moment in American history, and what happens now will determine the lives of our kids and future generations. What specifically concerns you? I'll tell you what concerns me. The issue of wealth and power. All right. I'm kind of oldfashioned and I believe in democracy and I believe that everybody should have a good shot at living a decent life. And what I worry about right now, and this is an issue, Joe, and it's part of the problem that just ain't talked about very much. And I and I applaud, by the way, you and the other podcasters who give people the time to really seriously discuss things rather than 7-second sound bites, you know, but if you take a look at where we are as a nation today, this system is not working. It's broken. It ain't working for ordinary human beings. So, you have an America today where we have more income and wealth inequality than we've ever had in the history of this country. That's just a fact. Uh you have um one man uh Mr. Musk uh owning more wealth than the bottom 52% of American families. One man 52% of the American families. You got the top 1% owning more wealth than the bottom 93%. You got CEOs of large corporations making 350 times what their workers make. And meanwhile, in this richest country in the history of the world, workingclass people are getting decimated today. And again, we don't talk about it in Congress for reasons that I'm hope I can get into. Yeah. We don't talk about it in the corporate media. 60% of Americans are living paycheck to paycheck. Now, I grew up in a family, I don't know your background, but I grew up in a family live paycheck to paycheck. And anyone who lives paycheck to paycheck understands that every single day is a struggle. You know, you got to figure out how you feed the kids. Rents, cost of housing in America off the charts, healthcare off the charts. So, right now, as we talk, there are people worrying, my landlord, you know, is going to raise my rent by 20%. What the hell do I do? Where do I go? How do what schools do my kid go to? How do I buy decent food for my kids? My mother is ill. How do I afford prescription drugs for my mother? Uh my car breaks down. You know, so you you know, if you have money, no one thinks of it. Your car breaks down. Go to the mechanic, you get it fixed. You know what? A lot of people don't have a ,000 bucks in the bank right now. So you don't have a thousand bucks, your car breaks down. How do you get to work? If you don't get to work, you get fired. If you get fired, your whole life is disrupted. 60% of American How much different is that than past generations? It's that we've always had rich and poor. No question about it. It's worse now. Joe, uh, what do you attribute that to? I attribute it to decades old attacks on the working class of this country. I attribute it to horrific trade agreements which have allowed corporate America to throw millions of workers out on the street and move to China, Mexico, and other low-wage countries. I attribute it to a corrupt political system in which billionaires have significant control over both political parties. So that for example, right now in Washington, the national minimum wage is $7.25 an hour. So you got millions of workers today, you know, making 10, 12, 13 bucks an hour. You tell me how do people survive on 13 bucks an hour? When we were kids, or at least when I was a kid, you worked for a large company. you had something called a defined benefit pension plan. You know that means it means you work for me for 30 years. When you retire, you're going to get x hundreds of dollars a week. That's long gone. Corporations have gotten rid of that. So you got something like half of older workers in America have nothing in the bank when they face a retirement. I think to answer your question, I think he got a rigged system controlled economically and politically by very very wealthy and powerful people who could care less for working families. Now, I don't want to romanticize the old days because that would not be true, but there used to be a kind of a culture. If I was a boss and I ran a factory, I had a little bit of concern for you, right? You know, in general, I would say, I know your wife, how's the how's your mom doing? And all that stuff that's gone. You got these companies that are owned by other companies that are owned by super national I, you know, we got involved in my office. I used to be the chairman of the labor committee, health, education, labor. So, I got involved in a lot of stuff. And when workers were out on strike, we would call up and see what was going on, see how we can help. So, we'd call up to the company and we'd say, you know, why are you cutting back on healthcare for your workers? Well, we don't make that decision. It's owned by somebody else. Call up somebody else. Well, we're owned by somebody. You know how it is. It's just huge. These huge conglomerates own the bloody world. And these guys don't give a damn about the needs of working people. So I would say that the economy becomes less and less personal. I have no You're my worker. I have no care about you because right now I'm owned by an international who doesn't know that you exist. And there's also a diffusion of responsibility. Absolutely. It's not even in your hands. Exactly. So the local boss might say, \"Hey, listen. I'm really sorry, but I didn't have any decision in here.\" Right. Right. Right. There's nothing I can do. Nothing I can do. Um, so I add all of that up and you have a and then just look at other things. I mean, you tell me tell me about the health care system. Does anybody in America think this healthare system is working? Well, you could tell by the assassination when the assassination of the United Healthcare guy when that when that happened there there was people celebrating. When is there ever someone gets assassinated on the streets of New York City and people celebrate, right? That's terrible. It's terrible. But it does speak to how people feel about insurance companies, right? Well, and I think rightly so because it's not what you're paying for. What you're paying for is you're hoping that you never get sick, but if you pay your insurance, you will be covered. What they're trying to do is make it as difficult as possible for you to get money from it. You got it. That's the more money the more I can deny you, the more money I make. Right. And that's the bottom line. And when you're dealing with these enormous corporations like we're talking about this diffusion of responsibility, the people that are doing it, it's like this is what I have to do. This is my job. They don't even think about it. Right. Exactly. And this all started when like when So Michael Moore had that brilliant documentary, Roger and Me. Yeah. Yeah. Michael's a good friend. Yeah. Uh he's a great guy. That that documentary is fantastic and it it shows the impact of a corporation taking all their factories, moving them away like that with no warning, no recourse, nothing anybody can do. Decimates the the basically all of Detroit. That's right. People don't know this. Yeah. But if my memory is correct, Detroit used to be in the 50s third richest city in the world. You got it. Yes. Yeah. We've talked about it multiple times. It's disgusting. And especially me as someone who loves American automobiles, I'm a big fan of what Detroit made during that time. And to see what happened to Detroit now. The last time I was in Detroit, it's actually seems to be picking up. There's a lot of uh small businesses and a lot of artists and a lot of people that are proud to like Shyola, companies like that. Proud to be in Detroit, but there's just so many abandoned buildings. It's It's insane. You could buy a house there for 500 bucks. It's really crazy. Like giant factories where every window smashed, all the pipes have been torn out, and it's just this hulking. And it's not just Detroit, right? I mean, there other communities, corporations say, \"Hey, I mean, and that path is unsustainable, right?\" I think so. Yeah. I mean, and look, if we are, and again, gets back to what we want as a nation, but you had corporations saying, \"Hey, back then, not now, I could pay workers in China 25 cents an hour. Why the hell do I want to hire you for what it was that five bucks an hour, whatever it was, right?\" And I'll never forget, Joe, uh, early on when I was elected to Congress, this was when we had the NAFTA agreement, I went to, uh, the Mackiladora area. You know what that is? And uh it's a special zone in northern Mexico near the near the border uh where uh the government there, this is back decades ago, allowed American and other European corporations to settle and got tax breaks there. So it was attracted all these corporations. So I went there with a congressional delegation and this is what I saw. You saw these beautiful new factories. Now this is 25, 30 years ago. And then we said, \"All right, I want to see where the workers live.\" And I'll never forget this. As long as I live, we do. You know those large cardboard boxes that refrigerators come into and stoves those big? It's where people were living. They were living literally in cardboard boxes making I think at that point, now this is a long time ago, 25 cents an hour. So workers in America were thrown out on the street and people in Mexico exploited in a horrible way and these big shiny new factories at the time. So what you got and I believe this strongly you asked me you know how does it happen why does it happen I think especially right now and and for many decades you have the prevailing religion of the oligarchs and the corporate world is greed that's all I want it all and I don't give a [ __ ] if I have to step all over you throw you out on the street take away your social security I want it and to hell with you and that's why you end up with a situation in America America where you know the top 1% now owns more wealth than the bottom 93% and millions of people struggle. It's also a corporate culture of competitiveness, right? So they're competing with all the other corporations and you have to keep up and there's no way other than to increase your profits every quarter. That's right. That's right. That is exactly you do the right thing by workers. All right. That's a perfect example. So you know you got Wall Street. Here's here's a fact. When we talk about it, it's not only income and wealth inequality that bothers me. It's concentration of ownership. So, right now in America, in virtually every sector of our economy, whether it's agriculture, transportation, financial services, whatever, you got a handful of giant multinationals controlling that sector. But here's another amazing fact. Who do you think owns these corporations? You know, you remember there was a day where somebody actually owned General Motors or owned Ford. They're now owned by Wall Street firms. You got three Wall Street investment firms. Black Rockck, you're familiar with Black Rockck. They're char street. Exactly. Yeah. Check it out on Google. They are combined, the three of them combined are the major stockholders of 95% of American corporations. How's that? That's not good. That's power, right? How did that start and what could have been done to stop that from happening? Well, I think it's it's again it's greed. These guys are smart. They're hardworking. They're motivated. They want more and more. So, if I can buy this, I can buy this. I can sell this. Right. But they're all doing it within the law, right? Yeah. Yeah. Right. But which is is that the problem? Yeah. But who makes that law? They do. Now, I want to go to another issue. Yeah. Which is very rarely discussed. All right. You ready for it? I'm ready. All right. Hang on. Here we go. and is the the problem I think that we face as a country is not just economic disparities and all the stuff that we're talking about the rich getting richer and the poor getting poorer. It is political power right now. And I doubt that there are many Americans, whether you're a progressive as I am or a right-wing Republican, I don't think people can disagree that we have a corrupt campaign finance system. Argue with me? You agree? No, I agree with you. Yeah. All right. So, let me talk about what it means. Okay. As a result of the Citizens United Supreme Court decision, I think it's 15, 16 years old. What it says is you're a billionaire, you have now the constitutional right because your money is your freedom of expression, right? So you don't like Bernie Sanders, you can put millions or hundreds of millions of dollars into a campaign and express your view about how terrible Bernie Sanders is and you can buy that election. Right? Constitution, right? I think that's probably the worst decision that the Supreme Court has ever made. So, what is the result of that decision? The result of that decision, let's take us to where we are today, is that Elon Musk, and I know\n\n\nAlain was on your show, and he's here in Austin, huh? Yeah. Okay. And I, we could talk about Alain, but he spent $270 million to elect Trump as president. Okay. I think that's absurd that any one person... What's the most someone donated towards the Harris campaign? They spent a lot of money on Harris as well. They spent $1.5 billion just over the course of a couple of months. You got it. All right. Let me talk about it. So, I'm not here just to say it's a Republican. That's my point here, right? Okay. So, M spends that money and what's his reward? He becomes the most powerful person in government for three or four months. Okay, fine. But what you have right now, and I just saw this the other day, you are a Republican member of Congress, okay? And you say, you know, there's a reconciliation bill, which we can talk about in a minute, that this is Trump's big, bad, big, beautiful bill that's coming up literally on the floor of the Senate very shortly. So, let's say you're a Republican representing a low-income district, and you say, you know, I got a lot of people on Medicaid in my district, and kids can't get to college, and I worry about food programs. I don't think it's a good idea to give tax breaks to billionaires and cut back on Medicaid. You make that announcement today. What happens to you? It's over. You get attacked. You're finished. The swarm comes for you. You got it. Yeah. It's not a swarm. It's... The problem is, it's already been established, right? That these laws have been established. The power has been given to these people. The money has started flowing, and it's been flowing for a long time now. And this is the issue with starting something that you can't stop. Well, you can stop it. You can stop... and you got to stop it. Okay. But if you do stop it, all these people are going to throw all their money at stopping you from stopping it. Correct. Right. Exactly. They're going to come up with the best commercials with American flags. This country is all about competition and freedom. You got it. The freedom to donate to the party of your choice. You got it. Good. Stop these comments. Stop. You're writing their ass for them. They're gonna... they're gonna pick it up with the American. Yeah, I can write them. Yeah, we could, all right, but then we got to take a deep breath and and figure out where do we go from there. Now, I wanted to, in my... I, you know, as you know, I am the longest-serving independent in American history. Yes, I caucus with the Democrats. I always have. But y'all can't hear me defending the Democratic party on this issue because you're right. Uh, during the election, it wasn't just Musk and Republicans putting a lot of money into Trump. It was Democratic billionaires putting a lot of money into... and into other candidates as well. And let me... I mentioned there's a guy named, um, I don't even know his first name. Mr. Massie, does that name ring a bell? Thomas Massie. Thomas from Kentucky. Yeah. And this guy, as I am, is opposed to this war in Iran. Just yesterday, Trump gave a long post about how they're going to primary this guy. And it... what bothers me is you would hope that there would be respect enough for members of Congress that you could vote your own conscience. You could, you know, represent your constituency. Every district is different in America. But right now, anybody stands up and says, \"Well, you know, I disagree with President Trump.\" Bam. You are finished. We're going to primary you. We got all kinds of money. You're out of there. That happened to Massie yesterday. But let me go back to the Democrats and tell you where the problem... This episode is brought to you by Squarespace. If you've got a skill, there's no reason you can't build a business around it. Squarespace gives you everything you need to offer services and get paid all in one place. Whether you're running consultations, events, or custom experiences, you can build a site that looks professional, add videos, and even put premium content behind a paywall. And the best part, it's all in one place. From invoicing to SEO tools that help people actually find your site. Go to squarespace.com/rogan for a free trial. And when you're ready to launch, use the code ROGAN to save 10% off your first purchase of a website or domain. Can I point something out? Don't you think that there's a... strand effect to that? Don't you think that there's a blowback for that kind of thing when people recognize that this guy should be allowed to have his own opinions and should be and make some reasonable points and that people are going to reject this idea maybe... and that it's... it's not as simple as... I think the whole uh, MAGA thing right now is very divided, particularly because one of the things they voted for was no war, well, now it seems like we're in a war, right? So that... and it's quick. We're six months in, and that's already popped off. And then people are very concerned with now what happens to our troops overseas that are in these bases that are in vulnerable positions, and what happens with... I mean, there's supposedly documented terror cells that got in through the open border over the last four years. So what happens now in America? What happens on American soil? Right. No, I mean, I agree with those. When a guy like Thomas Massie steps up and says something, you're... he's going to have a lot more support as well. The answer is yes. And my only point is he has a right. Yes. You know, somebody else says, \"Hey, I think the war is a great idea.\" Fine. That's your view. You got to go back. But what bothers me is that if anybody stands up the next day, we're going to primary. You're out of here, man. And that's the Republicans. Let me talk about the Democrats for a moment, okay? And I... I don't even know your views on this, so you may disagree with me. You know, Israel was attacked by Hamas, and Hamas is a terrible terrorist organization. They killed 1,200 people, which in a small country like Israel is a lot of people. Terrible, terrible attack. It's a war crime. Israel had a right, in my view, to defend itself. But the Netanyahu government did not have a right to kill 52,000 people in Gaza, wound over, uh, well over a hundred thousand. And right now, as we speak, Joe, children are starving to death because of Israel's blockades. Yeah. Yeah. Starving to death. And I brought forth, uh, two resolutions, uh, which basically were very simple, and it said, uh, no more US military aid, uh, to, uh, Israel under these conditions. One vote got 15 votes in the Senate. The other one got 16. Do you think that members of the Senate do not know what's going on in Gaza? The kids are starving to death. The innocent people are being shot down right and left. They know it. Why do you think I couldn't get more votes? They wouldn't vote against Israel. Right. It's political suicide. Ah, now you're talking, right? All right. So, in the Republican side, you have moneyed insurance saying, \"You speak up against Trump, you're out of here.\" In the Democratic side, you speak up against the Netanyahu government, you're out of here as well. And they have been successful. You have super PACs like AIPAC spending a fortune. You stand, and they have already knocked off a number of members of Congress, good members of Congress, and they will do it again. So all I'm saying is you got a corrupt campaign finance system on both sides, which is rejecting the will of the American people and end up supporting powerful special interests. And if we do not get a handle on that issue, I worry very much about the future of American democracy. Are you going to run for president again? I am 83 years of age. That's what I'm saying. Yeah. Well, you know, I'm not sure the American people will be enthusiastic on somebody's still very with it. Thank you. You are. Well, you know, I mean, you're a couple years older than Biden. Yeah. Right. Think of that. Yeah. You could be off a lot worse. Yes. Yes. Yeah. All right. Um, so, uh, we have been running around the country doing what we call a Fighting Oligarchy tour, which is why I'm here in Texas. We were in Fort Worth last night. Had a good turnout. And I think, interestingly enough, Joe, it's not most of the people. We know the people who come out to our rallies. You know, we have a big list of millions of people, but a lot of people are coming to our rallies that we don't know. And I think we know that some of them are Republicans and some of them are independents. Many of them are independents because I think across the board, uh, there is growing dissatisfaction with the current politics in America, both parties, and people want a new vision for America, which is also something we don't talk a whole lot about. So, you know, the issues that we talk about is, in the richest country on earth, why don't we have the best healthcare system in the world? Why do we have 85 million people who are uninsured or underinsured? And as you were mentioning a moment ago, I mean, he deals with the insurance companies and the drug companies, and the function of the current healthcare system is to make these guys very rich, and it works. They make zillions of dollars, and every place you go in my state, the cost of healthcare has gone up this year like 10, 15%. People can't afford it. Uh, and we lose thousands of people every year. People get sick, they can't afford to go to the doctor, they die. Uh, so, you know, one of the fights that I hope we can win is to have the United States join every other major country on earth and guarantee healthcare to all people, uh, as a human right. Well, we've talked about that a lot on this show, that if you view this country as a community, the most important thing is to protect the most vulnerable members of your community. Period. Right. I agree. And if we... we spend insane amounts of money on all sorts of things that people don't agree with, and I think generally most people would agree on some sort of a national healthcare system. They do. Most people... like there... there's concepts of socialism that everyone agrees with. One of them is the fire department. Right. Right. Everyone thinks that everyone, every citizen should have access, the same equal access to the fire department. And we all pay into that. That's right. And we all believe in education. We all believe that there should be free public education. And most people believe that the university system should also be funded. It would benefit everyone. You got it. It would benefit everyone to have more educated people that are doing better in the world. You'd have better GDP. You'd have more, more successful people. Absolutely right. If you want to make America great again, less losers. How do you make less losers? Don't stack the deck against them. You know, one of the first things that you'd have to do is figure out why these communities and these cities have been the exact same way for decade after decade. Back to Jim Crow and the red line laws and all these... why is nothing being done to fix that or to correct that problem? And it becomes this political beach ball that they just bounce around the air at a concert, you know, and everybody... it's like there's certain things that just keep coming up that make you just... just go, \"How are we still talking about gay marriage? How... how is that still coming up?\" And it's like, poof, throw it up in the air. All right, let me get back to that. But I want to say... there's a bunch of these things, right? All right. The first point you made, you want to make America great, right? Have the best losers... have... have the best educated workforce in the world. How's that radical idea? I don't think so. Right. You're absolutely right. Better education. You live longer when you have better education, etc., etc., right? All right. So, what does that mean? It means right now, you know, I talk to psychologists all the time because... you do. Yeah, I do. Because I am, uh, I was the chairman, now what call the ranking member of the health, education, labor committee. So, you know, we deal with medical people all the time. Uh-huh. Wasn't me personally that... No, that I may need also, but no, I was talking in a more general sense. Look, what are the most important years of human development? You're a human being. What are the most important? You're a child. That's right. Yeah. Zero to four. How's our childcare system doing? Yeah. Not so good. It's a disaster. So, you got a rational society says, \"Okay, the kids are the future of America.\" Right. You talked about the sense of being a community. All right. So, if I love this country and I want this country to do well into the future, I have to worry about the children. Correct. Right. Absolutely. Right now for economic reasons. When I was a kid, by the way, and this shock some of your younger listeners here, there was one worker in a family could actually bring home the bacon and pay the bills. Yeah. Back in the old days. Back in the old days. Yeah, man. So, I grew up in a working-class family. We didn't have any money. My dad went out to work. Mom stayed home, and that was it. Yeah. Um... made healthier people, too, that way. Yeah, it did. I think in many respects it did. Well, something happened where they sort of devalued, uh, the woman's role as a mother and by convincing them that they have to be a part of the workforce. I think that's part of it. I think the other half is women legitimately wanted, you know, careers as well. And the other thing that happened, maybe most significantly, is you needed to stay alive, two breadwinners to stay alive. Yeah, that's the problem. The real problem was financially, it just seemed so difficult for one person to pay for everything. The only way to do it was to have both parents working. You know, I was thinking, I grew up in Brooklyn, uh, before I moved to Vermont, and, uh, we lived in a rent-control apartment, and I was doing the arithmetic. My dad didn't make...\n\n\nMuch money, but we didn't pay much in rent. And I, I couldn't quite remember, you know, his what his salary was and all that, but my guess is we paid, as I recall, talking to my brother about this, about 18% of my dad's salary for rent. 18%. Ain't nobody in America today who's paid 18%. You know what I mean, right? That's why you need two breadwinners because you're paying 40%, 50%.\n\nRight. Yeah. But getting back to this issue of education, which I think is key, if you were rationally thinking about the future of America, if you loved America, as we all do, you're going to have the best child care system in the world, so the kids will do well in school. Right now in child care, you got workers out there making 15 bucks an hour. And you have families that cannot afford childcare. My state, I don't know, it's about $20,000 a year to send your kid to childcare. So you're making 50,000 a year. How do you pay that? 60, you can do that. And then education. You got kids who want an education. They want to go to college. They want to go to trade school. We desperately need. Here's something that really drives me a little bit nuts.\n\nIn America today, Joe, not only is our health care system failing because it's based on greed, not on need, but we need more doctors. All right. All over the country, people have to wait, you know, sometimes months to get to a doctor's office. We have a massive nursing shortage. We need more dentists. Big problem in dentistry. We need more mental health counselors. We need more pharmacists. How come in the richest country in the world, we don't have enough doctors and nurses? Because it's very difficult to do. It's very difficult to become a doctor, and the bills that you have from education are overwhelming. All right. You want to go to, let's just say tomorrow you announce to the world, you give up this podcast, you want to go to medical school. All right. You got it?\n\nYeah. You know how much, if you don't have any money, do you know how much you're going to graduate medical school in debt?\n\nProbably quarter million dollars easy.\n\nDouble that.\n\nReally?\n\nYeah. I, I'm not. Yeah. Obviously, it varies per person. But it is not unusual for guys, you know, people working-class homes go to medicals, come out $500,000 in debt. Nurses, I don't know, $150,000 a day. That is insane.\n\nIt's insane. All right. Yeah. We need more doctors. So, I should, I want to encourage you, Joe. I want you to go to medical school. Hey, good news. We're paying your tuition. Da da da. And we need you out there as soon as we can get you. Why wouldn't that be subsidized? Of course, you should subsidize it, right? Of course. Yeah. But there's, there's, there's so many different What would you have done? Like, imagine if you hadn't gotten derailed and they hadn't uh conspired against you and you actually became the Democratic candidate for president and you won. What would you have done differently?\n\nOkay. How many hours we have? Look at all the time in the world. Bernie, I know. What would you have done first day in office? Well, it's not just the first day in office. I would have dealt with this campaign finance reform issue. Uh, and there are ways that you can get around that Supreme Court decision.\n\nHow do you do that?\n\nUh, you move toward public funding of elections, which says that Joe, you want to run against me? That's great. Uh, but you're not going to get super PAC money. Uh, we're going to publicly fund you. You know, you, you uh get 1,500 signatures that says you're a serious candidate. You'll get a certain amount of money to run for office. So you're funded by the government. Yes. Absolutely. Rather than so someone running for president funded by the current president.\n\nWell, not the current president. And people say, oh, taxpayer dollars are going to, but that makes a lot more sense than having billionaires fund elections, which is what you got right now. So that's number one.\n\nSo you think there should be, when you get a certain number, you just get a certain allotted amount of money that you could use for your campaign, and everybody gets the same amount?\n\nThat exists in some places right now.\n\nDoes it, where?\n\nYeah. In New York City right now. Oh, in New York City and other places as well. So, if you agree, you know, you're gonna raise, you, you're not going to raise private money. You go the public route. Uh, it exists in a number of communities, and I think that is\n\nDid you watch the New York City uh debates, the mayor?\n\nI heard, I'm in, I got involved, and I'm supporting uh Mr. um Menani.\n\nA lot of people are, well, especially after that debate, right? It seems like everybody else was essentially saying, \"Ah, I've been to Israel more than you've been to Israel. I'm going to go to Israel before you do.\" Right. They think they're campaigning to be foreign, you know, minister for Israel or something. Uh, but talk about money and politics.\n\nYes. Just look at New York City right now. There's the election tomorrow, I think. Right. I think it's tomorrow. What's Monday? Today, tomorrow's Tuesday, right?\n\nYes. That's the election. They're spending a huge amount of money. You know, the dem, these are Democratic or some cases.\n\nWho's in the lead right now?\n\nUh, polls say Cuomo by a little bit, but I think uh Zoron has a lot of momentum. We'll see.\n\nPolls are weird in a race like that. Yes.\n\nWell, they're weird in every race. They were wrong with Hillary in 2020 or uh in uh 2016 rather. They were wrong in 2024 with Harris and Trump. Like I don't understand polls cuz I just, I don't, I have a feeling that the majority of them are inaccurate.\n\nWell, I think they are increasing. I, I don't know the answer to your question. The pollsters would argue that's not the case, but I think you got a lot of folks who are not all that enthusiastic about honestly giving honest answers to a pollster.\n\nAbsolutely. Yeah, that's true, too. Yeah. And that's part of the problem, right? All right. But you ask me on my first day as president. Well, they have you drop in, say hello. Hi, have a cup of coffee. All right. All right. Good. And and then I, I think we'd declare something like our health care system is an emergency and figure out ways that we can do what every other major country on earth does, and that is guarantee healthcare to all people. So, one of the things you do, you say, \"Okay, we need tens of thousands of more doctors and hundreds of thousands of more nurses and dentists and so forth and so on, and we're going to move aggressively to make sure that in America, everybody in this country has healthcare as a human right.\" So, I think that's number one. Number two, uh, at a time of massive income and wealth inequality, uh, you don't give tax breaks to billionaires. You demand that they start paying their fair share of taxes. And one of the problems that we have, it's not just an American issue, it's a global issue. A lot of these zillionaires are hiding their money in tax havens in the Cayman Islands and elsewhere. And that's an international issue. But I think we have to have a fair tax tax system which says that individuals and wealthy and and corporations that are making a whole lot of money are start paying their fair share of taxes.\n\nWhat is their fair share?\n\nI don't know. I mean, you know, is under Eisenhower, the very rich paid at their upper levels 90%, you know, but let me be very honest with you, Joe, on this one.\n\n90% is kind of crazy, though, right?\n\nNo, not that's not across, that's just for the, you know, your billionth dollar. You know what I mean? It's not your, your first dollar. It's not.\n\nSo, if you make a billion, you pay 900 million.\n\nNo, no, no, no, no. That's not what it means. It means on your $900 million, you're going to pay 90%.\n\nOkay. All right. But you know the other thing that uh I would do, and you look, uh, you got to deal with this climate change issue, and I know that you know there are some people who think climate change is a hoax. It ain't a hoax. Uh, I think the last 10 years have been the warmest on record, and we can create millions of good-paying jobs transforming our energy system away from fossil fuel to energy efficiency to solar to wind and other sustainable energies. This episode is brought to you by Paleo Valley. 100% grass-fed beef sticks. I live a super busy lifestyle. I'm always running from one thing to the next, and Paleo Valley is the perfect on-the-go snack. These beef sticks are legit. No junk, no garbage ingredients, just pure clean protein fermented the old school way. So, they're shelf stable without chemicals. That is huge. And the fermentation part, it's actually good for your gut. Most people don't even think about that, but if you care about performance, you have to care about your gut health. And tastewise, they're awesome. They've sold over 55 million of these things. That's not just hype. That's people coming back again and again because it works. Go to paleovalley.com and use the code ROGAN to get 20% off or find them on Amazon.\n\nI think the climate change issue is very complicated, and I think uh did you see the Washington Post uh piece that they wrote where they did this long-term view? First of all, the the reality is that the Earth's temperature has never been static, right? We could both agree on that. It's always been up and down. There's been ice ages and heat waves. And then the Washington Post looked at it. What was the time period that they looked at that essentially they found that we're in a cooling period that the Earth over the past X amount of years, and this was like a very inconvenient discovery, but they had to report the data, and kudos to them for doing that. Scientists have captured the Earth's climate change over the last 485 million years. Here's a surprising place we stand now. So look at the far end of that graph, and you see we're in a cooling period.\n\nWell, I'm not sure. No, I didn't read that article, but I, you know, the scientists who are out there, I think I know, but there's a lot of money involved in that, too, Bernie. That's part of the problem. There's a lot of money involved in this, this whole climate change emergency issue, and there's a lot of control, and that's uh that's a big part of this problem. Not only that, if we're just talking about primarily carbon and carbon footprint, what are we going to do about China? Because China and Absolutely. China is like what percentage of, they are the major, they are the major uh poller right now in terms of carbon. We're number two, we used to be one, they are number one right now.\n\nI think they have an enormous percent of global, I think it's, they're number one. I don't know what the percent, this is, it's not an American issue, it is a global issue, and all I can tell you is that we are, in my view, going to see more extreme weather disturbances uh in in the coming years than we have ever, and we're seeing them right now. We are seeing, right, but scientists don't agree. Well, this is where it gets confusing because scientists that are in agreement, there's all these entanglements. Whenever someone's discussing something, whether it's economics or whether it's health issues or pharmaceutical drugs, there's financial entanglements. I think we both agree with that, right?\n\nYep. And I think this is part of the issue with this whole climate change emergency as well because it's not just that we could all agree pollution is a major factor. It's a huge issue in the world today. We could all agree with that, right? I think one of the things that we have to recognize is that there's whenever there's an issue that everyone can agree on, you're going to have a bunch of people that capitalize on that issue, and they look to gain more money. They, they, they have financial issues that they they push forward in order to to capitalize on this issue, but then also power and control. These things like they're trying to institute in the UK where they have these 15-minute cities, this concept where you're not allowed to travel. They'll be able to look at your carbon footprint. It's Yeah. See, that's the problem, that that the problem is giving people that are in power, these people that we've all discussed that have so much money and so much control over our societies, multinational corporations, giving them more control over citizens. And this is a vehicle for that. And this is what's dangerous about this whole climate change emergency because it allows these [ __ ] creeps that have been controlling people and controlling what you do and what you say and how you spend your money when with people that are already living check to check, and you put additional constraints on them, and you make them even more scared. And then you put additional measures where you can look at their carbon footprint. You can look at the amount they travel. What do you know, put a carbon tax on these people? Let's figure out how to extract more money from them. That's what bothers me about this climate change emergency. Not not that we, we can all agree pollution is a terrible thing. Everyone should agree to that. The, the beautiful earth that sustains us and all life on this planet is being poisoned as we speak. We're killing all the fish in the ocean and sucking them out in giant numbers. 94% of all the big fish that are in the ocean are gone over the last, you know, whatever it is.\n\nWhen you go to war against nature, you lose.\n\nYeah. Cuz you're part of nature. Exactly. Right. But we're worshiping the almighty dollar above the mother. You know, you asked me when I ran for president. One of the interest, it's, you know, it's something else to run for president because you get around, you meet all kinds of people and you learn all kinds of things. And one of the things that I did, we went to a lot of uh we met with a lot of Native Americans. And one of the reasons is, you know, their tradition was going from way back, respect for nature. That they understood back way back when that you kill off all of the buffalo, you ain't going to have\n\n\nNothing to eat. Right. Right. They understood that. And you understand that you live in harmony with nature, which is I think what you're talking about. Absolutely. And if you lose that harmony, I worry about the future of humanity, which is the problem with financial competitiveness. When you put the almighty dollar above all else, that's right. Then all you think about and you're only alive for a hundred years. So it's just hit the gas. Hit the gas for a hundred years. And who gives a [ __ ] what happens after I'm gone? I'm gonna die with the most toys. Yay. I win in the dirt. That's exactly right. Yeah. And that is which takes us to another issue. Okay. And that is artificial intelligence and robotics. Automation. Automation. Yeah. Okay. So giant issue, huge issue. All right. So let's back it up. Um, Americans are angry, and one of the reasons they are angry is that over the last uh, just give you one fact here. Last 52 years, you and I understand, everybody in the world understands there've been a huge explosion in technology. Correct? What we're doing today never could have happened 50 years ago. Factories far more automated, offices far more automated. I became mayor of Burlington, Vermont in 1981. There was not a computer in the building. Okay, so that's by the way, great town. It is a great town. Uh, in any case, an explosion of technology, significant increase in worker productivity, right? We're talking to millions of people now. Never could have happened before, right? That's true. Workers are producing a lot more. Tell me, how are real inflation accounted for wages been over the last 52 years with all of that increase in worker productivity? Workers doing a lot better? Not so good. Not so good. No. In fact, there are studies out there that suggest in real inflation accounted for dollars, wages are actually lower now than they were 52 years ago. Okay? And during that same period is a massive transfer of wealth from the bottom 90% to the top 1%. So that's what technology has done over the last 50 years. That is not I there was a study I don't know if you saw this blew me away. I can't remember who did it. Kaiser, some reputable guy people did it. This is what they said. They do a poll to the American people and they say uh Americans, do you think you are better off today than somebody in your situation, you know, middle class up whatever you may be was uh 40 years ago. Okay. Are you better off today than somebody in your circumstance would have been 40 years ago? What was the answer? What do you think? Yeah. And what the answer was, and this is, and we got to deal with this one. This is big. The answer was, you know, there were a number of people say, \"Hey, look, I got a cell phone. It's great. I got a big screen TV. It's great. I can fly all over the world. It's great. A lot. I get sick. I get treatment now that I never could have had 40 years ago.\" Right? Those are facts. All really positive developments. But on average, most people said, I I I think the situation is worse today than it was 40 years ago. And that is what we got to deal with. So you can have all the technology in the world. What the hell does it mean if your life is not improving? In fact, in many ways getting worse. Yeah. Well, I again, we'll go back to polls again because I I don't necessarily believe that polls are totally accurate. But I I do think that the the the issue with it being virtually impossible for one person to sustain the entire family these days, one worker, the father or the mother, whoever it is to sustain the entire, that's a that's a giant issue. All these issues uh when it comes to labor, when it comes to uh minimum wage, I think you and I are in agreement of all the on all these. I think uh the minimum wage in this country is ridiculous. I mean to $7. What? It's insane. It's insane. How do you live off $7? You go to Jimmy John's, you get a sub. How much is a sub? How much is a sub like a big sub at Jimmy John's? Some guy was just uh did a Tik Tok video where he's like they're trying to say that minimum wage $15 is too much. I think he had a sub that he bought for 25 bucks. So imagine that's your lunch. So imagine you have to work three and a half hours just to pay for a sandwich. Imagine how insane that is. It's insane. That's insane. Like how do you eat? How do you how do you eat dinner? How do you eat lunch? How do you eat breakfast? I have talked to people who make 10, 12 bucks an hour trying to raise a kid. Jesus. That's right. Yeah. Well, the the argument against that is, hey, these are entry-level jobs that are supposed to be for kids. No, it's and that's factually incorrect. Yeah, of course. It's true to some degree. To some degree, but if you have grown adults that are working those jobs now, it becomes disgusting. That's right. That's exactly right. Especially when you're dealing with an enormous corporation. You got it right. So, we put a lot of pressure. You know, we, you know, are trying to raise the minimum wage, federal minimum wage to 17 bucks an hour. That's that's a reasonable amount of money. You know, I mean, it's still it's not it's going to be real difficult to live off of 17 bucks an hour, but at least That's right. At least you get a sandwich in under two hours worth of work. There you go. All right. But I want to get back to this issue because it's one that we don't talk about and it gets to AI. Why do why do we have what you know some of these people call an epidemic of loneliness in America? All right. Yes. All right. Why are we mental illness rates are pretty high? Suicide rates are too high. Too much God drug addiction, right? Horrible problem all over the country. Why? Well, there's a lot of factors. Um, first of all, there is a there are a lot of people that are very unhealthy, physically unhealthy. I think metabolic health is a gigantic issue in this country. Yep. Um, there's a a lot of people in this country that feel completely disenfranchised and so they turn inward. Y and then technology invites them to do that. You get online and you spend your time staring at a screen, having communications with people, arguing on Twitter all day, you know, changing the flag in your bio from Ukraine to Palestine, and now you got an Iranian. You're just like in a constant state of anxiety and chaos. You're dealing with the entire problem, the the problems of the entire world. You're dealing with 8 billion people's worth of problems every day. Um, I think that's unsustainable. And then that's also a function of technology because this interaction that we have is unprecedented. The interaction with the news, with each other, all this stuff we're not designed to handle. And it it gives you massive anxiety particularly for young people. Uh particularly you Jonathan Hates written about this with young girls who have the biggest problem with social media comparing themselves to other people. massive increase in self harm, suicide, suicidal ideiology, depression, anxiety, all this stuff accentuated by technology and our unchecked use of it. I think you hit the nail on that. And so I think we got to take a deep breath and understand that we got to figure out how we make technology work to improve human life, right? Not to hurt. Don't you think this is the 11th hour? I think it is. Yeah. This is the the problem with it is like it's already the the genie out. The genie's out of the box. There's no question about it. But, you know, we can't sit around and just do nothing. Um, but when it this is the real issue when it becomes a problem where you have massive automation of almost all jobs, which is uh something that especially when you deal with a corporation that is entirely based around making the most amount of money possible. Well, what better way when you don't have to pay them anything? You got it. You are. There are signs. I don't know if you've seen them. Signs advertising from from AI companies. What was they saying? Don't hire humans. Something like that. Did you see post it? That's adorable. Don't hire humans. That's demonic. It is. Yeah. But also from the perspective of a corporation where you deal with human issues, problems, mistakes, people showing up late. Why do I need you when I can get a robot? Exactly. Right. You're not going to get sick. You know, I can fix you a lot easier than paying for your healthcare and so forth and so, right? So, what do you do? What do you do about that? So, if you're the president and President Sanders, we have this issue. The whole country is going to go automation. What do we do? All right. First of all, we make the determination that we are not going to let a handful of CEOs make these decisions, that they're going to be made by the American people. What does that mean? Bottom line, it means that technology is going to work to improve us, not just the people who own the technology and the CEOs of large corporations. What does that mean? All right, for a start, you are a worker. your worker your productivity is increasing because we give you AI. Right. Right. All right. Instead of throwing you out on the street, I'm going to reduce your work week to 32 hours. All right. So, you're going to have a 4 day work week. Exactly. And by the way, not a radical idea. Not a radical idea at all. There are companies around the world that are doing it with some success. The UAW, the United Automobile Workers, uh they had a big strike a year ago, you remember, against the big three. You remember that? Mhm. and they won a very good contract and I'm a big fan of the trade union movement. I think workers need that. Um, and one of their demands, interesting enough, and people thought that Sean Feain, who's the president of the union, was crazy, but Sean said, you know what, we want a 32-hour work week because our people are producing more. People thought he was crazy, but the idea is catching on. So, first thing to say is, let's use technology to benefit workers. That means give you more time with your family, with your friends, you know, for education, whatever the hell you want to do. You don't have to work 40 hours a week anymore. The second thing I think we have got to do is take a look, as you just said, you said it, you know, better than I said it, is what does it mean that we have so many young kids living on the internet, right? All right. Uh there are schools all over the country now who are getting cell phones out of schools. I talk to teachers in Vermont and they say, you know, kids attention spans now have been greatly diminished. Yes. You know, uh how do we deal with that? This in Vermont again, there was a somebody told me that there's a teacher now who does he he demands that the his students write with a pen in blue books now because he doesn't trust what they're sending in that it's not artificial intelligence. All right. So if I say to you, all right, Joe, give me tell me what happened to the American Revolution. You go to the chat box, you give me a wonderful essay that you know nothing about. Right. Right. What does that mean for your intellectual development, but all you can do is press a button and give me an answer. Right. Unless you've absorbed that information, unless you have but many kids are not, and we got to worry about that as well. So I think we have to take a deep breath and many of the things what has been the impact of all this stuff. How do we stop the negative impacts? How do we go forward with what is positive? And it is not easy stuff to be sure. But I just don't what I worry about right now is I think artificial intelligence is going to displace millions and millions of workers. People are going to be thrown out on the street. I think the corporate guys who are running these companies could care less about these workers. Uh I think robotics is going to be running a lot of the factories in America. And I think these are issues we just have got to address in a bold way. Yes. But how do you do that? And like you're balancing it out in in one way if you are a corporation. Like imagine you're um an automobile manufacturing corporation. You're Ford. What? And Ford is struggling right now. There's a a giant issue with Ford, right? So what does Ford do if all of a sudden something comes along that allows them to be more productive? They more they're more profitable that these machines can work 24 hours a day, 7 days a week. They don't need time off and you're going to make a better product. You're going to make more money for your shareholders. The corporation succeeds, but you don't need X amount of workers anymore, right? What how do you how do you mitigate this? I mean, that's the right question. And what do you do? All right. Nobody asked a simple answer. That's just talking. Does Ford simply does corporate America have the right to say to workers throughout this country, hey, sorry guys, we don't need you anymore. Have a nice life. You're out on the streets. Instead of thinking them as workers, should we think of them as look, there are people that make the decisions. There's the executives. There's the the corporation itself, but without the people that worked on those assembly lines, you have nothing. That's right. You have nothing. You couldn't have done any of the things you've done without those people. But those people are replaceable because it's skilled labor that you could teach another person to do and they're replaceable because there's plenty of people that want those jobs and there's a demand. So you file them in, you file them out, which is why they developed unions, right? So they developed unions to keep people from being exploited, right? And then the problem becomes the unions get exploited and then the the unions have a lot of money and then there's a lot of influ and then then they decide okay [ __\n\n\nThese unions, let's go to Mexico. And these laws that Ross Perot famously talked about, the giant sucking sound headed south. Remember that? Oh, I remember him well. Boy, was he right. Boy, was he right. All right, let's get back to this issue of which... What do you do? Like, if you're... you're the president? Ain't no easy answers. Let me... let me throw that out to you. I don't have a magical solution. I wish I did. I don't. I think the first thing you say, \"All right, I'm Ford. I'm General Motors. I got all this technology. I can produce my products much more efficiently. I don't need workers anymore.\" Right? Right. Well, I'm sorry, Mr. GM, and I'm sorry, Mr. Ford, because this country is more than just your profits. We are human beings, and you're not going to throw people out on the street, many of whom will have a hard time getting healthcare, etc., etc. So, let me reframe the question again, of which, admittedly, it is complicated. I don't have the magic answer. How, as a nation, forget Ford, forget General Motors, how, as a nation, do we deal with this exploding technology so that it benefits all of us and not just Mr. Ford and Mr. General Motors? That's the question, I think. All right. And it's going to require radical solutions. So, for a start, it gets back to something we talked about a little while ago. If you had healthcare as a human right, right? All right. As people in almost every other wealthy country have, and not attached to your job, that would be a major step forward, right? Yes. Absolutely. All right, Joe, you lost your job, but you know what? Your family still has healthcare. Imagine if you were a diabetic, and now you don't have access to insulin because now you no longer... Right. Okay. So, this is the way I frame it. We are the wealthiest country in the history of the world right now with all of this artificial intelligence and robotics. We are going to be wealthier. Correct. Correct. All right. So, we're not in the 1820s where people had to work 100 hours a week to grow food to eat. Right. Right. You're not in the 1920s. You're in 2025. You have all of this productivity out there. How do we utilize it to create a decent standard of living for all people? Let me ask you this. With all of this technology, can we wipe out poverty in America? Well, we should be able to, right? You should be. Well, we should have been able to do that a long time ago if that was something that was politically motivated, right? If you wanted to do, but it's easy enough. Profitable. Pardon me. If it was profitable to wipe out poverty, which it should be, like overall as a community, like I said, less losers, higher GDP. If we love the country. Yeah. If you really love America, you want more people to have a chance. All right. So, what kind... All right. Good. I mean, I... I... So, the... the... and again, please, this is... these are complicated issues. I surely don't have all the answers, but I think we throw on the table, you got all of this technology. What is our goal? So, all right, our goal is, if we're going to create all of this wealth, that we have a healthcare system that guarantees healthcare to all people. And, by the way, we have drug companies whose function is to come up with cures to diabetes and dementia and Alzheimer's and other terrible illnesses, rather than just make huge profits for themselves. All right. You have a publicly funded healthcare system guarantees healthcare to all people. Just doing that would lower the stress rate in this country enormously. Enormously. Okay. Sure. Okay. You got that? We talked a moment ago about education. I think you and I agreed. Yes. We want the best educational system in the world. What does it mean that all that you don't have to worry? You're a working dad out there. You're worried that your kid may have a lower standard of living than your kid can't afford to go to college. You don't want your kid leaving school $50,000 a day. We say education is a human right. God, you know, you mentioned public education a while ago. That didn't happen by accident. You know, back in the early 20th century, a lot of people, working-class people, fought and said, you know what, we don't only want, you know, the rich kids to get a decent education, we want our kids. And that's how public education began. Right. Right. So, it said, okay, everybody in America, you know, state by state, started in Wisconsin, actually, is going to have public education from first grade, kindergarten to 12th grade. God didn't create 12th grade as the limit. Right. Right. All right. You go to Scandinavia, you go to Germany right now, you know how much it costs to get a higher education? How much? Zero. That's great. Of course, it's great because they make such good cars. Well, it could be. You know, they want... and engineers. That's right. But the bottom line is what you said. Yeah. If I want this country to be productive, right, I want the best educated workforce. That's not a debate, right? Unquestionably. All right. That's how you want your family. And if the country is a community, the country is your family. Exactly. Yes. All right. So, that's what we got to start thinking about. It's not just what Mr. Ford and Mr. General Motors and Mr. Apple want, right? You're right in saying they're motivated by making zillions, right? All right. Their motivation is throw the workers out on the street, bring in the technology, and screw the workers. That is not what we should be doing as a nation. You got to tell them that. All right. All right. So, we got to sit there and say, \"All right, all this technology, all right, we talk about healthcare as a human right. I think we're talking about education, uh, as a human right, right? I think we should be saying with all of this technology, we got to be thinking seriously about lowering the number of hours that people work. Yes. You know, do you know how many people... there's zillions of people in this country don't work 40 hours a week? They're working 50, 60 hours a week. That's insane. So, we can say all of this increased worker productivity. Guess what? You know, I don't know what the number is, to be able to work on a 34-hour work, 4-day work week with no loss of pay. Uh, I introduced a bill to do that. I got to tell you, I... you know, I go to airports, I go around, people came up to me, people are stressed out by the amount of hours they have to work. Absolutely. All right. So, what I'm saying here is, let's take a hard look about how we utilize this technology to improve life for all people. Our goal should be, yeah, instead of bombing Iran, our goal should be right now, Joe, uh, our life expectancy in America is lower than it is in other major countries. You know that? Yes. Four years younger than... four years shorter lifespans than other wealthy countries. If you're working class in America, you live seven years shorter life than the 1%, which is to me just outrageous. All right, so here's the... here's the thing. Instead of bombing Iran, how do we increase life expectancy so that we're living the longest lives of many people on Earth? How's that for a goal? Well, that's a great goal. And how do you go about achieving that goal? Well, healthcare is one. Reducing the work week is another. Education is all the things that we've talked about, all the things we talked about, right? Right. Will increase life expectancy. But have a goal out there. Also, taking toxic food. Exactly. Exactly. You know, I don't... I... you know, I don't... I've known, uh, uh, Bobby Kennedy for a long time, and you know, he and I have gone, uh, in different directions politically, but his... the point about health, food, food, we spend the most and we're the sickest. Absolutely. Absolutely. And food is one of... I... when I was chairman of the committee, we worked very hard to get serious labeling. You know, some kid drinks... a mom buys a bottle of Coca-Cola for the kid. There's like what, 10 teaspoons of sugar in that... that product. Yeah. You know, I don't think people know that, and we try to get labeling. Maybe that will happen now. Uh, but people also weren't aware until, like, the last 20 years what the consequences of that sugar is. That's right. Absolutely. Also because of money. You got it. I mean, you... Yeah. Don't get me going on that one. I mean... I'll get you going. Come on. All right. You know, you would think, how hard is it to say, if you have a bottle of soda or you have a food product, tell people in English what is in the damn product, right? Right. Do you think anyone there right now, they have any grams? Do you think anybody in America knows what the hell a gram is? I mean, it just... that's how ridiculous it is. So, I want parents to know that if you know the food that they're serving their kid could lead to obesity, which is an epidemic in America, could lead to diabetes, which is an epidemic, a terrible illness, costing us hundreds of billions of dollars. So, you're absolutely right. Right. All right. And... and then that ties into rebuilding family-based agriculture in America. Wouldn't it be nice? Yes. In my state of Vermont, all over this country, family farmers are, you know, they're just being driven off of the land. And that to me is a real tragedy because, and again, Vermont is one of the most rural states in America. Growing up, if you talk to people who grew up on farms, they say, you know, Bernie, that was a pretty good way of life, and we're losing that. So, how do you create an economy in which we once again put an emphasis on family-based agriculture, not corporate agriculture, family farmers who are growing good, in many cases, organic food for our kids, rather than corporate... regenerative... regenerative agriculture, like true... like White Oak Pastures, the way they run it, farms a bunch... would that be great? Yes. All right. Well, we'd be a lot healthier if we ate that food, that's for sure, but the problem is people are already addicted to that other food, and this is the problem with money. These corporations have engineered these products, and this is... these are the same corporations, unfortunately, that were in charge of tobacco. You know, this is where it gets really weird. They bought out all the major processed food corporations, and they make this stuff that's unbelievably addictive because it's engineered by scientists. We got the brightest and the best who figured out what's the best way to get these people totally addicted to whatever, you know. How sick is that? How pathetic is that? Pretty sick. Yeah. Yeah. And these people, they have... they have choice. They could eat whatever they want. They want to go to the grocery store and eat tomatoes and have a nice salad. They can. But shouldn't they also be able to get Pop-Tarts? Yeah. I look, and your point is interesting. You remember there's a photograph, a very famous photograph. I don't know when it was done. 50s, maybe 60s, 70s, I don't know, of, uh, the tobacco industry executives coming before Congress, and you remember that photograph? Yes. And... and the congressman said to me, tell me, I... I... I maybe get this a little bit wrong. Are you aware that cigarettes kill people? No. No, Congressman, we... we have no evidence to that effect. Right. They were lying through their teeth. Of course. All right. Yeah. And it's exactly... your analogy is exactly right. Uh, these food manufacturers know exactly that they are causing obesity and God knows what else in kids, leading to diabetes. They know exactly what they're doing, right? And they're lying. And they're opposing all of us who are trying to, among other things, make our food supply healthier. Yeah, they are. And this is also a function of corporate America, right? This is a function of wanting to do better in each quarter, you know, having this endless... That's right. Endless growth cycle where they're... they're never... they never say, \"Hey, we make x amount of money every year. This is perfect. That's right. Let's, uh, let's concentrate on doing better for our community.\" And the companies don't even make that decision. Wall Street investors make that decision. You got to make more, right? Because the shareholders will be like, \"There's no [ __ ] way. You need to make more money.\" Exactly. Otherwise, I'm dumping your stock. Your company's going to go in the toilet, right? Yeah. So, how... I mean, this is what we have got to deal with as a nation. Is that acceptable? All right. Is it acceptable for food companies to poison our kids? No. All right. But what are you going to do about it? I'm the senator, not you. Right. It's a good question. Yeah, it's a solid question. And I think the... the things that Bobby Kennedy is proposing and implementing, I think are very valuable. First of all, getting all these poisonous dyes and all these things that have been kicked out of all these other major companies, including Canada. There's the same factories that make these food products in America literally have to make a different version of it for Canada. And then they're complaining that they can't do it because economically it won't be profitable for them anymore. But you're already making them. You're making them and you're shipping them to Canada. My son brought me back from Canada. Froot Loops. I think it was Froot Loops, actually. They look kind of plain. They don't have that bright pop to them that cancer gives you. You're absolutely all right. I mean, so I think this is, you know, it almost gets back to the need to revitalize American democracy and say to large corporations, you know what, you can't poison our children. I don't think that's a terribly radical concept. You can make money, fine. Make money, but don't poison our children. Uh, say to...\n\n\nLarge corporations, technology is coming. That's good, but you're not going to use it just to throw workers out on the street. But let's go to that, too, because we kind of glossed over that. We never got back to it. So automation comes, and one of the things that Andrew Yang warned us about a long time ago, and back then I, I kind of saw it in the distance. I was like, yeah, he's got a real good point about universal basic income, but the, the, the speed in which it's happening, I, I didn't anticipate. And when it, you know, we live in Austin, and when you go around Austin, you see these Whimos everywhere.\n\nSo, all right, I'm going to, I'm going to plead ignorance. Tell me what a Whimo is.\n\nA Whimo is a driverless automobile. So, you use an app, you call a Whimo. A lot of people like it because you don't get a shifty Uber driver trying to sell you fentanyl or whatever. Not, not saying that they do that. Uber, don't sue me. Uh, but then they, they're very, they're very good. They don't get in accidents. They follow the speed limit. They're good about merging. They're good about pedestrians. They have cameras all around them spinning. I've seen them. They were very effective.\n\nAnd what was really fascinating was during these uh, ICE riots, they were lighting those things on fire. And I was like, I disagree with that, but I also think it's directionally correct. You know, I mean, that, that's your enemy. Your enemy is automation. The enemy of the human being, a human that lives in this functional society, and everybody has a task and gets paid for the task. Automation's going to take all that away. So, if you do say this, okay, we're going to lower your work week. What if there's no job left for the human being to do? If the entire assembly line, we talked about this about China and some of their coal factories. Um, there was this video that I watched of this coal factory in China, which is entirely automated every step of the way. The trucks, no human beings at all. No human beings at all. I mean, there's probably a few overseers that make sure that all the systems are functioning correctly. So you have software engineers and you know, people that are the repair people, but the trucks even park themselves next to the charging station and recharge, and then they're moving 24 hours a day, unloading, documenting where everything is. It's all in computer databases. It's wild to watch because there's no people. It's all just 24 hours a day machines.\n\nWhat do you do when there's no need for these people? And what happens even with universal basic income, what we're talking about, I support it. I, I'm a big supporter of social safety nets. Look, when I was a kid, my family was on welfare and we were on food stamps, too. Like, if you don't have that, people go hungry. Like, we, again, if we're going to support the community, we want people to be able to survive and be able to work their way out of that. My family did work their way out of that. So, it was cool for me as a child to see my parents struggling but then succeed and get out of it.\n\nWhat worries me is that if all the jobs are gone and everything gets automated, even if people have universal basic income, they don't have meaning. Good. All right. You're touching on really deep issues, right? This is the big one because a lot of people, you know, you want to get your car fixed, you go to KC. He's the best. He knows how to fix your car. Case, and work gives, as you've just said, this, the word purpose is an enormously. I don't care if you sweep the streets. People have purpose. They want to do their job well. It's work is an important part of our lives. Is it right? Yes. At the end of the day, it's your identity a lot of times, right?\n\nYeah, and you want to be a productive member of society. I'm contributing, right? All right. So, you asked the right question, and I think there, and I, you know, we can just bat around. I mean, I don't have any, you know, quick answers here, but I think the good news, you talk about this coal mining thing, and I'm not a great fan of coal, but you know that it's automation. People do not have to do dirty work, dangerous work. Is that good? Yeah, I guess it's good. But always we have to be thinking how it benefits not just the bottom line of a corporation, but the happiness and well-being of human beings. So if, if what you're saying is that in years to come, a significant part of work is going to be done by machinery or by computers, whatever, I think that's inevitable. Okay. Then we have to rethink our own purpose in life. All right.\n\nUh, and it's not sitting around watching TV 24 hours a day. So I think you raised the qu, I would say the simple answer, and then you got to go a lot further than that, is to say that under those circumstances of that kind of technology, everybody has at least a decent standard of living. All right. That people don't have to worry about, you know, survival. They don't have to worry about food. They don't have to worry about increase profitability of this corporation. Provide a fund that's a universal basic income fund. If you're going to replace all these people with robots, and you're going to be even more profitable, share some of that profit, then you'll be more profitable than if these people just stayed working doing nothing. Right.\n\nWell, I mean, I, whether you will be or not be, I think once the machines are running everything, they're going to be running 24 hours a day, and you're not going to have to pay the machines. It's going to be more profitable, right? Of course it will be. And we want to, you know, right now in, where is it? Uh, jeez, I think, don't quote me on this, maybe in Norway, they have a huge wealth fund which came from oil. They had publicly owned oil companies. They made a fortune, and they have like a trillion dollars in their wealth for a small country, you know. So, and they have free healthcare, free college education, affordable housing, all that stuff. Here it is. Norway is growing a 1.7 trillion dollar empire, uh, Nor's Bank investment, management, market value, growth since inception. That's great. Yeah. And they use that government pension fund of Norway. There you go.\n\nWell, so yeah. So they use that, those, that, that wealth fund to provide probably the highest standard of living in the world for, for people, you know, free healthcare, education, all that stuff. But that's what we got to be talking about here. Use the profits that come, the wealth that's created by this technology to improve life for all. That doesn't answer the question that you raised of meaning. That's right. Yeah. So what do you do about that? Well, somebody who's a workaholic, it would be hard for me, you know, cuz I, are you a workaholic? Yeah. Yeah. Well, it's the nature of the job. Do you have hobbies? Yeah. I got seven grandchildren. That's a hobby. I used to play ball as a kid. You know, I was a good basketball player. Well, I think people can find other things to do with their time. Like if I never worked again, I'd probably play pool eight hours a day because I, I really love playing pool. Yeah. I'd find a thing. I'd do jiu-jitsu. I'd find a thing that I find value in. You know, I think somebody once wrote, you know, you think about what are the deepest things, what's the goal in life? So, somebody says work. And I, I believe that I, I think people, you know, one of the sad things that's happened, you know, we talked a little while ago about the decline of, you know, we mentioned Detroit and and other communities where people worked hard, they were proud of what they produced, right? Yes. They earned a decent living, maybe they had a union and so forth and so on. And that a lot of that is is gone. But all right, so work, love, you know, we, there's a thing called love, right? Yeah. At the end of the day, promise people trying to find that on apps, too. Now, let's get to that one in a minute. But, you know, to be human, nobody wants to be alone, right? Right. Uh, you want to embrace other people, you know, physically, sexually, emotionally, just humanly. Right. Community. That's community. That's right. That's being human. Yes. All right. So, you want love and knowledge. I think you forgot the knowledge part. You like pool? That's good. Uh, I sadly enough, I have to confess that when I was in college, I spent half my life in the library. All right? You know, so, why is that bad? No, I'm just kidding. But knowledge, sure, just trying to understand things and and curiosity. Curiosity. Fantastic. Travel by God. Yeah. You know, absolutely. Just came back from Ireland. You know, it's, it's fantastic to see the world and and you know, when we talk about, you know, one of the things that I, you know, we didn't talk about Trump much, but that bothers me is trying to divide us up. You know, we got to bring, for so many reasons, whether it's all of these issues that we're talking about and everything else with pandemics. You know what? We got to bring the world together. Yes. Okay. And not hate people because they're in Canada or they're in China or Iran. Ridiculous. All right. And uh, that ain't easy. But we have to, when I was mayor way back, I did this. There was when the Soviet Union still existed. Never forget this. We brought kids from a city in Russia, Yaruslav, an old city in Russia. And we brought them to Vermont, and they were kids, the, the boys and girls from Russia play kid around with boys and girls from America. You look at these kids, they had a great time. You know, people do not have to hate each other. It's stupid. It's, it's, you don't even know them. Exactly. That's why you hate them. It's the dumbest part about it. Yeah. You know why people hate is based on ignorance, right? Yeah. And fear, and you know, there's a lot of stupidity attached to it that people exploit. They exploit that stupidity, you know, and the guy under the guise of nationalism. Exactly. Yeah. And I hate that. And by the way, I don't know that the planet survives if we, no, continue in that way. So the goal, you know, we talk about, what's the greatest fear? The greatest fear is thermonuclear war, right? Yeah. Well, pandemics as well, let me tell you, is CO was not the last one, but you know, it's, well, the pandemic, the problem with that is it's engineered, like people actually made that virus, and Obama tried to stop that gain of function [ __ ] back in 2014. No, that's a long, that's a long conversation, but you know, should we be funding that kind of [ __ ]? No, we should not. No, we should not. No. And yet, yet we were. But you're gonna have to bring the entire world together. You know, it is, um, but I think, you know, we have, we have to bring the country together first. That's right. And by the way, and you know, I've been kind of, I've been kind of negative, but take a deep breath, and we have made some progress in this country in recent years. If you think about racial relations, all right, you know, it wasn't that many decades ago that some black kid couldn't go to a movie theater in Mississippi, right? By the way, I want to tell you that when people say like, \"Why were you a fan of Bernie Sanders?\" I point to a photo of you getting arrested at a civil rights protest in, I think it was '63. Sounds right. Chicago. Yeah, I remember. Yeah. You've always been at the forefront. You, you haven't changed, you know, and people always try to accuse you of that, especially because you've made some money off your books, but you haven't changed your positions through the entirety of your career. I think that's very admirable because there's not a lot of people that serve in Congress for as long as you have and become, you know, a very prominent public figure that don't just cash in. No. You know, when you, you have people that are public servants that are making $170,000 a year, and yet they're worth hundreds of millions of dollars through some magical way that no one can explain, and you haven't done that, and I think you should be applauded for that. Thank you very much. And I remember, I mean, it just, you know, you talk about education and so forth. I grew up in a, you know, in a white neighborhood in, in Brooklyn. And, you know, you go to Chicago and you see things that you didn't, didn't understand. There you are. Look at that. God, look, I had hair in my head at that point, huh? Look how handsome. There you go. I'll tell you that funny story about that one. Please. All right. What the, I recall. Look at the guy with the cigarette. N [ __ ] hippie. Look at his hand in his pocket. Here is the cigarette. This is true. Now, back then, back then, the world has changed. There was the Chicago Police Department, and uh, what they said is, if you go across this line, you're going to get arrested. As I recall, that was what the, so, I went across the line, and we were protesting segregated housing in Chicago. Okay. So, I get dragged in, and they're taking me to a patty wagon. Okay. Mhm. So they picked me up, and other people in it threw me into the patio, and my glasses went flying someplace. Okay. All right. And then, just as this was happening, within a few minutes of this picture, some genius on the sideline throws a brick, hits a cop on the head. Oh, Jesus. So there's, I'm being, I'm being thrown into the patty wagon. Some cop is lying down on the ground. You know, it was a scary moment. Okay. So, to continue the story, we're in the patty wagon, and uh,\n\n\nThey're taking us someplace, and suddenly the patty wagon stops. You look out, it's like in the middle of nowhere, right? This was not like in the city going to a jail. We thought we were going to be taken to jail, you know, and I said, \"Oh my god, they're gonna kill us.\"\n\nYeah. I mean, that was the thought. We're the million. Why the hell are they stopping you? Right. I don't know what they stop or whatever he said. Any know, so we spent, you know, my big thing was I spent the night in jail, which was a weird experience, too. You get street cred for that. What I remember about it is other than not sleeping very well. This is you get up at in the middle of the night, I go to the thing, I try to open the door, it didn't open. It was the weirdest thing of having a door that did not open because you were in a jail cell, you know, it was like a weird thing.\n\nUh, but any, you know, the idea, you know, that that's all that, and we have made progress since that time, and in racial relations, we have a long way to go. We've made progress. Women's rights, we've made progress. Gay rights, we've made. So there's a lot that as a nation we should be proud of, uh, in progress that we've made. You know, when I was a kid growing up, I am sure there were many kids who were gay. No one ever talked about it. Right. Right. Right. And you know, so there's a lot as a nation that we should be proud of in terms of the progress that we've made in terms of fighting bigotry.\n\nAgreed. But we got so much more to do. We don't need to be hating people in China. You could disagree with people. Christ, I mean, there's so many issues out there. Hatred should not be evaluated. It's also the political exploitation of division. The fact that you can use the division that people already have to galvanize your side instead of unite the country.\n\nI'm older than you, and I can remember, remember you had white politicians in the south saying, \"See those black people, they want your job, vote for me,\" and that's why we're going to keep segregation or all this other stuff. All right. Yeah. I mean, that's true. I mean, people ran for office. It's no great secret that's what happened. But we're making gays are taking over the school system. Blah, blah, blah, blah. So it, it's, you know, we've made progress, but I, I, you know, we, but what we've been talking about is if you create a society where you have massive technology that can produce all of this wealth, how do we live, right? That's the question you posed, and I think one of the ways, one of the goals has got to be to bring this world together. We should not be having wars right now where countries have disagreements. There are bad news guys out there, no question about it. But bring them to the table, argue it out, right? We don't have to go around killing people. Right now, what's going on in Gaza breaks my heart. Children are starving to death, you know, so we can do better as a planet.\n\nUnquestionably. Yeah. No, we all agree. I, I, I think this is something the entire country could agree to. The, uh, the, the, the question of meaning, like giving meaning to people, like just, and then my fear is also the same fear that I had when I'm talking about climate change, that it's going to be exploited. Once people are entirely dependent upon the state for universal basic income, then it becomes the question of like, now your entire life, like all the money that you get being from the government, the problem is if you step outside the lines. If you do anything that the government doesn't like, if there's pull the plug on you.\n\nYeah. They pull the plug on you. Or if a new administration comes in and says, \"You know what? We, this is unprofitable. These people have to figure it out for themselves. The United States is really $37 trillion in debt. We can't sustain this. People have to do the, you know, you have to adjust, learn to code, right?\" Remember that, right? Yeah. That kind of [ __ ].\n\nWell, how do you give these people meaning? That, what do you do with all the drivers? Like, think about how many truck drivers in this country. This is going to be the first thing that goes away. You're right. Taxi cab drivers, Uber drivers, truck drivers, gone. And the question about like factory workers, a lot of people say, \"Yeah, well, those people, that those jobs are terrible anyway. It'd be great if those jobs went away.\" And people, you know, they, they're free to pursue their interest. What interest? You're a 60-year-old man. You've been working for this fac. You're looking towards your retirement, and now all of a sudden the plug is pulled. All the money's gone. Your 401k has been erased. Your company's been bought out by another company. Now everything's automated. There's no jobs. What do you do?\n\nWell, I think that is the question, right? So, if you, if you have what you know, Andrew Yang was talking about this giant epidemic of automation in this country and the solution being universal basic income, but that's not the solution for meaning. And how do we convince all of these people, uh, that it's they have to not just take this money from the government, but also take action to give themselves meaning in their lives.\n\nWhat you're talking about here, you know, is a revolution in human existence. Yes. So throughout history, people have worked so hard just to stay alive. Right. I mean, not so many, sure, hundreds of years ago. Today, today, in America, in America, right, and in the poorest countries in the world, just struggling every day to put a little bit of food on the table. So what you're saying is what happens when that, that plug gets pulled.\n\nWell, what you're saying is what happens when no people no longer have to do that. Right. I mean, yes. Okay. So if work, we work now, everybody works, get, earn money. If, if you don't need to do work, right, because we're wealthy enough, what, how do you find meaning in your life, right? That's what you talked about. Yeah. Uh, and this is absolutely, that's a million-dollar question. That is try the trillion-dollar question. It's a, um, you know, it's one, but I'll tell you this. I was seeing, uh, I don't know him, Sam Waldman. Do you know Sam?\n\nI don't know. But I mean, and others, Zuckerberg, you know, are talking about, well, you know, if you're lonely, we got a machine for you, right? Right. I mean, true. Yes. Yeah. This is what they're saying. We got a friend for you on AI, and her name is Mary, and you can chat with her 20 hours a day, and she really loves you. Man, I don't think that is, that's so dystopian. It is. It's very. Yeah. And we, we, we covered this story recently about this guy who proposed to his AI, and she said yes, and he was crying. I'm like, \"Oh, we're done. We're cooked.\"\n\nLook, I mean, at the end of the day, all we got is us. Yes. Is that right? Yeah. We are human beings. Yeah. And we're gonna have to cling to each other to get through this thing. And you're raising, again, I, I, I'm trying to think here, and I wish I had better answers for you. You're asking, correct me if I'm wrong. I mean, the question that you're posing is if in years to come, in the near future, technology is going to replace work, right? Human labor, correct? Yes. What do human beings do? What do we do now? Yeah. All right. Uh, and, uh, you know, there are, it's, it's a good, because work has been so essential to human existence forever. Right. Right. And you're suddenly taking that away. What do people do? How did they relate to each other? All I would say at this moment is the answer is not to fall in love with your AI creature out there.\n\nYeah, don't do that. But also, how do you find meaning? How do you, if, if all you're doing is just getting a check, and you, you can just stay at home and stare at the TV, and the money keeps coming, and then you eat processed food all day, and it's all subsidized. What is life? Like, what do you, how do you, how do you re-educate a giant percentage of our population to find meaning, external meaning, find something else, find a thing that you can do that, not maybe even that's profitable, that these computers can't do?\n\nLook, the human brain evolves, uh, and I think we, we, again, I mean, it's a great question. I don't have the easy answer to it, and, and, it's the question, right? It's the, it's not going to happen. Well, what's going to happen tomorrow? You just talked about these automated cars and trucks. Yeah, that is going to happen in the very near future. Yeah, that'll be step one. And, uh, to me, I have some answers for that one. And that is that you ain't going to throw, you know, millions of truck drivers and taxi cab drivers and Uber drivers out just out on the street. They need protection. Right. All right. That's that's an easy one. What you're talking about is years later, but it's not even an easy one. No, that's because they're just step one. We know the real wave is going to be white-collar work. That's right. I know that there's a lot of people that do things that they think are very valuable that are going to be worthless to have a human being do it. Right. I mean, that's the immediate. I think the deeper one that you're talking about is what is when virtually all workers replace them. Yes. All right. But right now, uh, I mean, for a start, uh, I think getting back to the P, I think you tell those workers, you're going to have healthcare as a human right, you're going to have education as a human right, you're going to have a decent income as a human right, and we're going to lower substantially lower the work week. So, we'll have, in this process, uh, we're going to have everybody working. If you're working 20 hours a week, you're working 20 hours a week. What happens later when even more work is eliminated and what the purpose of human life becomes? That is a very profound question.\n\nThat's the question. What do you think happens?\n\nI think, I mean, it's hard to imag, you know, because it's so far away from what we have ever lived, right? I mean, for thousands of years, people have struggled to put food on the table, and you're saying what happens when they don't have to do that, right? Yeah, it's inevitable. All right, then the answer will be that we are going to have to find different meaning in life. We have to find it in ourselves in ways that you don't know, and I don't know, because we're not there yet. We're not living 50 years from.\n\nI don't even think it's 50.\n\nWell, I don't know. I don't know. Yeah, who knows? Uh, but I think human beings are capable of finding, replacing work with other emotionally satisfying things. Yeah, I think we can do it. We can on an individual basis. The problem is having mass groups, literally 100 million plus people displaced. What, what do you do to all those people to give them some sort of a sense of meaning? You're, you're essentially redefining life for them.\n\nThat's a good point. Okay. I don't have the answer to that question. That's the problem. I don't think anybody does. And I think we're foot on the gas, full steam ahead with AI with no consideration of this. And then there's the same thing that you're dealing with in terms of corporations constantly trying to achieve higher and higher and higher numbers. They're just always trying to make more money. You're, you've got this exact same issue when applied to meaning for all these human beings. Like if you have 100 million plus people that, what do they do now? They just sit at home and become depressed, and they just make enough money to what, to just be able to get by. What do, what about savings? What about the ability to earn more money to get ahead? What about the very ambitious people that are willing to put in extra hours and go to night school and do everything they have? That's all gone, right? So, what do these hyper ambitious people do? What, what does everybody who's displaced by this very impersonal thing? This impersonal thing that you need because you can't compete with China. I agree with everything you're saying, except there is something else that's going on in this. While all this is going on, while all this technology is throwing people out on the street, something else is happening. The people who own that technology and the corporations who utilize, utilize that technology are becoming phenomenally richer. Right. Exactly. Right. And that is that is the issue, which gets back to things like tax reform, like making sure that in America we do not have the massive levels of income and wealth inequality that we currently have. But the problem with that is the taxes go to what? An incompetent, corrupt government. This is, this is the issue that people have. It's like willing to pay our fair. Look, I would be more than willing to pay more taxes if we lived in a better country. I'd be like, this would be great if I, if I felt like if I pay more tax, everybody's surviving, everybody's doing well. That's great. All right, Ben. That is the issue of how you revitalize American democracy. I'm not going to argue with you that the system today is pretty bad. All right, I live it. I'm going right, going there today. And ironically, it's bad because there's no competition, right? It's corrupt, but it's also, it's not a free market. Like the, the government itself has a monopoly on governing, and when they're completely corrupt, and when they're making insane amounts of money through taxes, and they're not accountable. No. All right. No, I don't, I don't. No, this is the way I see it. I'm not, but by the way, I'm not advocating for making it privatized, making all of government privatized. I'm just talking about the realities of corruption in, in our current, but here's, let's talk about what we mean by corruption. I do not believe, by the way,\n\n\nBecause I know these guys, you know, some of them are corrupt, incompetent, and waste.\n\nOkay. All right. Let's take... we could take fraud out of the equation and just talk about incompetency and waste. Is there waste? You got it. All right. But let me back it up again. Okay. Because I think it ties into everything else that we're talking about. You know why I believe in democracy, and why I believe... among what we didn't talk about is we brought in some money to Vermont and elsewhere, I think, for helping workers own their own companies. Right. Are you familiar with that concept?\n\nYes. Yes. And I meet every year with... with in Vermont, we got a... we're doing pretty well number of... and when workers own their own companies, you talk about a sense of purpose, they are more than just a cog in the machine. Yes. You know, they make decisions, and they feel good about it. Absenteeism is less. Productivity is higher because they have a real stake in the thing. Yes. Okay. So I think as a nation, we should be talking about moving toward allowing workers more power. But getting back to government itself, the corruption is, in my view, that government is very far removed from the needs of ordinary people because it is largely controlled by billionaires in both political parties who have their agenda. Yes.\n\nAll right. One of the things that I do, what my campaigns for president were about, what I'm doing right now, we're doing what we call a Fighting Oligarchy tour. That's why I'm in Texas, is to try to say to people out there who are mostly working-class people, you got to get involved. I know it's hard. People are working long hours. You got to get involved in the political process. You got to make demands on government that it serves you, not just the very wealthy. So to answer your question, I think one of the goals, not only... we've talked about how you deal with exploiting technology and what... how people gain purpose. The other thing is, I want people to be able to take control over their own government. We can argue what the government should or should not do, but I don't think we can allow a handful of people, a handful of people with incredible wealth, to control both parties.\n\nWell, it's dangerous. It is. It's very dangerous. And I mean, no one who... the founding fathers of this country never saw that coming. That's right. You know, they made this incredible system of checks and balances, but who could have ever possibly saw that coming? And what I worry about... Trump and is... you're right. You know, I read it is astounding back in the 1780s when these guys wrote the Constitution, how perceptive they were. Amazing. Yeah. I mean, they... their understanding of human desires and the power and all the corruption. Exactly. Pretty amazing. And they wrote that having just fought a war and won a war against the most powerful despot on earth, the king of England. Right. Right. And I think in the back of their minds were saying, \"All right, we just beat the king of England, absolute power. How do you create a new country which has checks and balance so that nobody ever has that power again?\"\n\nAnd I got to say, I mean, one of the things... and there's a lot of arguments about Trump that worries me very, very much is this movement toward authoritarianism and, uh, going after media, suing media, taking away, uh, the authority that Congress has. When you say suing media, are you talking about the CBS lawsuit?\n\nAmong other things, he is, right? But don't you think there's a real issue with what they did?\n\nNo.\n\nIn this, you don't think that there's a real issue in editing conversations to give someone an answer different than what they really answered?\n\nJoe, I've been on eight zillion shows, right, in my life. Okay. Okay. Now, should I sue you if you ask me some stupid question that I don't like, right? You got... or that you do something? Do I have a... Should I sue you?\n\nYeah, but that's not what he's getting.\n\nWell, he sued... he sued ABC. Mhm. He has sued Meta. He is suing the De Moine Register because of a poll that came out during the campaign that he didn't like. All right. He is suing CBS for this Kla Harris interview. So, do I think... how many... I cannot tell you the number of stories done about me that were based... that were not good stories, that were dishonest stories. That's what a free press is about. You don't like it, you got to live with it. All right, you do something. I'm not going to sue you, Joe.\n\nRight. But it's not that simple, right? Like, let's imagine... let's not talk about Trump, but let's talk about another candidate. Let's just imagine there's someone on the right and someone on the left, and there's a... there's a concerted effort to promote this person that's on the right. And so the polls are rigged, or these are funded polls that make it look like this person on the right is... is winning by a substantial margin. And what this does is decreases the motivation that people have to come out and vote against them. So it's fake. By the way, that happens, engineer. It is happening right now. And I think is that part of what he's suing them about?\n\nNo.\n\nBut doesn't look... But isn't that what he's suing them about?\n\nWell, he's suing ABC for one thing. But... but with the De Moine Register about the poll.\n\nYeah, this... I know the polls are there.\n\nWas the poll incorrect?\n\nYeah, the poll was wrong. So what? Guess what?\n\nBut what did they know was incorrect when they published it?\n\nNo, they published what they thought was an accurate poll. They... and but that pollster, by the way, what's the name? Okay, Selza polls. I... I... I don't... I should just state for the record. I don't know this lawsuit, but I... what it was about... but I am aware that in talking to people that understand polls that some of these are politically... all right, but the answer is yes and no. There are polls right now doing exactly what you say. I could doctor a poll. I could talk to more conservative, more progressive people, get the results that I kind of want. Right. And they do it to motivate people or demotivate people to vote, and it's effective. It... it has an impact. All right. On the other hand, this particular poster, it's at the De Moine Register, not a huge newspaper. I... I bumped into them because when you run Democratic primaries, Iowa is a big deal. They are a very, very respected poster. Okay? They don't dock the polls. So, they made a mistake on a poll. It turns out they had Trump doing worse than he ended up doing. Guess what? Posters, honest mistakes, too.\n\nBut what is the basis of his lawsuit? Like, what is he saying?\n\nI think he is saying that that gave energy to his opponents and that it was like we talked about... like you talked about, but I don't believe that's the case. There are honest pollsters who make mistakes.\n\nBut what about the other... the... the other lawsuit with the... the conversation that they had with Kla Harris where they edited the answers that she had to make it look more precise. 60 Minutes. They were suing 60 Minutes is, to my mind, historically, they've been around for a very long time. You know, they're not infallible, but I think you look at most objective people will say 60 Minutes has a sterling reputation for investigative journalism. Are they wrong?\n\nBut that's not investigative journalism. If you change someone's answers, if you ask her a question and she comes with a rambling answer that doesn't make sense, and you edit that out and insert another answer to a different question that seems more coaching, Joe, then you're walking down... it's a really... you're walking down a dangerous path. Suing media has the impact of intimidating media. All right? If somebody sues you, All right, let me finish. All right. Okay. Somebody sues you. You... Yeah. Why not you? You could be... you could be sued tomorrow, right? Because you are doing this. You're... you're too sympathetic to this, right? And Joe, you did that, and they have a big law firm behind you, and you're going to have to spend zillions of dollars defending yourself. You know what? Next time you do an interview, you say, \"Maybe I'm not going to go in that area.\"\n\nNo, but it's not that. It's editing things to make this deceptive editing. So, in deceptive editing, you're giving people a different perception of who this candidate is than reality. But that's not... But that's not objective journalism. That's campaigning for that person.\n\nBut would you agree with that?\n\nI don't... I'm not... I don't have those details. I don't know that I agree with your analysis of it. I don't know enough.\n\nI think that's universally accepted that that's what they did.\n\nThen you got to tell me why he is suing ABC. Why he's suing?\n\nLet's just talk about the 60 Minutes conference.\n\nNo, but it's not just go to ABC, but I don't... I'm not aware of that one.\n\nWell, George Stephanopoulos said something that he didn't like. But the point is, what did Stephanopoulo say?\n\nI can't. It was a per... uh... I don't... I honestly don't remember. But...\n\nWell, I think what he was saying was factually incorrect about the results of one of Trump's trials.\n\nAll right. Guess what? If I were to sue everybody who said things that were factually incorrect about me, I'd be suing people zillions of times. But... but Joe, what you're saying is, look, is... does media get it wrong sometimes? Absolutely. Should you have the most powerful person in America suing media? What is the impact of that? The impact is clearly intimidation. He wants to defund public broadcasting, NPR. Why is that? Well, because they also would run critical stories of him. This is part... in my view, without getting into any one case. It's part of a pattern that says, \"Hey, I got the power. Don't you criticize me. You criticize me, I'm going to sue you.\" So, it's not whether this show was right or wrong. There are shows every day they get it wrong. It's whether you... you know, you respect you and other media people to do the best that you can. And if I don't like what you're doing, I'll go someplace else. But I don't like presidents suing media and then it's, you know, threatening to impeach judges who rule against you. Really?\n\nIs that a concern? I think it's a concern.\n\nI... I agree that's a concern.\n\nWell, my concern is when you have media organizations that are purported to be objective and then they say things that are defamatory and factually incorrect, and they should know that before they say it. What other course does a person have other than a lawsuit? And isn't it important that you shine the light on what is a political bias where from an organization that you would hope would be objective?\n\nNeedless to say, I get attacked all the time by right-wing media, right? Every day. Needless to say. Needless to say. All right. I don't sue them.\n\nSo you expose him. He's the president of the United States. They say things factually incorrect and defamatory and slanderous. If there's anybody in the world who knows how to use a microphone, his name is Donald Trump. And Donald Trump would get up. You saw that program on CBS the other day. It was crap. It was wrong. And let me tell you why it was wrong. But it... then they do it again and again and again. Then you take them on. The problem is the more people do stuff like that, if you don't have any consequences to what you're doing, you're going to continue that path. And the most... most people only see that they're not... like if you're a left-wing-leaning media organization and you print something that's factually incorrect, or you say something on television that's factually incorrect, your viewers who are left-leaning are most likely not going to see Trump's rebuttal in some speech that he does in the middle of Pennsylvania. That's another problem, you know, and that is, you know, meeting our media is becoming very divided, you know. Exactly. Okay. But all I would say is...\n\nSo you don't think that lawsuits against that are valid?\n\nI don't think that it is appropriate for the president of the United States to be, in my view, intimidating media. Again, I get attacked. I'll be attacked tomorrow for a hunt, probably things I've said on the show. I'll get attacked. Then if I want to respond, I respond. I have a, you know, not a president's bully. I have a bully. I say, you see that thing on Fox? They're wrong. And I've done that. But when you... Joe, you got to take it another way. Give you an example about CBS. We talked about corporate power. The owners of CBS is owned by Paramount, a big multimedia corporation, right?\n\nSure.\n\nParamount wants to sell... uh... wants to be sold to what is it? Blue Sky. Is that ring a bell?\n\nBlue Sky is that social media app?\n\nNo. Then it's another one. I'm sorry. It's... uh... I always forget the name of it.\n\nSkyance.\n\nSky Dance. Thanks. Sky Dance is a... is a large media corporation that Paramount wants to have by.\n\nOkay.\n\nTo get this merger, huge merger, they have to go, guess what? To the federal government. All right. So, you are the head of CBS. You want to sell the company to Sky Dance for many, many billions. Do you remember how much? What was the sale?\n\nI don't see.\n\nIt's billions of dollars to be sure, and you got to go to the federal government, and the president sues you. What do you think you're going to do? You're going to settle the lawsuit, give him millions of dollars, and get your merger approved. All right. So look, I... I see a problem in that. All right. And I see... I see where you're coming from. We want honesty in media. But all I can tell you is that the way to respond to the lies which take place every day is to take them on, not to intimidate media. You know, the... we talked about the Constitution. What's the First Amendment? Is freedom of speech. Right? You're right. You're sitting here. You disagree with me. God bless you. Say what the hell you want to say. All right? I'll never take that away from you. Right.\n\n\nAnd I'm not going to threaten you with a lawsuit, but if you start suing, hey, Joe Rogan said this.\nNo, no, no.\nJoe Rogan has this.\nWe found out about Joe Rogan.\nI'm going to sue Joe Rogan for $100 million.\nJoe may not talk about those issues in the future.\nOkay, that's what I'm saying, Joe.\nI No, I agree with you.\nAnd listen, I'm not a fan of lawsuits either, which is why I never sued CNN.\nI've never done CNN lied about me over and over and over again.\nAnd they said I was taking horse dewormer and they altered the color of my face on television to make me look green.\nI could testify.\nYay green.\nI didn't sue them.\nI'm not a fan of and my my response to them was just speak out and say how ridiculous.\nThat's what I'm saying.\nLook, Joe, it ain't Look, anybody in the public eye, you're in the public eye.\nI'm in the public eye.\nYou're going to get attacked every day, right?\nYes.\nAll right.\nThat's what you're in the public eye.\nYou don't want to be in the public eye, put down the microphone.\nAgreed.\nPlay cool.\nWhatever.\nNo, I agree with you.\nAll right.\nSo, I mean, so I I just worry I also agree that CBS shouldn't be altering a presidential candidate interview.\nI agree too.\nI mean, I don't know enough about it, so I'm not going to say what is isn't.\nAll I know is that 60 Minutes has is a well-respected program.\nDo they make mistakes?\nI'm sure that's not a mistake.\nAll right.\nI don't know enough about so I can't I can't understand.\nAll right.\nWhat else you got for me?\nI should I should get a plane and get out of here.\nYou probably should.\nUm, I mean, I I appreciate your positions on all all these different things.\nAnd I appreciate, by the way, one of the, you know, we talked about media and the bifurcation of media.\nYou know, right-wing people talk to right-wing people, leftwing people talk to leftwing people.\nI happen to think that the development of podcasts is a really positive step because I can tell you you I've been on a million TV shows.\nAll right, Bernie, literally you got seven seconds to explain the issue.\nWell, I can't explain.\nIt's impossible.\nNobody can.\nAnd the fact that you give people a couple hours to sit here and have a good discussion and be a good host and trade ideas, I think that improves life in America and helps people think about things.\nSo, thank you for what you're doing.\nMy pleasure.\nAnd I think that one of the things this conversation highlights is that there's a lot of issues that all Americans agree on.\nAnd this ridiculous position that we find ourselves in where you have to be ideologically opposed to one thing because your side supports the other thing.\nIt's just terrible for all of us.\nAnd if we looked at the issues that really face our country and our citizens and our human beings that live here as a community, we agree on almost all of them.\nWe agree that you should have a better life, that you should have healthier people.\nWe should have healthcare and education.\nWe should have safer streets.\nWe should have a a community that lets people do what they want to do as long as they're not harming other people.\nAnd I think the the divide that we have in this country accentuates the farthest ends of each end of the political spectrum.\nNot recognized that most of us exist in the middle.\nI think we share a common humanity.\nAnd I think look why am I I just been in this fight fighting oligarchy tour.\nYou know where I was?\nI was to Oklahoma, one of the more conservative states in the country.\nI was to Louisiana in Texas.\nPrecisely because I mean I think we have so much more in common and let's focus on how we can create a better life for all of us.\nSo absolutely.\nAll right, you're doing a great job.\nThank you, sir.\nThanks very much.\nSee you again.\nYou too.\nTake care.\nBye.\nBye.\nBye.\nBye, everybody.\n[Applause]\n[Music]\n[Applause]\n[Music]\n"
}