{
  "episode": {
    "id": "nCEijFwQFOw",
    "title": "Joe Rogan Experience #2346 - Jim Lampley",
    "publishedAt": "2025-07-08T17:00:57.000Z",
    "description": "Jim Lampley is a sports broadcaster and commentator best known for his 30-year run on HBO World Championship Boxing. His new book \"It Happened! A Uniquely Lucky Life in Sports Broadcasting,\" is available now.\n\nhttps://jimlampley.com\n\nVisit https://blackriflecoffee.com/joe-rogan and use code ROGAN for 30% Off\n\nThis video is sponsored by BetterHelp. Visit https://BetterHelp.com/JRE"
  },
  "channel": {
    "id": "UCzQUP1qoWDoEbmsQxvdjxgQ",
    "name": "Joe Rogan",
    "slug": "@joerogan",
    "url": "https://www.youtube.com/@joerogan"
  },
  "transcript": "Joe Rogan podcast. Check it out.\nThe Joe Rogan Experience.\nTrain by day. Joe Rogan podcast by night. All day.\nWow. Really? That was your closest male friend?\nUnexpected. But over a period of time, we just got closer and closer and closer and, you know, very brotherly. And the last public appearance Emanuel ever made was my wedding in September of 2012.\nAnd that night, the wedding was at our house in Delmare, California. And that night he uh his girlfriend came to me and said, \"We have to leave early. Emanuel's having stomach pains.\" He was in oncology by the next week.\nHe was gone by three weeks later.\nOh. So very touching to me and you know deeply symbolic of my love for him and thus the Kron Cat.\nYeah, what a classic gym and he was one of the first guys to realize like if you crank the heat up it actually gives guys better conditioning. He realized a lot of things. He Emanuel was a genius uh in a lot of ways and there were a lot of um sort of timehonored rules and techniques in boxing that he quietly upended.\nYes.\nGaze was more advanced in his point of view and thought process and then everybody else sort of followed his lead once they understood what he was doing. Once you if you saw the McCroy's and Tommy and those guys, why wouldn't you imitate? Right.\nRight. Right. Exactly. Yeah. No, he was and he did it at both the amateur and pro level too, you know. So, and he was always fantastic, too, as a commentator because he would give insight that you're really not going to get from someone that's not like with these fighters day in day out through an entire camp. He really understand. When you consider the privilege I had and the expert commentators I work with, starting with Ry.\nYes, that's one perspective. Then gravitating through George Foreman and Roy Jones.\nEmanuel's in there and to me he was the best. I agree with you. The public responded more to Roy and Ray, of course, you know, famous guys, because of their stardom, etc. But, and they were really good, too.\nAnd they were good, but Emanuel taught me more, you know, because he was totally well-rounded as a human being as well as as a um boxing trainer.\nI was very pleased to hear you back on the microphone for that Times Square event.\nThank you.\nCuz it had been so long, six plus years. God, I was like, that's crazy. It didn't make any sense. You were the best in the business. HBO was the best in the business. And when they stepped away from boxing, I was really heartbroken.\nIf if you look at what happened, we go from situation where um the television networks have the authority and the uh self-belief to choose the commentators the way they want to. Yeah.\nThen you get into a more subdivided and um widely disperate marketplace and now the star promoters have a great deal more influence than you would have thought before. And now the star promoters start getting involved in um influencing who's on the air.\nSo PBC um Mayweather was never a fan.\nWe got along but he you know he\nWhat was the famous thing with Larry?\nWell and I guess he associated me with Larry which makes all the sense in the world kind of but you weren't nearly as critical.\nI was just the blowby-blow guy. I'm not an expert commentator you know so I tried very hard. Not always easy, but I tried very hard never to go over the line into doing what the experts were supposed to do, right? No, you were excellent at that.\nIt just it didn't make any sense to me that, you know, and and Kellerman, he's also excellent. That's another guy we should\nAnd now he's back.\nYes. It's nice. And Andre Ward is another excellent guy.\nTotally.\nIt just uh the the good thing about boxing was that HBO was completely independent from these promoters. And the bad thing about boxing is that the fighters don't get paid as much on the undergard fights and don't get paid as much coming up as is the case in the more broadly organized UFC universe.\nRight.\nYeah, there is a difference. Yeah, there's a giant difference in the undercard pay. But I learned that from Joe Rogan.\nYeah. Well, the UFC treats the entire uh card as an enormous event. So, they have elite fighters fight in the entire card. It's not topheavy. Like one of the problems with boxing is you would just say when's the main event? When is Canelo fighting? And you didn't the the other stuff is just nonsense. Whereas the UFC, you look at like, oh, look who's fighting first fight of pay-per-view. There's five fights on pay-per-view. First fight of pay-per-view is a banger. And everybody's the seats are packed and everybody's excited to see it. Whereas everybody starts shuffling in about 20 minutes before Canelo fights in one of these big boxing events. that I think is kind of unfortunate. You know,\nI I I totally agree and a little bit shortsided and I I exceeded to your point of view because and I've made this point before. I'm not a UFC expert. Any comment I make about UFC is um atmospheric, but it's not expertly informed. I didn't have the bandwidth for that. I was trying to be knowledgeable out about every single tributary and every single meaningless pocket in the boxing world. And that's a lot.\nThat's a lot.\nThat's a lot to find.\nYou know, it took time and and frankly, you know, I decided it would be distracting to me to try to keep up with two combat sports at once. This is the one where I make my living. This is the one where the audience identifies me. This is the one that's on HBO.\nYes. And I and I know that Dana in particular um is said by some to have been quite upset that he had a deal with HBO and the deal with HBO went away. If that's the case, and I don't know, I'm very sorry to hear it. Um because I think it would have been good for both if UFC had been on HBO.\nI think so as well. I mean HBO at that time was the premier network for combat sports. The work the work that you guys had done in boxing was the top of the food chain. It was the best.\nWell, Larry Merchant, Ray Leonard, George Foreman, Roy Jones, everything was on point. It was just so well honed.\nGood production.\nYes. It was just a a well polished machine. One of the issues is they wanted to replace the commentators. HBO did.\nOh, they did?\nYeah. So, if we came over there, I wouldn't go over there as well.\nSo,\nOh, really? Yeah. Because HBO was always about their own producer autonomy. Yes.\nSo, they wanted to have\nWe don't want anybody telling us what to do.\nExactly. Right.\nThe problem with that is in mixed martial arts, there's a very small pool of people who have a deep understanding of the entire history of the sport.\nYep.\nAnd you can't just hire a regular sports guy to take that part. They they're not going to be able to get it. Well, going back to the developmental stages, um, and I try very hard not to use the word unique. It's massively overused in American society. Sports media have beaten it to death. It means only one like this on the whole planet. But you were unique uh in those days because you had the full knowledge of UFC and you also knew some stuff about boxing. So I I think you were not just unusual but unique. Well, all I was doing was just following my interests and I've always been a huge boxing fan. From the time I was a child, I was\nDo you remember what your first fight was?\nThe first fight I watched, my parents watched it, which was crazy cuz my parents were hippies and they were really interested in Ali's rematch with Leon Spinks because Leon New Orleans.\nYeah. when Leon had beat Muhammad Ali because Muhammad Ali was he was a cultural icon as much as he was a sports figure.\nOh yeah.\nI mean like multiply that by 100, you know, to to get to where he was.\nHe was very very unique and his his opposition to the Vietnam War made him a hero to many Americans. Well, I always say um he was my childhood hero and he was my childhood hero as Cashes Clay. The very first live prize fight I ever attended was Cash's Clay versus Sunny Liston, February 25, 1964 in Miami Beach.\nOh, you were there for the first fight?\nI saved lawnmowing and car washing money for months to buy a ticket that in my memory was $100, but I don't really know for sure what the cost of that ticket was. I didn't save it. It would be worth millions now. Um, and my mother took me my mother took me over from our crappy Southwest Miami tracked house rental uh and dropped me off at the Miami Beach Convention Center and then came and picked me up afterward. And I I went in alone. Uh, and that was the first live\nHow old were you?\nI was 14.\n14.\nIt was the first live prize fight I had ever attended. It was all about my hero worship for Cash's Clay.\nYeah.\nTwo days later, he stands on Bickl Avenue in Miami and tells two reporters that he's a follower of the Nation of Islam and now his name is Muhammad Ali.\nAnd I'm in shock. Okay. What do you mean? I Your cash is clay. You can't.\nAnd so I nowadays I say the lesson he taught me then was a man's identity is his own.\nYes.\nAnd it does not matter how much I love him or cherish him or feel connected to him. He has the right to say who he is.\nI mean back in those days Islam what is that right? You I had no clue. But you know he he got over with me on that when I understood it was his right. Then he taught me my stance on the Vietnam War.\nMy mother was double widow of two United States military heroes. I grew up with a basement filled to the gills with memorabilia from their tours of duty as B20 B7, B24 and and B29 pilots in World War II. So there was nationalistic and patriotic material all over my household.\nWow.\nAnd when Ali said what he said about Vietnam, I mean about Vietnam, that moved the meter for me in that regard and I understood. And eventually eventually my mother said, \"You'll go to Canada before I'll ever allow you to accrafted into the army and going to Vietnam.\"\nBecause her thought was that it was a pointless war.\nYeah. And she was correct.\nYeah.\nShe was right.\nYeah. And they took three years of his prime. That's what's crazy. I always point to the Cleveland Big Cat Williams fight.\nThat was his best.\nYes.\nYou're totally right. That was his number one performance. And he was never 100% the same after that. But he still had his mind.\nYes. But he didn't train for three years. That's part of the problem, of course.\nAnd you know, at 30 years old in that day and age, it was just a different world. Like you you don't train for three years.\nNot as much knowledge of nutrition, not as much knowledge of training techniques, you know, the oldfashioned stuff in Deer Lake, Pennsylvania. Uh not the same as not no hyperbaric chamber.\nRight. Right.\nEtc., etc.\nYeah. Just they just robbed him. They robbed Dust, too, cuz he came back and he's a different fighter then. He was much more easy to hit and, you know, he became, you know, he relied on his chin more and, you know, he didn't have the fleet of foot movement that he had before then, but he found a way to rise to the top.\nYes, he did. Wow. The championship mind was always there.\nThat's 100% correct. But as a fan of boxing, it drives me crazy because you imagine what we could have seen in those three years if Ali had never been robbed, never took his title away, and allowed him to fight all those guys like Joe Frasier, George Foreman, all those guys with keeping the same skills that he had when he was younger.\nBut, and I think you're 100% correct, Joe, but isn't it in a perverse way a part of his mystique?\nYes. The fact that he was able to come back from those three and a half years off, the fact that he was able to rise to the top again, the fact that he was able to beat Foreman the way he beat Foreman and beat Frasier in the third fight in the kind of fight you would never have imagined him being in, right?\nAll these things combine to create the unique mystique of Muhammad Ali.\nOh, for sure. Yeah. And then also the tragic ending, you know, the the staying in too long and too many beatings, you know, the the the just the seeing him at the end of his life was just so horrible, you know, and we all know that that was trauma induced. We all know that. And it's just it was just sad to see.\nWe haven't seen that yet in MMA, right?\nNo, not quite. But you're seeing some damage. You're you're you're seeing some guys that are really struggling. you know, you just they're not as public, so you're not seeing it from a George St. Pierre or someone like that. George is one of the very unique former champions who has all of his wits, his faculties, retired as champion, very healthy.\nRoy Jones,\nRoy Jones is a good example. And Roy, you know, Roy famously after Gerald Mlelen was hurt when the Nigel Ben fight, he was really concerned because Gerald Mlelen was the guy that a lot of people thought was a giant threat to Roy for a long period of time. When Roy and I were working together, he was providing helpful financial support to Mlelen's sisters who were caring for Gerald and, you know, keeping alive uh on a daily basis, I think in Illinois or Ohio, someplace like that. But uh yeah, Roy loved all other fighters and he did what he could to help with Mlullen. I know that that loss that Mlullen had in the subsequent medical issues, the stroke and the aneurysm, all that stuff really disturbed Roy and made him think, you know, about getting out early.\n100%. Yeah. Cuz cuz Roy was nothing if not smart. Roy was brilliant. Okay. And Roy very assertively fought in a style that would limit harm.\nHe didn't want to get hurt. his gifts. I mean, what a what a guy. Like, who else in recent memory?\nThere's heavyweight boxing and then there's\n\n\nWeight class boxing. Ali is the unique physical specimen in heavyweight boxing.\n\nRoy is the unique physical specimen in weight class boxing, you know, and so much so that he actually won the heavyweight title.\n\nWell, exactly right. Whatever he wanted to do, if you put his mind to it, he could do that, you know. And, and, um, a part of the ongoing cliche was he could play any sport. You know, he could be great in football, basketball, baseball, etc., etc. And of course, he did go through the theatrics of playing a basketball game on the same day that he fought a fight, which was so crazy. It was insane. It was so crazy. But that was his talent was insane. But it was also like he was just showing people. He was kind of playing with his food. He's like, I can play a basketball game and then go and easily win a fight the same night.\n\nIt's interesting you use the phrase playing with his food. Um, and I like it. Roy liked to play with his food. Get to a certain level. Sometimes you do things because you can. He knew what he could do, right? So, yeah. I mean, his speed was so preposterous when he would forego the jab to lead with left hooks, which was just so crazy when he stood against the ropes in Miami against Glenn Kelly and put both hands behind his back and made Kelly miss, miss, and then hit him with one straight hand and knocked him out.\n\nYes, that's Roy Jones.\n\nOh, it was incredible. How about the Vinnie Pazenza fight when he didn't get hit for the entire round? The only round in Compubox's history where someone never got hit. Yeah, it was crazy. And I was with Roy at the International Boxing Hall of Fame induction ceremony a few weeks ago and we were talking about exactly that. You know, I, we were, you know, talking about Pacenza and I said, \"Is he the guy that you shut out for a round?\" And he said, \"Yeah.\"\n\nUh, and I just, I did it just cuz I wanted to do it. This episode is brought to you by Black Rifle Coffee. Ditch the weak coffee. Black Rifle Coffee is bold, fresh, and roasted right here in the USA. No bitter aftertaste, no BS. They've got it all. Whole bean, ground, K cups, ready to drink, even killer merch that doesn't suck. Every order supports veterans and first responders. So your caffeine fix actually does some good. Hit up blackriflec coffee.com/joan. Use the code roan. Get 30% off. Black rifle coffee, America's coffee. Yeah.\n\nWell, he was just so far above so many of the guys that he fought. They just had no business being in there that he had to create competition by doing stuff like that. He had to have fun. Yeah. He had to play with his food.\n\nWell said.\n\nYeah. No, he was spectacular. He, you know, he was one of those guys that's a unique once-in-a-lifetime talent that unfortunately, though, his mistake was going up to heavyweight and then trying to go down to 175, which is unbelievably grueling cuz he was, when he was 200 lb at heavyweight, he was 200 lean, muscular, fast pounds. That was not like fat to lose. And so to starve himself to get down to 175 like he was diminished. And you saw that in the Tarver fight.\n\nI'm not here to feather your nest, but you're brilliant. That's 100% correct. Yeah. If I was in, and he lamented it afterward because he understood how he had penalized himself in that way.\n\n25 lbs is so much weight to lose lean muscle mass.\n\nAnd you made the point when it's muscle, muscle. If it's fat, right, you can go into the steam room and sweat it all off, right? But once it's muscle, it's there, you know, and it's, it's a part of the structure. It's a part of the building. Now, how you going to rip it out, you know?\n\nWell, not only that, it diminishes his endurance. It diminishes his durability, gets compromised because you can't take a punch as well because you've cut so much weight. It gets to his confidence. And his confidence was unshakable, right? It was everything. Like when you go into the fight fatigued, you're feeling fatigued. And then you've got a guy like Tarver who's infinitely talented and has legitimate knockout power and is talking [ __ ] to you right before the fight. Got any excuses tonight, Roy? Remember that? And then he knocks him out like holy [ __ ] with a brilliant straight left hand against the ropes. I can see it in my mind. Yeah. And you know, I just worked with Tarver a few weeks ago when you mentioned the Times Square card and Tarver was my expert commentator on the Times Square card. So energetic.\n\nYeah, Tarver's great. So lively, really good. Yeah, I, I, I was thrilled. I thought he was.\n\nHe's another guy that with his boxing skill went all the way up to heavyweight because he was just so much better than everybody else.\n\nHow many southpaw heavyweights?\n\nRight. Very few. Very few. Michael Moore.\n\nYeah.\n\nYeah. He was Southpaw. But again, another won the championship.\n\nYep. Another light heavyweight and lost it to my man George Foreman. That one punch. Yeah, that was crazy.\n\nYeah. Thus the title of my book. Thank you so much, George, cuz you know the reason why my book is titled It Happened!\n\nWhy?\n\nWhere, where I came up with It Happened! So, he was the expert commentator in the weeks leading to his fight with Mo. He and I together had called Mer against Holyfield when Mur won the championship. And in the weeks before he fought Mer, I would pull him aside at crew meals and, um, fighter meetings and other occasions when I could get a minute with him. Three, four times I asked him, \"George, how are you going to beat Mura? He's a southpaw. He's a mover. He has great feet. Holyfield couldn't find him. And Holyfield was much faster than you.\" And every time I said it, George would fix me with that implacable George Foreman gaze and say, \"Jim, you watch. There will come a moment late in the fight. He will come and stand in front of me and let me knock him out.\" Always the same words. He will come and stand in front of me and let me knock him out.\n\nWow. So now as Mo is on the canvas and Joe Cortez is six, seven, eight, and I'm thinking, what am I going to say about this? How in the world do you establish this without being self- glorifying? You know, I, I've got to say something that's meaningful, but I want it to be about him.\n\nYeah.\n\nAnd I thought about what he had said to me, and what came out spontaneously was, \"It happened. It happened.\" Yeah, it's really me talking to George saying to him, \"Okay, I get it. You told me it was going to happen and it happened.\"\n\nWell, do you remember when George came back and he was 300 lb and everybody was laughing at him and he was in his late 30s, I believe. Was he 34, 35, something like that? When he made his comeback, he hadn't fought in 10 years. Everyone dismissed him like, what is he doing? He was very overweight and he started the bum of the month tour, you know what I mean? And, and that, that's not a fair way to say it. They weren't bums, but they were people that he knew he could beat.\n\nYes.\n\nTo build a dossier toward what he really wanted and get in shape.\n\nYep.\n\nAnd no one believed in him. No one. I remember me as a boxing fan watching that comeback being sad like, \"Oh, George Foreman's coming back and he's all fat now. This is sad.\"\n\nWell, I'm sure you've known a lot of people like this, Joe. You want to see George do something? Tell him he can't do it. Right. Right. Challenge his will. You know, because he's self-constructed person. You're talking about a guy who as a teenager, 17 or 18 years old, says to himself, \"I want to get out of the fifth ward of Houston. I don't want this life as a gangster or, uh, a laborer or whatever I'm going to get by living in the fifth ward of Houston. I want something else.\" So he goes to the JobCore in Hayward, California, and enrolls in the JobCore, and that's where he learned to box. That, that's what set him up a year and a half later to win his Olympic gold medal in Mexico City. And, uh, and then go on to his storied professional boxing career. Um, but you know, it, he, he was in his own mind proving he could do something that other people didn't think he could do even at that point. He told me that when he first got to Hayward, he befriended one of the other people in the job corps who was a white kid, and, uh, he said, you know, they're talking about things that they like, and the guy talks about Bob Dylan, how much he likes Bob Dylan. So George got the first two or three Bob Dylan albums and listened, wanted to hear what this is all about and absorbed the lyrics and paid attention. And when George told me this story, I said, \"George, you Bob Dylan, you know, how am I supposed to process all this?\" And he began quoting lyrics for me.\n\nWow.\n\nOkay.\n\nFrom Blowing in the Wind, from Don't Think Twice, It's All Right, etc., from early Bob Dylan songs. Yes.\n\nHe knew about Hurricane. Yes.\n\nSo, he was just an amazing person, you know, so broad-based, you know, and that was, I think that was part of what burned in him was that everybody, myself included, gave Ali credit for all that. And George wanted in his own way for people to see, hey, I'm not that different than that, you know. And I mean, one thing he said to me was, \"You can't win the heavyweight championship of the world without being smart.\" Okay. A stupid person couldn't do this. You know, it's true. Yeah. So, he respected Mo's intelligence, but he also understood something that I didn't understand. He'll come and stand in front of me late in the fight and let me knock him out.\n\nCrazy that he predicted it that way, cuz that's exactly how it played out.\n\nOh, yeah. Go to YouTube.\n\nYeah. If you haven't seen it, it's, it's uncanny. It really is.\n\nGiant Michael Moore fan when he was a light heavyweight. And I think a lot of people forgot how dangerous he was at light heavyweight. He was one of the great light heavyweights.\n\nNo question. Because of the southpaw punching power, you know, power at light heavy.\n\nI don't know if it's true in UFC as it is in boxing, but you don't see southpaw punchers very often. Southpaws are technical. They box. They take advantage of their foot skills and their hand speed and they, they beat you with boxing skills. You're not often going to run into a southpaw who's going to knock you out. But we've already talked about Tarver and, and Mura was another one who had punching power. Uh, and it's, you know, kind of Cooney. Cooney was a southpaw with punching power.\n\nIt's kind of doubly effective if you've got that because you're worried about the technical issues with a southpaw and now he brings a cannon.\n\nRight. Right. Yeah. The southpaw thing was always so confusing to people because if you ever boxed before, you're so accustomed to that left hand being forward, right? Then all a sudden everything's reverse and now you're thinking, right? And if you don't have a lot of southpaws that you train with on a regular basis, things aren't automatic anymore.\n\nAnd one of the things that George used to talk to me about all the time was angles. That you know, you're, you're standing in front of another man, you're confronting him, you're trying to deliver and stop delivery angles. It's all about where does it come from and where is it going and how can I deal with that. Now, I was never a fighter so I can't empathize, but I can sympathize when I listen to that guy.\n\nYou can see it, right? And I think the greatest at angles of all time is Lachenko.\n\nNobody. Nobody.\n\nThe greatest footwork, the greatest hand skills, the most effective training by his father.\n\nYeah. What a genius move to take him out of boxing for 2 years to study Ukrainian dance.\n\nAnd brilliant. Absolutely brilliant. And, and by the way, he had an effect on the national team for several years. And what culture in the world has had more accomplishments and surprising new stars in boxing, right, other than Ukraine, right? And Usyk, who is basically like, moves like a giant Lomachenko, just not quite as effectively.\n\nThat's a really great phrase that I had never conjured before this moment. Thank you, Joe. A giant Lomachenko. That's exactly what he can't quite move that well when you're 220 lbs. You're just dealing with gravity and mass, but you're still creating unique angles. You're, you're coming at them from unique approaches, etc. You're hard for your opponent to figure out. And Usyk is impossible for most other heavyweights. Constant motion. Constant motion. Constantly cutting off the ring with his feet and hammers you to the body as often as he can.\n\nYep. Yeah. Lomachenko in his prime was just a magical thing to watch.\n\nBrilliant.\n\nIt was like you were just watching poetry.\n\nAnd I had the privilege of calling those fights, you know. It was an extreme privilege.\n\nYeah. It was, uh, it was amazing watching him just do something where you'd seen so many different versions of boxers and you watch him do it and you're like, \"Oh my god, he put a new thing on this.\"\n\nThat's why I can't understand at this moment, can't really figure out what's up with Teapima Lopez. How do you beat Vasile Lomachenko, right? And then wind up, you know, with somewhat indifferent results since that time. Yeah, he, he fought better than the other guys in Times Square and I give him credit for upholding the card. Uh, but still, there's nothing since the Lachenko win. I mean, you lose to George Cambosus.\n\n\nI think the Cambosus fight was, I think, he was just a little overconfident, and he got caught, and then that really rocked him. That really shocked him. He got dropped early in the fight, remember that?\nIt's a bad sport to be overconfident in. It's the worst sport. Whether you're talking UFC or boxing, yeah, any combat sport, when you don't appreciate the potential that your opponent has to do damage, well, I used to say to people all the time, these are fine margins of competition. You think you see a lot of wipeouts in boxing because you see a second-round knockout or third-round knockout, and you think that means there's a huge talent gap between the two fighters. No, it means one fighter made a mistake. Okay? 90% of the time, it means one fighter made a mistake. And if he thinks about it and trains against it, he won't make that mistake again. So, like a perfect example, Juan Manuel Marquez versus Pacquiao, 100%. They have three insane fights that are very close. Marquez lands one bomb and starches Pacquiao. This one error. He got a little overconfident, a little, little too...\nGreatest counter puncher of his era. And power. Yeah, and with, with power, with the straight ahead power from the shoulder. Marcus was a gifted fighter, very gifted, but just like that one moment, like if that had happened in the first fight, we would look at the whole thing very differently. 100%. Yeah. Yeah. This, just like the, the margins, as you were saying, are so small for victory that when you see like a spectacular result, you do automatically assume, oh, that person's just that much better. But sometimes it's just one error. It's a moment in time. You know, if it's a knockout, now if somebody gets knocked down six times, then you're talking about something different. But one knockdown that leads to a 10 count, that was a momentary mistake, right? Uh, and that's again, that goes to the fine margins of competition. You can't make the one mistake, right? And then you know, it's also how do you bounce back from that? Like some people, the one moment, even if just a knockdown, they don't have the capacity to correct and stay safe and then regroup, like they get shook, and then now they're fighting from this position, this defensive position where they're a little bit gunshy. So, Mark has exposed the difficulties that Pacquiao could have against a great counter puncher, and now we get ready for Mayweather Pacquiao. Right. And Mayweather just did such a smart thing, but also a devious thing. Waiting until Pacquiao was older, waiting till he slowed down. And then devious is not illegal in boxing. It's encouraged. Yeah. In any entrepreneurial sport, devious is not illegal. Devious can be an asset. That's how you retire with a 50. I give Floyd credit for brilliance. Okay. Floyd wasn't just a smart fighter. Floyd was a brilliant fighter. He was on his own level. And so much so, you know, in any matchup between the great counterpuncher and the great attacker, you know, that the counterpuncher has the advantage. He's got more options. He's got more ways of winning. The attacker has to break through the wall, so to speak. So, in the years before Mayweather Pacquiao, people would run up to me on the street, run up to me in the shopping center in Vegas, run up to me in a hotel. When am I going to see Mayweather Pacquiao? And I would say, well, we don't know, but what exactly is it you think you're going to see? Oh, I can't wait. It's going to be such a great fight. No, it's not going to be a great fight. It's going to be watching like watching somebody pluck the legs off a spider. All right, you know, at a step-by-step method, and you're going to watch Mayweather pluck the legs off the spider that is Pacquiao, and it's going to be pretty easy for him, and it's not going to be wildly entertaining, but it is going to be one-sided victory. So, why are you so excited about the fight? Oh, no. I don't think that's the case. Da da da da da. But if you knew Floyd, you know, Floyd was only about winning the fight. He'll make fans other way on the web. I call him the first great social media genius. Yeah. He was great at talking [ __ ]. He got everybody upset at him so badly that they wanted to see him lose, and that would sell tons of pay-per-views. He realized you could build an audience with negativity. Yes. You didn't have to be an omnibus character. You didn't have to be somebody everybody loved. You could be totally negative, and that would build a following, too. Yeah. When he shifted from Pretty Boy Floyd to Money Mayweather, changed the whole thing. He knew what he was doing. He definitely did. Look, the, and it was, it would have been an interesting fight had he fought Pacquiao when he was younger in his prime. It would have been a very difficult fight. Would have been a more interesting fight. Much more difficult because, because any go forward physical warrior like Pacquiao is going to wear down. Right. Exactly. And any brilliant counter puncher like Floyd is going to retain more. Yeah. So he did. Yeah. It would have been much more interesting when they were younger. Also, the fact that Pacquiao fought him with a bum shoulder, that was a disaster, too. Money talks. Yeah. I mean, look, I guess he was faced with this thing, Legacy or, I mean, it was the biggest pay-per-view of all time in boxing, correct? I believe so. I believe so. And I think it was like 4 million buys or something crazy like that. It was huge. So, like, what is that? It was massive. Yeah. It just lured Pacquiao. All those people who had run up to me on the street corners for years, finally got the chance to see what they wanted to see. Yeah. Give him a cortisone shot, throw them out there. Yeah. Unfortunately, this is an advertisement from BetterHelp. Stress in the workplace is becoming an issue around the world. Did you know that 60% of the global workforce has reported experiencing higher than normal levels of stress? So, it's more important than ever that we learn to take some time for ourselves. Plan a nice long holiday this summer. Go hiking, read a book, play video games. I found that even a few minutes of meditation can help. Another great option is therapy. Everyone can benefit from it, and it's arguably one of the better long-term solutions to stress. Therapy can teach you how to positively cope and manage anxiety while improving your self-confidence and self-awareness. It can be very empowering, and thanks to Better Help, therapy is becoming more and more convenient. All it takes is a few clicks to join a session. You can also join from anywhere, whether you're at the beach, on your vacation, or at home after a grueling day of work. Plus, as the largest online therapy provider in the world, BetterHelp can provide access to mental health professionals with a diverse variety of expertise. Our listeners get 10% off their first month at betterhelp.com/jre. That's betterhp.com/jre. Unfortunately for, I remember there was like a class action lawsuit, a lot of people were upset that Pacquiao fought injured, a lot of the gamblers. I never talked to Freddy about that. But, you know, uh, at the end of the day, the fighter makes the decision. Well, the money. Yeah. And the money. And the money. Yeah. That happens a lot in the UFC. There's a lot of fighters that fight injured. And, you know, Yeah. I got to tell you this while we're talking about him. All right. I apologize for going off script here a little bit. I was with Manny three weeks ago, less than a month ago, at the Hall of Fame inductions in Canes Stood, New York, where he was being inducted into the Hall of Fame. And uh, on the night before the induction ceremony, there's a big banquet in a banquet hall at the Turning Stone Casino. And I'm sitting up on the Deis between Roy and Ross Greenberg, my former boss at HBO. And right across to the left of us behind the podium is Manny. And several people spoke. I didn't know that I was going to speak. I was asked to get up and speak. I did. Roy did a speech, etc., etc. Eventually, Manny got up and made a speech. Now, I met Manny Pacquiao 24 years ago in a fighter meeting room in Las Vegas before his fight against Leanola Lewaba, which was his first appearance in the United States. Class was that? He was a kind of a throwin opponent. What weight class was that? Yeah. So, that would have been 122. Isn't that nuts? And Larry and I were 100% convinced that Led Wyel was the best 122lb fighter in the world. We had seen him on the undercard of Lewis Rockbman in uh, in Johannesburg, South Africa. There's nobody, nobody who could possibly be better than that. Grace, style, hand skills, all the stuff. And I meet Manny in that room. He can't put three or four words of English together. I learn his backstory that he survived by selling stolen cigarettes on the streets of General Santos City in the Philippines. I get and understand that his big activity outside of the gym is to go play pool. He's a pool player in, in bar, in bar rooms. Exactly. Level pool player, etc. All of that. And um, and then fast forward 24 years and he's being inducted at the Hall of Fame, and without warning, he's asked to speak that night, and he stands up and makes a 15-minute speech, maybe 12 minutes, but it was more than 10, all in English, all perfect, uh, all more or less off the top of his head, unedited. It was brilliant. And, and I went to him afterward, hugged him, told him how much I loved him, and I said, I said, \"Manny, I first met you 24 years ago when you couldn't put three words of English together, and I know that politics had something to do with this.\" And he said, \"Yes, but a lot of my political speeches were in Tagalog.\" Uh, and I said, \"Well, some of them were in English.\" He said, \"Yes, some.\" Um, and I said, uh, I don't think there's any sport other than boxing where somebody could have achieved the kind of personal transformation that you have achieved. This is the only one. And he said, well, it, it sure helped me, that's for sure. Now, you probably know the story about Muhammad Ali and graduating from high school in Louisville. Yes. Okay. So, just for our listeners and consumers, um, Ali had very bad grades, and in his senior year, he was flunking a math course, and in order to graduate, he had to pass the math course, and he was nowhere near it. And the math teacher went to the principal of the high school and said, \"I'm going to give him a passing grade even though he has not performed on any of the tests, and he doesn't do the homework and stuff like that.\" And the principal is like, \"Why would you do this for, for this kid? Why would you give him a passing grade when he hasn't earned it?\" And the teacher said, \"You have to understand, he's going to be the most famous man in the world.\" And we cannot be the high school that denied a diploma to the most famous man in the world. That's such a crazy statement. I wonder if it's true. I wonder, I wonder if it's true, too. But it's, it's a fun story to tell. And of course, it's secondhand. You're, you're exactly right. It is. It's so... I don't know the teacher, and I don't know the principal. I just know the story. Uh, and I know, and I know Ali's primary biographer, uh, Tom Hower. So, maybe I got it from Tom. Yeah, I, I'd like to believe that that's true. I'd like to believe it's true, too. It makes it more... Let's make him back to believe it's true. The thing about Pacquiao that's so extraordinary is that he kept his power through eight weight classes. That is just wild. Like, who, what other fighter can you name that went through eight different weight classes as a world champion? I can't. None. No, obviously. Um, what I, what I did learn that may relate to that is Foreman was at great pains to explain to me and explained a couple of times that power punching is not a physical gift. Power punching is a science. Power punching is the product of real technical knowledge. Power punching is about, um, footwork, weight shift, uh, the angle at which you deliver the punch. Uh, you know, all sorts of things not directly related to your strength or quote power. Uh, and George was a disciplined and knowledgeable scientist, uh, about stuff like that. And he, he explained it all to me one time. And of course, if you watch the Mor knockout, he lands the first one, two, right on the button. Mhm. And then having Mur where he wants him, he puts a little more mustard on the second one, too. And we're out of there. But there are physical gifts that you are just, they're just God-given gifts of power. Big hands. Big hands. Big hands are... shoulders. Yeah. All that. There's just certain guys though that just have extraordinary power. Like you remember Julian Jackson in his prime? Oh my gosh, the hook. Oh my gosh. Extraordinary power. At some moment or another, he's going to get you. Yeah, it was just disturbing how hard he hit. It was just different than everybody else. And it looked like he was doing the same thing, but the results were so much different. How about Andy Lee? Skinny, not somebody you would expect to have, you know, heavy hands, knocking everybody out. Deontay Wilder. Yeah, another one. A 209 lb heavyweight that's flattening people. Like 209 pounds when he fights Tyson Fury the first time. Some, some of it is the bravery to commit, right? You know, can you, can you push your weight forward, right? In a way that might leave you open to the counter, and, and believe that you're going to get the better of that exchange. If you believe you're going to get the better of the exchange, go ahead, go forward. And, and that enhances your chance of knocking someone out there. But there is...\n\n\nThere's physical gifts that you are just God-given, and some people have them. And these are the extraordinary outliers: the Deontay Wilders, the Julian Jacksons, the uh John Mugabis. Remember Mugabi? John the Beast Mugabi.\n\nOo, I rewatched that Mugabi-Hagler fight the other day. What a great fight. What a fight. What a fight. Hagler was my hero when I was a kid, and he was... so I'm sure you're an advocate with regard to what I call the number one elevator fight of all time, that Hagler was the winner. No, the number one elevator fight of all time. And an elevator fight is the fight where you're Jim Lampley or you're Joe Rogan or you're any combat sports expert, etc., and you step onto an elevator with six people, and somebody turns around and says, \"Who won Leonard-Hagler?\" Okay. The debate about the decision, you know, and uh, you know, I'm sure you say Hagler beat Ray.\n\nYes. Uh, and of course, we all know that Ray partially won the judges and the crowd with Showbiz, with the, you know, with the way that he threw his arms up at the end of every round and, you know, called attention to himself. And he, he was quite aware of what he was doing. Uh, and he was quite aware also that it would get under Hagler's skin. So, you know, there was an element of genius in Ray, as we talked about already, that that went to more than just his spectacular physical gifts, right? Yeah. No, he gamed the system a little bit. He figured out how to flurry at the end of the rounds and make a big impression in the judge's eyes. That was a very close fight, but that fight always bothered me. And one of the things that bothered me is I felt like there were moments where Hagler could have turned it up and didn't. And then when he retired after that fight and went to Italy and became a giant movie star in Italy, the conspiratorial part of my brain was always like, was that like one of those deals where everybody assumed that Haggar was going to win? Haggar was a destroyer. Hagler had knocked out Tommy Hearns. Hagler had beaten everybody in the division, knocked out Mugabi. He was the man. You know, you fought, right?\n\nYeah. So, you fought. I didn't. I mean, I've only talked, but because you fought, you probably have an even stronger sense than I do of how difficult the sport is. Yes. Uh, the training is difficult. Mhm. The fear factor is certainly part of it. Um, the level of concentration and devotion that it takes. Uh, it's not easy. Team sports are easier. Uh, and and um, and so, you know, I'm I'm thinking that every fighter reaches a point where enough. Yes. And and they might reach that point without really cognitively knowing that they've reached that point where it's enough. Hagler went to Italy, as you say.\n\nYeah. Maybe he had already reached something like enough before he fought Ray in that fight.\n\nWell, you know, he had accomplished so much, and also his training camps were the stuff of legend. I mean, he would spar a hundred rounds a week sometimes, which is just insane. Mhm. Hagler was a monster. I mean, his conditioning and his drive and his will and his discipline, he was a monster. He would scare the [ __ ] out of everybody just from his work ethic. I remember I told the story. There was a news piece, um, when he was training on the Cape, and it was in the middle of the winter, and he was fighting Mustafa Ham Show, and he was running down the sand dune screaming war with combat boots on in the winter, and I remember thinking war, cuz you think you're disciplined, you think you're driven, you think, you know, you're special, and you see a guy like that, he's like, he's what my friend David Gogggins calls uncommon amongst uncommon. And great line. So, where does Hagler-Hearns rank among your all-time favorites?\n\nOne of the greatest of all time. Great. One of the greatest fights of all time because Hagler just threw caution to the wind. [ __ ] all this boxing. Just jumped, jumped out. So did Tommy. So did Tommy. Both of them did. Tommy didn't go in with a self-protective approach. He tried to box. Remember after he broke his hand, he tried just throwing the jab out there. You could tell early on in the first round when he broke his hand. Yes. Because from then on he's moving. He's little, but he's already endured so much damage. I mean, they have just thrown each other into the wood chipper. Both guys were just blasting away. I hope a lot of people are going to listen to this and go watch Agler on uh on their web attachment because it's as great as anything has ever been. It was insane. I remember being in my living room when when Hearns went down and just going, \"Wow, like I can't believe,\" and this was after Hearns had knocked out Duran, and I thought nobody could knock out Duran. When Hearns flatlined Duran, I was like, \"Good lord. Good lord.\" Like to see Duran face down the canvas. I was like, \"Yeah, you have to check your eyes, like, is this real?\"\n\nWell, did Tommy break his hand with that right hand in the first round against Hagler? Yes. Yeah. Yeah. There you go. There you go. You've lost your primary weapon. He has one knockdown attributed to him in his career, and it's [ __ ] The Juan Roll Dan fight. Mhm. [ __ ] Not really a knockdown. And now we deal with Canelo, who has had one knockdown attributed to him in his career, and in my view, it was [ __ ].\n\nWhich fight was that?\n\nSo it was Miguel Cotto's little brother, Jose Cotto. It was the first time we had Canelo on uh HBO. Believe it was an undercard of a top-ranked pay-per-view, who I'm not 100% certain uh about that. And um, Cotto's little brother, Jose, caught uh Canelo with a right-hand body punch to the chest, and Canelo hit the ropes behind him and bounced off the ropes kind of unbalanced. He didn't go down, but he came off the ropes ungainly, unbalanced, etc., and the referee, and I can't remember which referee, stepped in and very technically ruled that the ropes had held him up. So, that's the only official knockdown in Canelo's career, and he didn't touch the canvas.\n\nThat's crazy. Nobody has ever put him on the canvas. And this is part of what uh Terrence is facing as he gets ready to fight him in September is you're fighting a guy who up to this moment in his career has been utterly knockout proof. Mhm. Knockdown proof. Well, even against a guy like Bval, who's huge. Yeah. You know, exactly. A huge light heavyweight. Yeah. But BVOL is... Bvole is... I'm gonna say at least 50/50 a backup counter puncher. Uh, and they don't muster exactly the same power as a go-forward attacker. True. I, you know, you notice that he hasn't thought BetterHelp. Uh, and I'm not sure that BetterHelp would be the right matchup, but for Canelo. Yeah. I think that would be a nightmare matchup. Yeah. Better be of, especially even though he's almost 40 now, right? Is he 40? He might be 40. He might be 40, but he's still in shape, and he still comes forward, and he's a, you know, naturally heavy hands, big hitter. One of the scariest of all time at 175. He's another one of those guys. It's just like, but with him, it's volume. It's not one shot, but it's this thuting volume that never ends. This constant attack, which is has made his two fights with BOL so spectacular to watch, you know, because not a make fire fighter. He's a natural counter puncher. But if you insist on making the fire, and you're strong enough to make the fire, then be has to fight, which he's done twice against Better B.\n\nWell, he made brilliant adjustments in the second fight. Brilliant adjustments. He's a brilliant guy. Yeah. I mean, he really, really made the proper adjustments and the counter strikes and the movement, and he was just much better in the second fight. It's another country with very good boxing training. Oh, phenomenal. Do you think that they're, are they having a rubber match? Third. I don't know. Yeah, I'm not... I don't talk to promoters anymore. So, yeah, I'm not sure about that. I hope they do. Yeah, I think it's a fantastic idea. I think Riad season was trying to put that together. I think they're trying to put together a third fight, and I really hope they do make that fight. Go Turkey. Yeah, you kind of have to do it now before Better be of is just, he's probably passed his prime, 41, 42, etc. These numbers sound forbidding. Yes. But still, even as a guy... remember Foreman was 45, right? What did he still have? Power, right? And but in skill, the skill thing, like here's the best example of that: Bernard Hopkins, who has maintained their skill deep into their 40s. In fact, at a world-class level at 49 years old, beating like top contenders at 49 years old, one of the smartest men I've ever met. Okay, Bernard Hopkins is smart, beyond smart. Uh, he has uh, PhD-type intelligence. He really does. And he was also a very critical and thoughtful self-examiner. So those two things help Bernard to sustain long into, you know, antiquity and an extremely disciplined personal life. Yes, that's the big one. You know, he kept his prison tattoo on his arm, and he kept that number on his arm to remind him that he was never going to go back. M. And and I asked him one time, I said, \"What, what's the hardest thing you've ever done?\" And he said, \"Well, the hardest thing I've ever done was to walk off nine in the neighborhood in which I grew up.\" I said, \"What do you mean walk off nine?\" Nine years of probation, nine years of living on and in the same streets where I was the king of the streets when I was uh on the other side of the law. Nine years of reminding myself that I could never go back, that my, my behavior had to change completely. That's what he called walking off nine. Wow. What a phrase, huh? Yeah. What a phrase. What a guy. Yeah. Really? What a guy.\n\nWell, I remember when he was middleweight champion, and he wasn't getting the credit that he felt like he deserved. And he was, you know, squabbling with promoters. They kept him on the shelf. I'm like, my god, he's like wasting away in the prime of his life. And I felt like we're going to like miss out on the prime of his life. And then here he, he gets into the Felix Trinidad fight. And I was like, this guy's, this is crazy watching this guy like completely outclass Tito Trinidad. I'm like, this is nuts. Of all the fighters I've ever known, if you were to ask me who is the one most likely to still be holding every dollar he ever made, that's Bernard. Okay. He gives nothing away. Uh, and he protects himself. He protects his family. He protects everything about his experience in an extremely devoted way. Why? Walking off nine. Wow. Never wants to go back. Wow. Well, those are the stories that are so inspiring about boxing, right? This, the, the people that have used boxing as a vehicle to get out of their circumstances. Totally. You know. Yeah. And Bernard's one of the greatest examples imaginable. Yeah. I love him. You know, I had him on my show, The Fight Game on HBO. I had him do technical pieces because he was better than anybody at explaining footwork, technique, etc. Andre Ward could have done it, too. But Andre was still fighting uh at that period of time. Yeah, that was a great show, man. That was another bummer when when HBO stopped doing boxing.\n\nWell, look, successful for them. That's... I like to say this. It wasn't HBO. Okay. The minute that Time Warner was bought by a bunch of cell phone salesmen from Dallas, AT&T, the character of the operation changed, and the first thing that went away was boxing. Uh, it's in my book, you'll read it. Uh, there's an anecdote about uh me uh at a post-Emmy Awards or post-Golden Globe Awards event in Hollywood shortly after AT&T had purchased HBO. And I was seated at the table of Richard Pleper, the uh longtime brilliant chairman of HBO, my beloved boss. And uh Pleppler said, \"See that guy over there in the gray suit?\" And I said, \"Yeah.\" He said, \"That's your new boss. That's John Stany, the CEO of AT&T. I think you ought to go say hello. I think you ought to go meet him and just spend a little time with him.\" So, I took his advice. I went over and had a 10-minute discussion with Stanky. Very nice, um, very cordial, fun, and I walked back to Pleper's table, and he said, \"So, what do you think?\" I said, \"I think boxing is dead.\" He said, \"I agree with you. I just wanted to be sure that we were on the same page.\" Oh, god. Yeah. So it was clear, it was clear from that moment that they, they were not interested in going forward with something as...\n\nWhy did you think boxing was dead? Why'd you say that?\n\nWell, I mean, I could just tell from the way in which he spoke to me and the, you know, so you weren't saying it based on your personal... diffident replies to questions like, \"Are we gonna do this fight? You know, what do you think about that?\" Stuff like that. It was abundantly clear that they just, they saw it as a negative rather than a positive and and public perception or profitability. Profitability, really too many unpredict... many unpredictables in boxing. You schedule a show, somebody gets hurt, etc. I think\n\n\nThey didn't want that kind of, um, real life upheaval. And also, they saw it as unsavory, or at least it felt that way to me. Yeah, you know. So, um, yeah. Well, this goes to the fact, and you know this as well as I do, or maybe better, people from outside combat sports don't understand combat sports. You know, you're either in the culture and you get it, or you're not, right? You know, and I, you know, when I first started calling fights, I was assigned to call boxing at ABC Sports by an incoming new president of the sports department who wanted to get rid of me and who thought, and who thought that I would be such a misfit in boxing that if he assigned me to boxing, the audience would reject me, really, that they would see me as the successor to Coell. That would cut my throat, and then I would walk away from my contract, which is what he wanted me to do. He wanted me to, he thought my contract was absurd, too lucrative. He didn't like the guarantees for relative to exposure. And he told my agent flat out, he said, \"I'm going to get rid of Jim. I'm going to make him walk away.\" And his first method for doing it was boxing. So, of course, that means he didn't know that the very first sports event my mother ever sat me down to watch when I was six years old after my father died when I was five was Sugar Ray Robinson versus Bobo Olsen for the middleweight championship on Gillette Friday Night Fights that I had grown up all through my childhood and teenage years watching Gillette Friday Night Fights. And later people would say to me, \"Who's the voice in the back of your mind when you're calling fights? Is it Coell?\" I said, \"Oh, hell no. I would never try to emulate that.\" Don Dunphy, crisp, precise, factual, on point. That's who I'm hearing in the back of my head when I, uh, when I call fights.\nInteresting.\nYeah. So, he thought he could get rid of me by assigning me to boxing. And, um, he also did not seem to be paying much attention to the fact that his division with leadership of a guy named Alex Wallau, who was a boxing freak, had just signed a get acquainted lookie contract with a 19-year-old heavyweight from upstate New York whose name was Mike Tyson.\nYeah.\nSo the first fight I ever called on TV was Mike Tyson versus Jesse Ferguson in Glenn's Falls, New York. And this is the famous drive his nose bone into his brain fight.\nYeah.\nAlex went to do postfight interview after Tyson had obliterated Jesse's nose with an uppercut. There was blood all over the ring. And, uh, and Alex said, you know, \"Mike, tell me about the uppercut.\" And Mike said, \"Katamato taught me that the purpose of the uppercut is to drive the opponent's nose bone into his brain. I was trying to drive his nose bone into his brain.\" And I'm standing on the other side of the ring listening to this headset on, and I thought to myself, \"Oh my god, look at what I've stumbled into here. This kid is not only going to be the biggest attraction in boxing, he's going to be the biggest attraction in American culture if he can keep coming up with quotes like that.\" And of course, within the next few weeks, they all started spilling out. Boxing is a hurt business. Everybody's got a plan until you hit them. All the things that Damato had taught him, which he memorized and then reproduced in his media context.\nYes.\nOne of my favorite TV fights was him versus Marvis Frazier because it was such a terrifying execution.\nI'm giving away too much of the book, Joe. I mean, my, my publisher would say, \"Wait, don't tell them the whole book. Come on. People are going to buy it anyway. Don't worry about that.\" So, Alex Wallau and I lived five blocks apart on Upper Fifth Avenue in New York. And when we went to upstate New York for the Tyson fights, of which there were several, we would always ride up in his, uh, Green Jaguar, and he knew the route, and he would drive, play me his esoteric rock music. You ever heard of Cockroach? Try him out sometime. No. Uh, and, uh, and so all the way up to Albany for the Marvis Frazier fight, Alex is saying to me, you know, \"I'm thinking of saying in the opening on camera that Mike will knock him out in the first round. Do you think that's too audacious?\" And I said, \"Well, Alex, you're the expert. You know, I'm just a throw in blow-by-blow guy who's trying to get my feet wet here. I'm the last person who's going to tell you what it is you should say. So, if you believe Mike is going to knock him out in the first round, and you're confident saying that. First of all, no one's going to penalize you on Monday if you're wrong, nobody's going to print some big headline that says Wallau was crazy or something like that. It's, it goes into the wash at that point. And second of all, if you're right, you will get credit for it. If you're right, Rudy Martzke will say so in USA Today. Um, and so that's our position for 2/3 of the trip to Albany. And now in the last, oh, 40 or 50 miles, he starts saying, 'What if I said he's going to knock him out in the first minute? Do you think that's too brave?'\"\nSame thing. \"Alex, if you believe he's going to knock him out in the first minute, go ahead and say he's going to knock him out in the first minute. I'm not here to control you or tell you what to say. Say whatever you want to say.\" I think I'm going to say that he's going to knock him out in the first minute.\nSo, the following day, we do a rehearsal for the opening on camera. And he says he'll knock him out in the first minute. Then, when we do the live opening on camera for the show, he gets a little more cautious, and he pulls it back to There you are.\nLook at that. Look at you hairported on the right. We'll get to that in a moment. Um, he, uh, he pulls it back, and when we do it live on camera, he says, \"Mike will knock him out in the first round.\"\nWas it 33 seconds or 31 seconds? I think it was 33 seconds.\nAnd all the way back to New York and groaning, \"Why in God's name didn't I say what I really believe?\" Like, \"Alex, Alex, you said he'd knock him out in the first round. You're going to get credit for that. You were right.\" Yeah, but I could have gotten more credit if I said what I really believe.\nThat's such a silly perspective.\nNow, you, we talk about fighters freezing. Marvis froze on Saturday. I mean, on, on Friday, the day before the fight, Marvis was frozen.\nWell, we knew, we knew coming into that fight. We knew it was a perfect fight for Mike to showcase because Marvis had the giant name because he was Joe Frazier's son, and Joe Frazier had been trash talking Mike, and it helped to create what ultimately became\nYeah.\nthe myth of Mike Tyson.\nThe notion that he was going to knock everybody out in that way partially because of stuff like that that Douglas is a 42 to 1 underdog in Tokyo.\nYes. When, if you looked at the record for the preceding year, year and a half coming into Tokyo, Mike went the distance with James \"Bonecrusher\" Smith. Mike went the distance with Tony Tucker. Mike went the distance with James \"Quick\" Tillis. There were scorers at ringside in upstate New York who had Tillis as the winner in the fight. He went to the last 10 seconds with Jose Ribalta. He went the distance with Mitch \"Blood\" Green.\nMhm.\nWhat did they all have in common? They were all taller than Mike.\nMhm. Some of them have a right hand that would come over the top where he would have difficulty seeing the delivery. And, um, when you get to Douglas, best athlete of the group, former college basketball player with good feet, had a big right hand. I mean, looking back, pure logic, no way in the world Mike should be a 42 to 1 favorite against Buster Douglas.\nBut Buster Douglas had underperformed most of his career and had not been motivated. Then his mother dies. That's correct. 100% correct. And you're right on point for saying it at this moment.\nYeah. His mother died. And then\nand that lit him up.\nLit him up and never again.\nAnd Mike was at the height.\nYes.\nOf his differences with Robin Givens.\nRight. Right. Constant turmoil and\nYeah. And partying and and feeling invincible.\nNothing that can do more damage to a good man than the wrong woman. Right.\nYeah.\nAnd she was the wrong woman.\nShe's the wrong woman, period. Yeah.\nThat was\nThere's, there's, there's certain women out there like that that they could tank your life. Yeah. And unfortunately, OJ used to say to me, \"If you want to know what the daughter's going to be like, look at the mother.\" And if you looked at her mother and the background relative to Dave Winfield and all of that, maybe you could have predicted, or, or as Merchant said in our on camera prior to the Tyson versus Tubbs Tokyo fight, first fight I ever did on HBO. Larry had a line before the fight where he said, \"This is the beginning of the Robin thing. Cus had died. Um, Jimmy Jacobs had died.\" No, Cus hadn't died. Jimmy Jacobs had, at any rate. Um, was Kevin Rooney was already out then.\nYeah, right.\nThat's right.\nYeah.\nLarry said, \"Since the beginning of organized boxing, heavyweight champions have often consorted with actresses and never to their benefit.\"\nIt's a classic Merchant among many classic Merchant lines. I love him.\nThat was one of the best things about you and Merchant and just the entire commentary team at HBO was that there's you had these intelligent, articulate people involved in what many people think of as the most barbaric of all sports.\nYes.\nSo, it defined it in a very different way.\nThat's the HBO way. Yeah.\nElevate it.\nIt certainly was elevated.\nEle and, and, and HBO's executives were smart enough to see that you can treat it as an intellectual event.\nYeah.\nAnd, and if you're doing it right, you'll get away with it with the commentators. It, it, it frames everything. The same exact event with crude commentators is not the same experience because you don't get that intelligent, articulate analysis. And a guy like Larry Merchant, who'd been around boxing for his entire life and had a deep understanding of it, and you, and then it's even the funny back and forth banter between Larry and George Foreman when they would disagree on things. It was brilliant.\nAbsolutely brilliant. And I'm very proud to say, not blowing my own horn, but Larry and George in particular, there's a sports television columnist in the New York Daily News named Bob Raissman. R A I S S M. And at some point in that arc, Raissman wrote in his TV sports column in the Daily News, \"Lampley, Merchant, and Foreman are the greatest three-man broadcasting team in the history of sports television.\" Now, think about that.\nThat's amazing.\nThis is not Monday Night Football. This is HBO boxing, right?\nYeah. You know, I mean, and so he was saying in effect, \"This is better than Gifford, Meredith, and Coell.\"\nWow.\nUh, and you know, I was, I was very, very flattered by that, you know, which I should have been.\nYeah, that's incredible. Yeah. Having a great team like that, and, and it was also, there was the flow where you guys had worked together so often. You really\nAnd there was the between round stuff.\nYeah.\nWhat set Showtime and HBO apart from ABC, CBS, and NBC? No commercials, right?\nAnd, and no commercials means you get one of the most meaningful and communicative parts of the narrative, which is what goes on in the corner between rounds. So, you're watching Tyson Douglas, for instance, and you see these two novice trainers struggling with a condom filled with water.\nRight. Right. To try to, to try to do something to ease the swelling in his eye. No inswell. Unbelievable. I remember Ray nearly fell off his chair when he saw that.\nIt's just so hard to believe that you could achieve the highest level of combat sports, the heavyweight champion of the world, and yet have this really rank amateur corner.\nThere was so much that was taken for granted about Mike.\nYes. During that stage of his career, the only person in that camp once Damato died, the only person, and Jimmy died, the only person in that camp who was really aware of how vulnerable he could be was Mike. Mike was a boxing genius. Mike knew much more than those guys about how to prepare for a fight, etc., etc. But again, before Tokyo, he was distracted.\nYeah, he was thoroughly distracted. And it just, it comes with success. All the trappings. I mean, he was just constantly, you know, you know, Mike, right?\nYeah. Yeah. Very.\nHave you had him in here?\nOh, a couple times. Yeah.\nOne of the most lovable people in the world.\nTo death. Yeah. He's great.\nYou can't not love Mike if you know him.\nNo. If you know him. I mean, the first time I met him, it's, it's hard to believe he's really in the room. You're like, I can't believe he's real. Like, he's right there. This is Mike Tyson.\nme as a child. I remember when I was a kid, when I guess I wasn't a child, I'm only a year younger than him, but when he lost to Buster Douglas, I didn't watch it until after the fight. I watched a replay of it, and I still expected him to win.\nYou know how crazy that is? Like, that's the kind of aura.\nSo, you read in the paper and on the web that he's lost, but you're still expecting him to win.\nI remember I heard about it in a gas station. Someone told me in a gas station, and I can't believe this is true.\nI was getting gas and I heard, \"Did you hear Mike Tyson got knocked out?\" And I remember pumping gas. \"What the [ __ ] are you talking about?\" Like, what? Like Buster Douglas knocked out Mike Tyson? What? For real? So we talked about the call of Foreman Mur and where that call came from. The other call that is on that\n\n\nSame level in terms of, you know, people remembering and stuff like that is that call, and you just came very close to identically articulating what my call was because, you know, I'm watching the rounds in Tokyo, and I've arrived in Tokyo with a firm opinion that Mike is going to knock this guy out in one, two, three rounds, something like that. And as the rounds go on and you're watching the debacle unfold, the, you know, water in the rubber glove to try to stop the swelling and stuff like that, you realize that the preparation might not be all there. And Douglas is getting more confident. And Douglas is landing his jab, etc., etc., and hooking off the jab and hooking off the jab. And I mean, people think that he knocked him out with a right hand. It was the left hook that that did the damage. The left hook was thunderous and like stumbled to his side, and then, but at any rate, I'm sitting there in Tokyo. It's 10:30 or 11:00 in the morning. There are 34,000 people seated around me making no noise whatsoever. Right? The culture of a Japanese sports event. It's as though they are at an opera, you know, and that's just cultural. It's the way they are. And as that count is rising, five, six, seven, and it's abundantly clear that Mike's not going to get up, and I'm thinking, \"Oh my god, what am I going to say about this?\" The very first live fight I ever attended was the biggest upset in boxing history. And now here in front of me, 12, 14 ft away, is the result that's going to supplant that as the biggest upset in boxing history. Wow. Oh, so what do I say? And I've told this story many times. If you've heard it, I apologize for repeating. But I was developing a golf relationship with the greatest actor of my generation, Jack Nicholson, who became a close friend and later served my career, but that's another story. And I had asked Jack on the golf course about 2 or 3 weeks before Tokyo, said, \"Jack, when you're going to the set to deliver the fulcrum line in the movie, when you're going to the set to do the one thing that everybody in the audience is going to remember, when you're getting ready to go deliver, you can't handle the truth. What is it you have on your mind? What's your mantra?\" And he said, \"Lamp, same thing I've been saying to myself ever since I first went to acting class. Don't overact.\" So, I'm in Tokyo, the count reaches four or five, and I hear in the back of my mind Jack's voice, don't overact. And that call became, Mike Tyson has been knocked out. in about that tone of voice. I wanted to make it as matter of fact as possible because there was nothing I could do to elevate it by screaming or shouting or delivering any kind of window dressing, etc. It was what it was. Right. Mike Tyson has been knocked out. That was that. I remember that. Yeah. Now that you said it, I remember that. Wow. Well, thank you. I appreciate you remember. So, it was energetic but matter of fact. Well, there it is. Come on. Come on. He's He It's over. It's over. Mike Tyson has been knocked out. All right. So, I did shout a little bit. Yeah, I did shout it a little bit. All right. I give myself too much credit for the matter of fact. But that of course was that's my younger voice. It was a little bit higher. You know, that was what a Octavio Moran was the name of the referee. I just remember Buster Douglas winning that fight thinking, man, what what happens to him now? Now he's Well, what happens to him, of course, is that he goes on a celebration rampage. He puts on, oh, I don't know, 40, 50 pounds, something like that. He tries to train them off, but not effectively enough. He goes into the ring against Holyfield, and Holyfield delivers one left hook, one perfect counter left hook in the first round, and we're out of there. Yeah, that's what it was. Was it was a left hook? I thought it was a right hand. Might have been a right hand. I don't remember. I could be wrong. See if you can find it. Might have been a right hand. Well, they'll find it. Yeah, Jamie will find it. But, uh, yeah, he just never reached those heights again. That was it. He just never I mean, yeah. I mean, also like the all the money, food. Food. He got real fat. He was an addictive eater. Here it is. Okay, let's see. Right. Right hand. You're right. Yeah. Then there were then there was a left hook following, but the right the right hand is the one that did it. I think the left hook missed. Yeah, the left hook missed. You're right. All right. So, one for ROGAN, zero for Lampley. It's It's cemented in my mind because I remember what year was that? Well, it's 1990 when Buster knocks out Mike. Was it? Yeah. Uh, no. No. Had to be earlier than that. Huh? No, it was it was it was 90. It was February February 10, 1990. Wow. February 10 in the United States. February 11 in Tokyo. Okay. Right. And so this is probably 91 then. Then he it might have been 90. Yeah. I I think it I think it was later in 1990. Yeah. I just remember you know when when someone does something extraordinary and rise to the occasion, I always root on them. I always root for them. I'm like, \"Wow, he's gonna turn his life around. He's gonna be great.\" So, now you're rooting for Buster to beat Holyfield. Yeah. Well, and also I was a giant Holyfield fan, too. So, it was one of those conflicted fights. And Holyfield to me was extraordinary because what he did with Mackie Schillstone and his training October 25, 1990. There it is. This time I was right. Yes. It was one of those things where Holyfield was one of the first guys that really embraced weightlifting. And uh I remember as a a young fighter I was always told if you lift weights it'll slow you down. Weights weights will make you stiff. Weights will slow you down. You should never lift weights. And so I listened to that and I I never lifted weights. And then um I remember watching Holyfield train for his heavyweight debut thinking, God, I remember I remember his fight with Dwight Muhammad Kawi. Remember that fight? Incredible fight. Like that was when he was a cruiserweight and I was thinking how is this guy going to go up to heavyweight? How is this going to work? And then strong mind. Oh yeah. Very strong mind. Unquestionably. You want to see Evander do something, tell him he can't do it. Oh, for sure. Yeah. But also one of the first applications of real modern science in regards to strength and conditioning. Y what Mackie Schillstone was doing was like very revolutionary. and to see him do all these crazy strength and cardio routines and and putting all that mass on and seeing all the doubters and naysayers. So, which other fighter looked at that and realized who Mackey was? Bernard Hopkins, right? Genius. He worked with quite a few fighters, didn't he, Mackey? I believe Mackey worked with quite a few fighters after that whole quite a few fighters. Everybody saw like that the results were there. So, yeah, everybody kind of changed their opinion on that. Did he work with any MMA guys? I don't know. I don't probably there's probably a few. It makes sense. Yeah. I mean MMA guys are leg I mean this is with MMA you have the grappling aspect of it. With without strength and conditioning you really can't compete. It's not really possible at this day and age. Everyone uses strength and conditioning. There's very few fighters that just train using skill. Just just train skills like George St. Pierre did that for a certain period of his career. I wonder if there's anybody left in boxing who who trains just using the gym skills. There were a lot of them when I was first involved in the sport who would never have touched a weight. You know, they they subscribed totally to the notion that that was negative, right? And it the worst. I mean, they definitely did calisthenics, but that was it. It was just body weight exercises, you know. Um, which brings us to Crawford, which I think is really interesting. The Crawford Canelo fight. Beyond interesting. Fascinating. Fascinating. Cuz how does Crawford compete with that size? And you know, we we have to recognize, okay, well, when Canelo fought Floyd, it was 152 pounds, right? So, he had dropped down, which was a struggle for him, which is why Floyd was so brilliant in getting him to go down to 152 cuz he knew he would be drained. 52 or 54. Well, the weight class, I believe, was 54, but I believe the clause in the contract for that fight was that he get down to 52. You're ahead of me. Let's see if that's true. Find out. find out if that's true. I'm pretty sure that that's true that they had a fight at one point. I love factchecking on the fly. Yeah, it's interesting. Um that was a struggle. The 54 was a struggle. Now Canelo goes all the way up to 68 and then even to 75 and now back down to 68. Whereas Crawford is leapfrogging. He's going he goes to super middle 47 to 54 and now to 68. And the Madrav fight in 54 is iffy difficult fight. Yeah, difficult fight. 152. 52. You were right. Joe ROGAN scores again. Yeah, I have a goofy memory. It's It works a lot of the time, but sometimes not. Sometimes Sometimes it's like I don't think you could do this podcast without having a spectacular memory. Sometimes it's super accurate and sometimes it's just terrible. I don't understand why, but um but certain things I do remember. And I do remember it because of the weight cutting thing cuz I remember thinking like what a brilliant move to get him to do that the same thing that Javvante Davis did with uh Ryan Garcia. Yes. Like you can't rehydrate, right? Like which is like no rehydration club. Sucker bet. That's such a sucker bet. You're going to lo but it's like the same thing with Pacquiao taking the fight when it's Don't you think some of that is Tank reading Ryan's personality and playing him a little bit? Oh yeah. Yeah. Yeah. You're [ __ ] with him. Yeah. You're giving him other things. Tank is a brilliant con artist. Oh, he's so good. He's so good. And boy, the Lamont Roach fight. Oo. Well, that was a knockdown. Oo. 100% was a knockdown. And that's a you have to call a knockown. Dramatic mistake by the referee. Without that, you have a decision victory for Roach and he's a superstar. Now you have this [ __ ] draw that they have to fight again. But now Javvante knows what's coming. They had fought in the amateurs. Correct. They both have knowledge now. You know, Roach knows that his counter punching can be effective against Tank and Tank knows that he has to make an adjustment if he's going to land a power shot. Well, it's also Tank is another guy that has experienced all the trappings of fame. All the success and the money and, you know, all the jewelry and all the craziness and the ladies and all and Roach hasn't. And Roach has not. And Roach is a hungry [ __ ] who can really fight. Yeah, he can really fight and he should have got his flowers after that fight. And you know, a lot of the boxing people recognize like that was that was a knockdown. But forever in the history books, it's not a knockdown. When you take a punch to the face and then you take a knee, that is a [ __ ] knockdown. Period. End of story. I don't care if you got your hair [ __ ] perm stuffed. It's like a literary idiosyncrasy. Okay? And both of our sports, boxing and MMA, are littered throughout their history with these things that are egregiously unfair at the moment, but also prompt us to remember the fight and and remember both fighters. If if you're a fighter who has been victimized by a severe injustice in one of your fights, the audience is going to remember you sympathetically and be more interested in your next fight. So this so this is an entertainment enterprise and anything that contributes to your legend is ultimately going to pay you back somewhere down the road. Yes. Yes, that's true. There there's definitely something to that. And then so Lamont will have a lot of fans on his side going to that Oh, big time. Yeah. In fact, I would put the fight in DC. Uh although I I don't think Tank would want to do that. Is that fight scheduled? Not to my knowledge. Um, not to my awareness. Jervante Davis. I'm totally focused on Canelo Alvarez and uh Terren Crawford at this particular moment. Are you calling that fight? No. All right. At least wait a minute. Let Let me say I don't know. You don't know? I don't know. There was a there was a news conference in New York yesterday and they announced that Max Kellerman is a part of the broadcast team. Okay. So, so that's only one person they've announced. This is obviously I'd love to call the fight, but I don't know yet. August 16th scheduled scheduled for August 16 in Las Vegas. Wow. Boy, I might go to that. I might go to that. Maybe I'll go with you. Maybe we should. That would be fun. Hey, we're getting along really well here, aren't we? Yeah, for sure. Yeah. So, I enjoy the conversation. It would be fun to go sit at a live fight, wouldn't it? Oh, no. Was that a Is that a UFC weekend? God damn it. Let me check real quick because it might be. Yep. [ __ ] UFC in Chicago. All right. All right. I'll call you later that night and let you know. I will watch it. I will have it on my phone. I'll I'll set my phone up and\n\n\nHave it there while the fight's going on.\nAll right. Looking forward to it. So, who do you like in Canelo versus Crawford?\nWell, I'm a giant Crawford fan because I think he's the best switch hitter since Marvin Agler.\nI'm a giant Crawford fan because I called his coming out fight against Bradus Prescott and then various other stepping stones throughout his career.\nI also think he's one of those guys that if you tell him he can't do something, he wants to show you in shock.\nThousand%. Absolutely right.\nI also think Canelo is slowing down and Canelo is a more of a one punch fighter now than the combination fighter he was when he was younger.\nWe'll see. Not not yet ready to subscribe totally to that because again, you're talking about somebody who is stubborn and who wants to prove everything he can prove.\n100%. I agree with that, too. But I think there's a there's a like in boxing and certainly in MMA, there's a certain amount of years where a fighter can keep the RPMs up and you know when you're in the red line and I there's there's some people subscribe to the idea of nine years.\nThere's nine years is the most that a elite fighter in MMA has performed at their prime.\nI think that's a [ __ ] number because I think it's entirely dependent upon lifestyle, nutrition, discipline, physical attributes.\nThere's a lot of factors.\nGeorge Foreman won the heavyweight championship of the world in boxing at age 45.\nTrue. But he took 10 years off.\nYes. So eight years off. So you have to like factor in.\nBut were the 10 years off good or bad?\nDid they dull his reflexes or did they actually allow his body to recover in such a way that I mean you could debate that all night?\nAll night. And George is biologically very unusual.\nI mean, he had canned hams for fists.\nThey were gigantic fists and intellectually unusual as we discussed before.\nYes.\nAnd boy, you know, one of my favorite all-time heavyweight wars was him and Ron Lyall.\nThat was one of his all-time favorite heavyweight wars, you know.\nYeah. He he loved he loved to reminisce about the Lyall fight, you know.\nOh, that fight was crazy.\nEvery fighter loves drama and they love having been a part of drama.\nSo George loved that.\nThat was an insane fight.\nInsane. All the knockdowns.\nBoth guys rocked and hurt.\nYep.\nAnd Ron Ly, another one of those guys just kind of lost in the the history books.\nYou know, people sort of forgot except for that fight.\nYou know, there's a few of those guys that like people just kind of have forgotten.\nThey attached them to one fight.\nYeah.\nBecause they didn't ever have that shining moment again in their career.\nYeah. What a cruel game.\nWhat a cruel game.\nYou know,\nAli and Cleveland Williams.\nSure. Same thing.\nRight. Right.\nCleveland Williams is a murderer.\nHe was nasty knockout puncher.\nAbsolutely.\nBut Ali just boxed his face off and put him away.\nThat's exactly right.\nBig cat.\nThat that was the one that caused a lot of people to realize, oh, Cash's Clay is a really legitimate, meaningful talent.\nYeah. You know.\nYes. Yeah.\nAnd that's on the way to the first Liston fight.\nMhm. Yeah. Special.\nIt was a special fight.\nThe first Liston fight was crazy.\nIt was crazy.\nAnd also the crazy thing was there was something probably on Liston's gloves, right?\nIt got in Cash's gloves.\nThere was unquestionably something on Liston's gloves.\nAnd Cases at one point asked Dundee to cut his gloves off.\nMhm. That's right. That's right.\nBecause he was blinded.\nYeah.\nSo I think it's the fifth round where he ran and and had to stay away because he was waiting for his eyes to clear.\nYeah.\nYeah.\nAnd then by the seventh round, he knocks Liston down.\nYeah.\nAnd Liston effectively quits.\nWhat a dirty business to put something on your gloves to get in someone's eyes when you punch them.\nSo crazy.\nWhat a dirty business to load someone's gloves with what amounts to cement and send them in to fight Miguel Cotto in a pay-per-view in Las Vegas.\nYes. Yes. Yes. Yes.\nYeah. They they put holes in the gloves, removed some of the stuffing and watered it down.\nAnd then he also did something to his hand wraps as well.\nRight.\nHe was hitting Cotto with bricks.\nYeah,\nthat's all I know for sure.\nAnd and he and he could have killed him.\nYou know, he Cotto went through a life-threatening experience.\nAnd I always, you know, don't fall in love with a fighter.\nYou could not know Miguel without falling in love with him.\nHe was a wonderful, sweet, uh, great person.\nSo, I was very very um deeply disturbed and upset and sentimental calling that fight that night.\nUm not because I knew that Margarito's gloves were loaded.\nI I didn't.\nI just knew that I knew that Miguel was getting beat.\nWe didn't know until the Shane Mosley fight.\nThat's exactly right.\nRight. Shane Mosley's\nAnd I remember, you know, walking away from Vegas with a bad feeling after the Cotto fight.\nHow could that happen to Miguel, etc., etc.\nAnd then it's I don't know several weeks later, maybe three months later when we're in LA getting ready for um the Mosley versus uh uh Margarito fight and I hear in my headset there's a disturbance in Margarito's dressing room.\nThey're making him take his gloves off and da da da da.\nAnd at that moment it all comes together.\nYeah, that was a hand wrap thing.\nI'm conflating these two stories in my mind with Louis Resto and uh Billy Collins plaster of Paris.\nYes. That so Lou Resto was with Panama Lewis.\nYes.\nPanama Lewis who famously gave that drink to Aaron Prior.\nYes.\nYes. Get me the one that I fixed.\nAnd then Aaron Prior goes out and knocks out Alexis Arguo which is alleged to have been cocaine.\nA lot of people think it was co because Aaron then went to famously have a cocaine problem, right?\nUm but the Louis resto\nI don't see how cocaine could help you in a fight.\nI really\nIt's a stimulant.\nHuh.\nIt's a stimulant.\nYeah, I guess you're right.\nIt's a stimulant.\nYeah. If you're exhausted and all a sudden you get a bump and you're fired up and you go out there and [ __ ] him up, it could help you.\nCertainly if you're tired.\nYeah, 100% it would help.\nI mean, come on.\nI've never done cocaine, but I'm just guessing.\nIt ruins a lot of other things.\nThat's all.\nOh yeah, it does.\nBut in that moment, I guess, you know, in that moment, especially if you're a person who imbibes and you, you know, you've had a history of cocaine and then, you know, what does it do?\nIt boosts up confidence and it's a stimulant, I would imago fight.\nWoo!\nPhenomenal.\nOh my goodness.\nPhenomenal.\nAnd he's, you know, again, another great person.\nUh, another really I didn't know Aaron all that well, but Alexis was lovable in every way.\nWasn't he murdered?\nHe was a politician in Nicaragua, right?\nDoes he was he murdered?\nYeah.\nYeah.\nNicaragua.\nYeah man.\nThe So I was conflating those the the So with Margarito, I think it was just the wraps where they had put plaster Paris in his wraps, but Billy Collins Jr.\nAnd Louis Resto was a fight where Billy Collins was this upand cominging fighter and he fought Louis Resto and Louis Resto was like breaking his face open with every punch and he and there are photos that you can find on the web of Collins that show that.\nYes.\nAnd so Resto then when the fight was over, Billy Collins dad grabs Resto's gloves and realized there's no padding in the gloves.\nRight.\nAnd then Billy Collins's career is over and he winds up drinking himself to death.\nActually drive drove into a tree.\nYeah.\nSo, we don't know whether that was suicide or not.\nWe don't know.\nNo, baby.\nYou know, the guys he couldn't see after that fight.\nGreat story.\nWere [ __ ] I hope everybody who is listening to this will go to the web and pick up some of these things because you are touching on a lot of the most meaningful and poignant stories.\nYeah.\nThere's the photo right there of Billy and there's his dad in the photo.\nCrazy.\nJust crazy.\nI mean, his vision was [ __ ] for the rest of his life, for as long as he lived after that.\nNever fought again.\nAnd no, and everyone was so confused because they couldn't believe that this guy Louis Resto was not known as being this big puncher, was just busting him up with every shot he landed.\nIt was confusing.\nIt's a dirty business, man.\nAnd Panama Lewis was he did some corner work with Mike Tyson as well.\nRemember like later in Mike's career when everything was kind of chaotic and he had all those whackados in his corner, Panama Lewis was like on the sidelines there but wasn't able to be officially a part of it because he was still banned.\nWell, you know, Mike by late in his career had a very clear understanding of his vulnerabilities.\nNow, Mike was a boxing scientist and he knew better than anybody that styles make fights and that there were certain stylistic matchups which for him would be difficult.\nHe had spent a week training with Lennox Lewis when they were 14 years old.\nUm cuz Lewis's Arie Beam, his amateur trainer, had brought Lennox from the Toronto area to Canesto I mean not to Ken Stoa but to upstate New York.\nUm to the Catskills and uh Mike and Lennox spent much of a week, maybe all of a week watching old black and white bite films on the wall, sleeping in the same room, training and sometimes sparring every day.\nWow.\nAnd so Mike had known Lennox for a long, long time uh by the time they met June 8, 2002 in uh Memphis.\nAnd um\nI don't I don't know that he would subscribe exactly to me saying he knew what was coming, but I I think he had a pretty good idea.\nAnd you'll recall that at the first news conference, he ran across the stage and bit Lennox on the leg.\nYeah, he went crazy.\nLennox claimed that he drew blood through through the pants leg.\nAnd um and my interpretation of that at the time was he wants to get the fight canled.\nHe wants to get this fight wiped away.\nWell, you got to think this is also 12 years after the Buster Douglas loss.\nYes.\nWhich is a long time in boxing.\nLong time.\nAnd and a lot of trials and tribulation.\nPrison.\nYep.\nYou know, you I don't I mean, you might maybe you get a little chance to train in prison, but No,\nnot the way you train in a boxing gym.\nNo.\nSo,\nwell, you know,\nso he paid a lot of prices for a lot of experiences.\nThere it is.\nI didn't know this happened.\nLennox throws a right hand.\nI'm not sure he landed that right hand.\nMight have broken his hand if he'd landed it on Tyson's jaw.\nCrazy.\nThat's the hard part about bare knuckles boxing, right?\nOh, yeah.\nThey break their hands all the time.\nYou know why?\nYou know why gloves emerged?\nGloves emerged because John El Sullivan got tired of breaking his hands.\nReally?\nYeah.\nHe was a big proponent of behind the scenes of going to gloves.\nAnd then of course in the first gloved prize fighting heavyweight championship fight, he loses to Corbett.\nAh\nbecause Corbett was a boxing scientist and back then they probably had terrible medical treatment for broken hands.\nLike what did they do?\nI don't know.\nBut\nI mean they didn't have the kind of surgery that they have.\nCertainly not the sophisticated surgeries that take place now.\nYeah.\nIf there were any surgeries at all.\nYeah, they probably\nHe got tired of breaking his hands.\nAlong comes this idea, this phenomenon of gloves.\nYeah, absolutely.\nLet's do that.\nWow.\nAnd then he loses to Corbett.\nWow.\nI was uh watching a piece yesterday about uh it was a YouTube video on Sugar Ray Robinson and his training and the the type of training that Sugar Ray would do and how phenomenal his dedication was.\nAnd if you think about a guy that like when he had his first loss, how many fights had he won?\n120.\nYou know how crazy that is?\nYeah.\nStop and think.\nI sort of have a sense of it.\nYeah.\nStop and think about how insane that is.\nDid you ever drink in Jimmy Glenn's bar in New York?\nNo.\nJimmy's Corner?\nOh, that's too bad.\nJimmy Glenn was a really great well-known corner man who worked with Robinson, worked with Joe Lewis, worked with a lot of really bigname fighters.\nAnd he had a bar on 44th between 6th and 7th.\nIt's the still to this day, I think his son is running it now.\nI hope he still is.\nUh the ultimate boxing bar.\nThe photographs on the wall, the atmosphere.\nOh, there we are.\nWe're in a cool little\nWe're in Jimmy's Corner.\nYeah.\n24th between sixth and seventh.\nThere's gone.\nThere's Jimmy down to the left.\nIs it still there or is it gone?\nUh, the bar, I think, is still there.\nJimmy's gone.\nUh, what a wonderful, wonderful, loving man.\nUm, he was like an uncle to me.\nUh, because I spent so much time in the bar and just his his stories were fantastic because of the people with whom he worked.\nWow,\nthat's awesome.\nYou got to go sometime.\nI would love to.\nI'd love to go sometime.\nSugar Ray Robinson was one of the first guys also that showed how effective being a great dancer.\nMy mother's favorite fighter really.\nAnd yeah, and I told you that the first fight she ever sat me down to watch was Sugar A Robinson versus Bo, right?\nAnd the last thing she said before she left the room and left me in front of a little TV set on a TV dinner tray was, uh, Sugar A Robinson's my favorite fighter because he dances while he fights.\nWow.\nAnd he did.\nAnd he did.\nHe did.\nHe uh you know that was the thing about his training.\nYou know this uh video that I was watching was so interesting to watch someone who's really just ahead of the curve like above everybody.\nLike no one really understood how to move like that.\nAnd then of course Cash's Clay his favorite fighter Sugar A Robinson\n100%.\nSo\n\n\nHe's like a heavyweight version of Sugar A Robinson.\n\nSo what's the greatest asset for any fighter? Is it his punching powers? Is it his hand speed? Is is his footwork or is it his intelligence?\nIt's the mind.\nIt's the mind. But it's the willingness to accept what you need to accept and to see what you can do.\nThat's what makes for great fighters. And also the ability to objectively analyze your skills and recognize where you need to advance and what you need to do differently because you have a trainer to help you with that.\nYes.\nYeah. But you don't have coaches per se, the way you do in organized team sports and stuff like that. At the end of the day, you're the one. We got to figure this out, you know, and you can have an idea of what's effective, but until you see someone come along and do something totally different, you like that's the where the innovators come in, where the real groundbreakers come in. Like I bet before Sugar Robinson, nobody like you, you had Willie Pep, right?\nWell, you've mentioned what I think of as the modern supreme innovator earlier.\nYeah. Yeah. He recreated, you know, our approach to the sport.\nWell, you see a lot of that now in MMA. You see a lot of footwork and movement and switching stances. It's like a fighter that can't switch stances in MMA is kind of archaic because you I think we'll reach that point in boxing too, right?\nI think eventually as as time goes by.\nWell, Haggler was an example of one of the first guys to be a switch hitter that people sort of dismissed. So you just you earlier we talked about Canelo versus Crawford.\nYes.\nDo you think Terrence Crawford can beat Canelo Alvarez?\nYeah, I think he can win.\nOkay.\nI don't know if he's going to win, but I think he can win.\nHe's going to have to He's going to have to box a brilliant fight.\nOkay. What kind of a fight? I'm I'm going to get to that. I asked the great Jim Lampley, 90 94 years old, living on Ocean Boulevard in Santa Monica, looking out at the ocean, reflecting on all the amazing things he did. And I asked Jim, I said, \"Do you think Terrence Crawford has a beat has a chance to beat Canelo Alvarez?\" And Jim said, \"Jim, did Ray Leonard get an official decision victory over marvelous Marvin Haggler?\" And I said, \"Yes, he did.\" He said, \"Well, if Ray Leonard could beat Marvelous Marvin Haggler, then Terrence Crawford can beat Canelo Alvarez.\" And I said, why do you say that? He said, same equation. Get in, get out. Get in, get out over and over and over. He's got to figure the angles and the approaches that will allow him to step in, land to the body or occasionally upstairs, and then get out before he's facing any damage.\nRight. That's what Ry did so effectively against Haggler. And it frustrated Haggler. Uh, and the more you frustrate the opponent, the better off you are.\nYeah. Canelo has such unique skills. And one of the weird things that he does that very few people since Rocky Marciano does is he punches your arms.\nYes.\nHe brutalizes your arms.\nHe's another brilliant guy. He has the greatest punch resistance in the sport. You know, we talked about it earlier. one knockout in the whole career and it wasn't a knockdown and it wasn't really a knockdown in in my uh personal view. Um so because it didn't touch the canvas, he's never been on the canvas and and we call it chin and I think that we kind of missed the point by calling it chin because I used to be Canelo's neighbor in Delmare, California. Used to run into Chepo, his senior trainer at the grocery store. I'd look into the cart and say, \"Oh, he's he's eating tuna.\" And he said, \"Yes.\" And and he's eating chicken. Da da da. And um and so I also used to go down the hill from my house off of Via Debay in uh Delmare and watch him train at the equestrian center where he would go to the equestrian center in the morning and do two and a half hours of hunter jumper riding before going to his gym in the afternoon to do three and a half hours of boxing training.\nHunter jumper riding. What is that?\nHunter jumper is where you you go over jumps and you uh with a horse.\nYeah. On the horse. Yeah.\nWhy the [ __ ] would you do that when you're training for a fight? What if the horse\nbecause he was he was riding horses since he was a little kid. He was skilled enough to do it. You controlled the height of the jumps. You say set the jumps at 36 in or 40 in. You know what the horse can do. It's all about staying on the horse. And uh and I asked him, you know, how can you do that? And he said, \"Everything I do in boxing is upper body and everything I do on the horse is lower body.\" And on on that basis, I am the one who theorizes that the reason you can't knock him down is not because of his chin. It's because of his legs, his base.\nYou can't get him off balance. He's too strong from the waist down. And you know, if other fighters would pay attention to what Canelo does, they might go do a little horseback riding.\nI wasn't even aware of that until you brought that up. That's ext that's incredible.\nThere he is with his horses.\nWow.\nThat completely makes sense if you think about it. Squeezing with the lower legs, the core strength.\n100% correct.\nThe balance.\nThe balance. Exactly. The timing. All of it. Yeah. I I trained Hunter Jumper for a couple of years in the really early 90s trying to please a wife who was a horse freak. Okay.\nAnd I I had a really great trainer uh at uh the stables over next to Griffith Park in Los Angeles. Fabulous trainer named Jonathan Seresi. Hey John, if you hear me. Um, and uh, I trained for I don't know, I want to say 3/4 of a year uh, riding hunter jumper. And I got to the point where I was jumping 36 38 in jumps and I was riding quality horses and I was doing pretty well. And one day after my training session, I was in the stall combing the horse down, brushing to do the things, the busy work that you're supposed to do to be a part of it. And Jonathan came in and said, \"How do you feel about your riding?\" I said, \"I think I'm doing pretty well, don't you?\" He said, \"I think you're doing really well.\" He said, \"But I think that this would probably be a great day for you to quit.\" I said, \"Quit? What are you talking about? you just said, \"I'm doing pretty well.\" He said, \"Well, you're doing pretty well because you love to do the fun stuff. You love the jumping and you love the riding around the ring fast, etc., etc., but you don't want to do the busy work. You don't want to do um what we call sitting trot and the other things that help you to build your awareness and your command uh of of what you do. And the result is that you're getting closer and closer to the stage at which something negative is going to happen. And the first time something negative happens, you're not going to be able to respond to it. So, I think today would be a great day for you to quit.\nWhoa. Wild, right?\nDid you listen to him?\nI quit.\nI went I went home and thought about it and I thought he's right. But wouldn't positive, constructive advice being if you enjoy this, there's some other stuff that you need to do. Well, he I mean he did say, \"Look, I'm perfectly happy to keep training you if you will come and do the busy work that I need you to do to 20 to 30 minutes before you go out and and jump. But if you just want to come here, sit on the saddle, and run and jump, you're asking for trouble, and I'm not going to be part of it.\"\nWow.\nBecause of course, if you fall off, and I saw this one a couple times, if you fall off, the horse can stomp you. M you get a hoof on the chest or a hoof on the neck.\nOh,\nand you know you're in the hospital and you're in big trouble if you're lucky.\nI saw it happen to a woman in the ring. A really good rider.\nSo at the end of the day, you can't do that.\nYeah, there he is. Look at Canelo.\nWow.\nNow that is that's that's a skill he has carried since his early childhood.\nThat's crazy.\nYou can't knock him down. That makes so much sense. Also, he's got a square head.\nYeah,\nhe's got And it's not a small head. He's got\nBut he's he's also got a brilliant mind.\nOh, clearly.\nGive credit where credit is, due.\nNo doubt. No doubt. I mean, the just the evolution in the three fights with Triple G. Triple G was one of my all-time f.\nIf you can fight Triple G and never be badly hurt,\nright, that's a great point.\nThat's astonishing. Triple G never badly hurt him.\nYeah.\nAnd he was destroying everybody else you put in his pack.\nEverybody. Yeah. Everybody.\nOne of the heaviest punchers I ever saw. And he would do weird stuff like throw a a a left hook over the top and hit the top of your head. He would throw a left hook like that. Like a looping over overhand, which by the way is very much like the shot that Douglas landed against Tyson in the 10th round over the top with a left hand.\nYeah. But but the way Triple G would do it, it would be going down on you. down on you. It's weird. It was a weird punch. And he would hit you in the forehead, which is like or the temple, which is where a lot of people lose their equilibrium.\nWell, whatever they do in Kazakhstan, it might be different from what they do in the United States.\nNo, he was special. He was very special.\nAnother guy we we got to talk about, Julio Cesar Chavez, who's also one of my all-time favorites. Julio Cesar Chavez in his prime. He would just systematically break people down and the volume like constant constant attack and volume. His volume volume was the real key because his power shots did not look like hellacious power shots. Okay. His left hook didn't look all that devastating.\nIt wasn't a one punch guy, but it would hurt you. You know, over time he would break you down.\nTaylor fight.\nAnd then we go to the Taylor fight.\nWhat is it? Two seconds before the final bell that the fight gets stopped.\nYes.\nLarry Hazard stops it and everybody wants to kill.\nNot Larry Hazard.\nIt wasn't.\nNo, it was Richard Steel. That's right.\nRichard Steel. That's right.\nOkay. So, you corrected me on one earlier and now I got you. It was That's right.\nThat was Richard Steel. And And And he took a tremendous amount of grief for that.\nAnd I think he deserved the grief. I thought it was a very bad stoppage. You had a an unbeaten American Olympic star who's on the verge of his career definfining victory. There's no question at this moment that he has won the fight. When he stands up and Steel is counting, watch how he gets distracted when Lud Duba steps up on the ring apron and when he looks away from Steel, Steel uses that as his pretext to stop the fight with two seconds left. All right. giving Chavez a victory that he did not deserve.\nRight.\nIf if Duva had not stepped up on the apron and and distracted Meldrick in such a way that Meldrick looked away from Steel, then I think that Steel would have caught a lot more heat and wouldn't have had any valid pretext for stopping the fight.\nWhat if that had been in the eighth round?\nWould you be okay with it?\nFight goes on. No, I I mean I I Well, if that had been the eighth round, no, I still wouldn't be okay. But it's the first knockdown. It's not as if he knocked him down three or four times, right?\nMeltrick could won the fight.\nYeah. No, it's all It's interesting, right? The subjective calls of stoppages by referees.\nYeah.\nThings get very\nIt's one of the toughest things. Good stoppage, bad stoppage, etc., etc. It's one of the toughest things. and and I disciplined myself to be very very careful about ever um criticizing a referee in the moment. I'm not sure that I criticized Richard that night. But I'll tell you one thing, this is in some ways part of the proof of the pudding. Las Vegas boxing fans and Las Vegas boxing crowds are knowledgeable, right? They've seen more of the sport than other people. They know what they're watching. Richard was never again introduced in Las Vegas before a fight without the crowd booing.\nWow.\nHe was subjected to booze every time he was introduced.\nWow.\nWhich shows you that a majority of the fans in that particular boxing capital agree with me that it was a bad stoppage.\nImagine what that did to his psyche.\nLike every time you go out there, you have the whole crowd. I think he wound up committing suicide.\nSteel. Yes,\nthose booze might have had something to do with that.\nThat's what I was gonna say. Did Richard Steel commit suicide?\nI think he did.\nThat's a great fact to check because I don't know.\nI think he did.\nAnd you got to imagine the the kind of depression that would come just knowing that you altered the course of boxing history with that one momentary decision.\nYes. Yes.\nYeah. you know. So, so, so Chavez, Chavez is avenged in certain ways. De Laoya beat him twice.\nUh,\nhere's one where he didn't where he won, but he shouldn't have won. Pernell Whitaker.\nYeah, that's right.\nWho's another genius?\nYes.\nOne of one of the greatest defensive boxers of all time. Like certainly in the top. Certainly in the top five.\nYes. Genius. And I remember that decision being called and I was like, \"What the [ __ ] is this?\n\n\nThat was nuts.\"\nOscar was Oscar, you know, and he had a glamour image that was difficult to deal with at that time, you know.\nSo, uh, that kind of that kind of thing was part of the reason that my dear friend Fernando Vargas was in some ways jealous of Oscar.\nYou know, what other fighter would get a decision over Pernell Whitaker in that circumstance?\nBut wasn't it Chavez?\nDidn't Chavez have a decision win over Pernell Whitaker as well?\nSure.\nThat's the one that I'm talking about.\nThat's the one that you're talking about.\nI thought you were talking about Delo Hoya versus...\nSo, is that one similar as well?\nI don't really recall that one.\nAster gets a decision win over Whitaker on a night when Larry and a lot of other experts thought that Whitaker deserved the decision.\nWell, Whitaker was like underappreciated because it was so defensively brilliant.\nWell, sure.\nI mean, knocked a lot of guys out.\nGreat defenders never get as much credit as the... I mean, know Hopkins, right?\nHopkins had to become a media star late in his career to really get credit for what he had done.\nYeah.\nWhen you look back at your career and all the fights that you called and and think about the beginnings and think about when they were trying to just get you out of the business and by giving you boxing, like it's almost like it's a very much a story book tale.\nOh yeah, it really is.\nBut the part of the reason for using \"It Happened!\" as the title of the book is that there are so many circumstances in my career which are like that, counterintuitive.\nSomebody wanted to do something with me that turns in the other direction, etc., etc.\nThat was not the first time that that kind of thing had happened to me.\nThe, you know, my whole career begins when I win a talent hunt in 1974 to become one of the first two people ever to stand on the sideline of a college football game with a camera and a microphone.\nHow do you do what is a talent hunt?\nHow does that work?\nSo, first of all, you read something.\nThis emerges from the Munich massacre.\nAll right.\nThis emerges from the 9, 10, 11 days of captivity, uh, of the American athletes, excuse me, the Israeli athletes by Black September terrorists in Munich.\nAnd during that period of time, ABC is of course the uh broadcast uh organizer for the United States.\nAnd during that time, two reporters, Howard Coell and Peter Jennings are pushing the control room.\nHow can we get more information?\nHow can we get sound out of the dorm room?\nHow can we get pictures from some adjoining building through the windows, etc., etc.\nAnd in trying to service the needs of those two reporters, Jennings and Coell, ABC Sports learned things about radio frequency cameras and microphones, wireless cameras and microphones that they had not known before.\nSo they came back to New York and they convened a meeting.\nThis is after the '72 Olympics.\nThey convened a meeting among the sports division, the news division, and the engineering division to figure out, okay, now that we know these things, now that we've learned what we learned in Munich, what can we do with it?\nAnd one of the first ideas that gets adopted is we can put a reporter on the sideline of a football game.\nSo in 19, in 1974, Run Arlage's chief administrative assistant, a guy named Dick Eversol, who later became a constant and meaningful factor in my career, Dick Eversol takes two lieutenants out to conduct a search at 16 different college campuses, and they talk to a total of 432 college age or extremely close to college age candidates for this job.\nI am at first harvested out because I'm number 34 out of 36 on a 97-degree day in Birmingham, Alabama.\nI have driven overnight from Chapel Hill to get there.\nI'm wearing my best discount plaid suit.\nI look ridiculous in a pair of uh uh shoes I bought with two and a half inch heels so they'll make me look taller.\nAnd and I go into the room and have the screening interview and the screening interview is 12 minutes.\nAnd before and when we all have to draw numbers out of a fishbowl to determine in what order the interviews are going to take place and I'm number 34 out of 36.\nSo, I know I'm going to have to sit around in the Parliament House Hotel lobby for hours in Birmingham waiting to go in.\nAnd by the time I go in, I'm grinding my teeth.\nUm, and uh the first thing one of the other guys in the room, Terry Jastro, says to me is, \"What do you think of our our idea here?\nWhat do you think of what we're trying to do?\"\nAnd I couldn't resist.\nI said, \"I think it's the biggest croc of crap I ever heard in my life.\"\nAnd he said, \"What do you mean?\"\nI said, \"Well, you tell us that you're going around the country to interview 432 people for 8 to 10 minutes each, and on that basis, you're going to choose what you describe as the face and voice of the American college student.\"\nHe said, \"Yeah.\"\nI said, \"Errest my case.\nI think this is ridiculous load of crap, and I'm embarrassed that I drove from Chapel Hill overnight to be a part of this.\nLater, much later, I was shown the evaluation form on which Eversol had written, \"Arogant, abrasive, alienated, antagonistic.\"\nWhen I was finally chosen as one of the two people that became known in the college football production truck as the poor.\nEvery time I would [ __ ] about something, every time I would get upstreperous about something and raise my voice a little bit.\nThere it is, the four A's.\nArrogant, abrasive, alienated, antagonistic.\nBut you know, the bottom line was through a long and highly unusual process, I was the person who was chosen.\nNow, what was ridiculous about it?\nThe most ridiculous thing about it, which I've never really revealed until this year, the book media appearances, this the most prominent media appearance with your 19 million uh followers, was that um Run Arch was still the dictatorial and canonized president of ABC Sports.\nAnd I when I was under 11 years old, maybe 10 or 11, 12, living in Hendersonville, North Carolina, had asked my mother while watching Wide World of Sports one day, is this guy, Run Arlage, is he related to the Arges who live around the corner from us?\nYes, he's their son.\nSo, I grew up around the corner from Arage's parents.\nI cattied for both his mother and father at the Hendersonville Golf and Country Club.\nAnd when I was finally the person chosen, counterintuitively because I was 25 instead of 22 and because I had already done a lot of sports broadcasting and this person was supposed to be completely fresh.\nWhen I get chosen, I um meet Run in the restroom at 1336th Avenue in New York.\nAnd hi Ruin, I'm Jim Lampley.\nOh, great to meet you, etc., etc.\nAnd as he's going out of the restroom, I say, \"By the way, how's your dad?\"\nAnd he turns around, quizzical expression, says, \"Why would you ask a question like that?\"\nI said, \"Well, I guess nobody told you because probably nobody could have known, but I'm from Hendersonville originally, and I've caddy for both your mom and dad.\nIn fact, my mother's in the same bridge club with your mother.\"\nThe famous red face turned white and he said, \"Don't ever tell anybody that.\nNever ever reveal that to anyone.\"\nSo, of course, now it can be revealed.\nAnd why would you want that reveal?\nThat they had chosen out of 432 candidates, the one who grew up around the street from his parents.\nNo, he didn't know.\nWell, but yeah, he could say he didn't know and somebody might kick back.\nAt any rate, his his first instinct was to say, \"Don't ever tell anybody that.\"\nA long time has passed.\nRune has passed.\nThere are sideline reporters everywhere now.\nUh so, you know, I can very easily reveal and let you know that they accidentally chose the other accident was um they had already installed a guy from Stanford named Don Toliffson.\nAnd they knew that Tiffson was going to be chosen.\nHe was in the first batch of 16 people they talked to.\nHis credentials were unbelievable.\nAnd so they were dead set in their minds on choosing Don Toliffson all along.\nAnd um and now they were two, three weeks away from the first game, four weeks away from the first game.\nIt was August 8th and the first game was September 7.\nAnd August 8, uh, 1974, I'm at a rented beach house in Swan Corner, North Carolina with a friend of mine named, uh, Buck Goldstein and his wife.\nMy wife, Linda, and I are there.\nAnd the phone on the wall rings.\nAnd to this day, I don't know how Ever Soul got that phone number because the house was rented in the name of Buck Goldstein.\nSo Buck picks up the phone.\nHello.\nYeah, he's right here, Jim.\nIt's Dick Eversol.\nI, huh?\nWhat is this?\nHello.\nAnd Dick says, \"You know, I'm so glad I found you.\nWe are getting ready to announce the college age reporter thing, and we think we've settled settled on one person, but uh Rune is a little concerned about putting on the air somebody who has never had any on air experience at all.\nAnd within that discussion, that brought us back to you.\nWould you be willing to go to Birmingham, Alabama and do a a film in those days, 16-millimeter film, do a film audition for us?\"\nAnd I said, \"What do you want me to do in Birmingham?\"\nHe said, \"Well, there's a quarterback there named George Myra.\nHe's now with the Birmingham Americans of I think it was the World Football League.\nUm, he's already been busted out of the NFL, the AFL, um, Canada.\nThis is his last shot as a Pro Football quarterback, and we think it's an interesting story, and we want you to go interview him.\nSo, of course, they didn't know that I had watched George Myra play all three years of his college career at the University of Miami.\nHe was a huge childhood hero of mine.\nI had once hitched a ride in his very dull beige uh Ford Falcon uh going to pick up basketball on the campus of the University of Miami.\nUm I knew more about George Myra than probably some members of his family did.\nI still had a number 10 green and orange George Myra jersey in my uh closet in Chapel Hill.\nSo they they think they're putting me on the spot here to send me to interview George Myra and I'm going to have to do a quick research job with no web in those days to find out what I need to ask this guy.\nAnd I know more about George Myra than people in his family.\nSo I I go down to Birmingham.\nI'm laughing about it.\nI do the interview.\nI go through all these things in his college career and stuff like that, his 49ers experience and send the film off to New York.\nAnd about a week before the first game, I get a call and he said, \"You're going to be on the sideline.\nYou're going to be we're going to have two college football reporters.\nYou're going to be on one sideline.\nDon Toliffson will be uh on the other.\"\nRun feels a lot better about this because he can see that you have on camera performance skills and understand what you're doing.\nWow.\nWhat are the odds that they player?\nThe odds are astronomical.\nSo crazy.\nThe odds are beyond all belief.\nThey could choose any story in the world they wanted me to do as an audition.\nThey choose my childhood hero.\nIt kind of almost makes you feel like it's meant to be.\nCorrect.\nYeah, there's there's no other way to to describe it other than this was supposed to happen.\nYeah.\nWell, I think you're the best ever.\nSo, if that that's how it had to play out.\nThat's how it had to play out.\nAnd that's Steel thing.\nDid he kill... Did he commit suicide?\nI was going to bring that up later.\nOh, Jesus.\nI'm sorry, Richard.\nSomebody else committed suicide.\nWell, I mean, Larry Hazard commit suicide.\nRichard's dead.\nLarry Hazard's still around, I'm pretty sure.\nYeah, Larry Hazard is a athletic commissioner right now.\nYork State.\nMitch Halpern.\nMitch Halpern.\nOr New Jersey.\nExcuse me.\nNew Jersey, not New York.\nOh, Mitch Halpurn committed suicide.\nMitch Halpern committed suicide.\nOh, that's right.\nAll right.\nSo, what... So, what is Mitch Halpern's marker?\nOh, I, you know, I covered it.\nThere was a fight in...\nYeah, I covered it.\nIt was... It was one of mine.\nI can't remember right off the top of my head, but yes, there was a very controversial fight, right?\nYeah.\nA similar type situation.\nSimilar type thing.\nSomething that stains your reputation going forward.\nMy apologies to Richard Steel.\nI'm sorry.\nHalprin is, I believe, H A L P R I N.\nR H A L P E R I N R\nWhat was the big controversial fight?\nCan't remember right now.\nI saw Retalpin referee a number of fights.\nYou're right.\nHe did.\nHe did kill himself.\nYeah.\nYeah.\nI'm...\nThat's right.\nI'm connecting to it now.\nAnd as soon as we find out exactly what the fight was, I'll remember what...\nThat's the problem with like the circumstances.\nAgain, I told you my memory sucks sometimes.\nLike it's like Joe, I'm 76 years old.\nOkay.\nMy wife worries about whether I'm going to remember to put socks on in the morning.\nReally?\nUh oh.\nGabriel Willis.\nGabe Willis and Jimmy Garcia.\nOh yeah.\nOh my god.\nSo, one of the oldest dictims in the sport is that when one fighter dies, the other career dies, too.\nGabe was absolutely never the same.\nUh, and he allowed that fight to go on way longer than it should have.\nMay 6th, 1995.\nNever forget it.\nHot day outside in back of Caesar's Palace.\nMy wife was sitting with Jack Nicholson.\nCan't resist the name drop.\nUh, you know, there were a lot of things going on, but um Gabe was never ever the same after that and he uh you know Gabe went to Colombia or Venezuela, I forget exactly where, um, for the funeral.\nOh god, look at this.\nAnd also Richard Green committed suicide after the Manc...\n\n\nIni Kim fight.\nYeah.\nSimilar situation with Duck Koo Kim when he dies famously on national television. Ray Boom Boom Mancini and then that referee winds up committing suicide as well.\nIt's um, you know, it's a haunting thing because it's so intimate.\nYou're in the ring.\nYou're four or five feet away from these guys.\nYou're watching somebody land shot after shot after shot.\nYou're trying to gauge in your mind what is fair to the guy who's taking the beating, right?\nBecause he could always land one big comeback counter punch and win the fight.\nAnd there's been so many instances over time of guys recovering and coming back to win the fight.\nMany, absolutely.\nSo many fights that could have been stopped, and if they were, who knows what we've got would have gotten over and over and over.\nSo, you know, I was always disciplined and restrained about criticizing referees live because what they do is an extremely important and critical job.\nAnd sometimes they're the only, they're the only safety barrier between life and death.\nI was just thinking of the Diego Corales fight.\nDiego Corales, who with that crazy fight where he's knocked down multiple times, then comes back to win by knockout.\nArguably the greatest fight of all time.\nWho was it?\nWho was it against?\nCorales versus um, name is right on the tip of my tongue.\nCorales Jose Luis Castillo.\nIs that not it?\nThat might have been it.\nCastillo.\nIt was it, Corales Castillo.\nThat was it.\nJose Luis Castillo.\nAnd that's, that's arguably the greatest fight of all time.\nIt was a Showtime fight, by the way.\nI was watching it on uh, TV.\nEasily could have been stopped.\nHuh.\nEasily could have been stopped.\n100%.\nAnd Carales comes back and wins.\nYeah, exactly.\nAnd I believe he died in a motorcycle accident.\nCorales died in a motorcycle accident.\nYes, he did.\nYeah.\nAfter, after a lot of salacious revelations regarding his troubles with women.\nSo, but he was a sweet guy.\nYou could not know Chico without loving him, okay?\nAnd that's true of many very violent fighters.\nYou couldn't know Chico without loving him.\nYou couldn't know Mike in the early days without loving him.\nSo, um, the sport is filled with ironies.\nI'm sure MMA is exactly the same thing.\nIt is.\nIt really is.\nListen, I'm glad we had a chance to talk.\nI really appreciate it.\nIt was really fun.\nTwo hours just flew by.\nGreat.\nYeah.\nI think I, I think I, I've had a fantastic time with you and I really enjoyed every moment and yes, thank you.\nI'm glad we had a chance to talk and your book is available.\nIt Happened! A Uniquely Lucky Life in Sports Broadcasting.\nDid you do the voiceover?\nPlease tell me you did.\nI did.\nThank you.\nI did record the audio book.\nEspecially people, people who heard the audio book recommend it.\nYou have to do it with you.\nIt has to be.\nCan you imagine if somebody else, if they forced somebody else?\nDo you know the boxing writer Tom Hauser?\nYes.\nSo, Hauser is one of my dearest friends and and a great man.\nUm, and Ali's primary biographer.\nHauser has written a book about his mother and he knows about my relationship with my mother.\nAnd by the way, I read that you were raised by a single mother.\nIs that correct?\nWell, I have a stepfather.\nStepfather.\nOkay.\nYeah.\nI was raised by a double widow who never married again.\nHauser has deep and great affection for his mother.\nSo he wrote a book about his mother and I'm thrilled to tell you that he called me and said, &quot;Would you record the audio version of my book?&quot;\nAh.\nSo now I am going to record when I get back to Chapel Hill, um, Hauser's book about his mother.\nAnd that's awesome.\nIf you like hearing my book, then you'll probably enjoy reading or hearing my book about Hauser's mother, too.\nWell, I'm gonna listen to your book because I, that's how I absorb most of my books.\nWell, I've given away a lot of it to you.\nNo, I don't give a [ __ ] I'm listening to the whole damn thing.\nAnd I really hope that Netflix chooses you for the Canelo fight, the Canelo Crawford fight.\nThat would be fantastic.\nLike I said, it was made me so happy to hear you on the Madison, the Times Square card.\nToo bad the fights weren't uh.\nYeah, that, that was true.\nBut what do you think that is about?\nYou know, cuz there's a lot of people that have said that Turkey is spending so much money that he's spoiling these guys and they're afraid to lose and that they're fighting safe.\nFar be it for me to say anything about Turkey.\nOkay.\nYes.\nHe anything negative, he put me back at ringside.\nAll right.\nI'm very happy.\nOn a personal parochial level, I am a huge Turkey fan.\nYes.\nI think that um, more attention has to be paid to what real matchmaking is.\nUh, if you put two counter punchers in front of each other, that's not going to make a fire.\nTwo attackers, guaranteed fire.\nUh, an attacker versus a counter puncher, that can also be really good.\nSome of the greatest fights ever have been attacker against counterpuncher.\nBut it's a matchmaking issue.\nI believe it was.\nThat night you had too many instances where two counter punchers were standing in front of each other and waiting for the other guy to uh, to move.\nI also think that Roly Romero um, very intelligently beefed up, put on strength and went into the fight with Garcia with a defensive frame of mind.\nI'm going to take the air out of this balloon.\nUh, I'm going to slow the punch rate down.\nI'm going to land selectively when I want to.\nUh, and I'm not going to allow him to ever land a left hook.\nHe did a good job of that.\nHe also landed that left hook of his own.\nRocked him and dropped him.\nAnd I think that changed the the entire.\nAbsolutely.\nMentally changed the fight.\nYou know, Garcia's in there trying to land his left hook and all of a sudden he gets dropped by one.\nThat's, that's got to affect your mentality.\nWhat did you think about Devin Haney's performance?\nBecause I felt like that was an example of a guy like coming off of the Ryan Garcia fight where he got dropped multiple times.\nHe needed to put on a show and he didn't.\nHe just looked different.\nYeah.\nHe, if you go back to him versus Lach, of course, there's a lot of months in between, you know, you know, so we, it's not as if he's coming back two months later and you can draw a straight line from the mentality of of his Garcia fight to what he's doing in the ring that night.\nThat doesn't happen to be the case.\nUh, but it was definitely a disappointing performance.\nWell, you definitely can draw a line between a guy getting rocked and dropped on multiple occasions from a person that he was supposed to beat easily, right?\nIf you look at his boxing skill, you look at what he had done to Kambosus.\nI mean, he just boxed his face off.\nHe looked fantastic in that fight.\nBut you get, you get the benefit of being able to say to yourself if you want to, okay, he tested positive for a performance-enhancing drug.\nThat's the reason he knocked me down three times.\nYou know, if you can convince yourself of that, the problem is once you start saying that, people start saying, &quot;Fuck you.&quot;\nAnd then the booze get louder.\nI'm talking about saying it to yourself.\nI'm not, I'm not talking about saying it publicly.\nNo one's 100% correct about saying, no one says anything to themsself anymore.\nIf you say something publicly, the whole world responds now.\nIt's not like a guy living in 1976.\nThis is the different world we're living in.\nTell me about it.\nI'm sitting here on the Joe Rogan Experience with the possibility that 19 million people are talking, are listening to me.\nI'm sure I've made a mistake or two.\nWell, we both did.\nYeah, that's part of the fun.\nJust don't read the comments.\nThat's the key.\nJim Lampley, I appreciate you very much and I'm a giant fan and I'm, I'm really glad you're back in boxing.\nIt means a lot to me.\nAnd your book, It Happened: A Uniquely Lucky Life in Sports Television is available now.\nThank you, sir.\nI really forward by Taylor Sheridan.\nOh.\nOh, I love that guy.\nI have to take care of my friend.\nHas he been on the show?\nYes.\nYes.\nI love him to death.\nHe's a good friend of mine.\nFriend of mine, too.\nI love him.\nAll right.\nSo, we have a mutual friend.\nYes, sir.\nAll right.\nIt was a lot of fun.\nThank you.\nThank you very much.\nMy pleasure.\nThank you.\nI appreciate it.\nThank you.\nAll right.\nThat was everybody.\nAll right.\nReal handshake.\n[Applause]\n[Music]\n[Applause]\n[Music]\n"
}