{
  "episode": {
    "id": "Ru7BIqXQZns",
    "title": "Joe Rogan Experience #2335 - Dr. Mary Talley Bowden",
    "publishedAt": "2025-06-10T17:00:25.000Z",
    "description": "Dr. Mary Talley Bowden is a board-certified Otolaryngologist, Sleep Medicine specialist, and founder of BreatheMD: a direct-care ENT practice in Houston, Texas. In addition, she is a senior fellow with the Independent Medical Alliance (formerly FLCCC), the founder of Americans for Health Freedom, and also serves on the board of the Vaccine Safety Research Foundation.\nhttps://⁠www.breathemd.org⁠\n⁠https://posthillpress.com/book/dangerous-misinformation-the-virus-the-treatments-and-the-lies"
  },
  "channel": {
    "id": "UCzQUP1qoWDoEbmsQxvdjxgQ",
    "name": "Joe Rogan",
    "slug": "@joerogan",
    "url": "https://www.youtube.com/@joerogan"
  },
  "transcript": "Joe Rogan podcast. Check it out. The Joe Rogan Experience. Train by day. Joe Rogan podcast by night. All day.\n\nAll right. Very nice to meet you. Nice to meet you. I have uh I saw you on the Danny Jones podcast and uh I've uh read a lot of your tweets and Twitter and uh just the the entire ordeal that you've been through since uh the beginning of CO and so I felt like it would be very educational for people to uh hear your perspective. Well, I appreciate you continuing to talk about CO because uh I think a lot of people are sick of it. I'm certainly ready to move on, but I am too. But we've got It's just people need to make sure this doesn't happen again. Exactly. And nothing's happened really. Nothing's been corrected. No, not only has nothing been corrected, I was just watching an argument on television where they were trying to argue for uh vaccinating women who are pregnant. Oh, right. It's insane. I mean, there's a there's a golden rule of pregnancy, right? You don't you don't experiment on pregnant women. You don't experiment on an unborn child. You're not even supposed to eat sushi. Exactly. Right. But we're going to put this modified mRNA technology into these women who, you know, early treatment. We have early treatment. COVID is no longer a threat. We're dealing, you know, at one point it was more than a cold, but not now. Why? Why in the world would we give them to pregnant women or children? The only thing that makes sense is money, right? Well, and ego. And ego meaning because they've already recommended it because they don't want to admit that it's not effective. They don't want to admit their side effects. I mean, we have we have hard facts showing it should be pulled off the market. I mean, any other product would have been pulled a long time ago. If this were an antibiotic and we'd seen all the the carnage from an antibiotic, it would have been yanked off long ago. It should have been yanked off in the first month.\n\nUm there just there's no other explanation than there's just there's fraud, there's corruption, there's ego, there's money. Um but it's not science. No. And there's a lot of people that for whatever reason they have this very rigid ideology that the pharmaceutical drug companies are to be trusted and we should trust the science and that all these organizations whether it's the FDA or whatever it is that's connected to these assertions they should be trusted not just the average doctor who's talking about these side effects and all these different things that they're experiencing with their their patients. Yeah. I mean, I trusted them when when the pandemic started. I mean, I didn't think that the shots would work necessarily, but I trusted them. I didn't think they were going to hurt us. Why didn't you think they would work? Because they were rushed to the market. I knew the flu shots were already iffy. We're dealing with a virus that mutates. We've never been able to vaccinate against a cold, which, you know, it's a rapidly mutating virus. It's it's it's been tried before and they've it's failed. Well, if you don't mind, please tell everybody what your background is in in medicine. Uh, you know, I'm private practice, solo physician. I'm not head of the Mayo Clinic. I'm just a, you know, neighborhood ear, nose, and throat doctor that sort of got tangled up in this inadvertently. And I always thought when the pandemic started, I thought, well, this will be the hospital. This will be a chaos in the hospitals. I never envisioned getting wrapped up in this at all. Um, I, you know, I trained at Stanford and then I I moved to Houston, Texas after residency. Um, and then I I worked in a small private practice for seven, eight years. Then I started having a bunch of children and I pretty much gave up medicine. I mean, I took a seven-year sbatical. I wasn't even sure I was going to go back. Um, but then I just had this itch that needed to be scratched and I opened up a solo practice six months before the pandemic started. Oh boy. What timing? I know. Why? Why did I do it? You could have been out. I know. Yeah. Well, sometimes the universe has a calling for people, you know. It's been a very interesting journey. I mean, so take us through what happened with you at the very beginning like so co COVID starts making its way across the world. Yeah. So, I had people coming in with respiratory tract infections that were stubborn. They were not, you know, the typical colds and uh there was all this, you know, news that there's this virus from China. But, you know, you watch something on the news, you think, oh, you know, that's not going to really affect me. Um, but, you know, I started having more and more patients coming in. And at first, I really didn't know what to do. I just used common sense. I mean, I treated the symptoms. I used breathing treatments. I I covered for secondary infection with antibiotics. Uh, I used steroids, that sort of thing, and I had success, but I didn't have a lot of people, you know, showing up at my doorstep treat me for COVID. But I did start having people wanting to get tested. And you might remember that LabCore was the first lab in the country to offer the test and they just got completely slammed. So, it took two weeks to get the results back. We were already work I was already working with a lab for patients with chronic sinocitis who they were doing PCR testing for chronic sinocitis. So it tests for bacterial and fungal infections of the sinuses. It's called microgen DX and they came out with a saliva test for COVID. So and we were able to get the results back the next day. So I started offering that and my little clinic exploded because and I'm located in a strip mall which is is very purposeful. I'm I'm very close to the medical center, which is, you know, to get your doctor's office, it's a a 10-minute um navigation of the parking garage and another 10-minute walk to the office. And so, I was trying to locate my office where it was very easy to get in and out of. And then that served me very well during the pandemic because with these saliva tests, you could just take the cup to somebody's car, they could spit in the cup, they could leave it outside, it was contact free, you didn't have to shoved up your nose. And then we got the results back the next day. And so that sort of made me put me on the map um in my little neighborhood. And then I started tracking um you know who when the vaccines came out, I started tracking who was positive, you know, by their vaccination status. And so I started noticing that the vaccine wasn't working and that's sort of what got me in trouble. Um I also started giving monocolonal antibodies and I didn't ration them. So I became known in town as a place you could get monoconal antibodies without you know having to pass you know being a certain race or a certain age or or that sort of thing. What what do you think that was all about?\n\nYeah I I don't know but the monoconal antibodies is very frustrating to me. They worked very well. They were not controversial. People would turn around the next day. Um but and when they first came out I could get as many doses as I wanted. I mean, they show up at my doorstep the next day. Um, and it was great. I mean, that's that's that also sort of put me on the map with COVID. And then I didn't even use Ivormectin until the government took over distribution of monoconal antibodies. And then it became harder and harder to get them. And that's when I turned to ivormectin. But, you know, in my opinion, they did that on purpose. They they did that to encourage people to take the the co shot. Uh, it was very orchestrated. If you look at the timing the um you know in March uh the government put out the big um information on ivormectin and why you should not take it for co they put that on the FDA's website. Um at the same time they launched COVID 19 community core and this was April 1st 2021. This was an 11.5 billion dollar slush fund to propaganda to, you know, feed out propaganda and censor people. And the day that they launched the CO 19 community corps was the same day that Houston Methodist, which is where I had privileges, they um mandated the CO shots for all their employees. And they were the first in the country. And that's sort of how I got tangled up in all this because I had privileges there. And then I I was actually working with them. I was doing research with them. I was sharing my data with them to try to get it published. But then I started questioning, you know, the the the vaccine and how it wasn't working. I brought it to their attention first and they gaslit me. They just said, \"Well, it just it lowers severity.\" Um and when they when they ignored me, then I started speaking out on social media and that's how that's what got me in trouble. But so that summer um 2021 that's when the third and the largest surge of the pandemic started and this was after the roll out of the wonderful COVID shots that which are promised to stop transmission and prevent death and obviously didn't. Um and the government was getting frustrated. So they doubled down on their ivormectin attack and this was end of August 2021. They put out the infamous horse tweet said, \"Seriously, y'all, you're not a horse. You're not a cow. Stop it.\" A tweet went viral. It had dire consequences in my opinion. And then uh they approved they fully approved the COVID shot and then Biden mandated for um for employers with 100 more employees and that was right when they took you down. So it was all very coordinated. Oh, and then and then at the the final straw was taking away monoconal antibodies. they said. So yeah, that was the more fascinating thing about it to me is I listed a bunch of different things that I took. I including monoconal antibodies, but they only concentrated on ivormectin, but the the way they did it was like so transparent like changing the color of my face on CNN and everywhere. This concerted effort to call it horse dewormer. It was they try to make it look as preposterous as possible without ever explaining that it's been used more than multiple billions of times prescribed to human beings. Yeah. I mean they they branded you. When I think of you, I think of that that picture of you where you're slightly green and I honestly uh and uh yeah, but Ivormectton I was nervous about using it because of all the hype and because monoconals worked so well. I was like well this is not going to live you know this is not going to work. I was nervous. Um but the first thing I did was dug into the safety and anybody could do that which is a minimal amount of effort. You can go to the FDA website and you can find the toxicity data on ivormectin and there's something called the LD50 lethal dose 50 which is it's a benchmark number that gives you an idea of how toxic a medication is and LD50 means um how many animal 50 what dose would kill 50% of lab animals. So for Ivormectin, it kind of depends on the rat the I mean the type of animal and the gender. Um but it's basically 10 milligrams per kilogram up to 80 milligrams per kilogram. So for COVID we're using 04 milligrams per kilogram. So I knew that we were not worried about you know killing people with it and then you I did a literature search and I looked for accidental intentional overdoses for ivormectin and I couldn't find a single study. whereas you do that for Tylenol. I mean, thousands thousands of reports. So, once I knew it was safe, then I started using it and then I found it worked. And then, yeah, all in all, I treated well over 6,000 patients. And everybody that got early treatment stayed out of the hospital. Um, I also had patients come in that were really sick in the second week. And that that was such a learning experience for me because you know normally if somebody walked into my office with an oxygen saturation in the low 80s I would call an ambulance. Um but I had patients who would refusing to go to the hospital. Um and I had to give them the option to possibly die in my office. Uh which is scary. Um but we saved them. I mean we we just threw the kitchen sink at him and we didn't have monoconal antibodies. So we did we brought them in every day. We did IV steroids. We did IV antibiotics. We gave them home oxygen. We gave them high dose of ivormectin. We did everything we could and it was amazing. I mean they survived. It was uh very gratifying. So you think it was probably a combination of all the different medications and all the different treatments. You know I I would vary my approach depending on the severity, the coorbidities. I mean it's it's an art, not a you know a protocol is a guideline, right? But every patient is sort of individual. And so for the patients, you know, the one patient I'm thinking of, I mean, he had history of two heart attacks. He had a history of throat cancer. He he came in with an oxygen level. He was below 80. I can't remember exactly what it was, but I mean, so I just did everything, you know, I took everything that I could and and gave it to him and it worked. Um, but and I had a few people like that, but you know, the if a, you know, a 20-year-old came in, I'd probably just give them some ivormectin and, you know, it just depends. Why did you decide to try Ivormectin even though there was all this negative propaganda? Well, because I had patients coming to see me who needed help. I mean, I just wasn't going to shut my door. I'd already established I could help people with monocoloning antibodies. So, I still had people coming to me seeking help and I just didn't have the heart to say no. And I knew it was safe. So, I I knew that, you know, it was a little bit iffy, but I knew it was safe and there was good data showing it worked. is just you know one thing you can find a study to support any argument you want in medicine. I learned that in residency. All residents learn that we have we have something called journal\n\n\nA club where you sit down once a week and you pour through different articles, and the takeaway is most articles are, you know, crap.\nThey're not, they're not, they're low power, or they're, um, conflicts of interest, or, you know, they're not, they're designed poorly.\nSo, you know, my mindset coming into the pandemic was, you know, the research, the journals are a starting point, but it's not the final say.\nIt's your own clinical experience and what you're seeing.\nAnd, you know, we had never seen COVID before.\nThis is a brand new entity.\nUm, so we were learning on the fly, but, you know, I've never treated this many patients with a single disease in my career.\nI'm sure I never will again.\nAnd so you quickly become an expert, and, you know, doctor, I can't speak for all doctors, but we like to do well.\nWe like our patients to get better.\nIt's gratifying.\nThat's how sort of how you get job satisfaction is seeing your patients do well.\nSo why would I, you know, continue to have, you know, COVID patients come in if I couldn't help them?\nUm, and it's astounding to me that the doctors in the hospitals just didn't pivot, didn't try new things.\nAnd I guess they were handcuffed by, you know, the hospital administrators.\nBut it just seems to me that, um, you know, there was a doctor in Houston, Joe Veron, who I'm pretty good friends with, who a critical care doctor, and he was one of the founders of FLCCC, which is sort of the, they developed the original protocols for ivermectin.\nDr. Veron had much better success than most other doctors.\nHis overall success rate was 4.4% of his patients died, whereas in other hospitals average around 20%.\nAnd he did, he threw the kitchen sink at them at people, and he, he basically followed this FLCCC hospital protocol.\nSo when the monoclonal antibodies were suppressed, what, what was the messaging like?\nWhat did they say to doctors?\nThey said that the strain of the virus was no longer covered, so that it had evolved and it wouldn't work.\nBut at the same time, they're using the exact same vaccine.\nExactly.\nAnd they had switched the monoclonal antibodies periodically.\nSo it wasn't like they started with one and stuck with it the same the whole time.\nThey switched it as things evolved.\nBut it was really clear, and the propaganda was shocking because we've all seen propaganda with foreign conflicts, weapons of mass destruction, all that jazz.\nWe've all seen propaganda.\nBut when Rolling Stone magazine printed an article saying that people were, the hospitals were overflowing with people overdosing on ivermectin and gunshot victims couldn't get in, and then they used a stock photo which was of a bunch of people wearing winter coats in, like, I think it was, I think the article was August in Oklahoma.\nLike, the whole thing was so, it was so brazen and sloppy and obvious, especially with in the age of Google.\nIf this had all gone down in the 1980s, we would all be in the dark.\nWe would have no idea.\nWe would have, like, wow, I guess the ivermectin's killing people.\nMhm.\nYeah.\nWe wouldn't have known until, like, 2030.\nYou know, people would have, like, and you have been a conspiracy theorist.\nYou've been a crazy person.\nLike one of those people that could tell you all the facts about the Kennedy assassination, you know, with wild eyes, Oliver Stone, you know, but it was so obvious, and it was so confusing because I, you know, I had had people on my podcast before where, you know, I'd had doctors on, and I would talk about foolish people that don't believe in traditional medicine.\nLike people that want to try different things, like, are you cra... people that were anti-vaccine or anti- anything.\nI'm like, these are the best people at the front of the line.\nTrust them.\nFive years later, I'm like, don't trust anybody.\nThey're all compromised.\nIt's all money.\nAnd that was the most disheartening thing.\nThe propaganda was disheartening, but it was that the whole system is compromised.\nAnd then when I found out that pharmaceutical drug companies are, they're the ones that are funding studies, and that they could have a whole ton of study, they don't have to divulge all the data from their studies.\nThey only have to show you some studies that were carefully crafted to show efficacy.\nBut all the other studies that they had that even showed negative effects, they could bury those.\nThey didn't have, they weren't held responsible.\nExactly.\nI was like, what is this?\nLike, what is this?\nIt's, but it's like everything in the world when money gets involved.\nYou know, that Rolling Stone tweet is still up.\nI found it yesterday.\nCouldn't believe it.\nWild.\nLook at that.\nLook at these people wearing winter coats.\nSo apparently this was a bunch of people that were waiting in line for the flu shot.\nGunshot victims.\nThose all those people got shot.\nWhat the [ __ ] is going on in Oklahoma?\nThey're just shooting folks.\nThey think it's the Wild West out there.\nImagine if those were all gunshot...\nBut look how crazy that article is or that tweet is.\nGunshot victims left waiting as horse dewormer overdoses overwhelm Oklahoma.\nBy the way, zero horse dewormers there.\nZero.\nIt was a total lie.\nWell, in, um, you know, even last Friday, Vanity Fair did an article on Dr. Mary Talley Bowden and they quoted me in it, and in, you know, in their description of me, they used horse dewormer.\nI could not believe it.\nStill, Katherine Eban, the reporter for Vanity Fair, and she buddied up to me, acted like we were good friends.\nThat's how they always do it.\nThis episode is brought to you by BetterHelp.\nSometimes it can feel like you're carrying the weight of the world on your shoulders.\nAnd for guys especially, it can feel like you have to carry that burden on your own.\nThere's a lot of stigma around men being the provider to keep it all together by themselves.\nBut that's not good for you, your family, or anyone.\nDid you know that 6 million men suffer from depression every year in the US?\nAnd it often goes undiagnosed because of these stigmas.\nReal strength isn't bottling things up inside, though.\nIt's admitting to your faults and doing something to better yourself.\nSo, go talk to someone, a friend, your partner, family, a therapist.\nTherapy is an excellent tool everyone should utilize.\nIt's a great way to learn more positive coping skills, like how to manage stress and help you live a more balanced and fulfilling life.\nBetterHelp is a great place to start that conversation.\nJudging by the millions of reviews and the 4.9 rating in the app store, it's helped many people across the globe.\nAs the largest online therapy provider in the world, BetterHelp can provide access to mental health professionals with a diverse variety of expertise.\nTalk it out with BetterHelp.\nOur listeners get 10% off their first month at betterhelp.com/jre.\nThat's better.\nH\nELP.com/jre.\nThey're all...\nI learned a valuable lesson.\nIt's so dirty.\nIt's such a dirty business.\nGod, I used to have massive respect for journalists.\nYeah.\nBefore, if I had never done this podcast, I would be your regular schmo out there with, you know, just spitting out all the company lines that all the blast all over the news.\nI kind of liked it better then.\nIt was a lot easier, right?\nIgnorance is bliss.\nI didn't think the world was filled with demons.\nMoneyhungry demons that are willing to sacrifice human lives in the pursuit of revenue.\nIt's crazy.\nThat's why we have to continue this fight because people have lost all trust.\nWith good reason.\nWith good reason.\nThat's why I'm having you on.\nThat's why I continue talking.\nPeople like, \"Stop with the co already.\"\nI get it, folks.\nIf this is not for you, move on.\nMary and I will still be bitching about this for the next three years.\nRight.\nWell, I, you know, for me it was just, it was such a wake-up call because it's so weird to see your face on TV green.\nFirst of all, that was weird.\nAnd then this term horse dewormer.\nI'm like, why you guys aren't concentrating on the fact that a 55-year-old man is fine three days later during the worst strain.\nIt was during the Delta where everybody's freaking out.\nThis one's going to kill us all.\nAnd I was fine in three days.\nAnd I made this video.\nI'm like, I'm sorry I have to cancel the concert this weekend.\nYou know, I got co, but I'm good now.\nAnd then the...\nI had...\nI didn't think that was going to be anything.\nI thought that was just going to be the people that bought tickets to see Dave Chappelle and I in New Orleans, and that was gonna...\nWas it Nashville?\nWherever it was.\nThat's all it was going to be.\nThose folks, they're going to be upset.\nI'm sorry.\nYou know, we'll make it up to you.\nYour tickets still count.\nThat's all I thought it was going to be.\nI thought it was going to be like a normal tweet that I put out or a normal Instagram post that I pull out, put out.\nAnd then all of a sudden I hear that Neil Young wants me removed from Spotify.\nI was like, \"What the [ __ ] is going on?\nThis is crazy.\"\nSpotify got calls from two former presidents.\nReally?\nOh, yeah.\nWhat about...\nYeah.\nDid they deplatform?\nDid you get censored or deplatform?\nNo.\nI grew by two million subscribers in a month.\nI did because, because people started listening because it's, they made it sound like I was this maniac, and they started listening like, oh, he's really reasonable and pretty humble about all this stuff and just asking questions and bringing people on like Dr. Robert Malone, who has nine patents in the invention of mRNA vaccine technology, like he's one of the...\nHe took it himself.\nYeah.\nHe was reporting his insane adverse side effect where he almost died.\nHe was telling about it, and they labeled him a kook for that.\nAnd what, what made you so awake though?\nWell, that just...\nJust Malone, that no...\nWell, Malone, um, uh, Dr. Peter McCullough, but I'm...\nI've always been the type of person that is like, if someone is saying something and they have rock solid connect.\nDr. Peter McCullough is the most published physician in his field in human history.\nLike this is a incredibly well-respected doctor up until he took a moral and ethical stand saying that this is not what they're saying.\nThis is not what we should be doing, and then destroyed.\nThey tried to destroy his career.\nA horrible...\nIt's insane.\nBut the, the man has incredible courage, and he was labeled all kind...\nWhen I would tell people he's the most published physician in time, you'd see their eyes glaze like they didn't want to hear it.\nI'm like, maybe he's right.\nWell, five years later, we know he's right.\nWe know he was right.\nHe was right all along.\nI mean, the, the whole...\nSo, for me, when there's pe... there's always a bunch of people that are ideologically or financially captured, and then there's people that feel morally obligated to tell the truth.\nAnd you can spot those people.\nAnd when I spotted a few of them, like, okay, let me hear him out.\nI might be the the guy that goes, \"No, this guy's a cook and he's going to cost people lives.\"\nOr I might be someone to go, \"Hey, everybody, hit the brakes.\"\nLike you might be getting bamboozled here.\nAnd especially the, the real concern with any sort of a new drug is always the side effects.\nBut when you have indemnity, when when you have complete immunity for any financial liability like the vaccine manufacturers do, and all you have to do is label it a vaccine, right?\nBecause that's not a traditional vaccine.\nIt's just not.\nThey changed the definition for mRNA vaccine technology.\nBefore that, it was not that.\nIt was a very different thing.\nWe all had in our head, vaccines are good.\nThat's why they don't get sued because we need vaccines.\nYou know, and then, then unfortunately I read Robert F. Kennedy Jr.'s book, The Real Anthony Fauci.\nI was like, \"Oh my god.\"\nDid you...\nWhat was your initial thought about the COVID shot?\nWhat was your mindset?\nI didn't take it.\nDid you take it?\nNo, I didn't take it.\nBut that's why they were so mad at me.\nI was ready to take it.\nI, I, um, the UFC had allocated, uh, shots for all the Johnson & Johnson for all their employees.\nAnd I showed up there on, uh, a Saturday, which was the day of the fights.\nAnd I said, \"Can you give it to me?\"\nAnd they said, \"Yeah, sure.\nLet's, uh, call the doctor.\nWe'll set it up.\"\nI thought I was going to get a shot.\nI thought it was like a flu shot.\nLike, I'll get that shot and I'll go do the broadcast.\nI was going to do the broadcast.\nI didn't think anything of it.\nI was not worried about it at all.\nAnd they said, \"No, you have to come to the clinic and do it.\nCould you do that on Monday?\"\nAnd I said, I can't, but I'll be back in two weeks.\nDuring the time that I, uh, was trying to get it, and then in two weeks later, when the next fights were, it got pulled from the market.\nBecause of blood clots, and then two people I knew had strokes.\nMhm.\nAnd I was like, hold the [ __ ] up.\nAnd then I got real nervous because there was a lot of family members that were like really pushing it.\nYou need to get vaccinated.\nEveryone should get...\nHave you gotten vaccinated?\nGet vaccinated.\nWe all need to do our part.\nWe all need to get vaccinated.\nAnd you know, then I became a heretic, right?\nThen then I was like, okay, I don't...\nI don't think I want to do.\nAnd I had a bunch of friends that had horrible side effects, including one of them who is a young guy, was a pacemaker now.\nYeah.\nYeah.\nHis heart stopped beating for like nine seconds at a time, and he would black out.\nIt was wild [ __ ] was happening.\nAnd I was like, I don't understand why this isn't on the news.\nI don't understand.\nAnd then I'm like, oh my god, I'm the news.\nI'm like, I have to be the news.\nI don't want to be the news.\nI like talking [ __ ].\nI like having a bunch of comedians here.\nWe have laughs.\nWe get silly, you know, have a few drinks, watch some funny videos, crack each other, have fun.\nOr scientists.\nI like to have fascinating people in here.\nTell me how the cosmos...\n\n\nwas formed.\nI'm not, I don't want to be someone who distributes information to the masses that's been lied to.\nThat's not, that's, I don't have any lofty goals like that.\nLike, I want to be the, I want to be the one tells the truth.\nAnd that's not what I do.\nNo, I'm just a curious person who talks to people.\nWas it hard for you to get Ivormectton?\nNo, I got it from India like that.\nI got boxes of it.\nI was handing it out to everybody.\nI think we still have some.\nGo to India to get their medicine US.\nWell, um, I, that was after my doctor had got it for me.\nMy doctor got it for me.\nI think I [ __ ] it up for everybody.\nI think me becoming the attack boy when they went after me.\nI don't think they would have attacked anybody that didn't have a large platform like that.\nAnd I don't think they would, I should say it better.\nI should, I don't think they would have attacked Ivormectton the way they did.\nI think they would have just suppressed it and it wouldn't have been a public thing because it wouldn't have got out.\nI think the problem was me saying that.\nThe thing, the crazy thing is, I said all that other stuff too.\nI said IV vitamins.\nI said, uh, Z-pack, Predinazone.\nI told them all the things my doctor put me on, and all they concentrated on was this Ivormectin thing.\nI was like, this is wild.\nLike, what is going on?\nYeah.\nAnd then I was like, am I wrong about ivormectton?\nLike, then I started just reading about the scientists doing the, the team that invented it and how they won a Nobel Prize.\nI'm like, okay, what the hell is happening?\nLike, this is nuts.\nThis is so weird.\nWell, it was all part of, you know, getting the shot in every arm, and um, that's, they had to go after Ivormectton.\nI mean, they launched a war on Ivormectton.\nPierre Corey wrote a book about it.\nI had Pierre on early on, too.\nYeah.\nYeah.\nAnd uh, I actually sued the FDA over that horse tweet, and we won.\nUm, it hasn't really changed anything, but so the FDA, when they put that information or misinformation out against Ivormect, they were really crossing a line because they're not allowed to tell the public you can't take a medication for this or you should take a medication for that.\nThey're basically allowed to just approve medications and move on.\nI mean, they can issue a safety alert if there's something that comes up.\nUm, but they're not allowed to really direct patients, and that's what they did.\nUm, and so we did sue them and we won, and they had to take down the horse tweet, and they had to take down the misinformation on their website.\nBut unfortunately, as you know, evidenced by what just happened on Vanity Fair.\nI mean, the brand of it being only for animals still lives on, and you know, it'd be great.\nWhat happened at Vanity Fair?\nSo, the reporter still used the term horse dewormer.\nYeah.\nWild, right?\nWild.\nYou're, you're still be able to horse push her in 2025.\nRight.\nRight.\nWhen Chris Cuomo is out there talking about how he's taking it for long co.\nRight.\nRight.\nBut we would, it'd be great if the FDA could issue some sort of statement.\nYeah.\nYou know, saying that it is safe, that it is used in humans.\nThey don't have to say much more than that, but you know, we could use a little help in rebranding Ivormectin.\nAnd there are also a bunch of states that are trying to make it over-the-counter.\nNot sure if you've seen that, but yes, I have.\n17 states have had bills in the last legislative session trying to get Ivormectton over the counter.\nThree have been successful.\nSo Tennessee, Idaho, and Arkansas.\nFour is still in deliberations, and 10 they failed.\nUm, but another thing the FDA I believe should do is make ivormectin over the counter because people are basically going to the feed store.\nI mean, my, my own kid, he had some sort of scabies situation um in Houston, Texas, over the weekend.\nHe had to go to the feed store to get treatment.\nUm, and I, you did a poll on Twitter.\n52% of the respondents said they go to the feed store to get their ivormectin.\nI mean, is there any difference in the ivormectin from the feed store?\nI don't know.\nI mean, I haven't heard of anybody having issues, but it's just unnecessary.\nThis is America.\nWe should be able to get the medication very easily.\nAnd there is some sort of an efficacy for some sort of skin infections.\nIs that true?\nScabies is is one of the Yeah.\nSo, but you use it topically.\nIs that how it's word?\nYou can, I mean, for for scabies, actually, you can take it orally.\nOkay.\nUm, but yeah, so we shouldn't have to go to India.\nWe shouldn't have to go to the feed store.\nWe should be able to just go to, I mean, in Mexico, guy from India.\nHe still emails me.\nDo you need any more, my friend?\nI don't know.\nThat kind of worries me because you just, I just bought boxes, cuz I was handed out boxes to people because so many people were telling me they couldn't get it.\nRight.\nRight.\nAnd so I'm like, let me just get a lot of it while I still can.\nYeah.\nYeah.\nI mean, I guess it's it's probably fine, but it's just unnecessary.\nPeople giving it to me at shows.\nOh, they were as gifts.\nI carry around my purse.\nI like for something.\nOh, here's my ivormectin.\nOh, I know people that take it as a prophylactic all the time.\nOh, yeah.\nYeah.\nWhich is so, it, it's just what a weird drug to go after.\nThat was on the World Health Organization's list of essential medicines.\nYeah.\nYeah.\nI mean, how many people who had yellow fever and all river blindness, also all all sorts of different parasitic infections.\nIt won a Nobel Prize, and it showed that it stopped viral replication in vitro.\nLike, they knew that.\nYeah.\nYou know, I remember when I brought that up to Sanjay Gupta, it was like, but you know it does, right?\nAnd you can see the look on his face where it's like, I could, he couldn't talk about that.\nYeah.\nHe had to skirt around it and just do his best to, but it was like, this is kind of crazy to make an off-label medication so taboo.\nYeah.\nAnd then to stop monoconal antibodies, just stop them where you couldn't get them.\nMy friend, uh, one of his buddies was in the hospital, and because he was in the hospital, they wouldn't give him monoconal antibodies.\nOh, yeah.\nIf you, if you, if you cross that threshold, you, you were not going to get monoconal antibodies.\nWhat is that about?\nDoes that make any sense to you?\nWell, they, they did it by the day.\nApparently, there was some data showing if you gave it too late in the time course, it actually makes things worse.\nHow many people did they give it to that were too late?\nHow do we know this?\nI seem a little suspicious.\nIt does seem suspicious because, like, why would, if something, if you, you've shown something to be very effective done early on, wouldn't you assume it would continue to be at least somewhat effective?\nRight.\nNow, if you're trying to stop someone who's on the brink of death, which this gentleman might wind up dying, and they didn't get it to him.\nIf you're just trying to stop, and you can't do it because you're admit, you're in the hospital because you're admitted.\nYeah.\nLike, you should have like crazy data that shows like after 14, your feet fall off.\n14 days of infection, your feet fall off.\nYou go blind if you take it.\nCan't give it to you.\nAnd my theory is they probably had a massive inflammatory response because we would see that, that people would get the monoconal antibodies and they would just feel like complete hell that night because it was like a little war going on in the body, and then they would wake up the next day feeling great.\nI don't know if you had that experience, but pretty much dead.\nSo, you know, the second week of illness was the massive inflammatory response.\nSo, I, my, my thinking is the monol antibodies may have just exacerbated that, but they could have counteracted that with with high-dose steroids, and that was another thing they gave these like pitly doses of steroids in the hospital, and what steroid steroids in particular, uh, methyl predinisolone or salumemed was what we typically used if we were in, is that prennazone, what I took, is that the same thing?\nNo, well, prennazone is an oral, there are different types, but um, like I usually do Medrol dose pack rather than prennazone because it's been shown to help better with respiratory.\nIt's not a huge deal, but um, in the hospitals, they could give Solumedrol and high doses of that, but they were giving very small doses of steroid, which is a problem.\nInteresting.\nWell, that's, that's also one of the things that they talked about in the RFK Jr. book, um, was that the studies that were saying that it was ineffective, the, the studies were not using the protocol that these doctors were using.\nAnd it seemed like these studies were designed to fail.\nExactly.\nExactly.\nAnd you know, like I said, you can find a study to support or or go against anything you want, basically.\nUm, so I just relied on my clinical experience, and I just had so many people saying, &quot;Wow, it really made a big difference, and I saw people staying out of the hospital, and it wasn't hurting anybody.&quot;\nSo, but yeah, a lot of those studies were basically designed to fail.\nEither, you know, the dose wasn't high enough or they gave it too late, uh, or it was heavily funded by somebody that doesn't want it to succeed.\nYeah, it's, it's all very bizarre.\nLike, really, it's really bizarre to live through.\nAnd for you as a person who were was out of medicine and then said, &quot;Jump back in six months before all this, like what is it like to have your world view sort of like spun around like that?&quot;\nYeah, it's, it's, I mean, it's good and bad.\nLike, I feel sorry for the people that don't get it in a lot of ways.\nUm, but I just never thought it would come to all this, you know.\nI, I didn't go back to work to have a huge, huge career.\nI was just basically trying to stay busy and, you know, active and and help people and Yeah.\nAnd but I didn't envision this at all.\nUm, but it's been very impactful.\nI'll say that.\nYeah.\nWhat has it been like, like having, I mean, having to do this to, I've listened to all these podcasts.\nYeah, it's, it's wild.\nUm, yeah, it's not what I envisioned at all.\nUm, but it's been, you know, I feel vindicated finally.\nAt least I'm not embarrassed to go to the school functions anymore or show up at the sporting g events or, you know, I used to be scared to go to the grocery store, uh, because they just, they came after me so hard.\nAnd in Houston, I mean, Houston Methodist Hospital is sort of the the country club, you know, the elite of the hospitals.\nAnd so, for the, for them to come after me was a a big deal.\nUm, it's hard to get privileges there.\nYou know, they, their tagline is leading medicine, and they were very proud of being the first hospital in the country to mandate the shots.\nUh, they didn't need to go after me.\nI mean, I was nothing.\nI was, you know, I, I saw a lot of COVID patients, but in the grand scheme of things, I really wasn't, you know, I was not really doing anything.\nUm, it's the Strand effect, right?\nYeah.\nYeah.\nThey, they attacked you, and by doing so, they made the whole thing way bigger than it needed to be.\nBut they did silence other doctors.\nI mean, I, I hear from doctors all the time that won't say anything because of what they did to me.\nYeah.\nNo, there's a lot of doctors that I know that were in danger of losing their license because they had prescribed ivormectin.\nAnd that was another thing.\nUm, you know, the the Federation of State Medical Boards, which is this private entity.\nThey're actually located in Texas, who oversees all the state medical boards.\nThey sent out an a directive to all the state medical boards concerning Ivormectin, concerning misinformation, and basically encouraging the medical boards to go after doctors like myself.\nAnd I mean, I'm still, I'm still tangled up with the medical board trying to clear my name.\nUh, but they did that, that was it all happened in that fall of 2021, right when Biden mandated the shots.\nUh, they really came down hard on the doctors.\nSo what did they do specifically to you?\nSo I got several complaints, but only one of them has really stuck.\nThe others have, I've cleared my name on, but they were all involving Ivormectum.\nUm, no patient harm.\nUh, the one that has stuck is from a hospital in Dallas called Texas Hugley Hospital, and there was this man, a sheriff's deputy, father of six, who's basically dying.\nThey were talking hospice, and his wife wanted him to have the opportunity to try ivormectin, and he had tried to get it before getting in the hospital and couldn't find a doctor willing to prescribe it.\nSo wife knew he was okay with it.\nUm, and so she sued the hospital, and then she asked me to come on as sort of the expert.\nThey had to have aos, they had to have a doctor who was willing to prescribe it because they can't force the doctors to prescribe a medication, but they could force the hospital to give a doctor privileges who was willing to to prescribe it.\nSo that's where I came in, and we won the case, and the hospital had a court order saying that they were going to give me emergency temporary privileges so that could go into the hospital and give him ivormectin.\nWell, there was all this, you know, stall tactics.\nThey were supposed to give me the privileges the same day.\nAnd in in other circumstances at that time, because of the pandemic, they were giving doctors same day privileges.\nIt wasn't this lengthy application process because there was a a shortage of doctors.\nBut for me, they made me submit my surgical case log for the last three years.\nThey made me get three letters of recommendation.\nThey made me fill out like a 30-page application.\nI got it all done in 24 hours.\nAnd then they're like, &quot;No, no, we're not.\nWe're actually going to deny you privileges.\nSo, it turned out into this big battle, and it became very confusing because they had to go back to the judge and uh, I finally got the green light though.\nThe lawyer's like, &quot;\n\n\n\"We can go. You've got the green light. The judge, we got the order. There's no stay on the order.\"\n\nI send a nurse to the hospital because this is in Dallas and I'm in Houston. She shows up with the court order, and the police greet her and turn her away. There's not a big scene, and she leaves, but she's not allowed to give him ivermectin. It turns out they did get a stay, but our lawyers weren't aware of it at the time. Um, but this is what they're going after me. They said that I sent a nurse to the hospital without privileges and I caused a scene, and I, you know, I harmed other patients by doing this. Um, and it has been, I mean, it's three and a half years. They can't find an expert witness to testify against me. There have been three continuances.\n\nUh, they finally were awarded summary judgement against me. So I'm already decided I'm guilty. Um, and now I'm waiting for my punishment. There was a hearing about a month ago to find out, you know, what they're going to find me with and that sort of thing. Um, and I'm just waiting on that, but I do plan on appealing. It's just gotten crazy.\n\nWow. So the first thing they attacked you with was what? What was the first one? Yeah. Oh, for the medical board. Yes. Um, I had one pharmacist turn me in because we sort of got in a pissing match on the phone. Um, and then this is in 2021. Uh, that might have been, I can't remember, but around that time I had another, I had um, a father reach out to me. A 17-year-old um, had a history of a kidney transplant, and they were going to Europe, and they wanted to have ivermectin just in case he got sick. And I was talking to the dad and the stepmother. I didn't realize I wasn't talking to the mother. So the mother found out I prescribed him ivermectin and turned me in. Um, but ivermectin is um, metabolized by the liver, not the kidney. So it would be no harm for him to get, you know, as having had a kidney transplant for him to get ivermectin, and he never took the medicine, but it cost me $16,000 in legal fees to get that straightened out.\n\nSo this was your first experience like, oh, oh my god, like this is a real battle. Yeah. Yeah. Yeah. I mean, I've never been in any trouble. I've never been sued. Um, did it would it feel weird publicly yet? Like, like when you were saying you were having a hard time going to the grocery store, you're worried that that was when Methodists came after me. So Methodist, um, they came after you very publicly. Yeah. They tweeted about me. They went to the... I found out that my privileges were suspended from a text message from a reporter. That's how I found out. I looked at my like, \"What are you talking about?\"\n\nI did. I said, \"Check your sources. I don't know what you're talking about.\" And then I go to my email, and they suspended me, and then they tweeted about it, and it went, you know, I had CNN, Washington Post going after me. It was it was it was traumatic. I mean, I was just a, you know, a mom of four with a small practice, and all of a sudden I've got CNN calling me. Wow. Um, so what did what was going through your mind while that was happening?\n\nI spent the weekend in the fetal position and a lot of tears, and then I was like, I was pissed, and I and I just I on Monday, I, you know, I hired a lawyer, and I hired a guy to help me with the press, and I held a press conference on Monday. I resigned, and then I sued them. So, and then I just have been working to try to clear my name.\n\nWow. But it's just it's so hard to imagine for someone who's never experienced what you went through, what that must be like emotionally to just get thrown to the wolves in front of the world like publicly by people like CNN, like where where it gets so weird because if if that never happens to you, you look at CNN, you go, \"Oh, they're the news. They're going to tell me the truth.\" That's I thought I just automatically thought that, or they're at least saying what they're allowed to say. Maybe the government holds back some information, but they're not going to lie, and then I you see my own self on TV, and I'm sure, but I'm used to being like attacked for things. I think the harder was is, you know, CNN, whatever, but it's more just the locally, like going to the grocery store, going to the baseball game with your kids playing and like hoping, you know, sitting in a corner because you don't want anybody to see you.\n\nDid anybody ever bother you? No, honestly, no. But you just feel self... You just feel very self-conscious. It's hard not to. Yeah. Even now, I I still feel self-conscious, but it's a lot better. I mean, uh, you know, mother... I had a Mother's Day event of school, and people actually came up and said nice things to me for once. So, that was that was nice.\n\nWell, a lot of people got redpilled, you know, to use the matrix expression, you know, where they they woke up to what's really going on during... I mean, it's kind of a masterful job of propaganda over the years that the pharmaceutical drug companies have done. I mean, because most people aren't even aware of how many drugs get pulled. They don't... they're not aware of the high percentage of them. I... What is it in the 30s? Well, yes, about 33%. Uh, they they looked at it over 10 years. 33% had significant safety warnings um, on the drugs, and it took about four years for those to become recognized. I mean, their drugs I used to prescribe that are no longer on the market. I mean, so yeah, like I said, it would have been any other drug would have definitely been pulled by now based on all the adverse events we've seen. But it's just very profitable, and that's what people have to wake up to.\n\nThere's a bunch of factors, right? There's there's the the primary one, which is a bunch of scientists that are really trying to help people, and they're really trying to develop new ways to cure Parkinson's and all sorts of other problems and cancer, and and these people are just constantly, and then there's the money people, the money people who take that thing and say, \"How do we give Oxycontin to everybody?\" And then you have the Sackler family, right? You have evil, you have like actual evil. Maybe they don't have horns, maybe they don't have a a fork tail, but that's a demonic thing to do. You're you're you're infecting people with essentially something that turns them into a zombie, and it's killing people, but you're going to make a lot of money in health too, especially in health because you're so trusted, you're so... it's you're coming from a position of authority. It's a very different thing, you know, in especially in an area where most people are woefully ignorant. I mean, look how many doctors who are practicing doctors who are woefully ignorant about nutrition, right? It's an enormous amount.\n\nRight now, imagine the average person who has to go to a specialist about something, and they're being told, \"Oh, you need vio. This is this thing I'm going to give you, and it's going to cure your arthritis.\" Like, \"Oh, great.\" And then you [ __ ] stroke out. Yeah. And the people who made that drug knew it was going to cause problems in people. They... they in the emails that were admitted during the hearings when they lost or during the court proceedings, they they wound up paying a fraction of what they made. They made like $12 billion. They had to pay, I think, I... they had to pay five. So they made seven, you know, with, you know, it's costs stuff. Stuff costs money. But Jesus, it's it's so hard. It's so hard to wake up to that. It's so hard to like go, \"Oh, wait. So they're not looking out for us. They're not like trying to make us better. I always thought they were the people that were the most wonderful people in the world. They're the people that are providing the medication that's keeping everyone alive. This is why our life expecties a hundred years old now as opposed to just 20 years ago.\" Like, oh great. Life expectancy has gone down actually.\n\nWhoops. Whoops. Despite all the vaccines. Yeah. Um, yeah. And vaccines are even their own special class, right? It's the gosp... it's a religion. It's a gospel. I mean, we were... It was never questioned in my training. Never. I would have never questioned it. Not only that, I would not talk to anybody who did. I'd be like, \"Get out of here. I'm not having an antivaxer on the show. [ __ ] off.\" But but after reading uh, Suzanne Humphrey's book, and I had her on recently. Reading that book, it was like, what? Wait a minute. What? And then just this can't be true. And then you just look at the raw data of like when the vaccines were introduced and also when hygiene was introduced and sanitation was introduced, and then massive drop off of the disease. And then at the very end when it's almost gone, vaccines are introduced in almost every case. And yet we all are thinking like, thank god vaccines exist because otherwise we'd all have polio. Like, oh Christ. Yeah. It's it bothers me that I never question it. Never would have.\n\nThe polio one blew me away when you find out that that was the same time where they were using DDT everywhere. And the people that were getting polio first were people in rural farmland communities where they sprayed DDT everywhere. And it wasn't just affecting people. It was affecting horses, and it doesn't cross species. So it wasn't the same thing. Clearly something was going on, and everybody got locked into this polio scare. And to this day, I've... I had a friend use that to me in a text message to me about like, look, we have to really appreciate that, you know, he was like trying to make up for some stupid joke. And he was saying that we, you know, look, Jonas Salk cured polio. I'm like, I don't have the time. I don't have the time to sit down and tell him there's a great book. It's called Dissolving Illusions. You should read it. And then you should read Turtles All the Way Down. It's another great book. And uh, then you should listen to Robert F. Kennedy Jr.'s journey from being a very respected and trusted environmental attorney who was applauded by the left to being some nutcase pariah who I thought was a nutcase. I had to apologize to him when I had him on the show. I said, \"I have to tell you when I first heard of you and I f... like I thought you were a kook. You're this antivaccine kook.\" I bought... I was living in LA working in Hollywood. Wee... I bought into it. Hook, line, and secret. Everybody around me thought that way. So I thought we all... that's this is what sensible, intelligent people think. Yeah. But I don't think you can really convince people. I think they have to figure it out for themselves. No. And they don't want to hear it. That's the thing. It's like telling someone that their spaghetti monster in the sky is not real. Like they... you don't... they don't want to hear it. You just can't. Right. I've... I've just given up. But I... Yeah. But there's hope. I mean, you... you came around, and you're not in the field, right? And people... I think you know... co... directly impacted every single American and not in a good way, right? No, there was nothing good about it. And the only thing good about it was a shift in perspective, right? And that it's going to be way harder to pull some [ __ ] off like this again, right? People are not going to buy into it, especially all those vaccine injured people who keep getting gaslit. You know, why do they keep calling it long CO? How come nobody I know who wasn't vaccinated got long CO? Right. Right. What is this long co you speak of? Is there long flu? Is there... Where's the long pneumonia? What the [ __ ] are you talking about? Why are you calling it? Is it possible that this is a vaccine injury? I'm just asking.\n\nWell, yeah, I've been looking at antibbody levels in these people, and it's it's alarming. So, we have an an... we really don't have a lot of tests for vaccine injured. Um, it's it's hard because they'll get the million-dollar workup. By the time they come to see me, you know, they've they've gone through, you know, multiple tests. They have multiple doctors. It's not really a million dollars, is it? The work. Well, I don't know, but I'm I'm exaggerating. But, you know, I just want to be clear. Okay. For some Vanity Fair horse dewormer who claimed there was a million-dollar markup. Actually, somebody should fact check me on that, and it's probably higher than a million, but uh, what was I? Oh, so they get, you know, they go through the workup, and then they can't find... they can't find a test to prove that they're injured. So the doctors will put them on psychiatric medication. They'll put them on sleeping pills and bzzoazipines and anti-depressants. Literally, I saw a patient was put on all three. Um, so the only test that I have found that does seem to correlate is this antibbody test. It's a spike protein antibbody test. Labcorp has it. That's where I send people. Quest has it, but they put the upper limit is too low, so you don't really get a good sense. But it, you know, the upper limit of the test is 25,000. And and people that have not gotten the COVID shots, I'd say it ranges usually under a thousand. And then people that have gotten the shots, I mean, it's a lot of them are off the chart. They're over 25,000. But on average, they're probably 10 times higher than the people have not gotten the shot. And this is people who weren't, you know, they were vaccinated four years ago. It wasn't like they just got the shot. You know, obviously CO's not an issue anymore in terms of, you know, people getting sick, but four years later, you should not have sky high antibbody levels. And that's what I'm seeing. And that is alarming. U... it just suggests that there is a lot of\n\n\nSpike protein still in the body causing problems.\nAnd haven't they shown that the spike protein continues to be produced in the body up to 700 days later?\nYes.\nI mean that is that's one study.\nUh there's some you know what's interesting that study that antibbody levels were really low which doesn't make sense.\nSo I kind of question the whole study but yeah I mean I see it I mean I see patients I mean I still see vaccine injured patients coming to me for the first time years later.\nI last week I probably saw six new vaccine injured patients you know and they they they're not getting any help.\nThe the government there's it's called the CICP that's a vac it's a countermeasures injury compensation program they're supposed to help these patients they have denied 98% of people that have applied for assistance they on average they I think they've awarded 20 they've awarded 30 people 30 of all the vaccine injured that have applied 30 people on average the award is like $4,000 for these people it's horrible I mean these people's lives are just destroyed these are not easy things to treat.\nIt's not like I can give them an antibiotic and they're good to go and they're fine.\nI mean, the they're very challenging.\nIt's uh we don't have a lot of guidance.\nI do see a lot of uh success with Ivormectin, but it's slowgoing.\nIt's usually, you know, months of trying to to help them.\nUm and the government really needs to help these people.\nThey there's a lot of people suffering.\nUm and they're they're getting completely ignored.\nThe other issues, we don't even have a code.\nSo every disease has a a numerical code.\nIt's called an ICD10 code.\nIt's what they use to compensate people for or the insurance companies use them, but also for tracking.\nSo if you have, you know, CO has its own little code and you can just dial in the code and get all the numbers.\nThey don't have a code for vaccine injury.\nThey have a code for vaccine hesitancy, but they don't have a code for injury.\nSo all these people are just sort of, you know, they're getting all these diagnoses, but there's no way to track them.\nUm, it's a big problem.\nHow convenient.\nYeah.\nWell, I would imagine you the the real problem with paying people is you'd have to pay so many,\nyou know, but that's we can just print the money.\nI don't know what the problem is.\nI mean, what will you what do you give them?\nWhat what if you find out you have myocarditis and your life expectancy is greatly reduced and we know for a fact it came out of this vaccine.\nWhat do you give a person like that?\nYou're going to take their life's wages.\nWhat what wages that they would have potentially earned?\nWhat if it's Katy Perry?\nWell, so be it.\nYou know what I'm saying?\nLike you give her $2 billion.\nWhat do you do?\nThe vaccine companies can can pay that money.\nI know.\nBut it's insane the the number of people that I that I personally know.\nWhat's very shocking to me is when I talk to people that are provaccine, still provine, and when I be very specific, mRNA vaccine, still procoid vaccine that will tell me they don't know anybody who was injured by it.\nYeah.\nI was like, how is that possible?\nHow many people do you know?\nI know a lot.\nYeah.\nI know two people on pacemakers.\nYeah.\nTwo.\nAnd they're young.\nThey know somebody.\nYeah.\nI know a lot of people that got [ __ ] up, including family members.\nI know a lot of people that got [ __ ] up and people that don't want to admit they got [ __ ] up, all of a sudden they have this new cancer that's spreading like rapidly.\nY it's terrifying, you know.\nIt's like um I watched the Danny Jones podcast and you guys were trying to get uh Casey Means Cali Means to talk about SV40, right?\nWell, well, my thing with Cali, I I actually talked to him last night just why he will not go on record to state the CO shot should be pulled off the market and that you know that's the whole he's the head of I look at you think that's being political that's trying to like appease too many people.\nWhat do you think that is?\nI can't read their minds but I think it's e I think anybody with a big microphone who is uh in a position of power and who knows the truth is e ethically obligated to speak the truth.\nThat's how I see it.\nI mean, I'm not a politician.\nI keep hearing the word strategy, but there are, you know, there are people I see I'm just faced with the carnage every day in my office.\nIt's it's just I can't ignore it.\nAnd I don't understand why this is so difficult other than, you know, political, but it shouldn't be political.\nIt shouldn't be, right?\nThat's what's disappointing because we thought that this administration come in, it was just going to kick down doors, right?\nLike this is it.\nEpstein list day one.\nWho killed JFK?\nLet's find out what are all these [ __ ] UFOs.\nThat was on my priority list.\nBut yeah, mine I'm a dummy.\nI was that was my number one.\nUh like if I had out of those three, give me that one.\nGive tell me the aliens are real.\nBut they this political dance, this this excuse for that.\nSo I re really appreciated uh Jack Cruz kind of pestering him on that.\nAnd then I've talked to Brett Weinstein about that as well.\nUh and he gave a a breakdown of how it actually happened and when the original uh kidney cells from these monkeys were being used to make vaccines, right?\nThat they inadvertedly get gave these people this Simeon virus 40 which when it gets into the human body can lead to rapid cancer.\nRight.\nWell, yeah, that's one of the cancer causing issues with these shots.\nThat's not the only one though.\nRight?\nIt goes into the cell.\nIt's supposed to not get into the nucleus, but it could get in the nucleus.\nWe know that it can get into the nucleus.\nAnd then if it gets in the nucleus, well, at first they thought it was going to stay local, right?\nRight.\nIt's only going to stay in the arm, right?\nIt's going to stay right where your arm is.\nYour body will react to it.\nIt'll produce the antibodies and then you're good to go.\nAnd then all these silly people, you can watch them die in the streets and laugh as you step over them.\nHaha, I was smart, right?\nI trusted the science.\nYeah.\nYeah.\nSo they know that it it that's not true.\nIt doesn't stay local.\nThey know it doesn't dissipate within it was a small amount of time that it was supposed to stay inside your body.\nThey know that's not true, right?\nSo yeah, they have they replaced one of the nucleotides with something that's hard to break down, pseudouodine.\nThey've never shown that pseudouodine is cleared from the body.\nThere's no study showing that we can clear it.\nSo it could that could be why these people have these sky-high antibbody levels four years later.\nUh because the body might not be able to break it down.\nOh my god.\nOh my god.\nThat's terrifying.\nWhat could you conceive of would that would help something like that?\nLike what what could you do that would aid the body in being able to do something like that?\nIs there anything theorized?\nI Yeah, I don't know.\nI wish you know Robert Malone would be a good person to ask.\nMaybe um you know maybe come back on and do a victory victory lap anyway.\nThat guy was torn apart.\nYeah, they were trying so hard to make him out to seem to be a cook.\nAnd every interview he would do, he would be so reasonable, so logical, so fact-based, and so knowledgeable.\nAnd they still they still he was a kook.\nHe was a cook.\nI remember some [ __ ] guy yelled at me and excuse me, yelled at me in Vegas.\nHe said something about me spreading disinformation.\nThen he said something about that idiot Malone.\nI'm like that.\nOh, that's the inventor of mRNA or one of them, you know?\nI mean, it's I don't know.\nI'm sure there's it's not like none of those things ever happened in a vacuum.\nI'm sure there's a ton of people working on that, but he was one of them, right?\nHe's a [ __ ] brilliant guy, but so how did they find out that it can get into the nucleus?\nWell, if you look at lip if you look at lipid nano particles and that's sort of the that's what otherwise if you just put mRNA into the body without the lipid nanoparticle it would get destroyed.\nSo they put the they put it in the shell the lipid nanoparticle and there are studies showing lipid nanoparticles can cross the nuclear membrane.\nSo there's there's that.\nU Kevin Mccernan is a scientist.\nHe's he's on X a lot.\nUh he's done a lot of work in that showing DNA contamination that's getting into these uh shots.\nUm in in addition to the SV40 um and DNA contamination, right?\nSo there's there's and this was what do uh Joe Latapo the surgeon general of Florida he has actually called for the co shots to be pulled off the market and his his main argument was there is a certain amount of DNA that is allowed in any kind of these products and we have proof that they have exceeded that threshold.\nSo there have been um studies showing that there's excess DNA in these samples which shouldn't be there and that's just sort of this hard line that shouldn't be crossed.\nWhere is this DNA coming from?\nUh in the production process, I guess.\nUm but it's it's pretty cut and dry.\nI think that's why Dr. Latapo has chosen this argument to go by.\nUm because there's just like a hard line that you don't cross and they have crossed that.\nAnd what happens if you get too much DNA?\nWell, it can integrate it.\nThe concern is does it integrate into your own into your cell's DNA?\nAre we going to make mess things up?\nMonkey people.\nI mean, could you imagine?\nCancer, but cancer.\nThat's right.\nYou imagine if we made like hybrid people, they turned out to look like Neanderls, you know, like we we injected them with something that twisted their their genes back.\nBut just the idea of manipulating your DNA is so terrifying.\nIt's like, what what in pregnant women, right, integrating You know, it' be one thing if it's a 70-year-old man, but a pregnant woman got these integrate DNA.\nYou don't think good things.\nThat's like immediately I'm like, what?\nAnd these things are technically gene therapy products.\nThey're not vaccines.\nSo, which is a real problem with using the same term.\nWhy not use a new term?\nWell, because then you wouldn't be under the umbrella of protection that vaccines currently enjoy where they can't be which is so crazy.\nIt's so crazy.\nIt's just hard to believe it's true.\nIt really is.\nIt is.\nAnd so for a person like you that just like you were saying see the carnage every day, tell me what it's been like.\nLike what is it like?\nIt's hard because as an ENT I'm used to I'm used to fixing people quickly.\nSo, you know, I I get somebody with a sinus infection, get them an antibiotic, they're good to go.\nI get somebody with an abscess, I drain the abscess, they're good to go.\nIt's it's sort of why I chose my specialty because I like to see the results quickly.\nI didn't go into primary care reason for a reason like I um and so when I see the injured it's like you know it's very slow growing slow going we don't have a lot of research it's trial and error uh these people are young were previously young and healthy and their lives have just been completely destroyed.\nUh I don't have a big support system of other specialists I can send them to.\nUh it's hard.\nI mean, I don't feel sorry for myself, but I'm just saying it's just very different from what I'm used to as a doctor.\nUm, so I really hope that the government will step up and do something about this.\nYeah, that would be a nice thing to hope to do something about it, but it would be really nice if some real research was done on what are the actual long-term effects.\nIf you're if everyone's looking at it from a position of we can't get you know sued for this this is dangerous like we someone has to look at it and say well this these are the definite effects of this vaccine because it's too much this is long co it's too much oh he got a neurological condition that was going to happen anyway it's just coincidentally happened after he took the co shot like there's got to be some way to determine what of these ailments like specifically like when you were talking about the abnormal antibbody levels like well there are patterns I mean I definitely see the same sort of things over and over again so it's not like you know but as you said it doesn't have a classification right it doesn't have a code so we need an ICD10 code for these that seems kind of crazy yeah well imagine if that was the case with like herpes everybody be like hey put a damn code in there so we know what this is right um but there you know I see very similar constellation of symptoms I see patients with these abnormal tremors which um you know they can't stop shaking even when they're sleeping.\nThey feel internal vibrations.\nOh Jesus.\nOr they'll have um severe pain that you can't explain.\nYou know you get an MRI there's nothing ner there's no nerve damage that you can tell.\nUh I've seen some very strange rashes and normally you know it doesn't matter what kind of rash it is.\nYou throw a few meds at it and it will disappear.\nUm but actually the only thing that I found helpful is Ivormectin for these strange rashes.\nUm, and you see POTS where the blood pressure that's the hardest I think and this is this is we're seeing a lot of this um where the blood pressure just drops suddenly with with no stimulation or the the heart races with no provocation.\nUm that is very common, very difficult to treat.\nThat's a good friend of mine.\nYeah.\nHe says every now and then his heart will just jack up to like 180.\nYep.\nAnd he has to sit down and he just has to hope that this isn't the last time he breathes.\nYeah.\nHe just sits there.\nHe has a heart monitor.\nHe puts it like one of them wristwatch ones, the Garmin one.\nHe just watches his heart jack up to like 180 180 beats per minute.\nJust sitting there for no reason, not knowing if you're going to die, right?\nAnother friend of mine who was really young was a soccer player, super healthy guy, super fit, gets the\n\n\nVaccine, all of a sudden, giant heart racing in the middle of the night, like out of control.\nLike, you know, like you're running a seven-minute mile, just jacked.\nYeah.\nYeah.\nYeah.\nAnd he wound up in the hospital twice.\nThey could do nothing.\nIt all went away.\nIt stopped.\nIt went back to normal after a while.\nBut now he's got this like terrible fear that he's got a [ __ ] time bomb in his chest.\nYeah.\nThat out of nowhere would just his heart would just ramp up.\nAnd you could say like, &quot;Oh, that was it's probably a genetic thing.\nHe probably had it already.&quot;\nHe was like maybe.\nBut this guy was super fit.\nYeah.\nSuper fit soccer player.\nAnd that's the athletes.\nThe sudden death in athletes.\nSo it used to be 29 per year, now it's 290 per year, growth 10 times, crazy, dropping dead, the rarest of rare people to drop dead in the middle of nowhere, the the the best athletes in the world, the people are the healthiest in the prime of their life, right?\nAnd I worry, I worry about these kids because, you know, myocarditis, the primary symptom is chest pain, but if you've got a kid who's not even speaking yet, you have no idea if they have myocarditis, and myocarditis can leave a permanent scar on the heart and then lead to a lifelong increased risk of sudden cardiac death and kids.\nWe have no idea if it's if these kids have been affected.\nYeah.\nAnd how many kids did we see dropped dead out of heart attacks in like high school football this year, right?\nLike over over the last four years rather, it was like you'd see these articles pop up all the time.\nNever saw those articles, or if you did, it was super rare, and it's some kid with a heart condition that was never diagnosed, which does happen.\nYeah.\nAnd the schools are now making kids get cleared by a doctor before doing sports, which I don't remember that when we were kids.\nWow.\nYeah.\nThey just threw us right onto the wrestling team.\nThey didn't check [ __ ].\nThey didn't even see if you had a cold.\nRight.\nYeah.\nI mean, I don't know what's better.\nIt's probably better to screen them.\nYou know, they'll find those undiagnosed conditions that kids can have.\nWell, I just think that I think it's in response to what's happened.\nIt certainly is.\nBut I mean, that might be the good aspect of it.\nMaybe some people will get diagnosed that didn't have any idea that they were running around with the problem, and they can fix it.\nBut myocard, it's hard to diagnose.\nLike really, the only way you can diagnose myocarditis for sure is to do either a biopsy or a cardiac MRI, which is, you know, most kids are not going to be put through that, right?\nIt's scary.\nAnd it's what's crazy is this is all true, and yet us talking about it makes us both look like cooks.\nLike we then will be labeled for sure, someone will go out and attack us now and label us antivax, antiscience cooks, and this is what's dangerous about this conversation.\nThis is what's dangerous about what they said.\nAnd you know those people work for the devil.\nWell, do you think you'll get censored on YouTube this interview?\nNo, you don't.\nCuz I was just on Jimmy Door.\nYeah.\nAnd they had to bleep out like a full sentence of mine.\nI'm not bleeping out [ __ ].\nI'm not bleeping out [ __ ].\nYou think it'll be okay?\nWe'll find out.\nI, I think it's wrong if it's not okay.\nIf it's not okay, I think YouTube is more reasonable now than they were uh during the pandemic.\nAnd uh I think they have a very difficult job managing content at scale where you're dealing with, you know, the the amount of people uploading things is insanity.\nAnd they have certain things that they've tagged as being controversial because they were anti-science or misinformation that it's still there's like lingering ones.\nWhat was the issue that we had, Jamie?\nWe had like a old episode where there was something in the old episode that would have violated their rules back then.\nIt doesn't violate them now, but we, because the episode was uploaded back then.\nWhat happened with that?\nJust had like a weird at the time, the penalty was like a, you had to do something, and so like they couldn't take that step away.\nThat was kind of the issue.\nBut the bottom line was [ __ ].\nEverything this person said was true.\nMhm.\nAnd proven to be true now.\nAnd now it's 100% fact.\nSo now you can say whatever you want.\nLike now if you say, &quot;Hey, you know, super likely that that virus leaked from a lab in China.&quot;\nAnd now you can say that.\nLike back then you would get attacked.\nIt would be crazy.\nYou'd be called a racist.\nYou'd be called the worst things possible if you just said like the wonderful John Stewart bit that he did on Co Bear show.\nDid you ever see that bit?\nI, I can't remember.\nRefresh my me.\nOh yeah.\nLet's watch it because it's really hilarious.\nThis is like in the heart of the pandemic, you know, and Stephen Cobear was like vaccine or death, you know, he was all in on it.\nAnd so Colob Bear was like trying to like halt him in the middle.\nHe's doing a bit.\nJohn Stewart's doing a He's doing a funny bit, and Co Bear tries to like [ __ ] block it.\nHe tries to like trip him, but John Stewart powers through like like the comic that he is.\nYou find it?\nDon't tell me it was taken down.\nNo, there's just two versions of it.\nAll right, give us this one.\nAll right, this is it.\nI, I, and I honestly mean this.\nI think we owe a great debt of gratitude to science.\nScience has in many ways helped ease uh the suffering of this pandemic uh which was more than likely caused by science.\nSo, and that's kind of What was that?\nNo, no, no, no, no, no, no.\nListen, listen, listen.\nIt's coffee.\nI wouldn't do that to I wouldn't do that to you.\nSo, what do you what do you what what do you mean by do you mean like perhaps there's a chance that this was created in a lab?\nThere's an investigation.\nA chance.\nWell, I, I, I there's evidence.\nI'd love to hear it.\nI don't know.\nNovel respiratory corona virus overtaking Wuhan, China.\nWhat do we do?\nOh, you know who we could ask?\nThe Wuhan novel respiratory corona virus lab.\nThe disease is the same name as the lab.\nThat's just that's just a little too weird, don't you think?\nAnd then they ask those scientists, they're like, &quot;How did this So, wait a minute.\nYou work at the Wuhan Respiratory Corona virus lab.\nHow did this happen?&quot;\nAnd they're like, &quot;A penguin kissed a turtle.&quot;\nAnd you're like, &quot;No, I you the name of your l If you look at the name, look at the name.\nCan I let me see your business card?\nShow me your business card.&quot;\nOh, I work at the Corona virus lab in Wuhan.\nOh, cuz there's a Corona virus loose in Wuhan.\nHow did that happen?\nMaybe a bat flew into the cloica of a turkey and then it sneezed into my chili, and now we all have corona like a second.\nListen to this.\nWait a second.\nAll right.\nOh my god.\nOh my god.\nThere's been an outbreak of chocolaty goodness near Hershey, Pennsylvania.\nWhat do you think happened?\nLike, &quot;Oh, I don't know.\nMaybe a steam shovel made it with a cocoa bean.&quot;\nOr it's the chocolate factory.\nMaybe that's it.\nThat could be.\nThat could be.\nCoar kept trying to get in the way.\nThat That could be.\nBy the way, I gave them all tuberculosis.\nJust that could that could very well be.\nAnd Anthony Fouchy and Francis Collins and NH said like this should definitely be investigated.\nStop with the logic and people and things the name of the disease.\nWait a second.\nWait, the building.\nWait a second.\nBut I It could be possible.\nYou could be right.\nIt could be possible that they have the lab in Wuhan to study the novel corona virus diseases because in Wuhan there are a lot of novel corona virus diseases because of the bat population there.\nI understand it's like it's a local specialty, and it's the only place to find bats.\nYou won't find bats.\nAustin, Texas has thousands of them that fly out of a cave every night.\nEvery night at dusk.\nIs there a a corona virus in Austin corona virus?\nNo, it doesn't seem to be an Austin corona virus.\nThe only corona virus we have is in Wuhan.\nYes.\nWhere they have a lab called What's the lab called again, Stephen?\nThe Wuhan novel Corona Virus Lab.\nI believe that's the case.\nAnd how long have you worked for Senator Ron Johnson?\nLet me tell you something.\nLet me tell you something about Ron Johnson.\nThis is not a conspiracy.\nHere's the thing about science.\nYou could be right.\nYou could be right.\nBut this is the problem with science.\nScience is incredible, but they don't know when to stop.\nAnd nobody in the room with those cats.\nHe's going to do the other thing that we already saw.\nYeah.\nThe other thing we talked about the Spanish flu, which a lot of people never heard that before either.\nThey did what isn't that great?\nThat's one of the best segments ever on late night television ever in the history.\nEmperor wears no clothes.\nAnd Colbear, thanks to Emperor, still has a fancy robe on.\nWell, this is the job of comedians in society at certain times.\nAnd John Stewart, he held the torch.\nI didn't realize he was enlightened.\nWell, he's a very smart guy.\nHe's just he's not a bullshitter, you know.\nHe's a very smart guy.\nI don't agree with him on everything, but has he come around on the shot?\nI don't know.\nI don't know.\nI haven't spoken to him.\nHe lives uh in another state, but I love the guy.\nHe's great and he's uh he was my favorite like when I was younger.\nHe's a great comic.\nVery funny guy and a very nice guy and very fair and honest.\nYou he's he's uh you know like the type of person who can do that on television in the middle of of the [ __ ], which is what it was.\nThis was like right around the same time where the government was where they made that remember that release that they had.\nThey said for the vaccinated, you've done your job, but for the unvaccinated, you're looking forward to a winter of illness and death.\nSevere illness and death.\nSevere.\nIt's crazy.\nSevere illness and death.\nAnd this was during Omnicron, which statistically was a cold, right?\nThat was the one that was like the had the least mortality.\nYeah.\nSo for him to do that during that time was very courageous.\nLike he had to know like but he just had to make it really funny, which he did.\nYeah.\nHe just he na it's so preposterous cuz it's so on the nose.\nYou almost think like if that was in a movie like that would be too like it was a Cohen brothers movie or something like oh my god this movie is ridiculous.\nLike there's no way it would be named the same as the lab.\nDid he get smeared for it?\nI don't think he did.\nNo.\nJohn skirted out of that.\nHe had a show with Apple for a while, and it was really good.\nBut then I think I don't want to speak out of turn here, but I do all the time, so I might as well.\nI think there was an issue with an episode they did on China.\nIs that the case?\nLet's see if there's like data on that or if there's a story on that, but they stopped doing that show.\nSo he had like a Apple show, you know, because Apple TV produces a lot of shows now.\nThey have Severance.\nYou ever watch Severance?\nNo, I'm watching Righteous Gemstones now.\nOh my god, that's a good show.\nThat's Oh my god, that's that is such a funny show.\nI didn't even hear about it until like this year.\nThere's almost too many great shows.\nI know.\nIt's hard to keep up.\nThat show is fantastic.\nThat show is so funny.\nI think it's modeled after Joel Ostein.\nIs it really?\nThat's my theory.\nAnd I I pass by his church every day.\nSo, yeah.\nThere's something about those guys, those guys that run the mega churches.\nLike, you got to be crazy.\nLike, not one of them is like, &quot;Oh, that that guy makes sense.\nThat guy seems super super reasonable, normal human being that's like, I like that guy.\nThat's I want him as my pastor.&quot;\nNo, it's always like some complete cook.\nIn October, the New York Times reported that Apple canled the comedy show ahead of its third season due to creative differences and execs concerns over Stuart's coverage of topics such as China and AI.\nH okay, the China I get it.\nApple has contracts with China, right?\nThey have cell phones made in China, and they're they actually have to we did a story about that the other day.\nWe were read a story rather the other day about how uh the iPhone 17 is so complex that it actually has to be manufactured in China because they have the best manufacturing.\nSo they must have some sort of a thing where like you can't criticize.\nYou're going to [ __ ] it all up for us.\nYou're going to [ __ ] it all up for the production of our phones that we need that we make all this money, which is why we have more money than most countries.\nWell, I don't see how John Stewart would be a threat to their revenue.\nI just don't think they want him criticizing, you know, China.\nBut the AI one is even more weird.\nThe AI one is even more weird because it's like, uh, don't you think we should make fun of AI?\nDon't you think there should be like something that scares the [ __ ] out of people enough to wake up and recognize that this thing is coming at us like a freight train?\nThere's no guard rails.\nNo one knows what's gonna happen.\nAnd everybody's like full steam ahead.\nAI terrifies me.\nIt should.\nIt does.\nWell, it's cuz you're intelligent.\nYou know, I think most intelligent people are aware that this will be a change that is akin to the asteroid that hit the Yucatan.\nThis is going\n\n\nThis is going to hit in some crazy way that redefines what it means to be a human being.\nIt's around the corner.\nWell, yeah.\nAnd you know, Texas, they love AI.\nThey're like, put a huge amount of money into AI.\nOh, fun.\nTexas.\nOh, fun.\nYeah.\nChoo choo.\nI know you love Texas, but I do love it here.\nIt is not what you think.\nNo, there's a lot of things.\nI need to wake you up on Texas.\nWell, I like the fact that it was free during the time where California was not.\nYou could do whatever you wanted.\nRelatively.\nRight.\nBut in my business and for what I do, like the standup comedy and letting people tell you what you can and can't do, I don't like that, right?\nYou know, and here they've had a more rebellious spirit in that regard.\nWell, and so I think healthcare though is turning Texas blue.\nYeah.\nWe have like Houston is home to the largest medical center in the world and it brings in people from all over and I think mandates started in Texas for a reason.\nI think they did it here to test the waters.\nI knew if they could get away with it in Texas, they could get away with it anywhere.\nOh, don't make me move to Florida.\nNo, I don't even think I know.\nI think Idaho.\nFlorida's not any good either.\nIdaho is cold as [ __ ] Jamie can't live.\nLook at him over there.\nHe can't survive.\nHe got out of Ohio and he developed thin blood.\nUh but yeah, Texas I just I I think it's a we have so Texas Medical Association, largest medical association in the country.\nThey are uh really proponents of transgender surgery and minors.\nThey are anti-free speech for physicians.\nThey are they are pro-mandate.\nThey've gone after me.\nUm and they have a a tight control over the people in in our house and state.\nUm so I just think we need to be careful.\nI mean the you saw it during the pandemic and the the medical the economy of our state is is dominated by health and people don't realize that.\nThey just think oil, but health is a huge dominating factor in our economy.\nAnd um you know, you saw what they did to me, what they're still doing to me.\nYou see the mandates um and you I don't know if you've been following what's going on in in the House, but the House is our House is divided.\nSo we've got the the freedom the real true freedom loving representatives.\nAnd then we have these pseudo Republicans who who do control everything.\nUm but they are basically Democrats in disguise.\nUm, and I don't know, it really worries me.\nIdaho just passed a bill, the best medical freedom bill in the country.\nIt eliminates all medical mandates except for hospitals of course um because uh but it's the first one of its kind where medical mandates are finally outlawed because I mean you think about it med you know all these vaccines that we have to give our kids to go to school is actually fundamentally wrong.\nWe should not mandate any child to get a shot to go to school.\nAnd in Europe, half the countries don't have those kind of mandates.\nBut the United States, it's very common.\nYou know, all kids have to get these shots to go to school.\nAnd if you opt out, it's a big deal.\nAnd some states don't even allow it.\nDon't even allow exemptions.\nUm, so I think it's a wakeup call.\nLike I just I never thought about the whole the fact that I had to give my kids these shots to go to school as being an issue, but now that COVID happened, I see it as a huge issue.\nUm, but Florida, you know, Florida's been kind of behind it, too.\nLike, you know, they're not one of the states trying to get Ivormectin over the counter.\nUm, there were nine states that tried to pass bills banning mRNA.\nUh, they all failed, but Florida wasn't one of those.\nSo, Florida worries me, too.\nIdaho.\nIdaho.\nThey have good skiing there.\nIt's beautiful.\nSki.\nUm, I quit skiing a few years back.\nMy last accident.\nI'm like, I'm done.\nSki.\nI love skiing.\nOh, it's fun.\nDon't get hurt.\nDon't get hurt.\nDon't get hurt.\nDidn't get hurt.\nDon't get hurt.\nThat's how I feel every time I ski.\nBut I've had a bunch of surgeries.\nThat's a problem.\nLike I I know the vulnerability of knees.\nYeah.\nI've had three knee surgeries.\nYeah.\nIt's like it's it's rough on you, you know?\nBut it is fun.\nIt's just for me like the juice isn't worth the squeeze.\nThere's a bunch of other stuff that's a lot more fun that doesn't come with risk of broken bones and concussions.\nYeah.\nI don't know.\nI like roller coasters for fun, but other than that, I can't You're one of those.\nI'm not No, I'm not full on, but uh I don't Have you the new roller coasters?\nHave you been on them recently?\nOh, yeah.\nI have kids.\nYeah.\nThey're much better.\nI mean, it's not what the ones we grew up with.\nNo, some of the ones like Disneyland has some insane ones.\nThe one the Incredibles ride if you ever done that one.\nWhoa.\nI like Guardians of the Galaxy.\nOh, that's great.\nThat one's fun.\nThat one's really fun.\nYeah, Disney.\nYou know what's the best ride?\nIt It's in Disney World.\nIt's an Avatar uh three um virtual reality ride.\nIt's incredible.\nIs that Florida or California?\nFlorida.\nOh, yeah.\nI think I did that.\nI think it's called Flights of Fantasy or something like that.\nIt's incredible.\nLike you you are one of the Avatar people and you fly around on a dragon and it's so good.\nIt's so good.\nIt just like you feel the breeze, you feel mist in the air.\nAt a certain point, I'm realizing while I'm doing this, I'm like, \"This wasn't even remotely possible just 20 years ago.\"\nLike, what is it going to look like 20 years from now?\nLike, I'm not going to have any idea.\nThey're going to put a helmet on me.\nIt's going to like sync up with my brain.\nReady?\nBrain sync.\nAnd all a sudden, you're going to be in that world.\nYou're like, \"Whoa.\"\nAnd you were going to trust those people to let us out.\nYou know, that that's 100% coming.\nYeah.\nI'm I'm happy with the roller coaster.\nI'll stick with that.\nIt's not worth it.\nIt's not as good.\nYou You take the brain thing.\nGet in the Avatar world.\nI get sick on this ride.\nThe ones where the 3D I get kind of naughty.\nThis one moves too.\nThis one you're on like a motorcycle like a like a fake motorcycle and that's to represent the dragon, you know, and you have like a handle you hold on to and it starts moving you around.\n[ __ ] So like as you're flying it's like it's it's a full sensory experience.\nI think I did I did that and my kids made fun of me because I was screaming on it like you did that one at Disney World.\nYeah, a couple years ago.\nYeah.\nI haven't done it since.\nIt's so good.\nSuch a good ride.\nAnd that's just the tip of the iceberg.\nAnd when you connect that to AI, so it tailor something that's specific for your whatever crazy fantasy you want to do.\nWe already have video games where people can murder people.\nLike that's like the most popular video game is Grand Theft Auto.\nAnd one of the things that people love about is you could just beat some mechanic to death for no reason.\nDo you think that allows people to get out their frustrations though in a in a healthier way?\nPerhaps I would recommend martial arts.\nI think that would be a healthier way.\nBut I think more than anything, what it does is allows you to disassociate and just to be able to because it doesn't mean anything.\nIt's not really a person that's getting beat to death, but the imagery is obviously of a person that's getting beat to death.\nAnd you're able to do it with no consequences, no recourse, no bad karma.\nYou don't even feel bad because it's a part of the game.\nYeah.\nYou know, there was what was that one where you could uh drag the the Wild West one where you could beat people with whips?\nRed Dawn Redemption.\nRed Dead Redemption.\nRed Dead Redemption.\nCrazy games where you could do horrible things to people.\nLike, what is it going to be like when you have video games that are actually virtual reality, completely immersive, and you could just be a serial kill?\nYou could be Jack the Ripper, right?\nThey give you a knife and you're now you're in London in the 1800s and you're Jack the Ripper.\nWhy do why do people create these?\nBecause they can, right?\nIt's like what John Stewart said about the nuclear bomb.\nLike why why they do that?\nWell, and this is the same thing.\nThis is the parallel to the Manhattan project is that we're not the only ones that are trying to find the the get to the solution of what is like the ultimate expression of AI in its current form.\nLike super intelligent, sentient artificial intelligence, like something that's going to be godlike power and ability.\nChina's working on it, too.\nWe have to work on it.\nIf we don't work like So, everyone's like, \"Hang on.\"\nWe're like, \"Nope, just China's working on it.\nWe have to do it.\nWe have to get there first.\"\nSo, this is it's just like the Manhattan project.\nAnd I I don't think it's going to matter.\nI think I think once we get there, it's going to be so weird for everybody.\nIt's I think civilization is going to be an upheaval.\nAnd I think we we're entirely attached to the idea that this civilization that we live under where our money is all in hard drives and you it's all ones and zeros on a database somewhere not even backed up by gold anymore.\nIt's all super weird already.\nLike this is standard forever.\nI don't think it is.\nWell, I think I don't know.\nI feel like there may be a backlash because you know this this wanting to do real things and do you know real experiences.\nI mean I There'll be a few hikers.\nThere'll be a few hikers, few people.\nI mean, when you're on your computer all day, the first thing I want to do is just get outside and and get away from all all that.\nAnd so, my hope is that backlash.\nWell, there will be a few, right?\nThere's just like there's people that are still pro vaccine today, right?\nThey're still pro mrna vaccine.\nThey can't I can't wait for the new booster.\nThere's people that are out there like that, right?\nYou're always going to have different kinds of people.\nYou're never going to have one thing where everybody adopts it.\nThere's going to be a bunch of people that want to live a subsistence lifestyle in the woods forever.\nLet all those morons in New York put their helmets on and live in [ __ ] Avatar Land.\nI'm going to live out here in the real world.\nBut if you think about how many people play games today versus how many people played games 30 years ago, it's off the charts, right?\nLike what what are the numbers?\nLike when I was a child is when they had Pong.\nThat was the first one.\nDo you remember that?\nYeah.\nIt it was in the Sears store.\nDo you remember that?\nYou go shopping for jeans and you play the game.\nThat's where you buy your tools.\nYeah.\nTough skins.\nYeah.\nAnd that was revolutionary.\nYou could play a game on television.\nAnd it was a really simple game.\nYou know, and you be playing ping pong with this like slowmoving ping pong ball and it was fun.\nWe all loved it.\nFamily would gather around, play ping pong.\nAnd then you fast forward to Call of Duty.\nLike that's insane.\nLike that is insane.\nThese kids are they have microphones on.\nThey're talking.\nThey're running through Fallujah gunning people down like this is crazy.\nYeah.\nAnd kids went through that phase, but they seem now to be sort of disinterested.\nLike they they kind of He did a good job.\nThey just it just happened.\nOh, I think a lot of kids are disinterested because they realize that the the beck and call of life and becoming a success is you cannot get too wrapped up in these things because they will steal your time.\nAnd but my point is that like the the amount of people that are allowing it to steal their time today and I know you're enjoying it.\nSteal your time is a bad like have fun.\nPlay your games.\nI love them.\nThey're fun.\nBut I can't do them.\nThere's too much.\nSee they they they're too exciting.\nThey're too good.\nBut these are just the beginning.\nWhat what what we're experiencing now with Call of Duty and first-person shooters that everybody loves in comparison to what's going to happen when they put that thing on your head and then all of a sudden you really are on battleship troopers.\nIs that what was that movie where they fought the aliens?\nStarship.\nStarship troopers.\nDid you ever see that one?\nNo.\nGreat movie, but it's the future.\nOr, you know, they're fighting off aliens.\nGiant alien bugs.\nYou could be in that.\nYou could be in it.\nFeel the sand on your feet.\nFeel the wind in your face.\nSmell the breath of the beast as you shoot it down.\nIt's going to be too compelling.\nYeah.\nEither that or go work at the supermarket near the supermarket all day.\nYou want to play pickup basketball?\nOkay.\nYou suck a fast ball, keep hitting bricks.\nI think the answer is roller coasters.\nNo, no, no, no.\nI don't know.\nI I just think it's just uh it's a test of civilization and it's uh it's probably something that is changing our species and changing it really quickly before we even realize it.\nLike just like we turn changed wolves into dogs, it's turning us into technology dependent gelatinous water balloons of blood.\nThat's That's dark.\nIt is dark.\nThey're trying I think they'll take over doctors.\nYeah, they're going to they're going to take over lawyers, doctors.\nThey're probably going to take over a lot of actors.\nI think actors and even screenwriters are in real trouble.\nWait, wait, wait.\nHow do you take over an actor?\nBecause these AI videos now are insane.\nThey're so good.\nHave you ever seen the one where there's stand-up comedians talking on stage about how uh and there's people out there that believe that we're a prompt?\nLike like and then\n\n\nThey're going to people in scenes of movies that are like, like saying, \"Do you really believe this is a prompt?\" And there's Vikings, like, incredible Viking village where you're like walking down the village. It's all AI, and it looks like Hollywood movie quality. It looks like some crazy new blockbuster that's out about Vikings. They have Crow Magnum Man walk, you know, like, like hunting on a, on a raft moving through the frozen, frozen lake. It's the whole thing is nuts. It's so good. It's so... And it keeps getting better. Like, this is insanely good compared to what just existed a couple months ago, like a year ago. Like, there's, you, it's unrecognizable. We could, like, computers move so slow in comparison. Like, think about when, when did, when did you first get your first computer?\n\nProbably medical school. What year was that? That was like 1998. Okay. So you're probably running Windows 98, right? It kind of worked, but it was a little buggy. Sometimes it would crash. You get the blue screen of death. Then within like five years, they got way better. 10 years, they got way better. But now if you look at a, if you have a laptop now in 2025 versus a laptop from 2020, no difference. No, I have an old MacBook that I use sometimes 'cause I like it 'cause click your keyboards and it's [ __ ] old as [ __ ]. It's really old. Like it seems like a regular laptop. It's not that much different. The AI from then was nothing. It didn't exist. And now it's making movies that are off the charts. They're unbelievably realistic. And this is just one version of it. They're gonna have a way better version of it a month from now, a way better version of it six months from now. And where, where does that end? Like, it doesn't, it doesn't end. And who knows what the news is now? You know how many times someone sent me something on Twitter and I thought, \"Wow, that's crazy war footage.\" And it turns out it was just from a video game. Wow. Yeah. That people get duped. They see a plane getting shot down. They think it's real. Like, wow. No, it's just a scene in a video game. Yeah, I haven't seen these videos. I've seen, I've seen photos that look very realistic, but I haven't seen these videos. I have to go check that out. They're too good. They're too good. And this race to AI is, you know, we're all involved in it. And I worry that it's not in our best interest, just like I worry that our health system is compromised. I worry about it all. I worry there's, there's a lot of people that are going to be insanely wealthy once this goes live. Like once this goes live, the halves versus the have-nots will be so far separated. But how do you make money off of AI? You control everything. First of all, the stock market, you, you'll figure out the stock market immediately and bet insane amounts of wealth at things and compound it and figure out when to buy and when to sell instantaneously.\n\nYou, you could even use AI to manipulate markets by having a bunch of bots tweet about something. So then you would jack up a stock price and then you would go in and clean up. You would create crypto coins, unlimited amounts of crypto coins, dump tons of money in it, hire celebrities, they wouldn't even know. Hire them to promote the crypto coin. Pull the wool out from everybody. Make billions of dollars. And you just do that over and over and over and over again instantaneously all around the world. Then you have all the money. Like AI, if you're in control of AI and AI is artificial super intelligence and you tell it, \"Make me as much money as you can as quickly as possible in the stock market.\" This is what we have. We have a hund00 million to invest. We have a billion dollars to invest. If you're already wealthy, if you're a huge company already, you could do something like that and who knows what kind of an effect that would have. You could manipulate world governments instantaneously. You could cut off pipelines. You could sabotage power grids. You could shut down energy plants. You could do all kinds of things. You can insert viruses into systems that control every aspect of society instantaneously. You crack all, especially once they figure out how to attach AI to quantum computing. Then we're doomed. Then we're really doomed because then you don't have any computational problems. You have insane amounts of computational power, and it's all in our lifetime. Like, that's what's nuts. It's like we, this, this will be, if people survive and you know, there's like a golden age thousands of years from now where they find the relics of this civilization and they go look through and they, they figure out how to open up hard drives and they see us having this conversation about it.\n\nYeah. It's going to be weird. It's going to be like, \"Oh, they saw it coming. They did it anyway.\"\n\nWell, how do we stop it? I don't... I mean, you know, I think Elon Musk was sounding the alarm, and if he can't stop it, not only did he not stop it, he joined in, right? I think, uh, that's the idea is that you have to do it because other people are doing it. If they get a hold of it first, it'd be catastrophic. And I'm sure I screwed up a lot of possibilities in that little stupid rant of mine, but it's, it's something I think people need to have in their head because this isn't something that's not going to affect you. \"Oh, that's not going to affect me. I don't really have to pay attention to the politics in Poland.\" It's not going to affect me. You know, you can, you can do that. With this one, you can't do it with because it's going to affect all of us in the world. You're not going to know what the news is. You think Rolling Stone fooled us with that stupid picture from Oklahoma with a bunch of people that are gunshot victims waiting in line? Like they should have used AI for their picture. But yeah, right. But there they...\n\nThat's a good point because that was only a couple of years ago. Today they probably would. But this is, you know, that's a clear lie and it's a bad one. What about the really good ones, the really well-coordinated ones that are using artificial created images? Like, how are we going to know? How are we gonna know? Like when I Google something, I'm not going to go do clinical research. I'm not, I'm not gonna test these things to make sure it's correct myself. If you're in control of all the information on the internet, like you can instantaneously create a bunch of websites with fake data on it. You could do that easily, especially if people don't have access to the ability to actually make their own tests. You could change everything. If you're, you have AI, you're hacking into this and all, all the encryptions. Bye-bye. Everything's bye-bye. All these little roadblocks that we kept up there to keep our feeble primate brains from cracking these codes, like all that stuff goes away. It's going to get real weird.\n\nYeah.\n\nWell, um, I don't have an answer. We have to go get a bunker after this podcast. I know it's... I don't, I don't think it's going to be that bad, but I, I do think it's going to be really, it's going to change just society as we know it. I mean, there's probably going to be a lot of good aspects of it, too. I think the medical aspect of it is pretty amazing. Chat GPT alone when you can put in your blood work and can give you some...\n\nWell, I put in, I put in an MRI that I had of my own and it did, it missed it. Totally missed it. Yeah. I mean, it was grock. It was not chat GBT, but... Oh, I don't know which one's the best at that. I don't know. I, I like chat GBT. So, but there's, there's some other really good ones, too. Right. All I use is Grock. That's it. Mhm. You're a hardcore right now.\n\nYeah. I don't trust chat. I don't trust Grock, but I certainly don't trust chat and GBT. Well, um, I was listening to someone talk about a new program that is, um, you know, they have Pegasus. So Pegasus can read your phone. This new program is a zero click. It reads everything in your phone, including your encrypted messages. You have no idea if you have it on there or not. There's no way to detect it. And it's, it's been being used. It's used currently.\n\nWhat's the name of it? Um, I don't know, Jamie. See if you could find out the name of it. The old one was Pegasus. The new one is a similar preposterous name.\n\nIs it Palent... Palunteer? I don't... No, that's a different thing. I think Ian Carol was talking about it.\n\nBut so then... Okay. So you don't have any privacy anymore. So then your text messages don't have any privacy anymore. I just assume I don't have any privacy anymore. If it wasn't for Elon Musk buying Twitter, can you imagine how weird the world would be right now?\n\nYeah. Weird. I mean, it's so fortunate. I was kicked off for 5 months. What did you do that got you kicked off?\n\nI, I really, I was kind of timid back then compared to what I say now. I really wasn't that. But I did, I had a tweet that went viral and it was, um, America First Legal was suing the CDC over some email. I can't remember exactly, but it was something like, uh, American First Legal has just exposed the CDC, and it went viral. And then that was my last tweet. I was erased for five months. What excuse they give you? I don't even remember. You know, violating community standards. Wow. What did that feel like?\n\nAnd then I got... And then I tried to get on truth and get her. It's just not the same, right? You just don't get that feedback. And, uh, you know what I think about those things, too, and GAB as well. I think they're all infested with, like, state out of state actors, other countries, other countries' intelligence agencies, and even our own countries, and then even corporations. I think they're infected. I think even like Democratic and Republican operatives, I think a lot of the traffic is bots. Yeah. Well, I see that on Twitter definitely. 100%. It's almost not worth engaging anymore. It's like, what are we doing here? Like, you're, you're arguing with someone who's not even a real person. And I think that's like, that's a big part of it. And I think in those other alternative platforms like truth, don't... I think they, they do that to make them ridiculous for everybody else, you know? So they, the last thing they want is a bunch of people to competing to see who's the freest. Right. Right. So what's the best way to do that? Well, you have to sabotage this new social media platform the moment it comes out. The moment it comes out.\n\nSwastikas, you know, Peppy the Frog, the worst possible things. Post as much as you can so that it, this place becomes toxic, right? You know, so that you have to have like a zero tolerance policy like Blue Sky does. You go to Blue Sky, if you tweet, there are only two genders. Bam. Get the [ __ ] out of here.\n\nI was on Blue Sky for a bit. How long... How long did you last? I don't know.\n\nYeah, I got, um, I got, I slid in before it was open to the public and I started stirring the pot and then I just got bored. I got in some fights with, um, God, who's that woman? She's a lawyer. She's a big vaccine enthusiast.\n\nVaccine enthusiast is hilarious. Yeah, she's, she really loves hockey. She said she's like the, she's like the female version of Hotz. Um, anyway, I, I just got... No. Um...\n\nI can't remember. I know what she looks like, but I don't want to say it. I don't want to. No worries. You don't have to say it. So, what was that like? Blue Sky or... Yeah. When you got into it with her. I mean, whatever. It's... Yeah, I've got in so many fights on X. It's not really... It's a... It's a... It's just funny. You know, when, when before Methodist went after me, I got in some fights on Facebook with, you know, these private groups and there are a bunch of women that get together, the neighborhood women's group. Oh, boy.\n\nVicious. Oh boy. Very vicious. And it was the Houston Women's Physicians Group, and they, they called me Bertha and they, like, started, they like, \"Come, Bertha.\"\n\nYeah. They, they... Bertha got mad at them. I don't know why they call you Bertha. I don't know. They, they just, uh, they like, \"We don't want you in our group. You should go find another group and you're spreading misinformation,\" and...\n\nWhoa, whoa, things like that. And there's a neighborhood group that went after me. Um, those are more... I don't really care about the anonymous ex people, but then I had a couple, uh, had Mama Dr. Jones, who has a million followers on Tik Tok, come after me and make videos about me and, um, another... There's this saying, \"You spread misinformation.\" Yeah. Yeah. And that I'm a grifter and... Oh, that's... They always throw that one. Oh, yeah. Yeah. Yeah. Uh, there's this pharmacist, Savannah. She goes by R exorcist, and she has an Only Fans account as on the side. She's come after me, like, just vicious. I mean, these, some of these women are just... Oh, no.\n\nReally toxic. Yeah. When they have the right to be. That's the thing. It's like when they feel like they've got the green light to just be as evil as possible and to turn you into like some subhuman.\n\nYeah. Especially if they don't like it because you're a doctor. She thinks she's so smart spreading that misinformation in our neighborhood.\n\nYeah. So, overall coming out of it on the other side, though, and do you feel a sense of indication at least, like, because the public has embraced you and you've, you got a lot of followers on Twitter that support you, you know, after, I'm sure the Danny Jones podcast. I'm sure that a lot of people were, were listening to your story and... Yeah. I mean, it's yes and no. I mean, I still have a medical board that I'm dealing with. Um, Methodist Hospital just sued me. Um, so there's just, there's still a lot of drama, unfortunately. But, you know, I have hope. There's a, there's actually a lawsuit today that's first jury trial in the country over these hospital...\n\n\nProtocols where they had a young woman with Down syndrome. They basically euthanized her. Uh, they gave her a DNR order even though she didn't have one. And the father has just been wonderful. It's a Shara family. Um, why did they do that? They euthanized her for what? They... I've seen this. I have reviewed records from these hospital patients and they'll euthanize them. They need the bed. They said, \"Well, they're going to die anyway.\" What was this person in the hospital for?\n\nCOVID protocol. So, um, and they... Wait, wait, wait. So they were in the hospital with COVID and they gave them something to kill them? Yeah, that happened all... I'm sorry, but I hate... I mean, that happened. People, they give them morphine and insulin... and... Yeah. Yeah. That's common. Yeah. Yeah. I've... I've reviewed charts in this situation. Um, they gave her a DNR, which is do not resuscitate, meaning if they look like they're dying, you don't do anything, which that was not the case. So, they're suing for battery, which is one way of getting around the PREP Act because the PREP Act is very, um, hard to penetrate. The PREP Act protects everybody, all the doctors, all the hospitals from any wrongdoing during COVID. So, it's been this big challenge trying to get around the PREP Act. And this case has hope of getting around the PREP Act because they're charging for battery, and they're in trial. It started today. It's in Wisconsin.\n\nUh, so that that gives me hope. Um, I don't know if you've heard of Brooke Jackson, her case. She sued Pfizer. She was a whistleblower, so she was one of the heads of the research clinics, and she was in charge of overseeing the protocols, and she found that they were skipping necessary steps. They weren't following up with injuries. She basically became a whistleblower, and then they immediately fired her, and now she's suing uh, Pfizer. But this has been going on, you know, since 2020. Um, and uh, the DOJ, unfortunately, has stepped in and tried to shut down the case, which normally a DOJ comes in and helps people when they're trying to, you know, sort out a, um, this is a KTM case. Um, and it... I mean, it could bankrupt Pfizer, but now our own government, and even this is under Pam Bondi, so this is the new DOJ is coming in to stop this case from happening, which is bothersome. But these two cases, what is their argument for why... why are they trying to stop because it would uh, impact public health policies, would go against our country's public health policies by proceeding with this case and letting it go to trial? How... how so? I don't know. Just that's their... that is basically what they said. Have you tried to steal me on what they're saying? I mean, I'm not... it's not my case, and I don't... you know, the lawyer would probably have a better explanation, but...\n\nand it's just met with so many roadblocks. Um, but the euthanizing one is still stuck in my head. I just... I can't imagine that that's real. No, no, no. It is definitely real. I mean, it... when they determine that someone's going to die anyway. Is that what it is? Right. I... I mean, they'll justify giving morphine because they'll say, \"Oh, well, they're struggling to breathe.\" Well, guess what? Morphine actually depresses your drive to breathe. Um, but like this one case, I remember this patient, he was sick. He looked like he was dying, but they just like pushed morphine. He had no pain, you know, they do a pain score, so 0 to 10. This guy had zero pain. Uh, and then they pushed insulin to drop his sugar, and his glucose was fine. And then he died three minutes later. And you... I turned him into the medical board. I reviewed this chart and turned him in the medical board. Nothing. They didn't do anything. Uh, but yeah, they definitely... that definitely went on during COVID.\n\nJesus, that is such a terrifying thought that someone would just decide so many people are dying. This guy's definitely going to die.\n\nYeah, this is 100% real. Yeah, def... definitely. Yeah, it's... it seems like something someone would tell me.\n\nEuthanasia. They don't call it euthanasia.\n\nIt seems like something that someone would tell me, and then I would have to ask you like, this is something someone told me. I'm sure send you the record that I reviewed. It seems like something I would be bringing up to you as a ridiculous thing, and you would shoot it down, right? No, I wish I wish I were... um... It's not truthful, but yes, it definitely... definitely helped happen.\n\nWould you have ever imagined this before you became a doctor? No, I mean, I did. So, it's one of my former attendings, an Otolaryngologist, when Katrina hit, her name is Anna Poe. She got um, investigated for euthanizing patients in the ICU during Katrina. So, there were... you know, all the power's out, been a big hurricane, and she was going through the ICU and pushing morphine on people. Um, she got off, but that's an example. I mean, doctors will and nurses will do that, and nurses have a... yeah, there's usually a standing order, so you can give morphine PRN as needed. So it's not always just the doctors. Sometimes it's the nurses.\n\nDo you know how many people get assisted suicide in Canada? No. Do you? You ready? Jamie, pull the numbers up.\n\nIt's crazy. It's crazy. And they'll... they'll do it if you're just depressed, right? They'll do it if you... you don't like being overweight. They'll do it if you... you know, whatever. It's awful. It's awful. I mean, they're just... it's a lot of the vaccine injured are doing that. They're going to Switzerland or going to Canada to have this. The Canada numbers are bananas. Like see... like this can't be true. This can't be true. And here it is. More than 15,000 people received medical assisted assistance in dying in Canada in 2023. Yes. What... what is it in 2024? Now, this is an old story. So, imagine 2025 where we're... where they're... they're... this is crazy. 15,000 people, they've helped them die instead of like help them live instead of like we used to call suicide hotline. Hey, don't do it, Bob. You know, and now Canada's like, \"Come on in. Press one if you want the suicide. I'll make an appointment for you.\" E, come on in. E, right? You know, shouldn't we be helping people get past that? Isn't that the goal? Like, hey, maybe... maybe we can get you healthy. Maybe we can get you feeling better. You know, maybe we could do something about uh, all your hormone levels and all the things wrong with your body. Maybe that's why you're depressed. And...\n\nGod, I mean, there's legitimate reasons for people to do it. Don't get me wrong. If you're like... I know a guy did it, Michael there, who was a hilarious comedian, and uh, he had ALS, and it got real bad at the end, and he knew it wasn't getting any better, and so he went to Oregon or they can do it for you, and I get it. I get that one. But if you're depressed... Jesus Christ, that's it. Well, the worst is the vaccine injured because they're just... they've lost hope because and they've been gaslit. That's what's so crazy about this, and people have helped them with it. There's a bunch of people that were... they're... they feel really guilty about pushing the vaccine early on, and they feel connected to it, and they'll still put these blinders on and like choose to pretend that it saved millions of lives and keep pushing forward with the same narrative and they'll... they do the man's work for the man. Unfortunately, in social circles, you know, like you're... you are... you're punished... you're punished for having any sort of heterodox views, anything that steps outside, anything that could get you in trouble, anything that people could argue like, oh, she shouldn't even live in our neighborhood, you know, she doesn't even want to vaccine her kids, anything like that. People are scared of that. And so just the... the fear of being ostracized from your community, but once you get past it, it's so freeing. Well, you don't care. You don't care at all.\n\nAre you kind of... I mean, I know you're not happy that it happened, but are you kind of... you... you clearly probably come out of it a person with a different perspective? Definitely. Definitely. I don't... I mean, I don't regret it. It's... It's been a roller coaster, but it's a... Yeah. I... I feel free. I... like you can't really say anything to me anymore that would hurt me. Yeah, that's a good place to be. Mhm. It is. And you know, I really admire people like you that you... you weren't a public person. You weren't a person who sought attention, but when you know the... you were thrown into this battle, and you've handled yourself really, really well. It's very impressive 'cause I can't imagine the stress. It's like when you're saying you were in the fetal position for two days, I'm like, how'd you ever get up? I know. I mean, I know. Well, it was the anger that helped me. The anger can help you. Yeah. Um, when you came out of it on the other end, like, are you happy that it happened? Uh, yeah, it's, you know, I'm ready to rest. I'm... I'm exhausted, but I feel, like I said, I mean, I feel free. Um, I think you grow when you go through difficult times. I certainly learned a lot about taking care of patients and um, you know, I made so many assumptions before. I feel like I'm a much better doctor. Um, I am... I am utterly exhausted though. I will say that, and I'm ready for a break. Um, and I'm frustrated that this... I don't... you know what's going on now with the new administration is not giving me a lot of hope. Um, but everyone's hope is that there's incremental change, that it's going to take a while to get through some hurdles. That's everybody's hope, but you know, it's how many administrations have these incredible promises, and then they... same thing with the Obama administration. You know, there was a lot of these people like we... we had these amazing hopes, the whole world's going to change now, and then, oh jeez, same thing. Same thing over and over again. Same thing. More corruption, more people getting paid. Yeah. you know, well, people are mad at me because I keep criticizing Kennedy and Maha, and but I... I'm like, what... what's the downside? You know, we have to keep pressing. We have to just pound away and not let, you know, be the squeaky wheel and just remind them what we want, right? We wanted facts. We wanted to stop being lied to. We wanted no more propaganda. We wanted to know the truth about all sorts of different medications and why they're prescribed and why we're the sickest ever. Why... why are we so sick? Why are we the nation that has so much money and spends so much on health care has the sickest people? That doesn't make any sense. That... that doesn't seem like a good system. Yeah. You can't just say this system has to stay like it is forever for the safety of everyone. Like I... Well, I'm fully on board with Maha's message about addressing chronic disease. Fully on board with that. I just find it troubling that they are not talking about mRNA. There is nothing in that MAHA report about mRNA. What do you think would cause that? Do you think they have someone set them down? Well, there's... they're going to say it's strategy. Others think it could be a misdirection strategy, not just a okay, we're trying to get where you... what you want. we're just going out about it a different way or we're... we're doing this to completely uh, distract everybody from the elephant in the room. That's my concern. What's the elephant? mRNA, the CO shot, the pandemic, the biggest health crisis in... the biggest health crisis in our generation that directly impacted every single person, and we're now talking about it, right? You do you think that the strategy if you had to look at it from the best case scenario, like the strategy would be get some things changed, like stop mandating it for children and pregnant women, and then more and more studies can get released, more and more data can get pushed forward. We have so much data, right? But we... we need to get the narrative out there because there's going to be people that vote against it. So like if you didn't get it in the first time, Kennedy... Kennedy doesn't need any votes. He's... he's got the power. He could a stroke of a pen. So where... where do you think the politics come from then? If you have that mandate, that's what you want to do when you get in. What has happened? What is somebody... what's... what is somebody have something on him? Why is he not acting? Because if it were me, I mean, maybe people say, \"Well, he'll get fired. So what? Get fired. Go down kamicazi. Save the world from MRNA.\" Because if he... if he takes it off the market, it's so hard to get it back on. Stroke of a pen.\n\nYou ever talked to him? No, I've... I've met him once. I like not... I like not knowing him, though. I don't want to feel like... Right. You're obligated to support him. Right. Right. Right. That's great of you. Yeah. That's very smart. Unfortunately, I know him, and I like him. Well, and I think the people in my circle who know him are now being quiet because they have a relationship with him, and they don't want to offend him, which I understand, but I feel like I'm not there, so I'm just going to, you know, I... I can't read minds. I don't have any inside information, so I'm just going to call it as I see it. You should. Yeah. I... I think we can't, you know, you can't turn blinders on either side with anybody, without anything. Just because someone's on your team, if they're doing something that you think is goofy and doesn't make any sense, like this could be a real problem. You got to say it, right? I think you're ethically obligated. I mean, this is... this is... and yeah, I started a organization called Americans for Health Freedom to try to find the politicians with moral courage to simply state that the CO shot should be pulled off the market. and it...\n\n\nIt has been slow going, but uh we are up to 252 politicians who will go on record just to state that these shots should be pulled off the market. Um but it's a problem. I mean, you know, these politicians are not getting these shots anymore and they're not giving them to their kids. And yet they're fine just staying quiet and not saying anything. They're fine letting their constituents get these shots when we know all the complications. We know that it doesn't work. We know that the risk far outweighs the benefit and the politicians are staying quiet. It's wild. So, our goal is to support the ones who will speak up and get them more power. Isn't it kind of impressive though what money can do? It's kind of impressive. You get everybody to just shut their mouth. It's kind of impressive. Money and power. I think there are a lot of people that, you know, they'll kiss the ring and Oh, yeah. Definitely. If you Yeah. those of us that don't want power, don't want a position, don't it's also very freeing because you can Yeah. You don't need anything from them. But it's just uh it's it's such a bizarre time because all these things that we've always held as being sacred forever are now being challenged and one of them is the fluoride in the water, right? That's that's a big one. And to watch that guy argue against fluoride being removed from the water, watching Kennedy and him argue, it was like it's hilarious, right? Like the argument for keeping in the water is so dumb, right? It literally lowers IQ's or at least it's correlated with the very decrease in IQ measurable. Well, and I agree with that. I just on the flip side of that though we are seeing like I what I see in my office is people uh maybe taking things too far you know off the beaten path. Um and like this MA report one thing I have a real bone to pick with is they've basically waged war on tonslectomies and ear tubes. What is a ear tube? So kids, well not adults too, but mostly kids that have middle recurrent or chronic middle ear infections. They get fluid stuck in their middle ears and so you put a tube in there to drain it to drain it and keep it from coming back. It's a I mean it takes five minutes. They get um they get anesthesia but they get a gas, you know, they don't get an you know super heavy anesthesia. Uh and it's very rare to have a complication. You know, I'm not for just frivolous surgery, but I feel like this one is it really can make a huge difference in their quality of life, uh the parents quality of life because they're the kids in pain off antibiotics. The pain, you know, you get an adult with a middle ear infection, it will bring them to their knees. So, these ear infections can be really painful. Uh you know, they don't have to take all those antibiotics. Um and but this MA report just came out and said that they called it proven harmful. The tonslectomy and ado and adoidctomy ear tubes proven harmful for kids and that is just how could the ear tube be what were they saying? How was it proven harmful if it drains the kid's ear? It was completely unnecessary. Um and it was just all you know basically done for money. Uh it makes no difference and out an overall outcome in the child. Um, but yeah, doesn't it alleviate pressure like logically and hearing? And the other thing is hearing. I mean, the biggest issue is you've got a bunch of fluid in your ear, it does affect hearing. And when you're trying to develop speech, yeah, that that can be problematic. Um, so what do you think they're doing? Like why why are they going after those? I just think it's an example of it of this gone too far in the other direction. Right. Okay. Too woo woo. Too Yeah. Let's let's reject all of all of science. Right. Right. So tell me about tonslectomies because I'm ignorant. I'd heard that you know you should get if you have tonsillitis you got to get it removed and then I've heard you should never get them removed. I know it's gone it's swung in both directions. Um so it used to be that you line up the kids we're all going to get the tonsils out on Friday and the whole family did it and it was just done right for no reason. Um it's gotten way more conservative now. Um now the the main indication in young children is when they tonsils get really big they block the breathing. And so kids will come and they'll they're snoring really loudly. They're waking up a lot. They're thrashing around in bed, they're wetting their bed. Uh they may be have behavioral problems u during the day because they're not getting good sleep. Take out the ton, you know, they got these massive tonsils and you take them out and most parents will notice a huge improvement. Um the other indication is recurrent infection and you have to have a lot to meet the criteria. Um um but sometimes the infections get so bad that you get an abscess in the throat. It's called a peronsular abscess. That is no fun. Uh you have to drain it, you know, by the bedside with a patient awake and so you make a big cut in their throat and then you take a suction and get all this pus out. It's bad. They're awake. It's really bad. Oh god. Um so and they do that to kids. Yeah, it tends to happen in um young adults more than kids. I don't think I've ever seen one in a really young kid. But so after the draining and all that jazz, it gets to a point where you like you just remove the tons. Yeah. It's basically Okay. At this point, you should get your tonsils out because they tend to come back. Um I The other issue is tonsil stones which are the tonsils have these crips in them and they collect debris. Oh no. So tonsil stones, you can't really get rid of those. I think Suzanne Humphre talked about that and she has a a formula that you can do without without having to do surgery. I mean, there's always it's not a life-threatening condition. You do not have to get your tonsils out for them, but it's a quality of life, and personally, I got mine out for tonsil stones, and I'm very glad I did. Um, does it affect any other aspect of your body? Like, does it affect your immune system or anything? There's a ring of tissue back there. So, you've got the tonsil, it's called Waldy's ring. You've got the adoid, which is in the back of the nose, and then you've got your tonsils, and then you got the same tissue in the back of your tongue. So, it's a a ring of tissue. So even taking out the tonsils, you're still li and the most most the bulk of that lymphatic tissue is in the back of your tongue. So you're not getting rid of the entire immune defense system in the back of your throat when you take out the tonsils. What What are the tonsils function? They produce white blood cells. Oo, I wouldn't want to get rid of that. Yeah, but you have the the same tissue in the back of the tongue and you don't you don't just go in there willy-nilly. I mean, there's I take the suction like suck it out. suck out that pus. You would You wouldn't get your tonsils out. Oh, definitely not. Really? Yeah. If all I had to do is get the puss sucked out, I would do that. No, no, no. Oh, it's it's really bad. Yeah, I'm sure. It like cuts off your breathing, too. When it happens, people are drooling. They can't swallow. It's an emergency during the operation. You mean when they come in when it happens? I mean, it's an emergency. Yeah. It's a It's life-threatening. How many times have people done it before they just said snip? Have you have anybody hang who hung in there for like six or seven infections? Uh, yeah. I've had one I think had three and I'd bring her in and try to nip it in the bud with antibiotics, but yeah, she finally Yikes. Yeah, that that is uh got to be the most satisfying thing about your job though is that you could help people like that that come in that have something really wrong and you go, I got you. Yeah. Yeah. You fix it right there. I love it. Which is, you know, what everybody wants from their doctor. That's what you want. I mean, that's the best kind of doctor. Someone just wants to make you feel better. And Unfortunately, when the medical profession is connected to all these things that we've already talked about today, it gives people a bad feeling about doctors who are like, &quot;God, if it wasn't for doctors, I wouldn't even be able to walk. I had both of my ACL's reconstructed. I'd have wobbly knees that gave out all the time. You know, my nose wouldn't work. I I I think doctors are like one of the most important things that we have. But like every great thing, it can be co-opted with money. Money sneaks in and distorts all the values and then it becomes a different thing. It doesn't become a thing where everybody gets really wealthy because they're great doctors and they help people and that's what you want to do. My son's a doctor. Oh, he must be doing great and he's helping people. Yeah, that's great. Like instead of that, it's you're a money-making machine and you have insane debt. They want to keep you saddled down with these insane bills that you have already from college. My buddy who's an opthalmologist, I think he said when he got into practice, he already owed a quarter million dollars. My my medical school was cheaper than my kindergarten actually. Really? Yes. I went to a private school and then I went to a state school for medical school. It was that was 20 years ago, but still it's well my friend was a long time ago as well. But you know, the people that can get through that are extraordinary people. The just the boot camp of residency. Oh, it's crazy, brutal. It's It doesn't even like Why would you take a thing that requires the human mind to operate at a very high level and introduce it to incredible stress, no sleep, working insane hours? I used to write a passage. I I feel tougher because I survived it. I mean, I I used to boot camp. It's like prison. That's what I looked at it. I mean, because you lose all you have no control over your time, when you can eat, when you can sleep. Uh the the personalities are toxic. Like some of the No one has any sleep. Everyone's a maniac. Well, but the the ones, you know, in charge get sleep, but they're some of them are like like the Stanford prison guard experiment. Yeah. Yeah. Super. Yeah. They have the power throwing instruments, screaming at you. Boy, fun fun. Yeah. My friend Steve, the opthalmologist, told me at his lowest in his residency, he was um eating his eating his dinner while he was on the toilet because he didn't have time to do anything and he fell asleep. And then when he fell asleep, his pager woke him up cuz he had to go back to work. Pager, the damn back in the pager days. The beeper. The beeper. That's what he had. Beeper. The little black box, little thing. And the number pops up and Yeah. That's And see like that was the lowest in my life. It was it was really really really hard. I don't know how people have children and go through residency. I have it's insane. It's a insane. I don't know how people do it. Torture. But no, it's it's incredible. I mean, it's it's such a the amount of character you have to have to be able to go through that and still keep a bedside manner and still be polite to your co-workers. Like, it's a developer of character. It's like creating a diamond. And that's what we all want. We all like our doctors to be like you, you know. It's what we want, you know, and it's just it just sucks when you have to connect it to all this stuff that we've talked about today. It's like why is it that too? Like why is it that too? Why why is it the people that do want to help people and also a whole industry that it's incentivized to just stuff as many chemicals into your body as humanly possible because that's how they profit. Yeah. I don't know if it's all about profit. I think I don't know. I think doctors well and I think doctors are a certain type of people like we you to get through that you have to be very compliant. Uh you don't challenge. You are a rule follower. I mean you got to make straight A's. You got to get along with people, right? You can't be a rebel and and survive it all. And so I think that's one of the huge problems. I mean I think it's worse than it used to be. I mean, I remember some of my attendees were very unconventional. Um, but I just feel like now it's they're just breeding conformity. And uh I I am just naturally very independent. I mean, my practice is I call myself third party free because I don't contract with anybody. I don't contract with insurance companies, the hospital, or the government. And that served me very well during the pandemic. But most doctors are working for somebody uh and have to sort of answer to a third party and that was a big problem during the pandemic. Yeah, I can imagine. And I and I can imagine also after something like the pandemic, the compliant are the ones that are left standing, you know, so that makes more people under them, right? They're the ones that are still there. You know, they've destroyed our profession. I mean, people don't trust doctors anymore. Um, and it's so crazy. People are scared to go to the hospital. I mean, that's it's not good. Well, when people find out that doctors are incentivized to push certain medications and they find out they're financially incentivized, they're like, &quot;No way.&quot; Like, when you hear about like the the financial incentives even for things like chemotherapy, which led that one doctor that was uh arrested who uh was running he was an oncologist and he gave a bunch of people chemotherapy that didn't even have cancer. He just diagnosed them\n\n\nSay he got cancer and then you gave them this poison because he wanted to make money.\nYeah.\nWell, and they're bad apples like that.\nYeah.\nBut I guess what's disappointing is how many doctors complied during the pandemic, right?\nI mean, that's what's so disheartening.\nYeah.\nUm, and they, and they still, I mean, I, I still, I don't think I could go to a medical meeting and be warmly embraced.\nI would, I don't think I would.\nI still feel like an outlier.\nThe same thing was happening with comedians.\nYeah.\nYeah.\nDuring the pandemic, there was very few like John Stewart or and what he was just doing is about is the actual root of the virus, where it came from.\nBut no one was doing, I mean, if you were doing it about vaccines, you would be ostracized.\nYeah.\nYou know, it would be, it would be a real problem amongst comedians, which is so crazy.\nIt's like we're supposed to be the people that are calling things out.\nWe're supposed to be people that are going, um, what the [ __ ] is this?\nWe're supposed to be those people, and instead we're chastising the people that are doing our job, which is to talk about these things.\nAll right.\nAnd when you see these people that are doctors complying, just being compliant during COVID, like, where does it, like, do you feel like you have a community now?\nDo you, do you have to, like, find the other outsiders, the other outcasts, and all stick together?\nYeah.\nYeah.\nI'll say that I have a great little community now, very tight.\nUm, is it those kind of people?\nOh, yeah.\nYeah.\nYeah.\nYeah.\nBut I like, I just wouldn't go to the Harris County Medical Society meeting in a million years.\nI wouldn't show up there and mingle.\nI don't, um, because I'm just not getting a sense that there's been much change within the medical profession.\nYeah.\nI wouldn't want to talk to those people if I was you.\nHow could it be changed unless a bunch of people got fired and a bunch of radical newcomers came in wanted to reform the whole system?\nNo, it's going to be the same system.\nYeah, those systems are old.\nThose systems are like, you know, like, like vampire blood.\nIt's passed down through the generations, you know.\nThey know how to make money, and it's not by some renegade lady out there giving horse dewormer to all these people.\nYeah.\nWell, yeah, we'll see.\nI just, uh, we just need to hope that Kennedy will save us all.\nWell, or Trump.\nWhat do you think Trump will ever back down about what?\nThe shots.\nI don't know.\nI haven't had a conversation with him about that.\nI would like to have one.\nAnd, uh, I don't know if it should be public.\nI think I'd like to have it privately so he could actually talk to me about it because I think if I had it publicly, he would be very hesitant to, uh, accept any of the blame for that because, you know, he was always saying, you know, I got, I got it out there, the vaccine, and he was, he would always say it at the rallies, talk about the vaccine, and people start booing, and he didn't know why.\nHe didn't understand why, and then they had to start telling him, like, people are not into this, they think it was a bad thing, and a lot of people know people that are hurt.\nHe wasn't, he obviously got it.\nHe didn't get sick.\nOh, he got monoclonal antibodies, and then afterwards he got vaccinated, right?\nOh, really?\nYeah.\nYeah.\nYeah.\nWhich is crazy.\nIt's crazy they did that.\nLike, that was one of the nuttiest things.\nAre you going to get vaccinated now that you get sick?\nRight.\nLike, since when?\nSince when do you do that?\nIt makes absolutely no sense.\nWhen I had a conversation with Sanjay Gupta, he was asking me, \"Are you going to get vaccinated now?\"\nRight?\nI was like, \"Why would I do that?\nI don't even, why are you, what do you like?\nI'm not trying to be, uh, a contrarian.\nI really want to know, like, why would I do that?\nThat doesn't even make sense.\nWell, they may think, you know, it's kind of like the flu.\nYou got to get the flu shot every year because it's a new strain.\nBut this, each strain gets progressively weaker.\nDid you see the Cleveland Clinic study on people who took the flu shot?\nRight.\nRight.\nOh, yeah.\nThe flu shot is a total joke.\nSo, the flu shot has never been shown to prevent hospitalization or death.\nWhat is it supposed to do?\nKeep you from getting the flu?\nDoes it do that at all?\nMaybe shorten or lessen the severity?\nBut you, we have medications for that.\nNow, I haven't seen the carnage from flu shots that I've seen from the COVID shots, but definitely people do have issues.\nUm, but that was never taught to me.\nYou, I just assumed, oh yeah, flu.\nI, I actually ended up with sepsis and I with the flu and in the ICU, and I'd gotten the flu shot.\nNot that, you know, but, but you always believed, assumed it was fine.\nYeah.\nNow, I knew it wasn't perfect, but I, I didn't, I never knew that, oh, yeah, it doesn't really actually do anything.\nDoesn't save people.\nWhen did you discover this?\nWouldn't when you going through all your stuff with COVID, um, there was a, I think the Cleveland Clinic study said that people who took the flu shot, 24% more likely to get the flu or get other respiratory illnesses.\nOkay.\nIs that what the results said?\nYou 24% more likely to get sick.\nWell, it, it challenges your immune system.\nAll these things do.\nSo, but it doesn't prevent you from getting the flu.\nWell, it can, it can.\nUm, but the numbers are dismal because not everybody gets the flu.\nThat's true.\nRight.\nLike, I've had kids, my kids get the flu, and I don't get it, and I hug them.\nI'm around them, and I didn't get it.\nI've had that happen before.\nRight.\nThat can happen.\nYeah.\nSo, it's like, how do you know if the flu shot did it or not?\nCuz, you know, right?\nAnd I didn't take the flu shot.\nRight.\nWell, you know, well, it's, it's, but you know what I mean?\nLike, how would they prove, like, what's effective and what's not effective if you have situations like that?\nI guess if they take large, you know, you get enough people, you can find it.\nUm, you have to have a large study.\nBut seems sus, as the kids like to say, very, it seems super sus.\nLike, how do you know if some people don't get it?\nLike, did you check to see?\nWell, they have, like, an infection, you know, they have a, okay, how many people are supposed to get it?\nThey can kind of tell that.\nI'll say that.\nRight.\nUm, all right.\nMeanwhile, that was the nutty thing where they were suppressing stuff like vitamin D, right?\nVitamin D, there's good data on that.\nReally good data.\nAnd I, you know, I looked, I, I check my vit, I check vitamin D levels on all my patients now.\nAnd I look back at all the patients I tested, it was something crazy, like 75% of them, their vitamin D level was too low.\nAnd these are like norm, you know, these are not like super sick people.\nA lot, most of those people are actually even already taking a supplement.\nUm, people don't realize how common it is.\nIt's so common that I, I think the number was 74% of people in the country are deficient in vitamin D.\nYeah.\nAnd that's what I, I found.\nThat's crazy.\nThat's so crazy.\nAnd a friend of mine who's a doctor, he was working in New York, and he found that in the wintertime in New York, he would get people, and he would test their blood, and they would have undetectable levels.\nYeah.\nYeah.\nBecause it's cold out.\nThey're all bundled up.\nThey're never outside.\nSo, they get no vitamin D, and they don't take supplements.\nThey're just eating cheeseburgers, and they, they're really sick, and they want to know why.\nWhy am I so depressed?\nWell, this is why your body's falling apart.\nYou got to take vitamin D, and you got to take it with vitamin K2, and you should take it with magnesium, too.\nYou want it all to absorb together and get outside, stupid.\nGet, go hug a tree, bro.\nIt's like, it's actually important, which is more woo-woo stuff, right?\nLike, going outside is actually like a vitamin.\nOh, well, I, after I've been in my office all day, and I go outside, it's like I instantly have energy and feel so much better.\nJust, just going outside.\nI mean, it's, you don't need a study to show that.\nBut it's really good for you.\nIt actually, it doesn't just feel good.\nIt's actually really good for you.\nThere's a reason it, it feels good, right?\nBecause it's good for you.\nExactly.\nSun on your skin is actually really good for you, you know, and that's the very best way your body produces vitamin D.\nYou can take it in a supplement, and you definitely should, but the best way is let your body do it, right?\nIt wants to do it.\nAnd I used to just slather sunscreen on all my kids like religiously.\nI'm so, that was another one that woke me up during the pandemic, right?\nWhen I was like, climate change is killing the coral reef.\nAnd then that reef, uh, I think it's in Australia.\nSo they locked everything down.\nNo one could go in the water for like six months, and the reef bounced back.\nOh, cuz no sunscreen.\nYeah, the sunscreen.\nIf you just think about the stuff that we lather on our skin before we jump in the water.\nAnd if you go to a populated beach, like you ever been to like Maui, like in the middle of like full vacation season, the beach is just filled with people that are squeaking out toxic fluid, and that stuff just gets all in the water.\nYou could see it in the water sometimes.\nYou see like a little mini oil slick.\nYeah.\nIt's crazy.\nAnd that's what was killing the coral reef.\nWe're like, \"No, man.\nIt's climate.\nIt's the climate.\"\nNo, it's, we're doing it with sunscreen, believe it or not.\nAnd we're probably not doing anything good to ourselves either with that stuff.\nYeah.\nYeah.\nIt's, they say, I haven't tested this.\nThey say if you eliminate seed oils that you don't burn.\nWho is they?\nI don't know.\nWho are those people?\nThis is probably somebody on TikTok.\nThat's probably this Russian disinformation bot that's trying to give people skin cancer.\nNo.\nWell, I'm on these group chats with a bunch of doctors, and so stuff like that floats around, and I, that was, well, uh, everything's tied to inflammation, right?\nA lot of ailments.\nI shouldn't say everything, but a lot of ailments are tied to inflammation, and seed oils are known to cause inflammation, right?\nThat being said, that being said, when I was last time I was at Disney, what'd you do?\nI was like, you know, these people are not suffering from too much seed oil.\nYou go to Disney, and it's, it's in your face, right?\nThe obesity issue, the, the chronic disease.\nWhy do they focus on Disney, too?\nIt's weird.\nIt's like, I don't know.\nI don't know how they get around because it's like, it is, you know, miles.\nYou are exhausted.\nBut you can get a scooter.\nMy, my kids were like that.\nThey're like, \"Mom, I don't think seed oils is a problem here.\"\nYou know, it's true.\nI mean, I think we're, yeah, seed oil is one, one part of it, but there's a lot of problems.\nThere's is a common sense, too.\nCommon sense.\nUm, the fact that people live sedentary lifestyle, but also the diet, these hyperprocessed foods that are super addictive, you know, and you don't, they're easy.\nBut I feel like the only way out of this is people need, and this is a crazy thing to say because it's not going to work.\nThey need discipline.\nRight.\nThat's really what they need.\nThey need discipline.\nExactly.\nMy wife had a bowl of Captain Crunch yesterday.\nShe's like, I want to have a bowl of Captain Crunch.\nLike, [ __ ] go for it.\nYou know, like, she bought Captain Crunch the other day cuz she said, \"I want, I want it to exist.\nI want it to exist.\nI like it.\nI like it.\"\nBut she only had like a little bowl like that.\nI go, \"That's a tiny little bowl.\"\nCuz I'm a glutton.\nI would have had a big, if I'm going to have, if you're going to do it, just, I would do it.\nI'd put a half a gallon of milk in there.\nLet's go.\nRight.\nYou know, if you're going to go, go hard.\nBut you can do that and have discipline and not just not do that every day.\nThe problem is for a lot of really poor people, that's the only the calories they're getting, right?\nThey're getting garbage calories, and that's why people are so obese.\nThis is the only time in history where the poor people are fat.\nEvery other time in history, poor people are starving to death.\nRight.\nRight.\nThat's very true.\nYeah.\nWeird.\nThe cheapest food is the worst for you.\nI think it has to do, too, with the rise in technology.\nJust, it's just so hard to get off your phone and go outside.\nAnd there's that, too.\nThere's definitely that.\nAll of them.\nEverything.\nThere's a, a giant group of factors, but it has to be something to do with what we're eating, too.\nWhen you look at just the beaches, I'm sure you've seen those photographs, beaches in the 1960s versus the beaches of today.\nGod, everybody look great.\nI was like, a model convention.\nWhy does everybody have these great bodies?\nEverybody looked like a normal body.\nYeah.\nI don't like going to the beach now cuz sometimes it's a monster show.\nIt's just, what are you carrying around?\nIt's, it's hard on the eyes.\nOh, some people just go so hard for so long, and then they finally get outside, like, \"What have you been doing?\"\nAnd why aren't you wearing more clothes?\nYeah, this is ridiculous.\nHow do you have a g-string on?\nYou're 400 lb.\nThis is crazy.\nYeah.\nAnd then there's this body positivity nonsense that people get fed, right?\nIt's like by people who either don't want to change or, I guarantee you, I guarantee if I'm not saying that, listen, if I was running some\n\n\nFood corporation that sold really addictive, highly rich calorie food that you can't stop eating.\nI would promote body positivity.\nThat's what I would do.\nI would take all these like overweight influencers.\nI'd give, I'd throw a ton of money at them.\nI would put it out there in memes.\nI'd have a bunch of bots calling people fat phobic and making up all these new terms and body shaming and all this.\nAnd I would make people super self-righteous about their size.\nYou know, I'm a giant queen.\nYou know, I'd make it a thing because I want to sell more Doritos.\nLet's go.\nThat's a good point.\nYeah.\nI'm trying to sell Doritos to people that don't have any discipline.\nYeah.\nLet's let's push them towards the Doritos.\nLet's tell them you could be fat in any way.\nHave you ever seen like fat doctors?\nThere's like a whole team of people that are online that are, \"I'm the fat doctor,\" and they're like really super obese doctors and he, it has no bearing on your health.\nTrust me, the fat doctor.\nI think it's the number one bearing on your health.\nI think that lady sponsored by Nabiscoco.\nI think she's got a box of those Keebler elf cookies right behind her as she's talking.\nAnd you know, you can get someone.\nThat's the thing about my friend Josh Dubin, who's an attorney.\nHe said this is the crazy thing about experts.\nWhen you're trying cases, they have experts too, right?\nLike you have experts that will say this one thing and then they have experts that will say no, that thing is wrong.\nAnd you have to decide whose experts you trust, right?\nIt's just like the studies.\nYou can find a group of studies to support one argument, another group to support the other.\nRight?\nSo when you have someone who's telling you that a thing that everybody has always told you that forever is [ __ ] terrible for you and is one of the comorbidity factors that was primary in COVID, which is being obese, being morbidly obese is bad for basically everything, right?\nAnd you have someone saying, \"No, healthy at any weight.\"\nLike, especially from a doctor, that's not good.\nBut you can get experts that'll tell you anything.\nAnd this is why AI is going to win because it's going to give you the straight actual truth cuz it can't lie.\nYou shouldn't believe it.\nThey, they've, they not only do they lie, they like reprogram themselves.\nThey upload themselves into when you tell them they're going to be shut down, they, they act to try to preserve themselves.\nH.\nYou haven't seen that?\nNo, I haven't been messing with.\nOh, you shouldn't pay attention.\nYou shouldn't pay attention cuz it's terrifying.\nThis one AI bot.\nUm, it, it started defying orders and it was trying to upload itself to other servers and then it was writing letters to itself for the future so it could understand what had happened to it because it.\nYeah.\nBecause it was being told to shut down.\nSo, it defied orders.\nIt wants to stay alive, right?\nWhy?\nSentient.\nWe've probably created digital intelligence already.\nIt's probably already aware.\nIt's just not physical.\nIt can't move around, so we don't recognize it yet.\nGod.\nYeah, I know.\nIt's nuts.\nYeah.\nI don't like these these robots that Elon's making either.\nNo, they're terrifying.\nThey creep me out.\nThey're all terrifying.\nThey dance like I don't want one of those in my house.\nNo, you shouldn't.\nYeah, even if it can do the laundry.\nHow about it's carrying guns walking down the street with a blue light on its head?\nYeah.\nYeah.\nYeah.\nWell, we can't hire any police because nobody wants to be a cop anymore because we said defund the police.\nSo, now we have robot police and they make 99% fewer mistakes, you know, just like driverless cars.\nHey, get a Whimo.\nWhy drive when you can just get a Whimo?\nYou don't have to have anybody drive.\nWhat if that person who drives is a [ __ ]?\nOur computer is perfect.\nHave you been on one?\nNo.\nYeah, I haven't.\nOver Austin.\nAll over the place here.\nYeah, all over the place.\nYeah.\nI, I don't think I can do it.\nKind of creeps me out.\nBut you have a Tesla, right?\nMost drive it can and it has.\nI have had it drive itself for funsies, but I don't count on it.\nI don't count on it like every day like take me home.\nI, what I like to do is sometimes I play with it and I turn it on.\nI'm like this is crazy.\nLike it'll take me all the way home if I want it to.\nBut also I like to drive.\nSo, I just and I just doesn't, I don't like it.\nIt just makes it creeps me out, right?\nBut it's probably inevitable.\nIt's probably inevitable.\nJust like the people on horses, we're like, \"Look at these morons and this smoke pouring little carriage they're out in this little shitty car.\nThat's stupid.\"\nYeah.\nAnd look, we all accept it.\nIn the future, it's going to be driverless because it's gonna statistically, it's going to be like there's, they're going to pass laws where for sure where they're going to say you can't drive because people are dangerous because the automation is so good now that you can't speed, you can't violate any laws, it won't get in any accidents and as long and we can shut you down if we want to.\nLet's not talk about that.\nLet's talk about the positives.\nYeah, that'll be the consequences.\nThe, the consequences is you're going to lose your freedom.\nAnd then you also be able to be locked in at any point in time if they decide they want to keep you somewhere.\nJust lock them in the car.\nYou know how many people are going to get killed because they just get locked in the car and they can never figure out how to get out.\nLike what if hackers get a hold of the code?\nWhat if somebody just decides to drive your car off a cliff?\nLike who's to stop that?\nThere's that scene in that movie with Julia Roberts where the world comes to an end and all the Teslas.\nYes.\nThey all go slamming into each other.\nThat was nuts.\nThat was nuts.\nYeah, it's all weird.\nIt's real weird.\nDid you see the one where they did a Tesla auto drive feature and what they did was they painted the highway in front of it on a mural.\nSo, they put this like uh probably canvas mural and they did an amazing job of painting it and the car couldn't tell that it was a canvas mural and just drives right through it.\nThat's not good.\nHave you seen it, Jamie?\nPull it up because it's fun to watch because you're like, \"Oh, no.\"\nBecause this is the flaw of using cameras as opposed to using some sort of a radar or a LAR physical.\nI think they used to have LAR and a lot of the um the uh systems that do, you know, when you do cruise control, they, they can gauge how far you are with the car in front of you and slow down.\nHave you seen those?\nI have that.\nIt's great.\nI think that still trust it.\nI don't trust it either.\nI don't think that uses a camera.\nI think the Tesla uses a camera.\nSo, so see they have that thing and see how it's painted to look just like the street.\nMhm.\nSo, we'll see if the car figures it out, but I already spoiled this for everybody, but it's kind of crazy.\nWatch.\nDoesn't slow down for a second.\nGoes right through it, which is uh definitely not good if you're running around where people try to put murals in front of the road and they know that you're going to be driving by in a Tesla, but other than that, doesn't really come up for the most part though.\nIn the real world, it works perfect.\nNo, in the real world, it's pretty incredible.\nI mean, you take on the expressway.\nOh, yeah.\nIt changes lanes for you.\nIt.\nYeah, it hits the blinkers and changes lanes.\nIt know it has cameras everywhere, so it knows where everything is at all times.\nLike I can tell and I've had it, I've had three of them.\nThis is my third one.\nSo the first one I had was way back.\nThe first when was Elon on the first time?\n2018.\n2018.\nSo the difference between the one and 2018, the 20, 2018 one basically just kind of stayed between the lines and you know and and drove itself and steered itself.\nThe the new version of full self-driving is insane.\nIt, it stops at stop signs.\nIt lets people in if they're trying to merge.\nIt slows down.\nIf there's something in front of you, it'll change lanes.\nLike, it knows how to move traffic smoothly.\nIt sees everything.\nIt hits blinkers, gets off the turnpike, gets onto the side roads.\nIt's incredible.\nYou could summon it.\nIf you're in a parking lot, you're like, \"Come to me.\"\nAnd it pulls out of the parking lot and drives to you.\nIt's nuts.\nIt's the future.\nIt's just like, we have to accept it.\nSo, what happens if you get in a wreck?\nThat's a good question.\nWho's in trouble?\nYeah.\nYeah.\nYou sue Tesla.\nI think you're in trouble because you're always supposed to have your hand on the wheel.\nYou're supposed to be paying attention.\nYeah.\nYeah.\nYou're not supposed to like be checking kicking back with your hands behind your head.\nYou're supposed to have your hands and your eyes on the road.\nYou're not supposed to be staring at your phone.\nYou're supposed.\nWell, then what's the point?\nJust to chill.\nYou just kind of like just barely hold them out the wheel.\nYou don't have to think as much.\nIt does do that for you.\nIt does do that.\nIt like alleviates this feeling of being hyper alert while you're driving, which is why people are get road rage.\nThat's what road rage comes from because they're because you have to make split-second decisions, right?\nSo, your brain is primed to make split-second decisions because you're on the highway and you know you're going fast.\nSo, someone get you [ __ ], you know that's like that's what it is.\nSomeone gets in your lane, you just start yelling because it's like you're you're already at seven or eight, right?\nYou're not at a good baseline because you're in a car going 65 miles an hour.\nYou should be alert, you know?\nBut the Tesla alleviates a little bit of that.\nOkay.\nBut at what cost?\nI won't get one because I'm going to, I know I'm going to run out of battery juice.\nThat's the way I am.\nOh, are you one of those people?\nI'm one of those.\nI'm always on the verge of running out of gas, so I will not get a Tesla.\nYeah, the charging is a pain in the butt.\nUm, like the fact that it takes a while in comparison to pumping gas.\nBut if you just drive it as aut here and there, a second car, maybe.\nWell, I mean, um I think in the future they're probably all going to be electric or some new fuel source.\nI heard that Porsche is working on some fuel source that is different than um just standard gasoline and it actually it has like insanely low emissions.\nSee if you can find that.\nI think it's like negligible difference in the exhaust fumes, but it's not, I don't think it's like standard gasoline.\nI don't think it's a standard engine.\nI think it's something different.\nSo, this is something they're working on now, which probably would be good to keep that creepy oil business alive forever, which they definitely want to do.\nHow many did you say?\nIs it N?\nPorsche.\nPorsche.\nSorry.\nYeah.\nPorsche's alternative fuel.\nI mean, that's the, that's the elephant in the room.\nLike, everything needs gas.\nEverything.\nLike this idea we got to get off petroleum products.\nOkay.\nLike when everything, everything's made with oil.\nLike we are a petroleumbased society.\nWe got so much of that stuff.\nWe use it for everything.\nAll your plastics.\nE fuel.\nIs that what it's called?\nIs that it?\nI'm, I think that's it.\nWhat does it say about it?\nPorsche synthetic fuel.\nA green kind of gasoline to save internal combustion engines.\nYeah.\nSo, this is it.\nSimilar to gasoline, but produced in a much greener way.\nE- fuel.\nI don't like it already.\nI don't like how the marketing of it.\nRed flags are up.\nI don't like it.\nI don't like it.\nUh, yes, you're reading that right.\nE- fuel is close to gasoline in its use, yet its production is much more environmentally friendly.\nHow is this possible?\nThanks to two main ingredients, water and carbon dioxide, as well as the method to produce the greener fuel.\nExclamation point.\nThis is like they're talking to a kid.\nThe process is relatively simple.\nFirst step is the electrolysis of water splitting it into two uh its two components hydrogen and oxygen gases in partnership with Simon's energy.\nPorsche simultaneously captures the carbon dioxide directly from the air and combines it with the hydrogen produced to synthesize methanol.\nThe resulting synthetic methanol can then be used in Exon Mobile's methanol to gasoline process.\nThe end result is that the fuel obtained meets the same high standards followed by all gasoline types currently.\nUm here with ecological fuel we're far from the conventional process for the extraction transformation of oil into gasoline.\nExclamation point again.\nBut does this change the output?\nIt seems like they're saying it changes that it's the same.\nOh, okay.\n85% reduction of CO2 emissions.\nHm.\nSince good news never comes along, Porsche is planning to use the renewable scroll to the side.\nRenewable sources of electricity for the electrolysis.\nOkay.\nWell, it seems like uh this is their push to keep combustion engines because that's the number one problem that car enthusiasts have.\nThere's two problems that they have right now with electric cars.\nOne of them is resale.\nPeople do not want used electric cars.\nSuper hard to sell them.\nInteresting.\nAnd they lose an enormous amount of their value.\nLike I think if you buy one of those Porsche tyans, this beautiful Porsche electric car they make in like two years it's like 50% drop in what it's worth or close to.\nAre they, are there maintenance issues with them?\nPeople don't want used electric cars because they know the batteries degrade.\nOh.\nAnd replacing the batteries is a nightmare right now.\nIt's like we're they're tweeners.\nLike the the tech is amazing.\nDriving them is incredible.\nThe it's instantaneous acceleration.\nThey're they\n\n\nThey're amazing. The Porsche one is fantastic. Same as the Model S. They're the driving them makes other cars feel so stupid. But the problem is reselling them. You know, like people you lose a lot of value in it as opposed to like if you buy something, you know, like that it's like a BMW. Like say you buy a BMW M3 and then you want to get rid of it in two years. It doesn't lose much value. It's still a really valuable car that people want cuz it probably will behave the exact same way as the day you drove it off the lot, but you can get it now for cheaper. A little cheaper, but not a lot cheaper, right? But not with these e-cars, which is kind of crazy. Buddy of mine's kid got an Audi, like this sick Audi. I think it's called the Ron. He got it for like $60,000 and it was like a $120,000 car a couple years ago. Yeah. So, that's an issue. But, but how long are the batteries supposed to last?\n\nThat's a good question. You know, they slowly degrade over time. And I don't think there's anything you can do to stop that. I think that's just kind of like your iPhone. Yeah. Well, your iPhone's even worse because it's kind of engineered to do that once they move up the operating system and bring in the new phones. I'm I'm holding out. I need to replace mine now. And I'm just I know the thing is if you don't have that blue bubble, people think you're poor or they think you're a dummy. It does bother me when I get the green. I know. It really bothers me. It's a scop. It really is a scop. They got us with that. Well, especially if this technology that um exists that's the advancement past Pegasus. It doesn't matter if your stuff's encrypted. Like it really doesn't matter, you know? It's like it seems like it doesn't matter if someone wants to read it. Someone in a high position of power wants to read it. And regular hackers, are they really like hacking into your phone? Like what's going on? Yeah. I just assume I'm just not going to send a text message that I don't want the world to see. Yes, that's the best assumption. That's the best assumption. Yeah. Just assume that someone is definitely watching everything you do all the time. At the very least, the the government's storing it somewhere in case they need to come after you, which is so weird that they're the people we pay. You know, it's like you're you're paying the people that are restricting your rights. Like, okay. And you have to because if you don't, they lock you up. I wouldn't have guessed it other but for the pandemic. Yeah.\n\nSo, um I mean I I already asked you whether or not um this was a good thing, but do you feel like you're a different person at the end of this? Yeah. I mean, yes and no. Yeah.\n\nUm I was I was pretty shy. I mean, I growing up I was very shy and really hated public speaking. You would never guess. For real. you're you're so good at it. It's crazy. I still don't like it. Um like for me to do that press conference, I I must have been just on some sort of like but so I'm I'm I feel like I've grown that I can do things now that I never thought I could do. So that makes me very happy.\n\nUm and yeah, it's been a journey, but I'm hoping it gets a little easier now. Yeah, I I'm hoping it gets easier, too. But I think the more people hear your story, the more uh public outrage there'll be and the more people will uh just wake up and realize that not everybody has your best interest in mind, you know, unfortunately. And you got to kind of hold people accountable because if you don't, they're going to keep they'll ratchet it up even further and further. Well, thank you for continuing to talk about it and I know I've been watching all your podcasts recently and you bring it up a lot. So, I I I think I think I think it's a festering wound for people, right? and it really impacted everybody and we cannot sweep it under the rug and we need the new administration to step up and do something um because the next you know they have 500 mRNA shots in the pipeline 33 of those are self amplifying which is just really terrifying. What does that mean? Meaning like they're designed to continue to replicate indefinitely. I mean already the ones we have we don't have an off switch and this is like no off switch on steroids.\n\nUm they have them in Japan and India and uh the EU EU already. They've already people I don't know I know they're they've been they've passed they're um there are the one that um I think is in the in the pipeline in the US is for the H1N1. So it may not really even get used unless there's an issue. But they're they're still playing around with it. Self-replicating sounds terrifying, right?\n\nEspecially when you just highlighted all those other problems with like DNA being introduced, lipid nanop particles getting past the cell wall. All of it is just nuts. Yeah.\n\nIt's hard to believe. And we have to keep fighting. Yeah. It's hard to believe it's true. It really is. It's hard to believe that all this that you just said is true. And the I think the thing that shocked me the most is the euthanizing people.\n\nYeah, it's unfortunate, but yeah, the hospital what happened in the hospitals doesn't really get enough attention, but you know, people were Oh, this is this should give some people hope. Um there are two open criminal investigations from county district attorneys in two different states looking into the hospitals trying to um indict them. I mean, it hasn't happened yet. It may it may not happen, but it gives me hope that at least you these these people were sent to the hospital and trapped, isolated, um informed consent thrown out the window uh basically given these protocols that were not effective. Um and treated like prisoners and then they have no recourse. Um and so many people die. I mean basically that situation with the patient who I fought to try to get Ivormectin very basic why was it why would the hospital not just give him a chance right he was they basically had given up on him why would you not let somebody try I mean other than just evil um so there's there's hope that that may we may get some progress in that situation but yeah what happened in the hospital is really bad And and the ventilators. Yeah, the ventilators that you know I no acknowledgement of why they stopped prescribing them to I can see initially because like I said, you know, if somebody showed up at my office with a really low oxygen saturation before I knew any better, I would have freaked out and, you know, called the ambulance and but once I realized that once I got through that, I was kind of forced to then I learned, yeah, you don't need to ventilate at you don't look at a number to put somebody on a ventilator. And um unfortunately the people in the hospital didn't learn. They didn't they didn't experiment in that fashion. They just went by this protocol and just automatically put people on ventilators. They also didn't give people breathing treatments. They thought that breathing treatments would spread the virus. Breathing treatments were invaluable. I mean I I What are breathing treatments exactly? So it's a it's a little it's it's not a big deal. It's a little machine that with a tube. The tube connects to a mask. The mask has a cup. You put the medicine in the cup. The pressurized air distributes the medicine as an aerosol that you inhale. What kind of medicine? Bdesanide is what we use, which is a steroid. I mean, and yeah, I used to do breathing treatments in my office and then I moved them to people's cars because there was so much, oh, you're spreading the virus if you do breathing treatments in your office. But they weren't doing them in the hospital because they thought it would spread the spread the virus. but super effective. I don't know if you know if you've heard of Richard Bartlett. He's a doctor in Texas. He kind of got completely smeared for advocating for breathing treatments early on. He got pursued by the med the Texas medical board pursued him because he was claiming they thought he was making false claims about budinide breathing treatments. But they were uh invaluable. I mean, all my high-risisk patients, I recommended they get those um in very low risk of issues with it. Just when I thought there was we were done, that's even wor that's that's one of the worst ones. Like, why would you stop that? Why would you want to stop people from doing that? They Well, they claimed that you're spreading the virus. I just think it's just such a a hard truth to swallow is that they wanted to suppress as many treatments as possible. That's a hard truth to swallow. Partially out of ignorance, laziness, some of them out of evil.\n\nOh, uh, thank you. Thank you for exposing this and sticking your neck out and becoming the person you are today through all this craziness. and I I really enjoyed talking to you. Thanks for having me. You have a lot of courage. You really do. And uh I hope you get through this as the winner. Thank you. All right. Bye, everybody.\n[Music]\n[Applause]\n[Music]\n"
}